{
    "Title": "ISEV and ISCT statement on EVs from MSCs and other cells: considerations for potential therapeutic agents to suppress COVID-19",
    "Authors": "International Society for Cell and Gene Therapy, International Society for Extracellular Vesicles",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Cytotherapy 22 (2020) 482\u0002485Contents lists available at ScienceDirectCYTOTHERAPYjournal homepage: www.isct-cytotherapy.orgShort CommunicationInternational Society for Extracellular Vesicles and International Societyfor Cell and Gene Therapy statement on extracellular vesicles frommesenchymal stromal cells and other cells: considerations for potentialtherapeutic agents to suppress coronavirus disease-19Verena B€orger1,y, Daniel J. Weiss2,y, Johnathon D. Anderson3, Francesc E. Borr\u0002as4,Benedetta Bussolati5, David R.F. Carter6, Massimo Dominici7, Juan M. Falc\u0003on-P\u0003erez8,9,10,Mario Gimona11, Andrew F. Hill12, Andrew M. Hoffman13, Dominique de Kleijn14,Bruce L. Levine15, Rebecca Lim16, Jan L€otvall17, S. Alex Mitsialis18, Marta Mongui\u0003o-Tortajada19,Maurizio Muraca20, Rienk Nieuwland21, Anna Nowocin22, Lorraine O’Driscoll23, Luis A. Ortiz24,Donald G Phinney25, Ilona Reischl26, Eva Rohde27,28, Ralf Sanzenbacher29, Clotilde Th\u0003ery30,Wei Seong Toh31, Kenneth W. Witwer32,33,*, Sai Kiang Lim34,*, Bernd Giebel1,*1 Institute for Transfusion Medicine, University Hospital Essen, University of Duisburg-Essen, Essen, Germany2 Department of Medicine, University of Vermont, Burlington, Vermont, USA3 Department of Otolaryngology, Stem Cell Program, University of California, Davis, Davis, California, USA4 REMAR-IVECAT Group, Health Science Research Institute Germans Trias i Pujol (IGTP), Can Ruti Campus, and Nephrology Service, Germans Trias i Pujol UniversityHospital, Badalona, Spain5 Department of Molecular Biotechnology and Health Sciences, University of Torino, Torino, Italy6 Department of Biological and Medical Sciences, Oxford Brookes University, Oxford, UK7 Department of Medical and Surgical Sciences of Children and Adults, University Hospital of Modena, Modena, Italy8 Exosomes Laboratory, Center for Cooperative Research in Biosciences (CIC bioGUNE), Basque Research and Technology Alliance (BRTA), Derio, Spain9 Centro de Investigaci\u0003on Biom\u0003edica en Red de enfermedades hep\u0003aticas y digestivas (CIBERehd), Instituto de Salud Carlos III, Madrid, Spain10 IKERBASQUE, Basque Foundation for Science, Bilbao, Spain11 GMP Unit and EV-TT Transfer Center, Spinal Cord Injury & Tissue Regeneration Center Salzburg (SCI-TReCS), Paracelsus Medical University (PMU), Salzburg, Austria12 La Trobe Institute for Molecular Science, La Trobe University, Bundoora, Australia13 School of Veterinary Medicine, University of Pennsylvania, Philadelphia, Pennsylvania, USA14 Department of Vascular Surgery, University Medical Center Utrecht and Netherlands Heart Institute, Utrecht, the Netherlands15 Center for Cellular Immunotherapies at the Perelman School of Medicine, University of Pennsylvania, Philadelphia, Pennsylvania, USA16 Department of Obstetrics and Gynaecology, Hudson Institute of Medical Research, Monash University and The Ritchie Centre, Melbourne, Australia17 Krefting Research Centre, Institute of Medicine, Sahlgrenska Academy at University of Gothenburg, Gothenburg, Sweden18 Department of Pediatrics, Harvard Medical School and Boston Children’s Hospital, Boston, Massachusetts, USA19 ICREC Research Program, Health Science Research Institute Germans Trias i Pujol (IGTP), Can Ruti Campus, and Cardiology Service, Germans Trias i PujolUniversity Hospital, Badalona, Spain20 Department of Women’s and Children’s Health, University of Padua, Padua, Italy21 Laboratory of Experimental Clinical Chemistry, Department of Clinical Chemistry and Vesicle Observation Center, Amsterdam UMC, Location AMC, University ofAmsterdam, Amsterdam, the Netherlands22 Biotherapeutics, National Institute for Biological Standards and Control (NIBSC), Medicines and Healthcare Products Regulatory Agency, Hertfordshire, UK23 School of Pharmacy and Pharmaceutical Sciences and Trinity Biomedical Sciences Institute, Trinity College Dublin, Dublin, Ireland24 Department of Environmental and Occupational Health, University of Pittsburgh, Pittsburgh, Pennsylvania, USA25 Department of Molecular Therapeutics, The Scripps Research Institute, Jupiter, Florida, USA26 Federal Office for Safety in Health Care (BASG) and Austrian Agency for Health and Food Safety (AGES), Institute Surveillance, Vienna, Austria27 Department of Transfusion Medicine, University Hospital, Salzburger Landeskliniken GesmbH (SALK), Salzburg, Austria28 GMP Unit, Spinal Cord Injury & Tissue Regeneration Centre Salzburg (SCI-TReCS), Paracelsus Medical University (PMU), Salzburg, Austria29 Section Tissue Engineering and Cell Therapeutics, Paul-Ehrlich-Institut, Federal Institute for Vaccines and Biomedicines, Langen, Germany30 Institut Curie/INSERM U932/PSL Research University, Paris, France31 Faculty of Dentistry, National University of Singapore, Singapore32 Department of Molecular and Comparative Pathobiology, The Johns Hopkins University School of Medicine, Baltimore, Maryland, USA33 Department of Neurology, The Johns Hopkins University School of Medicine, Baltimore, Maryland, USA34 Institute of Molecular and Cellular Biology, Agency for Science, Technology and Research, Singapore* Correspondence: Bernd Giebel, PhD, Institute for Transfusion Medicine, University Hospital Essen, University of Duisburg-Essen, Virchowstr. 179, 45147 Essen, Germany.* Kenneth W. Witwer, Johns Hopkins University School of Medicine, 733 N. Broadway, MRB 827, Baltimore, MD 21205, USA* Sai Kiang Lim, Institute of Molecular and Cellular Biology, Agency for Science, Technology and Research, SingaporeE-mail addresses: kwitwer1@jhmi.edu (K.W. Witwer), Lim_Sai_Kiang@imcb.a-star.edu.sg (S.K. Lim), bernd.giebel@uk-essen.de (B. Giebel).https://doi.org/10.1016/j.jcyt.2020.05.0021465-3249/© 2020 International Society for Cell and Gene Therapy. This is an open access article under the CC BY-NC-ND license.(http://creativecommons.org/licenses/by-nc-nd/4.0/)V. B€orger et al. / Cytotherapy 22 (2020) 482\u0002485 483A R T I C L E I N F OArticle History:Received 1 May 2020Accepted 2 May 2020y These authors contributed equally to this work.STATEMENT: The International Society for Cellular and Gene Therapies (ISCT) and the International Society forExtracellular Vesicles (ISEV) recognize the potential of extracellular vesicles (EVs, including exosomes) frommesenchymal stromal cells (MSCs) and possibly other cell sources as treatments for COVID-19. Research andtrials in this area are encouraged. However, ISEV and ISCT do not currently endorse the use of EVs or exo-somes for any purpose in COVID-19, including but not limited to reducing cytokine storm, exerting regenera-tive effects or delivering drugs, pending the generation of appropriate manufacturing and quality controlprovisions, pre-clinical safety and efficacy data, rational clinical trial design and proper regulatory oversight.© 2020 International Society for Cell and Gene Therapy. This is an open access article under the CC BY-NC-NDlicense. (http://creativecommons.org/licenses/by-nc-nd/4.0/)First described in December 2019, the severe acute respiratorysyndrome associated with coronavirus disease-19 (COVID-19)quickly evolved into a pandemic, with severe and increasing world-wide morbidity and mortality. Although most infected patients havemild to moderate symptoms or are even asymptomatic, olderpatients and those with pre-existing chronic diseases are at greaterrisk of developing serious complications, such as pneumonia or mul-tiple organ failure. COVID-19 respiratory infection is marked by dys-regulated immune responses leading to significant respiratorypathology as well as increased probabilities for multi-organ patholo-gies. While the inflammatory pathways are still being elucidated,notable components include increased circulating levels of pro-inflammatory cytokines and other mediators, including interleukin-6(IL-6), interleukin-1b (IL-1b), induced protein 10 (IP10) and mono-cyte chemoattractant protein-1 (MCP-1) [4, 6, 41]. There are also sig-nificant alterations in circulating inflammatory cell populations, withinitial lymphocytosis followed by severe lymphopenia, withincreased ratios of helper to regulatory T cells [4, 6, 30]. Since dysre-gulated immune responses and the cytokine storm are triggers fordevelopment of acute respiratory distress syndrome, an increasingeffort and current clinical trials are focused on immune therapeuticapproaches, such as IL-1 blockade (anakinra), IL-6 receptor blockade(tocilizumab) and Janus kinase inhibition [22]. In parallel, there are arapidly increasing number of cell-based therapy investigations,mostly utilizing mesenchymal stromal cells (MSCs) [12]. These arebased on supporting pre-clinical data for use of MSCs delivered eithersystemically or intratracheally in pre-clinical models of acute lunginjuries and on demonstration of safety of systemic MSC administra-tion in recent trials for acute respiratory distress syndrome resultingfrom other etiologies [15, 21].Among the cell-based therapy investigations for COVID-19, some reg-istered clinical trials aim to utilize extracellular vesicles (EVs) preparedfrom MSC-conditioned media rather than the cells themselves. MSC-EVswill be administered intravenously (ChiCTR2000030484) or by inhalation(NCT04276987, ChiCTR2000030261). The rationale for these approachesis based on a relatively small but growing number of investigations inpre-clinical lung injury and sepsis models in which MSC-EV preparationswere described as being as safe and effective as—if not more than—theirparent cells [19, 40]. The approach is further supported by a growingbody of literature on the therapeutic potential and mechanisms of EVs ina wide range of diseases, including recent positive results in a steroid-refractory graft-versus-host disease patient treated with MSC-EVs and ina single-center, randomized, placebo-controlled phase 2/3 clinical pilotstudy on chronic kidney disease patients treated withMSC-EVs [14, 25].The mechanisms by which EVs exert their beneficial effects, aswell as their site(s) of action, remain incompletely understood. None-theless, effects observed in a range of pre-clinical non-COVID-19model systems suggest that they may also have efficacy againstCOVID-19. For example, systemic administration of MSC-EV prep-arations modulated immune responses such as elevated cytokinestorms in relevant lung disease models, including acute lunginjury and sepsis [17, 20, 23, 24, 27, 35, 38, 42]. Notably, inEscherichia coli-induced pneumonia mouse models, MSC-EVadministration was found to enhance phagocytosis of bacteria [9,23]. In a pig model, MSC-EVs were shown to attenuate influenzavirus-induced acute lung injury, among other conditions, byinhibiting influenza virus replication [11]. Disease-attenuatingeffects on inflammatory immune responses following MSC-EVadministration have also been observed in other disease models[2]. In an ischemic stroke model, for example, syste mic MSC-EVadministration reduced stroke-induced lymphopenia and pro-inflammatory immune responses in the brain and periphery,resulting in overall improvement of disease symptoms [7, 37].These preliminary observations support MSC-EV administrationas a potential treatment option for COVID-19.However, the specific scientific rationale for the administration ofMSC-EV and other EV treatments in COVID-19 patients needs to bebetter understood and justified. For example, MSC-EVs do not neces-sarily suppress immune responses, but rather modulate them. Specif-ically, they seem to moderate acute immune responses towardregulatory responses, with the latter inducing tolerance and restoringhomeostasis [43\u000245]. While tolerance induction in graft-versus-hostdisease and other non-infectious diseases may be beneficial, it mightalso have severe adverse effects in the presence of replicating patho-gens. Although influenza and E. coli infections were attenuated inselected models [9, 11, 23], other viruses and bacteria might conceiv-ably expand in an uncontrolled manner in induced tolerogenic envi-ronments.A number of additional issues should be considered before adminis-tering MSC-EVs to COVID-19 patients. These include the source of MSC-EVs. MSCs are a heterogeneous cell entity that can be obtained from dif-ferent tissues. Even if derived from the same tissues, they may displayinterindividual and possibly clone-specific functional differences [28,29, 31, 36]. Indeed, side-by-side comparison of four MSC-EV prepara-tions harvested from the conditioned media of different donor-derivedbonemarrowMSCs demonstrated significant variations in cytokine con-tent [14]. Whether this correlates with therapeutic potency is not yetclear; however, in the example of the ischemic stroke model, it wasdemonstrated that MSC-EV preparations with comparable particle andprotein contents can significantly differ in potency. While some prepa-rations effectively suppressed stroke symptoms, others failed to exerttherapeutic activities [37]. Furthermore, in an acute lung injury model,EVs from young, but not aged, MSCs alleviated lipopolysaccharide-induced acute lung injury [10].Potentially, heterogeneity of EV potency due to different sources,preparations, aging and other factors could be resolved by generatingimmortalized clonal MSC lines that could be rigorously tested for EVproduction and potency [5]. Still, apart from their immunomodula-tory capabilities, MSC-EVs apparently also control additional biologi-cal processes, some with approved therapeutic functions [1] and484 V. B€orger et al. / Cytotherapy 22 (2020) 482\u0002485others that might trigger unforeseen side effects. Just recently, it wasfound that adipose-derived MSC-EVs had higher thrombogenic activ-ity than bone marrow-derived MSC-EVs [3, 34]. Thus, the source ofparental cells might increase thrombosis risk. Coupled with the find-ing that activation of complement pathways and an associated pro-coagulant state seem to result in catastrophic microvascular injurysyndrome in a proportion of severe COVID-19 cases [18], MSC-EVadministration could even be counterproductive in COVID-19.To this end, it is imperative that stringent “identity” and“potency” parameters are defined and potential side effectsaddressed before MSC-EV or other EV preparations are released fortherapeutic applications [16, 32, 39]. To date, many groups use in-house MSC-EV manufacturing and characterization strategies,mainly for pre-clinical studies [2]. Protocols fulfilling GoodManufacturing Practice (GMP) criteria are sparse, and just a fewhave been published [8, 26, 33]. For product candidates, studiesfocusing on safety and clinical pharmacology need to be per-formed. Results of such studies are mandatory to provide guidancefor adjustment of manufacturing, storage, dosing and administra-tion of EV-based therapeutics in specific target diseases.We would like to refer to a recent statement by ISCT on the useof MSCs in COVID-19 [13] and one by the Italian STEMnet1, asmany of the same considerations apply to MSC-EVs or other EVs.Governmental organizations, health care providers and clinicalinvestigators must take the lead by insisting that clinical uses ofEVs follow appropriate scientific, regulatory and ethical guidelinesand are approved only after a rigorous review by duly empoweredagencies. The ethical guidelines produced by the World HealthOrganization are a useful baseline2. The urgency of the currentoutbreak does not justify administration of EVs in uncontrolledcompassionate use settings and does not obviate the need to reg-ister clinical trials, obtain informed consent from patients or prox-ies and otherwise comply with good clinical practice. Inparticular, even limited compassionate use should employ well-characterized MSC-EV preparations produced through strict GMPconditions under the oversight of the relevant national regulatoryentity. Additional outbreak-specific measures may be needed,including establishing simplified clinical protocols for hospital-ized patients, such as the World Health Organization COVID-19core protocol; minimizing risks to trial integrity3; and changinglogistics of trial participant visits (e.g., implementation of remoteassessments) as well as protocol changes for the sake of hazardminimization, which may need to be implemented and reported,in Europe, to the Institute for Research in Biomedicine Barcelonaafter the fact. Certainly, to foster developments, it is helpful tohave regulatory flexibility and support from sources such as theUS Food and Drug Administration special emergency program forpossible therapies, the Coronavirus Treatment Acceleration Pro-gram4, the European Medicines Agency (EMA) COVID-19 Pan-demic Task Force5, the EMA guidance for medicine developers andcompanies on COVID-196 and the guidelines for clinical trials pub-lished by an EMA-coordinated group7 or the Medicines andHealthcare Products Regulatory Agency8, respectively. Most or allof the considerations covered for cell-based therapies are alsoapplicable to EV investigations.1 http://www.gismonline.it/images/filepdf/20200316_PostionSTEMNET_Covid19-MSCs.pd2 Organisation WH. Guidance for managing ethical issues in infectious disease outbreaks. W3 FDA Guidance on Conduct of Clinical Trials of Medical Products during COVID-19 Pandem4 Coronavirus Treatment Acceleration Program (CTAP) | FDA n.d. https://www.fda.gov(accessed April 1, 2020).5 COVID-19 EMA pandemic Task Force (COVID-ETF): “to help EU Member States and the Ement, authorisation and safety monitoring of treatments and vaccines intended for the treatmoverview/public-health-threats/coronavirus-disease-covid-19/emas-governance-during-cov6 https://www.ema.europa.eu/en/human-regulatory/overview/public-health-threats/coro7 https://ec.europa.eu/health/sites/health/files/files/eudralex/vol-10/guidanceclinicaltrials8 https://www.gov.uk/guidance/mhra-regulatory-flexibilities-resulting-from-coronavirus-In conclusion, to mitigate the risk of potentially life-threateningside effects, ISCT and ISEV strongly urge that the potential benefitsand risks in the use of MSC-EVs for COVID-19 be weighed carefullyagainst available pre-clinical data in relevant animal models and clin-ical data from relevant MSC clinical trials and that any use of EVs becarefully evaluated through rational clinical trial design, employingwell-characterized EV preparations produced under strict GMP con-ditions and under the proper regulatory oversight.FundingNo funding was received.Declaration of competing interestJDA is the co-founder of an exosome therapeutics company calledSomos Therapeutics, Inc. BG is a scientific advisory board memberwith Evox Therapeutics and Innovex Therapeutics SL. MG has a con-sulting and advisory role with MDimune. BLL has stock and otherownership interests with Tmunity Therapeutics; has received hono-raria from Novartis, Terumo and AstraZeneca; and has a consulting oradvisory role with Brammer Bio/ThermoFisher Viral Vector Services,Avectas, Immuneel, Ori Biotech and Vycellix. SKL is the founder ofParacrine Therapeutics and has a scientific advisory role with IliasBiologics and ExoCo. SAM is the inventor of intellectual propertylicensed by BCH to United Therapeutics Corp.Author contributionsDrafting the manuscript: VB, DJW, KWW, SKL, BG. All authorshave approved the final article.References[1] Arslan F, Lai RC, Smeets MB, Akeroyd L, Choo A, Aguor EN, Timmers L, van RijenHV, Doevendans PA, Pasterkamp G, et al. Mesenchymal stem cell-derived exo-somes increase ATP levels, decrease oxidative stress and activate PI3K/Akt path-way to enhance myocardial viability and prevent adverse remodeling aftermyocardial ischemia/reperfusion injury. Stem Cell Res 2013;10:301–12.[2] B€orger V, Bremer M, Ferrer-Tur R, Gockeln L, Stambouli O, Becic A, Giebel B. Mes-enchymal stem/stromal cell-derived extracellular vesicles and their potential asnovel immunomodulatory therapeutic agents. Int J Mol Sci 2017;18.[3] Chance TC, Rathbone CR, Kamucheka RM, Peltier GC, Cap AP, Bynum JA. Theeffects of cell type and culture condition on the procoagulant activity of humanmesenchymal stromal cell-derived extracellular vesicles. J Trauma Acute CareSurg 2019;87:S74–82.[4] Chen G, Wu D, Guo W, Cao Y, Huang D, Wang H, Wang T, Zhang X, Chen H, Yu H,et al. Clinical and immunological features of severe and moderate coronavirusdisease 2019. J Clin Invest 2020;130.[5] Chen TS, Arslan F, Yin Y, Tan SS, Lai RC, Choo AB, Padmanabhan J, Lee CN, de KleijnDP, Lim SK. Enabling a robust scalable manufacturing process for therapeutic exo-somes through oncogenic immortalization of human ESC-derived MSCs. J TranslMed 2011;9:47.[6] Diao B, Wang C, Tan Y, Chen X, Liu Y, Ning L, Chen L, Li M, Liu Y, Wang G, et al.Reduction and functional exhaustion of T cells in patients with coronavirus dis-ease 2019 (COVID-19). Front Immunol 2020;11:827.[7] Doeppner TR, Herz J, Gorgens A, Schlechter J, Ludwig AK, Radtke S, de MiroschedjiK, Horn PA, Giebel B, Hermann DM. Extracellular vesicles improve post-strokeneuroregeneration and prevent postischemic immunosuppression. Stem CellsTransl Med 2015;4:1131–43.forld Heal Organ 2016:62.ic Guidance for Industry, Investigators, and Institutional Review Boards. 2020./drugs/coronavirus-covid-19-drugs/coronavirus-treatment-acceleration-program-ctapuropean Commission to take quick and coordinated regulatory action on the develop-ent and prevention of COVID-19.” https://www.ema.europa.eu/en/human-regulatory/id-19-pandemic#covid-19-ema-pandemic-task-force-sectionnavirus-disease-covid-19/guidance-medicine-developers-companies-covid-19_covid19_en.pdfcovid-19#clinical-trialsV. B€orger et al. / Cytotherapy 22 (2020) 482\u0002485 485[8] Gimona M, Pachler K, Laner-Plamberger S, Schallmoser K, Rohde E. Manufactur-ing of human extracellular vesicle-based therapeutics for clinical use. Int J Mol Sci2017;18.[9] Hao Q, Gudapati V, Monsel A, Park JH, Hu S, Kato H, Lee JH, Zhou L, He H, Lee JW.Mesenchymal stem cell-derived extracellular vesicles decrease lung injury inmice. J Immunol 2019;203:1961–72.[10] Huang R, Qin C, Wang J, Hu Y, Zheng G, Qiu G, Ge M, Tao H, Shu Q, Xu J. Differen-tial effects of extracellular vesicles from aging and young mesenchymal stem cellsin acute lung injury. Aging (Albany NY) 2019;11:7996–8014.[11] Khatri M, Richardson LA, Meulia T. Mesenchymal stem cell-derived extracellularvesicles attenuate influenza virus-induced acute lung injury in a pig model. StemCell Res Ther 2018;9:17.[12] Khoury M, Cuenca J, Cruz FF, Figueroa FE, Rocco PRM, Weiss DJ. Current status ofcell-based therapies for respiratory virus infections: applicability to COVID-19.Eur Respir J 2020:2000858.[13] Khoury M, Rocco PRM, Phinney DG, Krampera M, Martin I, Viswanathan S, NoltaJA, LeBlanc K, Galipeau J, Weiss DJ. Cell-based therapies for COVID-19: properclinical investigations are essential. Cytotherapy 2020.[14] Kordelas L, Rebmann V, Ludwig AK, Radtke S, Ruesing J, Doeppner TR, Epple M,Horn PA, Beelen DW, Giebel B. MSC-derived exosomes: a novel tool to treat ther-apy-refractory graft-versus-host disease. Leukemia 2014;28:970–3.[15] Laffey JG, Matthay MA. Fifty Years of Research in ARDS. Cell-based therapy foracute respiratory distress syndrome. Biology and potential therapeutic value. AmJ Respir Crit Care Med 2017;196:266–73.[16] Lener T, Gimona M, Aigner L, Borger V, Buzas E, Camussi G, Chaput N, ChatterjeeD, Court FA, Del Portillo HA, et al. Applying extracellular vesicles based therapeu-tics in clinical trials—an ISEV position paper. J Extracell Vesicles 2015;4:30087.[17] Liu J, Chen T, Lei P, Tang X, Huang P. Exosomes released by bone marrow mesen-chymal stem cells attenuate lung injury induced by intestinal ischemia reperfu-sion via the TLR4/NF-kappaB pathway. Int J Med Sci 2019;16:1238–44.[18] Magro C, Mulvey JJ, Berlin D, Nuovo G, Salvatore S, Harp J, Baxter-Stoltzfus A, Lau-rence J. Complement associated microvascular injury and thrombosis in the path-ogenesis of severe COVID-19 infection: a report of five cases. Transl Res 2020.[19] Mahida RY, Matsumoto S, Matthay MA. Extracellular vesicles: a new frontier forresearch in acute respiratory distress syndrome. Am J Respir Cell Mol Biol 2020.[20] Mansouri N, Willis GR, Fernandez-Gonzalez A, Reis M, Nassiri S, Mitsialis SA,Kourembanas S. Mesenchymal stromal cell exosomes prevent and revert experi-mental pulmonary fibrosis through modulation of monocyte phenotypes. JCIInsight 2019;4.[21] Matthay MA, Calfee CS, Zhuo H, Thompson BT, Wilson JG, Levitt JE, Rogers AJ, GottsJE, Wiener-Kronish JP, Bajwa EK, et al. Treatment with allogeneic mesenchymal stro-mal cells for moderate to severe acute respiratory distress syndrome (START study):a randomised phase 2a safety trial. Lancet Respir Med 2019;7:154–62.[22] Mehta P, McAuley DF, Brown M, Sanchez E, Tattersall RS, Manson JJ. Hlh AcrossSpeciality Collaboration, U.K. COVID-19: consider cytokine storm syndromes andimmunosuppression. Lancet 2020;395:1033–4.[23] Monsel A, Zhu YG, Gennai S, Hao Q, Hu S, Rouby JJ, Rosenzwajg M, Matthay MA,Lee JW. Therapeutic effects of human mesenchymal stem cell-derived microve-sicles in severe pneumonia in mice. Am J Respir Crit Care Med 2015;192:324–36.[24] Morrison TJ, Jackson MV, Cunningham EK, Kissenpfennig A, McAuley DF, O'KaneCM, Krasnodembskaya AD. Mesenchymal stromal cells modulate macrophages inclinically relevant lung injury models by extracellular vesicle mitochondrialtransfer. Am J Respir Crit Care Med 2017;196:1275–86.[25] Nassar W, El-Ansary M, Sabry D, Mostafa MA, Fayad T, Kotb E, Temraz M, Saad AN,Essa W, Adel H. Umbilical cord mesenchymal stem cells derived extracellularvesicles can safely ameliorate the progression of chronic kidney diseases. Bio-mater Res 2016;20:21.[26] Pachler K, Lener T, Streif D, Dunai ZA, Desgeorges A, Feichtner M, Oller M, Schall-moser K, Rohde E, Gimona M. A Good Manufacturing Practice-grade standardprotocol for exclusively human mesenchymal stromal cell-derived extracellularvesicles. Cytotherapy 2017;19:458–72.[27] Park KS, Svennerholm K, Shelke GV, Bandeira E, Lasser C, Jang SC, Chandode R,Gribonika I, Lotvall J. Mesenchymal stromal cell-derived nanovesicles amelioratebacterial outer membrane vesicle-induced sepsis via IL-10. Stem Cell Res Ther2019;10:231.[28] Phinney DG. Functional heterogeneity of mesenchymal stem cells: implicationsfor cell therapy. J Cell Biochem 2012;113:2806–12.[29] Phinney DG, Kopen G, Righter W, Webster S, Tremain N, Prockop DJ. Donor varia-tion in the growth properties and osteogenic potential of human marrow stromalcells. J Cell Biochem 1999;75:424–36.[30] Qin C, Zhou L, Hu Z, Zhang S, Yang S, Tao Y, Xie C, Ma K, Shang K, Wang W, et al.Dysregulation of immune response in patients with COVID-19 in Wuhan, China.Clin Infect Dis 2020.[31] Radtke S, Gorgens A, Liu B, Horn PA, Giebel B. Human mesenchymal and murinestromal cells support human lympho-myeloid progenitor expansion but notmaintenance of multipotent haematopoietic stem and progenitor cells. Cell Cycle2016;15:540–5.[32] Reiner AT, Witwer KW, van Balkom BWM, de Beer J, Brodie C, Corteling RL, Gabri-elsson S, Gimona M, Ibrahim AG, de Kleijn D, et al. Concise review: developingbest-practice models for the therapeutic use of extracellular vesicles. Stem CellsTransl Med 2017;6:1730–9.[33] Rohde E, Pachler K, Gimona M. Manufacturing and characterization of extracellu-lar vesicles from umbilical cord-derived mesenchymal stromal cells for clinicaltesting. Cytotherapy 2019;21:581–92.[34] Silachev DN, Goryunov KV, Shpilyuk MA, Beznoschenko OS, Morozova NY, KraevayaEE, Popkov VA, Pevzner IB, Zorova LD, Evtushenko EA, et al. Effect of MSCs and MSC-derived extracellular vesicles on human blood coagulation. Cells 2019;8.[35] Varkouhi AK, Jerkic M, Ormesher L, Gagnon S, Goyal S, Rabani R, Masterson C,Spring C, Chen PZ, Gu FX, et al. Extracellular vesicles from interferon-gamma-primed human umbilical cord mesenchymal stromal cells reduce Escherichia coli-induced acute lung injury in rats. Anesthesiology 2019;130:778–90.[36] Vogel W, Grunebach F, Messam CA, Kanz L, Brugger W, Buhring HJ. Heterogeneityamong human bone marrow-derived mesenchymal stem cells and neural pro-genitor cells. Haematologica 2003;88:126–33.[37] Wang C, B€orger V, Sardari M, Murke F, Skuljec J, Pul R, Hagemann N, Dzyubenko E,Dittrich R, Gregorius J, et al. Mesenchymal stromal cell-derived small extracellularvesicles induce ischemic neuroprotection by modulating leukocytes and specifi-cally neutrophils. Stroke 2020. STROKEAHA119028012.[38] Willis GR, Fernandez-Gonzalez A, Anastas J, Vitali SH, Liu X, Ericsson M,Kwong A, Mitsialis SA, Kourembanas S. Mesenchymal stromal cell exosomesameliorate experimental bronchopulmonary dysplasia and restore lung func-tion through macrophage immunomodulation. Am J Respir Crit Care Med2018;197:104–16.[39] Witwer KW, Van Balkom BWM, Bruno S, Choo A, Dominici M, Gimona M, Hill AF,De Kleijn D, Koh M, Lai RC, et al. Defining mesenchymal stromal cell (MSC)-derived small extracellular vesicles for therapeutic applications. J ExtracellVesicles 2019;8:1609206.[40] Worthington EN, Hagood JS. Therapeutic use of extracellular vesicles for acuteand chronic lung disease. Int J Mol Sci 2020;21:2318.[41] Yang Y, Shen C, Li J, Yuan J, YangM,Wang F, Li G, Li Y, Xing L, Peng L, et al. Exuberantelevation of IP-10, MCP-3 and IL-1ra during SARS-CoV-2 infection is associated withdisease severity and fatal outcome. medRxiv 2020. 2020.2003.2002.20029975.[42] Zhu YG, Feng XM, Abbott J, Fang XH, Hao Q, Monsel A, Qu JM, Matthay MA,Lee JW. Human mesenchymal stem cell microvesicles for treatment ofEscherichia coli endotoxin-induced acute lung injury in mice. Stem Cells2014;32:116–25.[43] Giebel B, Hermann DM. Identification of the right cell sources for the productionof therapeutically active extracellular vesicles in ischemic stroke. Ann Transl Med2019;7:188.[44] Zhang B, Yeo RWY, Lai RC, Sim EWK, Chin KC, Lim SK. Mesenchymal stromal cellexosome\u0002enhanced regulatory T-cell production through an antigen-presentingcell\u0002mediated pathway. Cytotherapy 2018;20:687–96.[45] Zhang B, Yin Y, Lai RC, Tan SS, Choo ABH, Lim SK. Mesenchymal Stem Cells SecreteImmunologically Active Exosomes. Stem cells and development 2014;23:1233–44.",
    "Link": "https://core.ac.uk/download/323055339.pdf"
}