{
    "Title": "Holographic Entanglement Entropy of Anisotropic Minimal Surfaces in LLM\n  Geometries",
    "Authors": "Kim, Chanju, Kim, Kyung Kiu, Kwon, O-Kab",
    "Year": "No year available",
    "Abstract": "We calculate the holographic entanglement entropy (HEE) of the $\\mathbb{Z}_k$\norbifold of Lin-Lunin-Maldacena (LLM) geometries which are dual to the vacua of\nthe mass-deformed ABJM theory with Chern-Simons level $k$. By solving the\npartial differential equations analytically, we obtain the HEEs for all LLM\nsolutions with arbitrary M2 charge and $k$ up to $\\mu_0^2$-order where $\\mu_0$\nis the mass parameter. The renormalized entanglement entropies are all\nmonotonically decreasing near the UV fixed point in accordance with the\n$F$-theorem. Except the multiplication factor and to all orders in $\\mu_0$,\nthey are independent of the overall scaling of Young diagrams which\ncharacterize LLM geometries. Therefore we can classify the HEEs of LLM\ngeometries with $\\mathbb{Z}_k$ orbifold in terms of the shape of Young diagrams\nmodulo overall size. HEE of each family is a pure number independent of the 't\nHooft coupling constant except the overall multiplication factor. We extend our\nanalysis to obtain HEE analytically to $\\mu_0^4$-order for the symmetric\ndroplet case.Comment: 15 pages, 1 figur",
    "Keywords": "No keywords available",
    "Publisher": "'Elsevier BV'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "ar\nX\niv\n:1\n60\n5.\n00\n84\n9v\n1 \n [h\nep\n-th\n]  \n3 M\nay\n 20\n16\nHolographic Entanglement Entropy of Anisotropic\nMinimal Surfaces in LLM Geometries\nChanju Kim,1 Kyung Kiu Kim,2 O-Kab Kwon,3\n1Department of Physics, Ewha Womans University, Seoul 120-750, Korea\n2Department of Physics, College of Science, Yonsei University, Seoul 120-749, Korea\n3Department of Physics, BK21 physics Research Division, Institute of Basic Science,\nSungkyunkwan University, Suwon 440-746, Korea\ncjkim@ewha.ac.kr, kimkyungkiu@gmail.com, okab@skku.edu\nAbstract\nWe calculate the holographic entanglement entropy (HEE) of the Zk orbifold of Lin-Lunin-\nMaldacena (LLM) geometries which are dual to the vacua of the mass-deformed ABJM\ntheory with Chern-Simons level k. By solving the partial differential equations analytically,\nwe obtain the HEEs for all LLM solutions with arbitrary M2 charge and k up to µ20-order\nwhere µ0 is the mass parameter. The renormalized entanglement entropies are all mono-\ntonically decreasing near the UV fixed point in accordance with the F -theorem. Except the\nmultiplication factor and to all orders in µ0, they are independent of the overall scaling of\nYoung diagrams which characterize LLM geometries. Therefore we can classify the HEEs of\nLLM geometries with Zk orbifold in terms of the shape of Young diagrams modulo overall\nsize. HEE of each family is a pure number independent of the ’t Hooft coupling constant\nexcept the overall multiplication factor. We extend our analysis to obtain HEE analytically\nto µ40-order for the symmetric droplet case.\n1 Introduction\nGauge/gravity duality has been a central paradigm for decades in theoretical physics.\nAmong others, holographic calculation of the entanglement entropy (EE) [1, 2] draws re-\ncently much attention due to its elegance and implications for the nature of quantum field\ntheories as well as quantum gravity.\nIn this paper, we consider Zk orbifolds of Lin-Lunin-Maldacena(LLM) geometries [3,\n4] with SO(2,1)×SO(4)×SO(4) isometry in 11-dimensional supergravity and calculate the\nholographic entanglement entropy (HEE) to nontrivial orders in the mass parameter. The\nmain motivation is their connection to the Aharony-Bergman-Jafferis-Maldacena (ABJM)\ntheory with level k [5] which is a conformal field theory (CFT) describing the dynamics\nof M2-branes on the transverse C4/Zk orbifold with the Chern-Simons level k. It allows a\nmass-deformation [6, 7] which preserves full N = 6 supersymmetries. This mass-deformed\nABJM (mABJM) theory has many supersymmetric vacua. It has been shown that the\nvacua have one-to-one correspondence with the Zk orbifold [8,9] of LLM geometries, which\nare classified by a 1-dimensional droplet picture, or equivalently Young diagrams [4].\nThe LLM metric has a mass parameter µ0 which is proportional to the mass parameter\nµ in the mABJM theory. Then we can explore the renormalization group (RG) flow of the\nrenormalized entanglement entropy (REE) [10] triggered by the mass deformation from the\nABJM theory as a UV fixed point [11]. Since there are many vacua in the theory, the RG flow\ndepends on the vacuum. This should be manifested in the holographic calculation of REE\nfor LLM geometries. See also [12–18] for the behavior of EE under relevant perturbations\nfrom the UV fixed point.\nAn important issue related to REE is about the c-theorem which states that there exists a\nc-function which is positive definite and monotonically decreasing along the RG flow [19–21].\nIn 3-dimensions in particular, it is called the F -theorem [22] because the free energy on a\nthree sphere plays the role of c-function. The F -theorem was proved [23] through the\nconnection of the free energy with the constant term of EE of a circle [24–26]. In this paper,\nwe will examine explicitly how F -theorem is realized in the HEE of the mABJM theory\nwhich has a large number of discrete vacua.\nThe LLM geometries with Zk orbifold are all asymptotic to AdS4 × S7/Zk. They are,\nhowever, not spherically symmetric along the radial direction of the AdS geometry but\ndepend on two transverse coordinates. Therefore, it is not a simple exercise to get the\nminimal area for a given entangling region because one has to solve a partial differential\nequation (PDE) for the two transverse coordinates. In the previous work [11], the angle\n1\ndependence was neglected to simplify the calculation with the assumption that it would\nnot contribute at least in the leading order in µ0. Though sensible results were obtained\nfor simple droplet configurations, there were cases that the F -theorem is violated in this\napproximation. In this work, however, we take into account all the angle dependence exactly.\nIn other words, we solve the PDE exactly for all LLM solutions with Zk orbifold and obtain\nthe corresponding HEE up to µ20-order. Then we verify that the REE satisfies the F -theorem\nfor all relevant deformations connected to dual LLM geometries with Zk orbifold. For some\nsimple droplet configurations with general k, we further extend our analysis to µ40-order and\nobtain REE analytically.\nSince we work with the most general k and the rank of the gauge group N , it is possible\nto investigate the dependence of EE on these parameters including the ’t Hooft coupling\nλ = N/k in particular. Note, however, that it is not a trivial task to compare the EEs with\ndifferent N or k because they will not uniquely specify a droplet due to many degeneracies.\nThat is, in the field theory language, different vacua will give different EEs and to begin\nwith one has to specify the vacua to compare. We will see that, depending on which\nvacua to choose, the EE depends on λ differently. Moreover, we will show that, up to a\nmultiplication factor, the HEE of LLM geometries is independent of the overall scaling of\nthe droplet configurations to all orders in µ0. Therefore, we can classify the LLM geometries\nwith Zk orbifold in terms of the shape of the corresponding Young diagrams modulo overall\nsize. At each order in µ0, they are pure numbers independent of λ. These can be considered\nas nontrivial results to test the gauge/gravity duality in the large N limit between the LLM\ngeometry and mABJM theory which are not conformal.\nThis paper is organized as follows. In section 2, we briefly review the relation between\nthe vacua of the mABJM theory and the droplet classification of the LLM geometry with\nZk orbifold. In section 3, we solve the PDE exactly to obtain the HEE of a disk up to\nµ20-order. We show that the resulting REE satisfies the F -theorem near the UV fixed point\nfor all LLM geometries with Zk orbifold. Then we show that it is classified by the shape of\nthe Young diagrams and discuss how it depends on N and k. We also calculate the REE\nanalytically up to µ40-order for simple droplets. We draw our conclusion in section 4.\n2 HEE of the mABJM Theory and LLM Geometries\nSupersymmetric vacua of the mABJM theory are classified by the occupation numbers\n(Nn, N\n′\nn) [9], which are numbers of irreducible n×(n+1) and (n+1)×n GRVV matrices [7],\nrespectively. On the other hand, the LLM solutions with Zk orbifold are also classified by\n2\nthe discrete torsions (ln, l\n′\nn) assigned in the droplet picture of the LLM geometry. It was\nshown that there exists one-to-one correspondence between (Nn, N\n′\nn) and (ln, l\n′\nn) in the\nrange, 0 ≤ Nn, N ′n, ln, l′n ≤ k [9]. Since the mass deformation of the ABJM theory is a\nrelevant deformation from the UV fixed point, the dual LLM geometry with Zk orbifold is\nasymptotic to AdS4×S7/Zk. We investigate the behavior of the RG flow near the UV fixed\npoint in terms of the HEE for all LLM solutions with general k and examine the F -theorem.\nLet us start with the LLM geometry dual to the vacua of the U(N)k×U(N)−k mABJM\ntheory with a mass parameter µ. The metric is given by\nds2 = |Gtt|(−dt2 + dw21 + dw22) +Gxx\n(\ndx2 + dy2\n)\n+Gθθds\n2\nS3/Zk\n+Gθ˜θ˜ds\n2\nS˜3/Zk\n, (2.1)\nwhere ds2S3/Zk and ds\n2\nS˜3/Zk\nare metrics for two S3/Zk spheres and\nGtt = −\n\n4µ20y\n√\n1\n4\n− z2\nf 2\n\n\n2/3\n, Gxx =\n\nf\n√\n1\n4\n− z2\n2µ0y2\n\n\n2/3\n, (2.2)\nGθθ =\n\n fy\n√\n1\n2\n+ z\n2µ0(\n1\n2\n− z)\n\n\n2/3\n, Gθ˜θ˜ =\n\n fy\n√\n1\n2\n− z\n2µ0\n(\n1\n2\n+ z\n)\n\n\n2/3\n(2.3)\nwith\nf =\n√\n1− 4z2 − 4y2V 2. (2.4)\nIn the metric, the mass parameter µ0 is identified with that of the mABJM theory through\nµ0 = µ/4 [9] in the convention of [11]. The geometry is completely determined by functions\nz and V ,\nz(x, y) =\n2NB+1∑\ni=1\n(−1)i+1(x− xi)\n2\n√\n(x− xi)2 + y2\n, V (x, y) =\n2NB+1∑\ni=1\n(−1)i+1\n2\n√\n(x− xi)2 + y2\n, (2.5)\nwhere xi’s denote the boundaries of black and white strips in the droplet representation\nwith NB being the number of black droplets. For details of the droplet picture with general\nk, see [9]. Due to the quantization condition of the four-form fluxes on 4-cycles ending on\nthe edges of black/white regions, it turns out that xi’s are quantized as\n(xi+1 − xi)\n2πl3Pµ0\n∈ Z, (2.6)\nwhere lP is the Planck length. Note that the quantization is proportional to µ0. It introduces\nµ0 dependence to the metric in addition to the explicit dependence appearing in (2.2) and\n(2.3).\n3\nThe metric (2.1) goes asymptotically to AdS4 × S7/Zk with radius R given by\nR = (32π2kN˜)1/6lP, (2.7)\nwhere1\nN˜ =\n1\n2k\n(C˜2 − C˜21),\nC˜p =\n2NB+1∑\ni=1\n(−1)i+1\n(\nxi\n2πl3Pµ0\n)p\n≡\n2NB+1∑\ni=1\n(−1)i+1x˜pi . (2.8)\nFor later convenience, we define normalized coefficients Cp by\nCp ≡ (kN˜)−p/2C˜p, (2.9)\nwhich are invariant under an overall scaling of xi’s. Then C2 − C21 = 2.\nNow, let’s consider a 9 dimensional surface in this geometry. We denote coordinates of\nthe surface by σi with i = 1, . . . , 9 and represent the embedding function as X\nM(σi) where\nM = 0, . . . , 10. Then, the 9 dimensional area of the surface becomes\nγA =\n∫\nd9σ\n√\ndet gij =\n∫\nd9σ\n√\ndetGMN\n∂XM∂XN\n∂σi∂σj\n, (2.10)\nwhere gij is the induced metric of the surface and GMN is the 11-dimensional metric in (2.1).\nThe HEE is defined by [1, 2]\nSA =\nMin(γA)\n4GN\n, (2.11)\nwhere GN = (2πlP)\n9/(32π2) is the 11 dimensional Newton constant. In the next section we\nwould like to calculate SA for disk-type entangling surfaces in the small µ0 limit.\n3 Anisotropic Minimal Surfaces and HEE\nThe effect of small mass deformation on the HEE has been considered in [11] under the\napproximation that the minimal surface is independent of the angle in polar coordinates\nintroduced below. Though this approximation gives reasonable results consistent with F -\ntheorem for simple droplet configurations, one cannot expect that it would be valid in general\n1N˜ is the area of the Young diagram made of positions x˜i divided by k, and is equal to the rank N of\nthe gauge group in the field theory up to the contribution of discrete torsions [28, 29]. See section 3 for an\nexample. In addition, there is a further constant correction − 1\n24\n(k − 1\nk\n). With these corrections, N˜ should\neventually be the Maxwell M2 charge [9], i.e. N˜ = N − 1\n24\n(k − 1\nk\n).\n4\nbecause the spherical symmetry is obviously broken. Indeed, for some droplet configurations\nthe REE calculated in [11] does not decrease monotonically along the RG flow, violating\nthe F -theorem. For these LLM geometries, it was also found that the curvature scalars\nare not small at some transverse positions even in the large N limit [11, 27], which implies\nthat the gauge/gravity duality for those geometries does not work in this approximation.\nIn this section we would like to investigate the effect of small mass deformation without\nresorting to such an approximation. In other words, we will treat the angular dependence\nof the minimal surface exactly. It amounts to solving PDEs with two variables up to some\nnontrivial order in µ0.\nFrom now on, we take only disk type entangling surfaces into account. We will work\nwith polar coordinates u and α defined by\nx =\nR3\n4lu\ncosα, y =\nR3\n4lu\nsinα, (3.12)\nwhere l is the radius of the disk at the boundary. The minimal surface is bounded by a disk\nin the w1-w2 plane at the boundary of AdS space (u = 0). To describe such a configuration,\nwe may consider the following embedding,\nw1 = ρl cosσ1, w2 = ρl sin σ1, u = u(ρ, φ), α = α(ρ, φ). (3.13)\nPlugging this into (2.10), we obtain the action,\nγdisk =\nπ5R9\n8k\n∫ 1\n0\ndρ\n∫ pi\n0\ndφ\ngρ sin3 α\nu2\n√\nα′2 +\nu′2\nu2\n+ g2(α˙u′ − α′u˙)2, (3.14)\nwhere ˙= ∂\n∂ρ\nand ′ = ∂\n∂φ\n. We have also introduced the function g(u, φ) defined by\nf(u, φ) = 2µ0lu sinφ g(u, φ). (3.15)\nNote that all the mass-deformation effect in (3.14) appears only through the function g which\ncontains the information of the droplet position xi’s. In the undeformed limit µ0 → 0, xi’s\ngo to zero due to the quantization condition (2.6). Then it is easy to see that g goes to\nunity and hence (3.14) reduces to the minimal surface action for the undeformed ABJM\ntheory [1].\nBy utilizing the residual gauge degree of freedom, we may choose α = φ. Then the\nequation of motion yields a PDE for u = u(ρ, φ),\n∂\n∂ρ\n(\nρg3u˙ sin3 φ\nu2\n√X\n)\n+\n∂\n∂φ\n(\nρgu′ sin3 φ\nu4\n√X\n)\n− ∂\n∂u\n(\nρg sin3 φ\nu2\n√\nX\n)\n= 0, (3.16)\nwhere X = 1 + u′2\nu2\n+ g2u˙2.\n5\n3.1 HEE up to O(µ20)\nNow we are ready to consider the effect of small mass deformation. From (2.4) and (2.5) we\nsee that g can be expanded in powers of xi√\nx2+y2\n∼ µ0lu. Furthermore, u itself will depend\non µ0l. As a result we can write\nu ≡\n∞∑\nn=0\nun(ρ, φ)(µ0l)\nn = u0(ρ) + u1(ρ, φ)µ0l + u2(ρ, φ)(µ0l)\n2 + · · · ,\ng(u, φ) ≡\n∞∑\nn=0\ngn(φ)(uµ0l)\nn\n= 1 + g1(φ)u0µ0l + [g1(φ)u1 + g2(φ)u\n2\n0](µ0l)\n2 + · · · . (3.17)\nSince z and V consist of the generating function of the Legendre polynomials, gi’s can be\nwritten in terms of Legendre polynomials [11]. Explicitly, a few lower terms are\ng1(φ) = D1 cosφ,\ng2(φ) = D2 +D3 cos(2φ), (3.18)\nwhere Di’s are constants depending on the droplet positions,\nD1 =\n1√\n2\n(C3 − C1C2),\nD2 = − 1\n32\n[\n4C23 − 4C1(C21 + C2)C3 − C22(C21 − 5C2) + 9(C21 − C2)C4\n]\n,\nD3 = − 1\n32\n[\n4C23 − 4C1(3C21 − C2)C3 + C22(C21 + 3C2) + 15(C21 − C2)C4\n]\n, (3.19)\nand Cp’s are defined in (2.9). Given Di’s, one can solve the equations of motion (3.16)\nperturbatively with respect to µ0 to obtain the change of the minimal surface. Note that\nwe have to solve inhomogeneous PDEs of two variables ρ and φ in the background of lower\norder configurations. There is, in general, no guarantee that explicit form of solutions\ncan be obtained. Nevertheless, in this case, we are able to find exact solutions up to the\nnonvanishing second orders in perturbation.\nLet us start with the zeroth order equation of (3.16) in µ0,\nu¨0 +\n(2ρ+ u0u˙0)(1 + u˙\n2\n0)\nρu0\n= 0. (3.20)\nThis is nothing but the equation of motion for the conformal case, as it should be. Imposing\nthe boundary conditions, u(0) = 1 and u˙(0) = 0, one can find the well-known solution which\nis a geodesic in AdS space,\nu0(ρ) =\n√\n1− ρ2. (3.21)\n6\nThis gives the minimal surface for ABJM theory without mass deformation.\nIf we plug this solution into (3.16), then the first order equation of motion reads\nρ(1 − ρ2)2u¨1 + ρu′′1 + (1− ρ2)(1− 2ρ2)u˙1 + 3ρ cotφ u′1 − 2ρu1\n−D1ρ(1− ρ2)(5− 3ρ2) cosφ = 0. (3.22)\nWe have to solve the equation under the boundary conditions u1(1, φ) = u˙1(0, φ) = 0 and\nu′1(ρ, 0) = u\n′\n1(ρ, π) = 0, where the latter comes from the regularity at φ = 0 and π. This is\nan inhomogeneous linear PDE with explicit dependence on the independent variables ρ and\nφ. It, however, admits a very simple solution\nu1(ρ, φ) = −D1\n2\n(\n1− ρ2) cosφ. (3.23)\nOne can proceed to the second order in µ20. The equation of motion at the second order\nbecomes, after the solutions (3.21) and (3.23) plugged into (3.17),\nρ(1− ρ2)2u¨2 + (1− ρ2)(1− 2ρ2)u˙2 + ρ(u′′2 + 3 cotφ u′2)− 2ρu2\n+\n1\n8\nρ(1− ρ2)3/2\n[\nD21(27− 26ρ2)− 16D2(3− 2ρ2)\n+ (11D21 − 16D3)(3− 2ρ2) cos(2φ)\n]\n= 0 , (3.24)\nwith the boundary conditions u′2(ρ, 0) = u\n′\n2(ρ, π) = 0 and u2(1, φ) = u˙2(0, φ) = 0. This is\neven more complicated than the first order equation (3.22). Remarkably, however, a fully\nanalytic solution is still available,\nu2(ρ, φ) = − 1\n6\n√\n1− ρ2 (D\n2\n1 + 20D2 − 12D3) log(1 +\n√\n1− ρ2)\n+\n1\n48\n{\n[8 + (9− 13ρ2)\n√\n1− ρ2]D21 + 16[10− (6− ρ2)\n√\n1− ρ2]D2\n− 48(2−\n√\n1− ρ2)D3\n}\n+\n1\n48\n(11D21 − 16D3)(1− ρ2)3/2 cos(2φ). (3.25)\nHaving found the solution to the µ20-order, now we can calculate the minimal surface\narea (3.14) to this order,\nγdisk = γ\n(0)\ndisk + µ0lγ\n(1)\ndisk + (µ0l)\n2γ\n(2)\ndisk + · · · . (3.26)\nInserting the solutions (3.21), (3.23) and (3.25) into (3.14), we obtain2:\nγ\n(0)\ndisk =\nπ5R9\n6k\n(\nl\nǫ\n− 1\n)\n, γ\n(1)\ndisk = 0, γ\n(2)\ndisk = −\nπ5R9\n72k\n(12D3 −D21 − 20D2), (3.27)\n2 Introducing the UV cutoff ǫ in the u coordinate changes the upper limit of the integration range of ρ\nin (3.14).\n7\nwhere ǫ in γ\n(0)\ndisk is the UV cutoff in the u coordinate. Note that the first order correction\nvanishes due to the angular integration. For the second order contribution γ\n(2)\ndisk, it is crucial\nto notice that the combination (12D3−D21−20D2) can be rewritten in the form of a complete\nsquare,\n12D3 −D21 − 20D2 = 16 +\n1\n2\n(C3 − 3C1C2 + 2C31 )2, (3.28)\nwhere we used the parameter relations in (3.19). The entanglement entropy then becomes\nSdisk =\nπ5R9\n24GNk\n{\nl\nǫ\n− 1− µ20l2\n[\n4\n3\n+\n1\n24\n(C3 − 3C1C2 + 2C31)2\n]}\n+O(µ30). (3.29)\nA few comments are in order. First, it is not difficult to show that the expression (C3 −\n3C1C2 + 2C\n3\n1) appearing here is a unique combination made of cubic terms in xi which is\ninvariant under the translation xi → xi + a. It provides a nontrivial consistency check of\nthe result. Moreover, the expression appears in (3.29) in the form of a complete square\nand hence the second order term is negative definite. This has an important implication in\nrelation to the F -theorem [22–24]. In the present context, the REE can play the role of a\nc-function of the theory [10]. It is computed by the prescription\nFdisk ≡\n(\nl\n∂\n∂l\n− 1\n)\nSdisk\n=\nπ5R9\n24GNk\n{\n1− µ20l2\n[\n4\n3\n+\n1\n24\n(C3 − 3C1C2 + 2C31)2\n]}\n+O(µ30), (3.30)\nwhich is clearly monotonically decreasing near the UV fixed point. Note that this is true\nfor all geometries dual to the vacua of mABJM, regardless of the Ci’s. This result may be\nconsidered as an evidence of the validity of holography for non-conformal case. This corrects\nthe result in [11] where REE was calculated with the angle (α) dependence neglected and\nshowed increasing behavior for some asymmetric droplet configurations. This means that\nthe angle dependence of the minimal surface in the LLM geometry results in nontrivial\ncontributions.\nAs is evident from the calculation, the REE depends on N or k only through Cp’s except\nthe overall multiplication. Therefore, different theories with same Cp’s will give essentially\nthe same REE. Since Cp’s defined in (2.9) are invariant under the overall scaling of droplet\nboundaries xi’s, a family of droplets with a same geometric shape of Young diagrams modulo\noverall size give the same REE up to a multiplication factor. This holds to all orders in µ0\nsince the action (3.14) is completely determined in terms of Cp’s up to an overall factor.\nAs a simple example, we consider the case of NB = 1 with arbitrary k for which the\ngeometry is specified by three boundary positions x1, x2 and x3 of the droplet. See Fig.1.\n8\nx\n\n3\nx\n\n2\nx\n\n1\nl2 = 0\nl3 = m\nl1 = k -m\nFigure 1: A droplet representation of NB=1 case. li’s are discrete torsions assigned at x˜i’s.\nFrom (2.8), the REE becomes\nFdisk = π\n5R9\n24GNk\n{\n1− µ20l2\n[\n7\n12\n+\n3\n8\n(\nx3 − x2\nx2 − x1 +\nx2 − x1\nx3 − x2\n)]}\n+O(µ30). (3.31)\nThis result explicitly shows that scaling the overall size of the droplet (or the shape of the\nYoung diagram) does not change REE except the overall multiplication factor.\nTo connect the result with the field theory, let us parameterize the integer-valued posi-\ntions x˜i = xi/2πl\n3\nPµ0 defined in (2.8) as x˜1 = −pk −m, x˜2 = (q − p)k, x˜3 = qk +m, where\np, q,m are positive integers and 0 ≤ m < k, so that the location of the Fermi level of the\ndroplet is zero. Then including the contribution of the discrete torsions [9], we obtain the\nrank N of the gauge group as N = (pk+m)(qk+m)/k−m(m−k)/k = kpq+m(p+ q+1).\nIn the large N limit with finite ’t Hooft coupling λ = N/k, (3.31) is reduced to\nFdisk = π\n5R9\n24GNk\n{\n1− µ20l2\n[\n7\n12\n+\n3\n8\n(\np\nq\n+\nq\np\n)]\n+O(1/k)\n}\n+O(µ30), (3.32)\nwhere we assumed k ≫ m for simplicity and λ = pq in this limit. Therefore, for a fixed ratio\nof p and q the mass correction is independent of λ. On the other hand, if we scale, say, p\nwith q fixed, then the correction depends nontrivially on λ since p/q = λ/q2. Note that by\nchanging p or q, we are comparing theories with different λ. The above result demonstrates\nthat λ-dependence of REE appears in different ways, depending on how vacua are selected\nin mABJM theories for comparison.\nFinally, let us give a comment on the stationarity of the RG flow. Since the deformation\nparameter µ enters into the mABJM theory as a mass of a supermultiplet, the deformation\n9\nis of the first order in µ due to the fermionic mass term. On the other hand, REE F in\n(3.30) has vanishing first order correction in µ0. It means that the RG flow at UV point is\nstationary. This is consistent with the result of [13].\n3.2 HEE up to O(µ40) for symmetric droplet case\nFor some simple droplet configurations, it is possible to obtain higher order corrections\nanalytically. For example, if D1 = 0, the first order equation (3.22) becomes homogeneous\nwith vanishing boundary conditions and hence the first order correction u1 is zero identically.\nThis will also simplify higher order equations. Here we will consider a symmetric droplet\ncase obtained by putting p = q in Fig.1, i.e., (x˜1, x˜2, x˜3) = (−pk − m, 0, pk + m) and\nN = kp2 +m(2p + 1).\nTo consider higher order corrections up to µ40-order, we need the following coefficient\nfunctions in (3.17),\ng2(φ) = −1\n8\n+\n9\n8\ncos(2φ),\ng4(φ) =\n1\n256\n[85− 60 cos(2φ) + 359 cos(4φ)], (3.33)\nas well as gn(φ) = 0 for odd n. By symmetry we may set un = 0 for odd n. Then employing\nall the lower order results including (3.21) and (3.25) gives us the equation of motion for\nu4(ρ, φ),\nρ(1− ρ2)2u¨4 + (1− ρ2)(1− 2ρ2)u˙4 + ρ(u′′4 + 3 cotφ u′4)− 2ρu4\n+B\n(4)\n0 (ρ) +B\n(4)\n2 (ρ) cos(2φ) +B\n(4)\n4 (ρ) cos(4φ) = 0, (3.34)\nwhere\nB\n(4)\n0 (ρ) =\n64ρ(3ρ2 + 2)\n9(1− ρ2)3/2\n[\nlog\n(√\n1− ρ2 + 1\n)]2\n− 2\n9ρ\n(9ρ6 + 28ρ4 + 187ρ2 − 64)\n− 2ρ\n9(1− ρ2)\n[\n128ρ2 − (67ρ4 + 8ρ2 + 85)\n√\n1− ρ2 + 192\n]\nlog\n(√\n1− ρ2 + 1\n)\n+\n1\n1152ρ\n√\n1− ρ2 (6147ρ\n10 − 15629ρ8 + 6165ρ6 − 8463ρ4 + 69124ρ2 − 16384),\nB\n(4)\n2 (ρ) =\n3\n32\nρ(1− ρ2)\n[\n576− 192ρ2 − (15ρ4 − 227ρ2 + 404)\n√\n1− ρ2\n]\n− 6ρ(7− ρ2)\n√\n1− ρ2 log\n(√\n1− ρ2 + 1\n)\n,\nB\n(4)\n4 (ρ) = −\n125\n128\nρ(1− ρ2)5/2(4− 3ρ2). (3.35)\n10\nThis is again an inhomogeneous PDE with very complicated source terms but fortunately\nwe can find the solution satisfying the necessary boundary conditions,\nu4(ρ, φ) = C\n(4)\n4 (ρ) cos(4φ) + C\n(4)\n2 (ρ) cos(2φ) + C\n(4)\n0 (ρ), (3.36)\nwhere\nC\n(4)\n4 (ρ) = −\n25\n256\n(\n1− ρ2)5/2 ,\nC\n(4)\n2 (ρ) =\n1\n64 (1− ρ2)3/2\n[\n96\n(\n7− 2ρ2) ρ2 log (√1− ρ2 + 1)+ 32 (6ρ4 − 16ρ2 − 5)√1− ρ2\n+\n(\n1− ρ2) (3ρ6 − 97ρ4 + 209ρ2 + 125) ],\nC\n(4)\n0 (ρ) = −\n1√\n1− ρ2\n∫ 1\nρ\nF (s) ds, (3.37)\nwith\nF (s) =\n135s6 + 598s4 − 3371s2 + 1423\n135s(1− s2)3/2 −\n256\n9s\n√\n1− s2 log 2\n+\n18441s8 − 37339s6 − 170949s4 + 326871s2 − 182144\n17280s(1− s2) −\n64s log2(\n√\n1− s2 + 1)\n9(1− s2)2\n+\n1\n9s\n[\n64(s4 + 1)\n(1− s2)3/2 −\n134s6 − 524s4 + 501s2 − 192\n(1− s2)2\n]\nlog(\n√\n1− s2 + 1). (3.38)\nInserting the solutions in (3.21), (3.25), and (3.36) into (3.17) and (3.14), we easily obtain\nthe corresponding HEE and REE for the symmetric droplet up to µ40-order,\nSdisk =\nπ5R9\n24kGN\n(\nl\nǫ\n− 1− 4\n3\nµ20l\n2 +\n2671− 3840 log 2\n540\nµ40l\n4\n)\n+O(µ60),\nFdisk = π\n5R9\n24kGN\n(\n1− 4\n3\nµ20l\n2 +\n2671− 3840 log 2\n180\nµ40l\n4\n)\n+O(µ60). (3.39)\nThis result holds for arbitrary N and k. In general, the expressions of the HEE and REE\ndepend on N , k, radius of the disk, and the choice of droplets as we have seen in the previous\nsubsection. However, for a family of droplets related by rescaling of the overall size, the\ncoefficients of the corrections are given by pure numbers as seen in (3.39), and in particular\nare independent of the ’t Hooft coupling constant λ. This is an interesting phenomena from\nthe point of view of the gauge/gravity duality. Based on the duality relation between the\nvacua of the mABJM theory and the LLM geometries with Zk orbifold, one can examine\nthe HEE conjecture by computing the EE of the dual field theory on a family of vacua\nconsidered here.\n11\n4 Conclusion\nWe investigated the RG flow behavior and the F -theorem in terms of the HEE near the UV\nfixed point in 3-dimensions, where a supersymmetric Chern-Simons matter theory is living.\nAs the UV CFT we considered the N = 6 ABJM theory and introduced the supersymmetry\npreserving mass deformation, called the mABJM theory. This deformation is a relevant\ndeformation and so triggers the RG flow from the UV fixed point. To describe the RG\nbehavior near the UV fixed point, we adapted the HEE conjecture to the LLM geometry in\n11-dimensional supergravity, since the supersymmetric vacua of the mABJM theory have\none-to-one correspondence with the LLM geometries with Zk orbifold.\nThe LLM solution has SO(2,1)×SO(4)×SO(4) isometry and warp factors of the metric\ndepend on the two transverse coordinates (u, α) in (3.12). For this reason, one has to solve\nthe PDE for u and α to obtain the minimal surface in the HEE proposal. In this paper, we\nanalytically solved the PDE up to µ20-order for all LLM solutions with arbitrary N and k.\nWe found that REEs have different RG trajectories depending on the LLM geometries but\nthey are always monotonically decreasing near the UV fixed point in accordance with the\nF -theorem in 3-dimensions.3 We also computed the REE up to µ40-order for a special family\nof LLM geometries with arbitrary N and k. It would be interesting to extend the result to\nmore general case.\nSince the HEE proposal is based on the gauge/gravity duality, in order to compare\nour results in gravity side with those in the mABJM theory, one has to consider the large\n’t Hooft coupling λ = N/k in the N →∞ limit. In general, the effect of mass deformation\nin REE would depend on λ and calculation in field theory side is a formidable task due to\nnonperturbative effects coming from the strong coupling constant. In the mABJM theory,\nthere are further complications from the presence of many vacua. However, we found that\nfor a family of droplets with a same shape of Young diagrams, we have the same REE (or\nHEE) up to overall dependence on N and k. One might be able to calculate the REE\nin the field theory side perturbatively on a certain class of vacua, and compare the result\nquantitatively with that in the dual gravity side.\n3Recently, it was reported that the strong form of the F -theorem, which describes the monotonically\ndecreasing behavior of the REE, is violated for relevant deformations by operators of conformal dimension\n3/2 < ∆ < 5/2 [30, 31]. One needs more investigations in this direction.\n12\nAcknowledgements\nKK thanks Tatsuma Nishioka for helpful comments in the 9th Asian Winter School on\nStrings in Busan. This work was supported by the National Research Foundation of Ko-\nrea(NRF) grant with the grant number NRF-2015R1D1A1A01058220 (K.K.) and NRF-\n2014R1A1A2059761 (O.K.).\nReferences\n[1] S. Ryu and T. Takayanagi, “Holographic derivation of entanglement entropy from\nAdS/CFT,” Phys. Rev. Lett. 96, 181602 (2006) [hep-th/0603001].\n[2] S. Ryu and T. Takayanagi, “Aspects of Holographic Entanglement Entropy,” JHEP\n0608, 045 (2006) [hep-th/0605073];\nT. Nishioka, S. Ryu and T. Takayanagi, “Holographic Entanglement Entropy: An\nOverview,” J. Phys. A 42, 504008 (2009) [arXiv:0905.0932 [hep-th]];\nT. Takayanagi, “Entanglement Entropy from a Holographic Viewpoint,” Class. Quant.\nGrav. 29, 153001 (2012) [arXiv:1204.2450 [gr-qc]].\n[3] I. Bena and N. P. Warner, “A Harmonic family of dielectric flow solutions with maximal\nsupersymmetry,” JHEP 0412, 021 (2004) [hep-th/0406145].\n[4] H. Lin, O. Lunin and J. M. Maldacena, “Bubbling AdS space and 1/2 BPS geometries,”\nJHEP 0410, 025 (2004) [hep-th/0409174].\n[5] O. Aharony, O. Bergman, D. L. Jafferis and J. Maldacena, “N=6 superconformal Chern-\nSimons-matter theories, M2-branes and their gravity duals,” JHEP 0810, 091 (2008)\n[arXiv:0806.1218 [hep-th]].\n[6] K. Hosomichi, K. -M. Lee, S. Lee, S. Lee and J. Park, “N=5,6 Superconfor-\nmal Chern-Simons Theories and M2-branes on Orbifolds,” JHEP 0809, 002 (2008)\n[arXiv:0806.4977 [hep-th]].\n[7] J. Gomis, D. Rodriguez-Gomez, M. Van Raamsdonk and H. Verlinde, “A Massive Study\nof M2-brane Proposals,” JHEP 0809, 113 (2008) [arXiv:0807.1074 [hep-th]].\n[8] H. -C. Kim and S. Kim, “Supersymmetric vacua of mass-deformed M2-brane theory,”\nNucl. Phys. B 839, 96 (2010) [arXiv:1001.3153 [hep-th]].\n13\n[9] S. Cheon, H. -C. Kim and S. Kim, “Holography of mass-deformed M2-branes,”\narXiv:1101.1101 [hep-th].\n[10] H. Liu and M. Mezei, “A Refinement of entanglement entropy and the number of\ndegrees of freedom,” JHEP 1304, 162 (2013) [arXiv:1202.2070 [hep-th]].\n[11] K. K. Kim, O. K. Kwon, C. Park and H. Shin, “Renormalized Entanglement En-\ntropy Flow in Mass-deformed ABJM Theory,” Phys. Rev. D 90, no. 4, 046006 (2014)\n[arXiv:1404.1044 [hep-th]]; “Holographic entanglement entropy of mass-deformed\nAharony-Bergman-Jafferis-Maldacena theory,” Phys. Rev. D 90, no. 12, 126003 (2014)\n[arXiv:1407.6511 [hep-th]].\n[12] I. R. Klebanov, T. Nishioka, S. S. Pufu and B. R. Safdi, “Is Renormalized Entanglement\nEntropy Stationary at RG Fixed Points?,” JHEP 1210, 058 (2012) [arXiv:1207.3360\n[hep-th]].\n[13] T. Nishioka, “Relevant Perturbation of Entanglement Entropy and Stationarity,” Phys.\nRev. D 90, no. 4, 045006 (2014) doi:10.1103/PhysRevD.90.045006 [arXiv:1405.3650\n[hep-th]].\n[14] V. Rosenhaus and M. Smolkin, “Entanglement Entropy Flow and the Ward Identity,”\nPhys. Rev. Lett. 113, no. 26, 261602 (2014) [arXiv:1406.2716 [hep-th]].\n[15] H. Casini, F. D. Mazzitelli and E. Test, “Area terms in entanglement entropy,” Phys.\nRev. D 91, no. 10, 104035 (2015) [arXiv:1412.6522 [hep-th]].\n[16] C. Park, “Logarithmic Corrections to the Entanglement Entropy,” Phys. Rev. D 92,\nno. 12, 126013 (2015) doi:10.1103/PhysRevD.92.126013 [arXiv:1505.03951 [hep-th]].\n[17] P. A. R. Jones and M. Taylor, “Entanglement entropy and differential entropy for\nmassive flavors,” JHEP 1508, 014 (2015) [arXiv:1505.07697 [hep-th]].\n[18] H. Casini, E. Teste and G. Torroba, “Holographic RG flows, entanglement en-\ntropy and the sum rule,” JHEP 1603, 033 (2016) doi:10.1007/JHEP03(2016)033\n[arXiv:1510.02103 [hep-th]].\n[19] A. B. Zamolodchikov, “Irreversibility of the Flux of the Renormalization Group in a 2D\nField Theory,” JETP Lett. 43, 730 (1986) [Pisma Zh. Eksp. Teor. Fiz. 43, 565 (1986)].\n[20] J. L. Cardy, “Is There a c Theorem in Four-Dimensions?,” Phys. Lett. B 215, 749\n(1988).\n14\n[21] Z. Komargodski and A. Schwimmer, “On Renormalization Group Flows in Four Di-\nmensions,” JHEP 1112, 099 (2011) [arXiv:1107.3987 [hep-th]];\nZ. Komargodski, “The Constraints of Conformal Symmetry on RG Flows,” JHEP 1207,\n069 (2012) [arXiv:1112.4538 [hep-th]].\n[22] D. L. Jafferis, I. R. Klebanov, S. S. Pufu and B. R. Safdi, “Towards the F-Theorem:\nN=2 Field Theories on the Three-Sphere,” JHEP 1106, 102 (2011) [arXiv:1103.1181\n[hep-th]].\n[23] H. Casini and M. Huerta, “On the RG running of the entanglement entropy of a circle,”\nPhys. Rev. D 85, 125016 (2012) [arXiv:1202.5650 [hep-th]].\n[24] R. C. Myers and A. Sinha, “Seeing a c-theorem with holography,” Phys. Rev. D 82,\n046006 (2010) [arXiv:1006.1263 [hep-th]];\n“Holographic c-theorems in arbitrary dimensions,” JHEP 1101, 125 (2011)\n[arXiv:1011.5819 [hep-th]].\n[25] H. Casini, M. Huerta and R. C. Myers, “Towards a derivation of holographic\nentanglement entropy,” JHEP 1105, 036 (2011) doi:10.1007/JHEP05(2011)036\n[arXiv:1102.0440 [hep-th]].\n[26] J. S. Dowker, “Entanglement entropy for odd spheres,” arXiv:1012.1548 [hep-th].\n[27] Y. H. Hyun, Y. Kim, O. K. Kwon and D. D. Tolla, “Abelian Projections of the Mass-\ndeformed ABJM theory and Weakly Curved Dual Geometry,” Phys. Rev. D 87, no. 8,\n085011 (2013) doi:10.1103/PhysRevD.87.085011 [arXiv:1301.0518 [hep-th]].\n[28] O. Bergman and S. Hirano, “Anomalous radius shift in AdS(4)/CFT(3),” JHEP 0907,\n016 (2009) doi:10.1088/1126-6708/2009/07/016 [arXiv:0902.1743 [hep-th]].\n[29] O. Aharony, A. Hashimoto, S. Hirano and P. Ouyang, “D-brane Charges in Gravita-\ntional Duals of 2+1 Dimensional Gauge Theories and Duality Cascades,” JHEP 1001,\n072 (2010) doi:10.1007/JHEP01(2010)072 [arXiv:0906.2390 [hep-th]].\n[30] M. Taylor and W. Woodhead, “Renormalized entanglement entropy,” arXiv:1604.06808\n[hep-th].\n[31] M. Taylor and W. Woodhead, “The holographic F theorem,” arXiv:1604.06809 [hep-th].\n15\n",
    "Link": "https://core.ac.uk/download/pdf/82722236.pdf"
}