{
    "Title": "Development and preliminary validation of a new screening questionnaire for identifying atopic children",
    "Authors": "BRUSCOLINI, ALICE, Ilaria, Baiardini, LAMBIASE, ALESSANDRO, Loredana, Chini, SACCHETTI, MARTA, Viviana, Moschese",
    "Year": "No year available",
    "Abstract": "Background: \n\nAllergic diseases represent a frequent and increasing condition affecting children. A screening questionnaire allowing an easy identification of children with symptoms of allergic diseases may improve management and clinical outcome. The aim of this study was to develop and validate an easy-to-use screening questionnaire to detect children requiring further allergological evaluations.\n\nMethods: \n\nA 10-item questionnaire, evaluating the presence and the history of the most frequent allergic conditions affecting children, including allergic asthma, allergic rhinitis and conjunctivitis, food allergy, and atopic dermatitis, was developed and administered to 214 parents of children from 5 to 10 years of age (163 with allergic disease and 51 healthy, nonallergic children). Validation was performed by Pearson's correlation between the clinical diagnosis and the responses to the questionnaire. Internal consistency was computed by Cronbach's alpha correlation coefficient. Sensitivity and specificity of the novel questionnaire were assessed by the receiver operating characteristic (ROC) curve.\n\nResults: \n\nValidation analysis of the new children atopy (ChAt) questionnaire showed good internal consistency with a Cronbach's alpha of 0.757. Responses to the items evaluating the presence of individual allergic conditions significantly correlated with the clinical diagnosis (p&lt;0.001). The ROC curve showed an area of 0.956 and identified a cutoff value &gt;2 of the ChAt questionnaire total score for detection of allergy (sensitivity =0.92 and specificity =0.902).\n\nConclusion: \n\nThe novel ChAt questionnaire represents a simple tool able to detect the presence of all major allergic diseases in a pediatric population allowing an early identification of allergic multimorbidity and potentially facilitating clinical management",
    "Keywords": "No keywords available",
    "Publisher": "'Dove Medical Press Ltd.'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "© 2017 Sacchetti et al. This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms. \nphp and incorporate the Creative Commons Attribution – Non Commercial (unported, v3.0) License (http://creativecommons.org/licenses/by-nc/3.0/). By accessing the work \nyou hereby accept the Terms. Non-commercial uses of the work are permitted without any further permission from Dove Medical Press Limited, provided the work is properly attributed. For \npermission for commercial use of this work, please see paragraphs 4.2 and 5 of our Terms (https://www.dovepress.com/terms.php).\nPediatric Health, Medicine and Therapeutics 2017:8 99–105\nPediatric Health, Medicine and Therapeutics Dovepress\nsubmit your manuscript | www.dovepress.com\nDovepress \n99\nO r i g i n a l  r e s e a r c H\nopen access to scientific and medical research\nOpen Access Full Text Article\nhttp://dx.doi.org/10.2147/PHMT.S142271\nDevelopment and preliminary validation of a  \nnew screening questionnaire for identifying  \natopic children\nMarta sacchetti1,2\nilaria Baiardini3\nloredana chini4\nViviana Moschese4\nalice Bruscolini2\nalessandro lambiase2\n1cornea and Ocular surface Unit, \nirccs-Ospedale san raffaele di \nMilano, Milan, 2Department of sense \nOrgans, sapienza University, rome, \n3allergy and respiratory Diseases \nclinic, DiMi, University of genoa, \nirccs aOU san Martino-isT, genoa, \n4Pediatric allergology and immunology \nUnit, Policlinico Tor Vergata, University \nof rome Tor Vergata, rome, italy\nBackground: Allergic diseases represent a frequent and increasing condition affecting chil-\ndren. A screening questionnaire allowing an easy identification of children with symptoms of \nallergic diseases may improve management and clinical outcome. The aim of this study was to \ndevelop and validate an easy-to-use screening questionnaire to detect children requiring further \nallergological evaluations.\nMethods: A 10-item questionnaire, evaluating the presence and the history of the most frequent \nallergic conditions affecting children, including allergic asthma, allergic rhinitis and conjunc-\ntivitis, food allergy, and atopic dermatitis, was developed and administered to 214 parents of \nchildren from 5 to 10 years of age (163 with allergic disease and 51 healthy, nonallergic chil-\ndren). Validation was performed by Pearson’s correlation between the clinical diagnosis and \nthe responses to the questionnaire. Internal consistency was computed by Cronbach’s alpha \ncorrelation coefficient. Sensitivity and specificity of the novel questionnaire were assessed by \nthe receiver operating characteristic (ROC) curve.\nResults: Validation analysis of the new children atopy (ChAt) questionnaire showed good \ninternal consistency with a Cronbach’s alpha of 0.757. Responses to the items evaluating the \npresence of individual allergic conditions significantly correlated with the clinical diagnosis \n(p<0.001). The ROC curve showed an area of 0.956 and identified a cutoff value >2 of the ChAt \nquestionnaire total score for detection of allergy (sensitivity =0.92 and specificity =0.902). \nConclusion: The novel ChAt questionnaire represents a simple tool able to detect the presence \nof all major allergic diseases in a pediatric population allowing an early identification of allergic \nmultimorbidity and potentially facilitating clinical management.\nKeywords: allergy, questionnaire, children, screening, validation\nIntroduction\nAllergic diseases represent a leading cause of chronic illness in children, with up to \n30% of pediatric population affected by some form of atopic disease.1–3 Moreover, \nthe prevalence of allergy seems to have dramatically increased over the past 25 years, \nparticularly in Western industrialized countries.4,5 Among the Italian children, preva-\nlence of allergic disorders varies from 20% for rhinitis to 10% for eczema/dermatitis, \n9% for asthma, and 8% for food allergy.6–8\nSince allergic inflammation involves different target tissues (conjunctiva, nose, \nlung, and skin) causing allergic conjunctivitis (AC), rhinitis (AR), asthma symptoms, \nand atopic eczema/dermatitis, evaluation of the prevalence of allergic diseases requires \nthat any form of allergic response should be identified and addressed.9 In fact, atopic \nconditions are often comorbid: 20%–40% of patients with AR are reported to have \ncorrespondence: alessandro lambiase\nDepartment of sense Organs, University \nsapienza of rome, Viale del Policlinico, \n155 00161 rome, italy\nTel +39 06 4997 5357\nFax +39 06 4997 5357\nemail alessandro.lambiase@uniroma1.it\nJournal name: Pediatric Health, Medicine and Therapeutics\nArticle Designation: Original Research\nYear: 2017\nVolume: 8\nRunning head verso: Sacchetti et al\nRunning head recto: Screening tool for allergic children\nDOI: http://dx.doi.org/10.2147/PHMT.S142271\n \nPe\ndi\nat\nric\n H\nea\nlth\n, M\ned\nici\nne\n a\nnd\n T\nhe\nra\npe\nut\nics\n d\now\nnl\noa\nde\nd \nfro\nm\n h\nttp\ns:\n//w\nww\n.d\nov\nep\nre\nss\n.c\nom\n/ b\ny \n5.\n94\n.8\n7.\n21\n7 \non\n 2\n2-\nSe\np-\n20\n17\nFo\nr p\ner\nso\nna\nl u\nse\n o\nnl\ny.\nPowered by TCPDF (www.tcpdf.org)\n                               1 / 1\nPediatric Health, Medicine and Therapeutics 2017:8submit your manuscript | www.dovepress.com\nDovepress \nDovepress\n100\nsacchetti et al\nasthma, and 30%–90% of patients with asthma have AR.10,11 \nIn addition, it has been proposed that early diagnosis and treat-\nment should improve clinical outcome of allergy in children \nby controlling the progression toward the most severe forms, \nsuch as allergic asthma.4 Therefore, screening instruments, \nallowing an early and simple identification of children with \nsuspected allergic conditions, may improve patients’ health \nand clinical outcomes.12,13 Questionnaires are useful screen-\ning tools with the advantages of being noninvasive, low cost, \nand easy to administer and provide quick results. 13–15 Aller-\ngic screening questionnaires for school children have been \ndeveloped for the detection of individual allergic conditions \nto improve early identification and management of allergic \ndiseases.12,16–18- Most of them are focused primarily on detec-\ntion and/or prediction strategies of asthma, with comorbid \nallergic diseases, including rhinitis and conjunctivitis, used to \nincrease the specificity of allergic diseases detection.17–22- In \nthis study, to identify the children with symptoms of all the \nmajor allergic disease types, we developed and validated a \nnovel, simple, and easy-to-use children atopy (ChAt) question-\nnaire that addresses the primary allergic conditions. \nMethods\nChildren between 5 and 10 years of age were recruited con-\nsecutively by the Pediatric Allergology and Immunology Unit, \nPoliclinico Tor Vergata, University of Rome Tor Vergata, Italy, \nfor the development and initial validation phases of the new \nscreening questionnaire for the detection of allergic diseases \nin children (ChAt questionnaire). \nThe study was conducted in accordance with the prin-\nciples embodied in the Declaration of Helsinki of 1965 \n(as revised in Brazil 2013). All parents of the participants \nprovided written informed consent, and patient anonymity \nwas preserved using methods approved by the Local Ethics \nCommittee of the University of Rome Tor Vergata. \nDiagnosis of allergic diseases including AC, AR, allergic \nasthma, atopic dermatitis, and food allergy was based on \nclinical history, objective examination, and allergological \nexams (including skin prick tests and specific Immunoglobu-\nlin (Ig) E detection). \nChAt screening questionnaire \ndevelopment\nThe development of ChAt screening questionnaire included \nthe following steps.23,24\n1. Item generation. The aim of this phase was to identify \nthe items and conditions to be included in the screening \nquestionnaire. A preliminary list of items was developed \non the basis of the following sources:\n•\t An international literature review was performed \nthrough a computerized search in the Medline data-\nbase to identify existing screening questionnaires for \nallergic diseases in children by using the following \nkeywords/search terms: atopy*, allergy*, asthma*, \nallergic conjunctivitis*, allergic rhinoconjunctivitis* \natopic dermatitis*, food* and allergy, children ques-\ntionnaire and screening questionnaire.\n•\t A panel of four specialists (VM, LC, MS, AL) were \nrequired to indicate the most frequent allergic con-\nditions affecting children and how to identify them \nthrough simple questions for administration to the \nparents.\n2. Item reduction. A qualitative selection was performed \nfrom the preliminary list of items by eliminating those \nwhich were redundant, difficult to understand, or ambigu-\nous. The resulting screening questionnaire included 10 \nitems aimed at identifying a history of allergic diseases \nand the presence of specific symptoms of allergy: 1) previ-\nous diagnosis of allergic diseases, 2) previous use of antial-\nlergic drugs, 3) presence of symptoms of AC, 4) presence \nof symptoms of AR, 5) presence of symptoms of asthma, \n6) presence of symptoms of atopic dermatitis, 7) history \nof severe allergic conditions such as anaphylaxis, 8) peren-\nnial and/or seasonal presentation of allergic symptoms, 9) \nfamily history of allergic diseases, and 10) history of food \nallergy including elimination diet (Table 1).\nCognitive debriefing interviews with 10 parents of allergic \nchildren were performed to verify that the items were clear \nand easy to understand. The screening questionnaire was \nadministered to the patient population for initial validation. \nValidation of the new ChAt \nquestionnaire \nTwo-hundred and fourteen parents of children between 5 and \n10 years of age completed the screening questionnaire. One-\nhundred and sixty-three children were diagnosed with one or \nmore allergic diseases by allergological exam, and in 51 chil-\ndren allergic diseases were excluded. This group was utilized \nas the healthy control group for the validation of the ChAt \nquestionnaire. The aim of the validation phase was to evaluate \nthe following psychometric properties of the new instrument:\n•\t Validity: using the Pearson correlation coefficient, we \nevaluated the relationship between the clinical diagnosis \nand the responses to the questionnaire.13 \n \nPe\ndi\nat\nric\n H\nea\nlth\n, M\ned\nici\nne\n a\nnd\n T\nhe\nra\npe\nut\nics\n d\now\nnl\noa\nde\nd \nfro\nm\n h\nttp\ns:\n//w\nww\n.d\nov\nep\nre\nss\n.c\nom\n/ b\ny \n5.\n94\n.8\n7.\n21\n7 \non\n 2\n2-\nSe\np-\n20\n17\nFo\nr p\ner\nso\nna\nl u\nse\n o\nnl\ny.\nPowered by TCPDF (www.tcpdf.org)\n                               1 / 1\nPediatric Health, Medicine and Therapeutics 2017:8 submit your manuscript | www.dovepress.com\nDovepress \nDovepress\n101\nscreening tool for allergic children\n•\t Internal consistency: a measure of the homogeneity of a \nscale was computed using the Cronbach’s alpha correla-\ntion coefficient, and test–retest reliability, was evaluated \nby using intraclass correlation coefficient (ICC). Mea-\nsurements with reliability of 0.70 or more have been \nrecommended for the purpose of comparing groups.14\nDiscriminant validity was evaluated by comparing the \nscores of allergic patients. Sensitivity and specificity of \nthe new ChAt questionnaire were assessed by the receiver \noperating characteristic (ROC) curve in the entire popula-\ntion included in this study. The type and number of allergic \ndiseases affecting the children were related to the ChAt total \nscore by Sperman’s rho test.\nThe statistically significant cutoff value was set at p<0.05. \nThe entire statistical analysis was conducted by using SPSS \nsoftware version 18.0.\nResults\nParents of one-hundred sixty-three allergic (N=163, mean \nage 7.2±1.1 years, 63 girls and 100 boys) and non allergic \n(N=51, mean age 7±0.9 years, 19 girls and 32 boys) children \n(mean age 7.2±1 years, 132 boys and 82 girls) completed the \nscreening questionnaire. \nAmong the allergic children, 97 (59.5%) patients had a clini-\ncal diagnosis of AR, 51 (31%) of AC, 57 (35%) of asthma, 68 \n(42%) of atopic dermatitis, and 11 (7%) of food allergy. Eighty-\nnine of the 163 (55%) allergic patients were diagnosed with \nmore than one allergic condition (59 had been diagnosed with \n2 different allergic diseases, 27 with 3, and 3 with 4; Table 2).\nThe completion of the questionnaire by parents of allergic \nchildren included in the study is summarized in Figure 1.\nValidation analyses were undertaken considering the \ngroup of allergic patients (N=163).\n1. Validity. Item and scale scores were oriented so that No= \n0 and Yes =1 (Table 1); the sum of scores ranges between \n0 and 10, and the higher the score, the higher probability \nto have an allergic disease. \n2. Internal consistency. The screening questionnaire dem-\nonstrated satisfactory Cronbach’s alpha value of 0.757 \nand ICC of 0.84. \nTable 1 chat questionnaire items and score values\nScreening questionnaire for allergic diseases in children \n(to be completed by parents)\nResponse scores \nYes No\n 1. Was your child diagnosed with an allergic disease? \n\t if yes, please specify: \n-\t allergic asthma\n-\t allergic rhinitis\n-\t allergic conjunctivitis\n-\t Hives\n-\t atopic dermatitis\n-\t Food allergy (with elimination diet)\n-\t anaphylaxis\n1 0\n 2. Did your child ever use drugs for an allergic disease? (e.g., antihistamines, corticosteroids, etc.) 1 0\n 3. Does your child often show red eyes, tearing, and itching? 1 0\n 4. Does your child sneeze often or does he/she have nasal itching and discharge? 1 0\n 5.  Did your child ever complain of breathing problems? (e.g., shortness of breath, chest tightness, wheezy \nbreathing, coughing, or itchy throat) \n1 0\n 6. Does your child often have dermatitis with itching? 1 0\n 7. Did your child ever suffer with severe allergic reactions or anaphylactic shock? 1 0\n 8.  Does your child have any of the above symptoms? \n\t if yes, please specify if:\n-\t seasonal: spring/summer or autumn/winter\n-\t Throughout the year \n1 0\n 9. Does your child have relatives who suffer or have suffered of an allergic disease? 1 0\n10. Did your child ever have allergic reactions to food? \n\t if yes, please specify:\n-\t asthma\n-\t Dermatitis\n-\t rhinoconjunctivitis\ncurrently, is he/she under an elimination diet? 1 0\nAbbreviation: chat, children atopy.\n \nPe\ndi\nat\nric\n H\nea\nlth\n, M\ned\nici\nne\n a\nnd\n T\nhe\nra\npe\nut\nics\n d\now\nnl\noa\nde\nd \nfro\nm\n h\nttp\ns:\n//w\nww\n.d\nov\nep\nre\nss\n.c\nom\n/ b\ny \n5.\n94\n.8\n7.\n21\n7 \non\n 2\n2-\nSe\np-\n20\n17\nFo\nr p\ner\nso\nna\nl u\nse\n o\nnl\ny.\nPowered by TCPDF (www.tcpdf.org)\n                               1 / 1\nPediatric Health, Medicine and Therapeutics 2017:8submit your manuscript | www.dovepress.com\nDovepress \nDovepress\n102\nsacchetti et al\nA strong correlation was observed between the clinical \ndiagnosis and the responses to the questionnaire. Specifically, \nthe following items showed strong correlation: \n•\t Item 3 – clinical diagnosis of AC vs symptoms of AC \n(p<0.001, R=0.330)\n•\t Item 4 – clinical diagnosis of AR vs symptoms of AR \n(p<0.0001, R=0.467)\n•\t Item 5 – clinical diagnosis of allergic asthma vs symptoms \nof allergic asthma (p<0.0001, R=0.527)\n•\t Item 6 – clinical diagnosis of atopic dermatitis vs symp-\ntoms of atopic dermatitis (p<0.0001, R=0.483)\n•\t Item 9 – familiar history of allergic disease collected by \nphysician vs positive response to familiar history in the \nquestionnaire (p<0.0001, R=0.368)\n•\t Item 10 – presence of food allergy diagnosed by allergolo-\ngist vs positive response to food allergy with elimination \ndiet in the questionnaire (p<0.0001, R=0.370)\nTable 2 clinical characteristics of allergic population included in \nthe study\nClinical characteristics Allergic children (N=163)\nAge (years)\nrange \nMean±sD\n5–10\n7±0.9\nGender\nMales\nFemales\n100\n63\nSingle allergic condition\nMultiple allergic conditions\n74 (45%)\n89 (55%)\nAllergic diseases diagnosis \nallergic rhinitis \nallergic conjunctivitis \nasthma\natopic dermatitis \nFood allergy\n97 (59.5%)\n51 (31%)\n57 (35%)\n68 (42%)\n11 (7%)\nSkin prick tests \nnegative\nPositive\nnot done\n16 (10%)\n126 (77%)\n21 (13%)\nFigure 1 Percentage of positive responses to the chat questionnaire items.\nAbbreviation: chat, children atopy.\nFood allergy\n12%\nAnaphylactic shock\n<1%\nThroughout the\nyear\n46%\nSpring/summer\n29%\nAutumn/winter\n25%\nAsthma\n20%\nRhinitis\n19%\nConjunctivitis\n13%\nUrticaria\n6%\n90\n80\n70\n60\n50\n%\n o\nf p\nos\nitiv\ne \nre\nsp\non\nse\ns\n40\n30\n20\n10\n0\n1. Previous\ndiagnosis of\nallergic disease\n2. Antiallergic\ndrug use\n3. Symptoms\nof allergic\nconjunctivitis\n4. Symptoms\nof allergic\nrhinitis\n5. Symptoms\nof allergic\nasthma\n6. Symptoms\nof atopic\ndermatitis\nchAt questionnaire items\n7. Severe\nallergic\nreactions\n8. Presence of\nallergic\nsymptoms\n9. Familiar\nhistory of\nallergic\ndiseases\n10. Food\nallergy\nElimination\ndiet\nAtopic dermatitis\n30%\n \nPe\ndi\nat\nric\n H\nea\nlth\n, M\ned\nici\nne\n a\nnd\n T\nhe\nra\npe\nut\nics\n d\now\nnl\noa\nde\nd \nfro\nm\n h\nttp\ns:\n//w\nww\n.d\nov\nep\nre\nss\n.c\nom\n/ b\ny \n5.\n94\n.8\n7.\n21\n7 \non\n 2\n2-\nSe\np-\n20\n17\nFo\nr p\ner\nso\nna\nl u\nse\n o\nnl\ny.\nPowered by TCPDF (www.tcpdf.org)\n                               1 / 1\nPediatric Health, Medicine and Therapeutics 2017:8 submit your manuscript | www.dovepress.com\nDovepress \nDovepress\n103\nscreening tool for allergic children\nThe ROC curve was calculated including the entire popu-\nlation of allergic and nonallergic children. Results showed \nan area of 0.956 and suggested that a cutoff score of >2 was \nable to accurately identify the allergic population with a \nsensitivity value of 0.920 and specificity of 0.902 (Figure 2).\nPatients with a diagnosis of allergy showed an average \nChAt questionnaire score of 5.2±2, while nonallergic patients \nshowed an average of 1.2±1.2, confirming that the cutoff total \nscore >2 is able to identify the allergic population. In addition, \nthe number of allergic diseases affecting the children was sig-\nnificantly related to the ChAt total score (p<0.001, R=0.695).\nChAt questionnaires with total score >2 identified a \npopulation with the possible presence of allergy which \nrequires further clinical investigation for allergic disease, \nwith a sensitivity of 92% (95% CI: 86.75% to 95.69%) and \na specificity of 90% (95% CI: 78.59% to 96.74%), a positive \nlikelihood ratio (LR) of 9.39 (95% CI: 4.08 to 21.61) and \nnegative LR of 0.09 (95% CI: 0.05 to 0.15).\nDiscussion\nAtopic diseases represent a substantial burden on the health \ncare system, and great attention should be paid to identify \nchildren with allergic diseases in a timely manner and to pro-\nvide prompt treatment and management of allergic diseases.25 \nSeveral screening tools, including screening questionnaires \nand prediction rules, have been developed to detect specific \nallergic conditions and the risk of progression toward more \nsevere allergic conditions such as asthma.17,18,24 Since a simple \nand ready-to-use tool for the identification of children with \nallergic symptoms including all the most common symptoms \nof allergic diseases is not currently available, in this study we \ndeveloped and validated a new 10-item screening question-\nnaire to identify children with allergic symptoms requiring \nfurther clinical evaluation. This questionnaire represents a use-\nful tool for the detection of children with suspicion of allergy \nin epidemiological, screening studies or in general practice.\nMost studies commonly use questionnaires to collect epi-\ndemiological and clinical data. Moreover, self-administration \nof questionnaires avoids interviewer bias.17,18,26,27 On the \nother hand, the main issue in the validation process of self-\nadministered questionnaires is the capability to understand \nthe items and to appropriately answer them. To facilitate this \nprocess, the ChAt questionnaire has been developed with \nwell-defined, objective, and easily understandable questions \nfor parent self-administration. In addition, respondents were \nselected and screened from the same geographical area \n(Rome, Italy).28\nThe ChAt questionnaire includes an item exploring the \nprevious diagnosis of allergic conditions, with specification \nof the previous diagnosis, and an item about the previous use \nof antiallergic drugs to aid in the identification of allergic \nchildren. The other five items explore the presence of the most \nfrequent symptoms associated with AC, AR, asthma, atopic \ndermatitis, and food allergy including elimination diet. The \nresponses to these items showed a significant correlation with \nthe clinical diagnosis of the specific allergic condition made by \nthe allergologist, suggesting the ability of the items to identify \nthe presence of the symptoms of specific disease. An additional \nthree items evaluate the history of severe allergic reactions \nsuch as anaphylaxis, seasonal and/or perennial symptoms’ \npresentation, and familial history of allergy, adding important \ninformation for the identification of allergic children. \nThe ChAt score was calculated by the sum of the “YES” \nresponses to the 10 items resulting in a total score ranging \nfrom 0–10, with the higher total score indicating a higher \nprobability of allergy. The ROC curve analysis showed that \na ChAt questionnaire total score >2 was able to identify \nchildren having allergy with high levels of sensitivity (92%) \nand specificity (90%). \nTherefore, this study describes the development and \npreliminary validation of a simple, standardized, 10-item \nscreening questionnaire that is able to identify atopic chil-\ndren who should be evaluated for the presence of allergic \ndiseases and allergic comorbidities. The ChAt questionnaire \nshows the limitations characteristic of the use of question-\nnaires for disease screening, which includes the need to \ndemonstrate the validity in different settings, in terms of \nFigure 2 receiver operating characteristic (rOc) curve of chat questionnaire \nscores for identification of the presence of allergic diseases. \nAbbreviation: chat, children atopy.\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0.0 0.2 0.4 0.6\n1-sensitivity\nSe\nns\nib\nilit\ny\n0.8 1.0\n \nPe\ndi\nat\nric\n H\nea\nlth\n, M\ned\nici\nne\n a\nnd\n T\nhe\nra\npe\nut\nics\n d\now\nnl\noa\nde\nd \nfro\nm\n h\nttp\ns:\n//w\nww\n.d\nov\nep\nre\nss\n.c\nom\n/ b\ny \n5.\n94\n.8\n7.\n21\n7 \non\n 2\n2-\nSe\np-\n20\n17\nFo\nr p\ner\nso\nna\nl u\nse\n o\nnl\ny.\nPowered by TCPDF (www.tcpdf.org)\n                               1 / 1\nPediatric Health, Medicine and Therapeutics 2017:8submit your manuscript | www.dovepress.com\nDovepress \nDovepress\n104\nsacchetti et al\nsample  population, social conditions, and geographic dis-\ntribution, and to standardize the clinical diagnosis of the \nspecific allergic conditions to be used as “gold standard.” \n12–15,17–19,28 An epidemiological study is currently ongoing \nin a large population of schoolchildren to confirm the \nvalidity of the ChAt questionnaire at identifying children \nwith allergic symptoms and allowing an early diagnosis of \n“unknown” cases. \nAssessing allergic diseases at a community level using \nsimple questionnaires, such as ChAt, may be a first step to \nchange patient behaviors and to target educational initiatives \naimed at improving the allergic disease outcomes. In fact, \nnot only is poor disease control a negative prognostic factor \nfor allergic disease progression, but it may also be associ-\nated with low continuity of care due to a poor  doctor–patient \nrelationship, negative attitudes, and concerns about the use \nof medication, and little understanding of the disease.10,29 \nThe consequences of such a scenario are detrimental for \natopic children, their families, and the health care system \nin general.\nTo conclude, the ChAt questionnaire represents a useful \ntool to identify children with suspicion of multiple atopic \nconditions and, in turn, to substantially contribute to further \nenhance the treatment and clinical management of allergic \ndiseases. In addition, the ChAt questionnaire may facilitate \nthe collection of data on school children population, which \ncould be useful to save time and serve as useful resource in \nlarge epidemiological studies.\nAcknowledgment \nThis study was supported by Italian Ministry of Health grant \nfor Young Researchers (GR-2009-1595946).\nDisclosure\nThe authors report no conflicts of interest in this work.\nReferences\n 1. Downs SH, Marks GB, Sporik R, et al. Continued increase in the \nprevalence of asthma and atopy. Arch Dis Child. 2001; 84: 20–23.\n 2. Skoner DP. Allergic rhinitis: definition, epidemiology, pathophysiology, \ndetection, and diagnosis. J Allergy Clin Immunol. 2001;108(1 Suppl): \nS2–S8.\n 3. Quercia O, Incorvaia C, Puccinelli P, et al. Prevalence of allergic dis-\norders in Italy: the Cotignola population study. Eur Ann Allergy Clin \nImmunol. 2012;44(1):5–11\n 4. Asher M, Montefort S, Björkstén B, et al; ISAAC Phase Three Study \nGroup. Worldwide time trends in the prevalence of symptoms of asthma, \nallergic rhinoconjunctivitis, and eczema in childhood: ISAAC Phases \nOne and Three repeat multicountry cross-sectional surveys. Lancet. \n2006;368(9537):733–743.\n 5. Worldwide variation in prevalence of symptoms of asthma, allergic \nrhinoconjunctivitis, and atopic eczema: ISAAC. The International Study \nof Asthma and Allergies in Childhood (ISAAC) Steering Committee. \nLancet. 1998;351(9111):1225–1232.\n 6. Galassi C, De Sario M, Biggeri A, et al. Changes in prevalence of asthma \nand allergies among children and adolescents in Italy: 1994–2002. \nPediatrics. 2006;117:34–42.\n 7. Brescianini S, Brunetto B, Iacovacci P, et al. Prevalence of self-perceived \nallergic diseases and risk factors in Italian adolescents. Pediatr Allergy \nImmunol. 2009;20:578–584.\n 8. Tozzi AE, Armenio L, Bernardini R, et al. Pediatric allergy and immu-\nnology in Italy. Pediatr Allergy Immunol. 2011;22(3):267–276. \n  9. Muraro A, Clark A, Beyer K, et al. The management of the allergic child \nat school: EAACI/GA2LEN Task Force on the allergic child at school. \nAllergy. 2010; 65(6):681–689. \n 10. Pols DHJ, Wartna JB, van Alphen EI, et al. Interrelationships between \natopic disorders in children: a meta-analysis based on ISAAC question-\nnaires. PLoS ONE. 2015;10(7):e0131869. \n11. Gupta R, Sheikh A, Strachan DP, Anderson HR. Burden of allergic \ndisease in the UK: secondary analyses of national databases. Clin Exp \nAllergy. 2004;34:520–526.\n 12. Galimberti M, Passalacqua G, Incorvaia C, et al. Catching allergy by \na simple questionnaire. World Allergy Organ J. 2015;11;8(1):16.\n 13. Scientific Advisory Committee of the Medical Outcomes Trust. Assess-\ning health status and quality-of-life instruments: attributes and review \ncriteria. Qual Life Res. 2002;11:193–205.\n14. Fayers P, Hays RD, Revicki DA. Reliability and validity, including \nresponsiveness. In: Fayers P, Hays RD, editors. Assessing Quality of Life \nin Clinical Trials: Methods and Practice. 2nd ed. New York: Oxford \nUniversity Press; 2005: 25–39.\n 15. Garcia de Yebenes Prous MA, Rodriguez Salvanes F, Carmona Ortells \nL. Validación de cuestionarios. [Validation of questionnaires]. Reumatol \nClin. 2009;5:171–177. Spanish.\n 16. Castro-Rodriguez JA. The Asthma Predictive Index: a very useful \ntool for predicting asthma in young children. J Allergy Clin Immunol. \n2010;126:212–216.\n 17. Pescatore AM, Dogaru CM, Duembgen L, et al. A simple asthma \nprediction tool for preschool children with wheeze or cough. J Allergy \nClin Immunol. 2014;133(1):111–118.\n 18. Redline S, Larkin EK, Kercsmar C, Berger M, Siminoff LA. Devel-\nopment and validation of school-based asthma and allergy screening \ninstruments for parents and students. Ann Allergy Asthma Immunol. \n2003;90(5):516–528. \n 19. Redline S, Gruchalla RS, Wolf RL, et al. Development and validation \nof school-based asthma and allergy screening questionnaires in a 4-city \nstudy. School Nurse News. 2004;21(5):12–14.\n 20. Jones A, Bowen M. Screening for childhood asthma using an exercise \ntest. Br J Gen Pract. 1994;44(380):127–131.\n 21. Bauer EJ, Lurie N, Yeh C, Grant EN. Screening for asthma in an inner-\ncity elementary school in Minneapolis, Minnesota. J Sch Health. \n1999;69:12–16.\n 22. Savenije OEM, Kerkhof M, Koppelman GH, Postma DS. Predicting \nwho will have asthma at school age among preschool children Review \nArticle. J Allergy Clin Immunol. 2012;130:325–331.\n 23. Bonini M, Braido F, Baiardini I, et al. AQUA: Allergy Questionnaire for \nAthletes. Development and validation. Med Sci Sports Exerc. 2009;41(5): \n1034–1041.\n 24. Sacchetti M, Baiardini I, Lambiase A, et al. Development and testing \nof quality of life in children with Vernal Keratoconjunctivitis question-\nnaire. Am J Ophthalmol. 2007;144:557–563. \n 25. Ducharme FM, Tse SM, Chauhan B. Diagnosis, management, and \nprognosis of preschool wheeze. Lancet. 2014;383:1593–1604.\n 26. Murphy KR, Zeiger RS, Kosinski M, et al. Test for respiratory and \nasthma control in kids (TRACK): a caregiver-completed questionnaire \nfor preschool-aged children. J Allergy Clin Immunol. 2009;123:833–839.\n 27. Sato K, Sato Y, Nagao M, et al. Development and validation of asthma \nquestionnaire for assessing and achieving best control in preschool-age \nchildren. Pediatr Allergy Immunol. 2016;27(3):307–312.\n 28. Savitz DA. Interpreting Epidemiologic Evidence: Strategy for Study \nDesign and Analysis. Oxford, UK: Oxford University Press; 2003.\n29. Soriano JB, Rabe KF, Vermeire PA. Predictors of poor asthma control \nin European adults. J Asthma. 2003;40(7):803–813.\n \nPe\ndi\nat\nric\n H\nea\nlth\n, M\ned\nici\nne\n a\nnd\n T\nhe\nra\npe\nut\nics\n d\now\nnl\noa\nde\nd \nfro\nm\n h\nttp\ns:\n//w\nww\n.d\nov\nep\nre\nss\n.c\nom\n/ b\ny \n5.\n94\n.8\n7.\n21\n7 \non\n 2\n2-\nSe\np-\n20\n17\nFo\nr p\ner\nso\nna\nl u\nse\n o\nnl\ny.\nPowered by TCPDF (www.tcpdf.org)\n                               1 / 1\nPediatric Health, Medicine and Therapeutics 2017:8 submit your manuscript | www.dovepress.com\nDovepress \nDovepress\nPediatric Health, Medicine and Therapeutics\nPublish your work in this journal\nSubmit your manuscript here: http://www.dovepress.com/pediatric-health-medicine-and-therapeutics-journal\nPediatric Health, Medicine and Therapeutics is an international, peer-\nreviewed, open access journal publishing original research, reports, \neditorials, reviews and commentaries. All aspects of health maintenance, \npreventative measures and disease treatment interventions are addressed \nwithin the journal. Practitioners from all disciplines are invited to submit \ntheir work as well as healthcare researchers and patient support groups. \nThe manuscript management system is completely online and includes a \nvery quick and fair peer-review system. Visit http://www.dovepress.com/ \ntestimonials.php to read real quotes from published authors.\nDovepress\n105\nscreening tool for allergic children\n \nPe\ndi\nat\nric\n H\nea\nlth\n, M\ned\nici\nne\n a\nnd\n T\nhe\nra\npe\nut\nics\n d\now\nnl\noa\nde\nd \nfro\nm\n h\nttp\ns:\n//w\nww\n.d\nov\nep\nre\nss\n.c\nom\n/ b\ny \n5.\n94\n.8\n7.\n21\n7 \non\n 2\n2-\nSe\np-\n20\n17\nFo\nr p\ner\nso\nna\nl u\nse\n o\nnl\ny.\nPowered by TCPDF (www.tcpdf.org)\n                               1 / 1\n",
    "Link": "https://core.ac.uk/download/127586685.pdf"
}