{
    "Title": "National climate, agriculture and socio-economic development policies and plans formulated with the use of scenarios across six global regions",
    "Authors": "CGIAR Research Program on Climate Change, Agriculture and Food Security",
    "Year": "No year available",
    "Abstract": "Climate change impacts bring great uncertainty, raising the need to plan for the future. As the impacts of climate change are complex and far-reaching, it can be extremely difficult to foresee exactly what the consequences will be, and how they will affect different regions and sectors. However, by bringing together relevant stakeholders and brainstorming \"what if\" ideas of possible future scenarios, policy makers can prepare themselves for a variety of potential challenges. Including stakeholders from diverse backgrounds can avoid blindspots focused on a single vision of the future",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "P\nH\nO\nTO\n G\n. S\nM\nITH\n (C\nIAT)\nNational climate, agriculture and \nsocio-economic development policies \nand plans formulated with the use of \nscenarios across six global regions \nS U M M A RY \nClimate change impacts bring great uncertainty, raising the \nneed to plan for the future. As the impacts of climate change \nare complex and far-reaching, it can be extremely difficult to \nforesee exactly what the consequences will be, and how they \nwill affect different regions and sectors. However, by bringing \ntogether relevant stakeholders and brainstorming “what if” \nideas of possible future scenarios, policy makers can prepare \nthemselves for a variety of potential challenges. Including \nstakeholders from diverse backgrounds can avoid blindspots \nfocused on a single vision of the future.\nAugust 2015\nCCAFS Outcome Case\nL E A D  C E N T E R  / PA RT N E R \nUniversity of Oxford\nY E A R  2014 and 2015\nCON TAC T  Joost Vervoort \nOxford Environmental Change Institute (ECI)\nF L AG S H I P  Policies and Institutions\nG E O G R A PH IC  F O C U S  Global\nOU TCOM E  C AS E S\nRESEARCH IMPLEMENTED IN COLLABORATION WITH\nCCAFS scenarios work has engaged in precisely \nthis sort of future-proofing, informing a range of \nagricultural, climate, and development policies \nacross a number of countries. The CCAFS \nscenarios team created regional scenarios \ntogether with diverse stakeholders, quantifying \nthem with IMPACT by the International Food Policy \nResearch Institute (IFPRI) and GLOBIOM by the \nInternational Institute for Applied Systems \nAnalysis (IIASA) models. Based on these scenarios, \nCCAFS was able to work closely with governments, \nresearchers, and private sector representatives to \nco-design a process for a given plan or policy, \nbased on analyses of challenges and opportunities \npresented within the different scenarios. These \nrecommendations are informing the following \nplans:\n » Honduras: National Strategy for Climate \nChange Adaptation in Agriculture\n » Cambodia: Climate Change Priorities Action \nPlan\n » Bangladesh: 7th Five year plan\n » Tanzania: New Environmental Policy\n » Uganda: Agricultural Sector Plan\n » Burkina Faso: National Plan for the Rural \nSector\n » Colombia: Action Plan for the National \nAgricultural Adaptation Strategy\n » Ghana: National Climate Change Policy.\nK E Y  FAC T S\n•\u0007  CCAFS scenarios work is informing climate, \nagriculture and socio-economic development \npolicies in 7 countries\n•\u0007 Integrating diverse scenario-based recommendations \ninto the policy-making process creates a better \nenabling environment for climate resilience\nL E S S ON S : K E Y  E L E M E N T S  OF  S UCC E S S\n•\u0007  Bringing together diverse stakeholders to provide \ndifferent perspectives and strategies regarding \npotential climate change scenarios\n•\u0007  Close collaboration with government teams in each \ncase led to timely applications and ownership of the \nprocess by policy makers\n•\u0007  Development of flexible and credible scenarios \napplicable in the national context\nF U RT H E R  R E A DI NG \n•\u0007  Future scenario development now part of \nCambodia’s Action Plan for Agriculture \nhttp://bit.ly/1JOUJjk\n•\u0007  Future scenario development now part of Honduras \nNational Strategy for Climate Change Adaptation in \nAgriculture [Spanish]  http://bit.ly/1VKpqxn\n•\u0007  Cocoa farmers in Central America learn to plan for \na more variable climate http://bit.ly/1M7CI5A, \navailable in Spanish: http://bit.ly/1OtSh4Q\nR E L AT E D  R E S E A RC H  OU T PU T S\nVervoort M, Thornton PK, Kristjanson P, Förch W, \nEricksen PJ, Kok K, Ingram JSI, Herrero M, Palazzo A, \nHelfgott AES, Wilkinson A, Havlík P, Mason-D’Croz D, \nJost C. 2014. Challenges to scenario-guided adaptive \naction on food security under climate change. Global \nEnvironmental Change. http://bit.ly/1K3of3U\nVermeulen SJ, Challinor AJ, Thornton PK, Campbell BM, \nEriyagama N, Vervoort JM, Kinyangi J, Jarvis A, Läderach \nP, Ramirez-Villegas J, Nicklin KJ, Hawkins E, Smith DR. \n2013. Addressing uncertainty in adaptation planning for \nagriculture. Proceedings of the National Academy of \nSciences of the United States of America 110:8357-8362. \nhttp://bit.ly/1O9Uuoi\nChaudhury M, Vervoort JM, Kristjanson P, Ericksen PJ, \nAinslie A. 2013. Participatory scenarios as a tool to link \nscience and policy on food security under climate change \nin East Africa. Regional Environmental Change 13:389-\n398. http://bit.ly/1PYCDyU\nPHOTO J.L. URREA (CCAFS)\nRESEARCH SUPPORTED BY\n",
    "Link": "https://core.ac.uk/download/132678061.pdf"
}