{
    "Title": "10 Key Mathematics Practices for All Elementary Schools With Strong Evidence of Effectiveness From High-Quality Research",
    "Authors": "The Meadows Center for Preventing Educational Risk",
    "Year": "No year available",
    "Abstract": "The sixth installment of MCPER's \"10 Key\" series, this document distills the latest research findings into 10 easy-to-follow recommendations that states, school districts, and schools can use to improve elementary students' mathematics outcomes. Also included are examples of how to enact each principle in the classroom.\r\n\r\nNote: This file has been formatted for online viewing and is not a print file.Educatio",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "© 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.010 Key Mathematics Practices  for All Elementary Schoolswith strong evidence of effectiveness from high-quality research10 Key Mathematics Practices for All Elementary Schoolswith strong evidence of effectiveness from high-quality researchAll elementary students can become proficient in mathematics if:1. Teachers emphasize number sense. Students learn what quantities and numbers mean and how to represent them with objects and numerals. Students know the position of numbers on a number line. Students count fluently and compare amounts. Examples•  Students understand 5 as represented by the numeral, the number word five, five objects, and five fingers.•  Students place 14 on a number line. Stu-dents describe 14 as greater than 13 and less than 15.•  Students count objects or pictures quickly and without hesitation.• Students count two sets of objects and compare. For example, “9 bears is more than 6 bears.”2. Teachers ensure that students have fluency with addition, subtraction, multiplication, and division math facts. Students know the 390 math facts. Until learned, students practice facts regularly. Students also develop computational fluency. Students understand procedures for multidigit addition, subtraction, multiplication, and division. Students learn fluency for com-putation with fractions and decimals.Examples• Students answer addition and subtraction facts like 4 + 8 and 10 – 3 quickly and without hesitation. Fluency with addition and subtraction facts should be established by the end of second grade. • Students answer multiplication and division facts like 3 × 8 and 54 ÷ 9 quickly and without hesitation. Fluency with multiplication and division facts should be established by the end of fourth grade.• Students develop efficiency with computation—adding, subtracting, multiplying, or divid-ing in steps. For example, 109 + 62 or 6,598 ÷ 18. 3. Teachers help students understand math concepts. Teachers teach the “why” and “how” of math in combination with procedures and rules. ExampleWhen working to solve 246 + 197, students learn why notation requires a 1 written above the tens column. Students understand that in the ones column, 6 + 7 = 13 ones. 13 ones is re-grouped to 1 ten and 3 ones. This instruction emphasizes the concept of regrouping.© 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.04.  Students are expected to use hands-on materials and visual representations to show concepts and procedures.Examples•  When learning about the properties of quadrilaterals, students use plastic sticks to show the differences and similarities between a square, rectangle, rhombus, kite, trapezoid, and parallelogram. • When learning to represent the fraction 2/3, stu-dents use the three models of fractions.• Area: Rectangle divided into 3 equal parts, 2 parts shaded• Length: 2/3 placed on a number line• Set: 3 circles, 2 shaded5. Students are taught problem-solving strategies. Students are taught how to read problems and organize work according to the structure of the problem. Teachers do not use “key words” to teach problem solving. Examples• Every time students see a mix of numbers and words (a word problem), they use a step-by-step process to solve the problem. The first step is to read the problem. Then, students make a plan, solve the problem, and check the work.• Students learn to identify word problems by structure. For ex-ample, students identify word problems as comparison prob-lems (comparing two amounts), change problems (an amount changes), or combine problems (amounts combined). Students use structure to identify word problems instead of defining word problems by the operation (for example, addition or subtraction) for solution. • Teachers avoid saying things like, “When you see the word altogether, that means you add.” Altogether could be used in word problems that use addition, subtraction, mul-tiplication, or division. Using key words is superficial and does not work across grade levels.6. Students are expected to show work and have opportunities to explain work in oral and written forms.ExampleStudents write their steps to solve a problem about measuring the perimeter of a room. © 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.07.  Students use technology, when appropriate, to learn math concepts and practice procedures. Examples•  To practice properties of triangles, students use a tablet application with a geoboard to show equilateral, isosceles, and scalene triangles.•  Students practice math facts with brief, daily lessons via software.8. Teachers provide differentiated instruction to meet the needs of all students. Teachers use explicit instruction when introducing new math content. Examples• Teachers extend the math learning of students exceeding grade-level expectations and work on foundational skills with students not meeting grade-level expectations.• Teachers model math problems step-by-step. Students participate in guided practice with the teacher and independent practice with teacher feedback. Teachers design planned and organized lessons, ask the right questions, require frequent student response, and provide affirmative and corrective feedback.9. Teachers use precise math language. Stu-dents use correct math language when ver-balizing explanations and steps for solving problems. Examples• From the beginning of fraction instruc-tion in first and second grades, teachers use the terms numerator and denomi-nator to describe the parts of a fraction. Teachers avoid exclusive use of the terms top number and bottom number. Throughout the elementary grades, teachers consistently describe the numerator as the parts of the known fraction and the denominator as the whole divided into equal parts.• Instead of saying, “I put the number over here,” students say, “My number was greater than 9, so I have to exchange 10 tens for 1 hundred.”10.  Teachers improve student beliefs and attitudes about math. Examples• Teachers work to eliminate students saying, “I’m not good at math.”• Teachers show students how math is helpful in life.—www.meadowscenter.org—© 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0",
    "Link": "https://core.ac.uk/download/211340194.pdf"
}