{
    "Title": "Development of allergy in children. I. Association with virus infections.",
    "Authors": "Frick, OL, German, DF, Mills, J",
    "Year": "No year available",
    "Abstract": "Children born into allergic families, with two allergic parents, are at high risk of developing allergy within the first 5 years of life. In order to observe possible external factors in the sensitization process, a prospective study of 13 such children was done, in which serial clinical and immunologic observations were made at 3- to 6-month intervals over a period of 1 to 4 yr. Eleven of these children are now clinically allergic; 5 have asthma. Immunologic evidence for allergic sensitization was observed in these 11 children by RAST, antigen-induced leukocyte histamine release, lymphoblastogenesis, and rise in serum IgE. Upper respiratory infections (URI) occurred in these 11 allergic children 1 to 2 months prior to the onset of allergic sensitization. In 10 of these 11 URI children, complement-fixing antibodies to viruses (parainfluenza, RSV, CMV) increased in the same blood samples in which immunologic allergic sensitization was first evidenced. This coincidence suggests that certain viruses may contribute to the allergic sensitization process",
    "Keywords": "No keywords available",
    "Publisher": "eScholarship, University of California",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "UCSF\nUC San Francisco Previously Published Works\nTitle\nDevelopment of allergy in children. I. Association with virus infections.\nPermalink\nhttps://escholarship.org/uc/item/8d96v5jc\nJournal\nThe Journal of allergy and clinical immunology, 63(4)\nISSN\n0091-6749\nAuthors\nFrick, OL\nGerman, DF\nMills, J\nPublication Date\n1979-04-01\nDOI\n10.1016/0091-6749(79)90106-4\n \nPeer reviewed\neScholarship.org Powered by the California Digital Library\nUniversity of California\n  \nSince January 2020 Elsevier has created a COVID-19 resource centre with \nfree information in English and Mandarin on the novel coronavirus COVID-\n19. The COVID-19 resource centre is hosted on Elsevier Connect, the \ncompany's public news and information website. \n \nElsevier hereby grants permission to make all its COVID-19-related \nresearch that is available on the COVID-19 resource centre - including this \nresearch content - immediately available in PubMed Central and other \npublicly funded repositories, such as the WHO COVID database with rights \nfor unrestricted research re-use and analyses in any form or by any means \nwith acknowledgement of the original source. These permissions are \ngranted for free by Elsevier for as long as the COVID-19 resource centre \nremains active. \n \nOriginal articles \nDevelopment of allergy in children \nI. Association with virus infections \nOscar L. Frick, M.D., Ph.D., Donald F. German, M.D., and John Mills, M.D. \nSan Francisco, Calif. \nChildren born into allergic families, with two allergic parents, are at high risk of developing \nallergy within the first 5 years of life. In order to observe possible external factors in the \nsensitization process, a prospective study of 13 such children was done, in which serial clinical \nand immunologic observations were made at 3- to 6-month intervals over a period of 1 to 4 yr. \nEleven of these children are now clinically allergic; 5 have asthma. Immunologic evidence for \nallergic sensitization was observed in these 1 I children by RAST, antigen-induced leukocyte \nhistamine release, lymphoblastogenesis, and rise in serum IgE. Upper respiratory infections \n(URl) occurred in these II allergic children 1 to 2 months prior to the onset of allergic \nsensitization. In IO of these II URI children, complement-fixing antibodies to viruses \n(parainfluenza, RSV, CMV) increased in the same blood samples in which immunologic allergic \nsensitization was first evidenced. This coincidence suggests that certain viruses may contribute \nto the allergic sensitization process. \nAre children born into allergic families already \n“over the hill” at birth in regard to developing aller- \ngies later? Or, are there environmental events that \ntrigger allergic sensitization and symptoms in such \nchildren? \nAtopy usually appears in childhood and may last a \nlifetime, with symptomatic periods alternating with \nquiescent periods. This is the time during which ef- \nfective optimal preventive or therapeutic measures \ncan minimize any permanent damage from atopy. \nTherefore, if external events can trigger allergy in \nchildren, then preventing or overcoming the effects of \nsuch events might prevent allergic onset. \nFrom the University of California, San Francisco, Kaiser- \nPermanente Medical Center, and San Francisco General Hospi- \ntal. \nSupported by the United States Public Health Service Allergic Dis- \neases Center Grant Al I 1010 and Training Grant AI0001 I. \nParts of this paper were presented at the American Congress of \nAllergy, New York, March 30, 1977, and at the Federation of \nExperimental Biology and Medicine, Chicago, April 5, 1977. \nReceived for publication May 16, 1978. \nAccepted for publication Oct. I I, 1978. \nReprint requests to: Oscar L. Frick, M.D., Ph.D., Department of \nPediatrics, 1404-A, HSW, University of California, San Fran- \ncisco, San Francisco, CA 94143. \nSpecial abbreviations used \nCMV cytomegalic inclusion virus \nHR histamine release \nLTT lymphoblast transformation test \nPHA phytohemagglutinin \nRAST radioallergosorbent est \nRSV respiratory syncytial virus \nURI upper respiratory infection \nThat allergy, e.g., asthma, is hereditary was known \neven by such ancients as Maimonides. l Later, Cooke \nand Vander Veer,* in the first extensive study of he- \nredity in allergy, found that 48% of 504 allergic pa- \ntients had an immediate family history of allergy, \nwhile only 12% of a comparable nonallergic group \nhad such a family history. In individuals whose par- \nents were both allergic, 68% developed allergy before \nthe age of 10; with one allergic parent, 5 1% devel- \noped allergy; and 38% had no family history of al- \nlergy. This suggested a simple mendelian inheritance. \nHowever, in subsequent genetic studies the inher- \nitance of allergy was complex and polygenic,3 \nprobably involving the immune response genes of the \nhistocompatibility region.4 \nWe here report our prospective study of 13 chil- \nVol. 63, No. 4, pp. 228-241 0091-67491791040228+ 14$01.4010 0 1979 The C. V. Mosby Co. \nVOLUME 63 \nNUMBER 4 \nDevelopment of allergy with virus infections 229 \nTABLE I. Comparison of clinical symptoms of allergy in children from “allergy-prone” \nand “nonatopic” families \n28 random children \n13 children from allergic families from well-baby clinic \nSystem with symptoms Mild Moderate Severe Total Mild Moderate Severe Total \nGastrointestinal (including “colic”) 5 1 1 7 2 1 0 3 \nSkin (chrome eczema>1 mo 6 6 1 13 6 1 0 7 \n(non-diaper area); urticaria) 0 2 0 2 0 0 0 0 \nNose (chronic> 1 mo) 2 8 1 11 6 0 0 6 \nChest (chronic cough or wheeze with URI) 5 6 0 11 2 0 0 2 \nOtitis (recurrent) 3 3 1 7 2 1 0 3 \nTotals: Number positive/number total possible. .51/65 21/140 \n% positive. 80% 15% \np < 0.01. \ndren, who had a biparental allergic history, for the \nonset of symptoms and immunologic evidence of al- \nlergy. In this study we focused on the possible exter- \nnal events associated with the onset of allergy, such as \ninfections, immunizations, or new foods. \nMATERIALS AND METHODS \nPatients \nAllergy-prone group. Thirteen allergic pregnant women \nwith allergic husbands were selected from the Allergy and \nObstetrical Clinics of the University of California, San \nFrancisco and the Kaiser-Permanente Hospital in San Fran- \ncisco, between 1973 and 1976. All parents had asthma, hay \nfever, or eczema, either singly or in combination. At birth, \nthe authors examined the infants and collected cord blood \nwith viable leukocytes and plasma for immunologic studies. \nThe I3 offspring have been studied at 3-month intervals for \nthe first 2 years, and at 6-month intervals up to 4 years. \nWe acted as observers, but informed the family pediatri- \ncian of any significant findings in the laboratory tests; in \nsome instances the pediatrician acted on that evidence, e.g., \nchanged the formula. He also gave routine immunizations at \nthe appropriate times. Nursing was strongly encouraged and \nsupplemented with soy or casein hydrolysate (Nutramigen) \nformula feedings. \nThe clinical diagnosis of allergy in infants involved the \ncriteria discussed in the following paragraphs. \nECLEMA. Mild was a pruritic maculopapular rash on the \nface and flexural surfaces of the limbs persisting for more \nthan one month, i.e., observed on 2 or more visits. Moder- \nate was such a rash observed for 6 or more months, or \ninvolving, in addition, trunk and extensor surfaces of limbs. \nSevere was such a rash that was scratched open and became \ninfected and/or persisted 9 months or more. \nALLERGIC RHINITIS. Mild was recurrent sneezing and \nclear or while nasal discharge observed on 3 or more occa- \nsions; moderate was such a discharge plus nose rubbing on 3 \nsuccessive visits for 6 months; severe was a constant pro- \nfuse white discharge with intermittent purulent episodes on \n3 visits. \nASTHMA. Mild was 4 weeks of persistent cough and mild \nwheezing with infections; moderate was cough persisting \nbeyond 4 weeks and wheezing without infection and requir- \ning intermittent bronchodilators; severe was constant cough- \ning interfering with sleep or exercise or wheezing of suffi- \ncient severity to require daily bronchodilators. \nOTITIS. In&m&tent otitis lasting 6 months or more was \nmild; 9 months of otitis with persistent fluid was moderate; \nsuch otitis or persistent fluid that required placement of \ntympanostomy tubes was severe. \nCOLIC. Infantile colic meaning prolonged crying, \ncramps, and frequent flatus and persisting for one month or \nmore was mild; such colic persisting 2 months and/or asso- \nciated with vomiting was moderate; these symptoms asso- \nciated with diarrhea and dehydration were severe. \nWell-baby control group. Our original intent was to fol- \nlow the same protocol in a group of infants born into \nfamilies with no allergic family background, but we were \nprevented from doing so by a lawsuit brought by a member \nof our Human Experimentation Committee over the issue of \nserial venous blood sampling in normal children. Therefore, \nwe made clinical observations on the development of aller- \ngic symptoms in a group of 28 infants with nonallergic \nparents from our Well-Baby Clinic. These 28 children were \nfollowed at 3-month intervals for 1 year or more for signs of \nallergy. An additional 7 children were followed but were \nnot included in the control group when it was discovered \nthat close relatives had allergies. The 2 infants in the \nallergy-prone study group (S. G. and M. J.) who failed to \ndevelop significant allergic symptoms or positive immu- \nnologic tests served as internal controls, in that they had the \nsame bilateral family history of allergy but had few colds. \nSingle blood samples from IO nonallergic age-matched \nchildren undergoing cardiac catheterization served to estab- \nlish baseline values for our immunologic tests. Single blood \nsamples from 24 age-matched known allergic children \n(symptomatic-positive skin tests) served to test the validity \nof our immunologic assays. While our controls were not \noptimal, they were the best possible under the legal con- \nstraints imposed. \n230 Frick, German, and Mills J. ALLERGY CLIN. IMMUNOL. \nAPRIL 1979 \nTABLE II. Comparison of immunologic responses with common allergens in 3 tests in \n“allergy-prone” and “control” children \nImmunologic tests \nRAST \n>1.5 e/c (3x) \nWBC \n>lO% \nLlT Ag \n>1.7 e/c \nPatient groups \nInfants of allergic families \n(n = 13) \nAllergic child controls \nNonallergic control children \n(n = 10) \nNo. positive allergens*/total tested \n38/65 = 58.5% 21/46 = 45.6% 23/42 = 51.7% \n32/40 = 80% 46/50 = 92% 8/13 = 62% \n(n = 20) (n = 24) (n = 11) \n2/18 = 11% l/20 = 5% l/10 = 10% \n*Dog or cat; grass pollen; house dust or mite; cow’s milk; soy. \nTABLE Ill. Complement-fixing virus antibodies in 11 “allergy-prone” children before \nand after allergic sensitization \nParainfluenza 3 RSV CMV Total no. children \nRise in virus antibody titer \nHigh virus antibody titer \n(not rising) \nLow virus antibody titer \n(no change) \n2* (2-fold) \n3 (4-8 fold) \n2 \n4 \n2 (2-fold) \n1 (Cfold) \n- \n8 \n8/11 \n1 (Cfold) \n1 2/11 \n9 l/11 \n*Number of children. \nImmunologic tests \nAZlergens included cat pelt allergen (kindly supplied by \nDr. H. Baer, Food and Drug Administration, Bethesda, \nMaryland), dog dander, house dust (Berkeley Biologicals, \nBerkeley, California), mite (Dermatophagoides farinii), \nwhole cow’s milk, soybean and rye grass pollen (Lolium \nmultiforme) extracts (Hollister-Stier Laboratories, Spokane, \nWashington). \nSerum immunoglobulin (IgG, A, M) concentrations were \ndetermined by the Mancini immunodiffusion method” using \nPartigen immunoplates (Behring Diagnostics, Somerville, \nNew Jersey). Total serum IgE was determined by a double- \nantibody method6 (PRIST Pharmacia, Piscataway, New \nJersey). \nRadioallergosorbent test (RAST).7 RAST was used for \nIgE antibodies to a panel of 7 allergens common for children \n(cat or dog dander, house dust, and mite (D. farinii), rye \ngrass pollen as representative for grass or cereal antigen, \nwhole cow’s milk, and soybean). The allergens were \ncoupled to Whatman No. 1 filter paper discs activated with \ncyanogen bromide, mixed with 50 ~1 1: 5 diluted serum, \nand incubated 24 hr at room temperature, with slow rota- \ntion . After centrifugation , the discs of sorbent-allergen \nantibody mixed with 50 ~1 lzZI rabbit antihuman IgE \n(40,000 cpm) were incubated for 18 hr, recentrifuged, \nwashed, and counted on an Auto-Gamma Spectrometer \n(Searle 1185). Results from children’s sera were compared \nwith cord sera from infants of nonallergic families and dil- \nuent. RAST of 2 times greater than base was considered \npositive, and 1.5 times base was borderline; this choice of \nsignificance has been established for our laboratory for 5 \nyears. \nHistamine release (HR) from leukocytes.8 Leukocytes \nwere separated by dextran from 5 to IO ml heparinized \nblood, mixed with antigen in 3 or more decimal (dilutions) \nor with rabbit antihuman IgE serum, incubated 40 min at \n37” C, and cells were removed by centrifugation. Histamine \nwas extracted from the supematant in n-butanol in NaOH, \nthen in n-heptane and HCl, cooled, and made fluorescent \nwith o-phthaldialdehyde. Acidified fluorescent histamine \nwas quantitated by spectrofluorometry (Aminco SPF- 125). \nPerchloric acid (4%) was used to completely lyse one \naliquot of cells for total histamine content; antigen-induced \nhistamine release was expressed as percent of total hista- \nmine present in cells. Antigen-induced histamine of 10% or \nmore than control was considered positive. \nLymphoblast transformation test (LTT).” Lymphocytes \nwere collected from heparinized blood by first separating \nerythrocytes in dextran; the supemate was then layered on \nFicoll-Hypaque and centrifuged. Six IO-fold dilutions of \nantigen or PHA 100 ~1 were added to 1,000 ~1 lymphocytes \n(1Oj) in tissue culture TC 199-20% autologous serum sus- \npension. Cultures at 37” C in 5% CO, were carried 3 days \nfor PHA and 7 days for antigen; then, 3H-thymidine (0.5 \n/Xi) was added to 0.1 ml culture and harvested after incu- \nbation for 4 hr. Incorporation of 3H-thymidine was mea- \nVOLUME 63 \nNUMBER 4 \nDevelopment of allergy with virus infections 231 \nWC \n(ARAST) \n(0 LTV \n“,R”S CF TITERS \n8163264 8163264 \n4 \nADENO - - - 60 \nBO-- CAT \n4.0 @cJ- H.D. MITE \nno-.- COW MILK \n@al- 3.0 soy \n- 40 \n100 5 \n1.0 IgE ~~/ml \n0 \n--1 \n0 CHEST wheeze \nHR% \n(0) \n0 3 6 9 12 15 \nLt t \nMY \nt”“t tN F t \nN stir \nCU~~.+PSdd.3 AGE -MONTHS \nFIG. 1. Chronologic record of symptoms (Sx) and immunologic tests: RAST, HR, LTT, total IgE, \nand complement-fixing virus antibodies in Patient C. F. At bottom are months, February(F), May \n(My), August (Au), and November(N). Arrows indicate time of URI. Feedings are indicated by N \n(nursing), S (soy formula), and CM (cow’s milk). \nsured by counting samples in a liquid scintillation spec- \ntrometer (Mark III, Searle). Lymphocyte transformation \nindices were ratios of 3H-thymidine in cultures with \n(E = experimental) or without (C = control) antigen or \nPHA. A ratio of E/C greater than 2.0 was considered posi- \ntive, and 1.7 was borderline. \nVirus anribodies. Complement-fixing antibodies were de- \ntermined before and after respiratory infections by utilizing \na panel of 7 common childhood respiratory virus antigens: \ninfluenza A, parainfluenza 1,2,3; adenovims, RSV, CMV, \nand Mycoplasma pneumoniae.‘O These tests were kindly \nperformed by Dr. A. Back, Director of Laboratories, De- \npartment of Public Health, San Francisco, California. Rou- \ntine bacteriologic and viral cultures from the nasopharynx \nwere made at times of acute respiratory infection. For virus \ncultures, alglnate nasal swabs were dipped in 1 ml of Hanks \nbalanced sall: solution containing penicillin and gentamicin; \n0.1 to 0.2 ml was immediately added to 2 tubes each of: \nrhesus monkey kidney, WI-38 human diploid fibroblasts \nand HEP-2 cells (Flow Laboratories, Rockville, Maryland). \nCell monolayers were incubated at 35” to 36” C on roller \ndrums for 2 weeks (for HEP-2 and monkey kidney) and 4 \nweeks (WI-38) with weekly feedings. The presence of vi- \nruses was detected by cytopathic effects and/or hemadsorp- \ntion, and the identity was confirmed by reaction with the \nspecific antiserum. \n/3-adrenergic status assessment. In two children at the \nage of 6 months we determined blood sugar, free fatty \nacids, and total eosinophil baselines, then gave epinephrine \ninjection (10 pg/kg) subcutaneously, and repeated the \nblood sampling at 20, 40, and 60 minutes. This evaluation \nwas again repeated in the two children at 12 or 18 months \nafter each had developed allergic symptoms. \nRESULTS \nAllergy-prone group. All 13 children showed some \nsymptoms of allergy (Table I). All had recurrent \nrashes; 7 had moderate to severe atopic dermatitis \ninvolving the face, ears, flexural creases, trunk, and \nextensor surfaces of the limbs; the remaining 6 had a \nmild but persistent macuiopapular rash on the face \nand limbs. Two infants had recurrent episodes of ur- \nticaria, 1 from cat exposure and 1 from ingestion of \nbeef. \nRespiratory tract involvement occurred in 1 1 chil- \ndren, with moderate to severe chronic nasal discharge \nin 9 and milder intermittent discharge in 2. Six chil- \ndren had persistent cough and wheezing that required \nbronchodilators intermittently; 3 are now considered \nto be moderate asthmatics. Five others had mild \ncough or wheezing with infections only. \nRecurrent otitis was observed in 7 children: 3 mild, \n3 moderate, and 1 severe. Gastrointestinal symptoms \noccurred repeatedly in 7 children, 4 with mild to \n232 Frick, German, and Mills J. ALLERGY CLIN. IMMUNOL. \nAPRIL 1979 \nTABLE IV. Onset of allergic sensitization in infants \nPa- \ntient \nAge (mo) last visit \nwith no allergic \nsymptoms and all \nnegative \nimmunologic tests \nAge \n(mol \nURIS \nAge ho) \nvirus* \ncomplement-fixing \nantibodies \nPre- Post- \nURI URI \nAge (mo) \nfirst \nallergic \nsymptoms \nAge (mo) \nfirat \nimmunologic \ntests \npositivet \nW \nserum \n(W/ml) \nPre- Post- \nURI URI \nC. F. 3 1, 2 \nJ. H. 3 6, 11 \nD. M. 3 2% \nM. S. NB 2, 3, 5 \nR. J. 3 354,542 \nM. M. 6 7, 8, 12 \n3 \n~8 \n6 \nP 32 \n3% ecz; \n6 wheeze \n6?4 \nP4 \nRS 16 \n9 \nP64 \nRS 8 \n6% nose \n7 10 6 nose; \n138 P 16 rash \n4 9 4 nose; \nRS 16 RS 32 6 urtic \n3 \nCM8 \nP64 \n6 \nCM 32 \nP@t \n6 nose \n9 \nRS 16 \n12 \nRS 64 \n8 nose; \nwheeze \n6 2 \nR-CM, 2.3 \nL-CM, 2.5 \nL-H, 4.0 \n6% 1 \nR-CM, 2.1 \nR-H, 1.6 \nH-C, 40 \n7 1.4 \nR-D, 2.7 \n6 1.5 \nR-C, 1.8 \nH-C, 85 \nH-H, 55 \nL-H, 1.8 \n6 0 \nR-G, 2.1 \nL-G, 2.0 \nR-S, 1.8 \n9 1 \nR-H, 1.8 \nH-H, 60 \nL-H, 7.5 \nH-O, 90 \n51 \n3 \n5.5 \n2.5 \n5.8 \n1.4 \n*Virus: p, parainfluenza 3; RSV, respiratory syncytial virus; CM, cytomegalovirus. \ntR: RAST (numbers indicate E/C); H: HR (numbers indicate 8 histamine); L: L’IT (numbers indicate E/C-lymphoblastogenesis). C: \nD: dog; G: grass pollen; H: house dust; CM: cow’s milk; 0: oat; N: nursing; S: soy; W: wheat. \nSARI allergic rhinitis. Asth: asthma; Ecz: eczema; SOM: serous otitis media. \ncat; \nmoderate colic and 3 with recurrent vomiting, 1 of \nwhom had severe diarrhea and dehydration that re- \nquired feeding changes and hospitalization for intra- \nvenous fluids. \nImmunologic responses \nWell-baby control group. Of the 28 children in this \ngroup, 7 had a chronic mild skin rash, 6 of whom had \na nasal discharge which lasted over one month, and 3 \nhad recurrent otitis. \nThe 3 tests for immunologic response to specific \nallergens were positive for about half of those in the \nallergy-prone group (Table II). The percent of posi- \ntive tests in children of allergic families compared \nwith the nonallergic controls are statistically sig- \nnificant (p < 0.01) for all 3 tests using the t test for \npaired samples. \nA comparison of symptoms of allergy in the two In two children at the age of 6 months, subcutane- \ngroups (Table I) shows 51 chronic symptoms in 5 ous epinephrine injection (10 pg/kg) caused a normal \norgan systems in the 13 allergy-prone children, for a rise in blood glucose and free fatty acids and a drop in \nmaximum possible score of 65 (5 symptoms X 13 total eosinophils measured at 20-min intervals for 1 \nchildren) for an 80% (5 l/65) incidence, whereas 21 hr. When the tests were repeated on these two chil- \nsymptoms in a possible score of 140 (5 x 28 chil- dren at 12 and 18 months, respectively, after they had \ndren) or 15% were observed in the control group. This each developed allergic symptoms, subcutaneous epi- \nis significant at a p value of CO.01 (cm-square with nephrine (10 pg/kg) caused a similar normal rise in \nYates correction for small numbers). blood glucose and free fatty acids and a fall in total \nVOLUME 63 \nNUMBER 4 \nDevelopment of allergy with virus infections 233 \nFeeding \nhistory \nCurrent Current \nage allergic \n(vr) status \n(6178) (6178)s \nN 5% mo; 2% Asth mod \nS Ecz mod \nN 5% ITIO' \nCM \n4 AR mild \nEcz mod \nN 1 mo; \nCM \nS 12 mo \n4 Asth mod \nAR & ecz mild \n5 AR & urtic, cat \nN 26 mo + \ns suppi \n3% AR mod \nN7mo t nutr; 4?4 Asth mod \nS 12 mo AR mod \neosinophi1.s. There was no evidence of an increase \nin P-adrenergic blockade following allergic sensi- \ntization. \nWe could make no association of allergic sensitiza- \ntion with lthe type of infant feeding, i.e., breast feed- \ning, COW’IS milk, or soy formula; however, the num- \nber of children13 is too few for an association to be \nmade on a statistical basis. \nOf note is that the onset of allergic symptoms and \npositive immunologic response to one or more al- \nlergens calincided with a URI in the previous month. \nPlasma samples, taken before and after the respiratory \ninfection in 11 children from allergic families, were \ntested for complement fixing antibodies to a panel of \ncommon respiratory viruses and mycoplasma (the \nsame plasma samples in which a change in allergic \nimmunologic reactivity was observed). \nFrom Table III, it is evident that 4 children had a \nrise in parainfluenza 2 and 3 antibodies (3 had Z 4- \nfold rises, 2 had a 2-fold rise); 2 had already high \nantibody levels to these viruses. With RSV, 3 had \nrising titers; 1 had a rising titer to cytomegalic virus, \nand another had a stable high titer. Only one child had \nlow titers to all the panel viruses. That these are not \nunusual viruses in this age group is evidenced by the \npresence of complement-fixing antibodies in our 10 \ncontrol nonallergic cardiac catheterization children. \nThree had antibodies to parainfluenza 3, and 2 had \nRSV titers of 1: 8 or more. What was striking was the \nonset of allergic sensitization coincident with a rise in \nantibody titer to these respiratory viruses. \nNasopharyngeal cultures were taken in 1.5 of the 23 \nURIS reported in the 13 infants. Two cultures were \npositive for pathogenic bacteria (Stuphylococcus \naureus, coagulase-positive in Patient C. F., and \npneumococcus in Patient J. H.). The rest of the cul- \ntures were reported as containing normal bacterial \nflora. \nTable IV is a tabulation of the pre- and postinfec- \ntion clinical and immunologic test results and ages in \nmonths when changes were observed in the individual \nchildren. Feeding history and current allergic status \nassessment are tabulated. In the first 11 children that \ndeveloped allergic symptoms and positive immu- \nnologic tests for a particular allergen, a URI preceded \nthe allergic sensitization by 2 to 6 weeks. These in- \nfections were associated with a rising virus antibody \ntiter in 8/ 11 children; another 2 already had high ti- \nters. In 7 children, two different immunologic tests \nfor a particular allergen were positive in the first \npostinfection plasma sample (column 7). In 10 chil- \ndren, tests for two allergens were positive. Of these \ntests, one-third (13/35) were borderline-positive: \nRASTandLTTEK, 1.7-1.9,andHR < 15%onthis \nfirst examination; on subsequent samplings, 9 became \nmore positive (E/C > 2), 3 remained the same, and 2 \nbecame negative. Postinfection IgE levels increased \n3-fold or more in 7/l 1 children when compared with \nthe preinfection sample taken 3 months before. How- \never, in only 2 infants did IgE levels rise to above 10 \nU/ml in the postinfection sample. \nSeven children were breast-fed for 555 months or \nlonger, 2 of these were breast-fed for more than two \nyears. Of these 7 nursing infants, only 2 required \nsupplemental soy or casein hydrolysate formulas. \nThree were on soy formula and 3 were maintained on \ncow’s milk formula. In all children, solid foods were \nintroduced conservatively at 4 to 6 months of age. \nThe current allergic assessment of these 13 children \nindicates that 5 have asthmatic episodes, 9 have \nperennial allergic rhinitis, 4 continue to have eczema, \n2 have recurrent otitis, and 1 has intestinal symp- \ntoms from wheat and milk; only 3 are considered not \nallergic. \nThe association between virus infections and onset \n234 Frick, German, and Mills J. ALLERGY CLIN. IMMUNOL. \nAPRIL 1979 \nTABLE IV. Cont’d \nPa- \ntient \nAge (mo) last visit \nwith no allergic \nsymptoms and all \nnegative \nimmunologic tests \nAgO \nho) \nURIS \nAge (mol \nvirus* \ncomplement-fixing \nantibodies \nPre- Post- \nURI URI \nAge ho) \nfirst \nallergic \nsymptoms \nAge b-no) \nfirst \nbnmunologlc \ntests \npositivet \nW \nserum \n(IUlml) \nPre- Post- \nURI URI \nJ. M. 5 8 \n‘3. B. 3 2%,7 \nS. J. NB 2, 3 \nJ. D. NB 3, 6 \nJ. Z. 3 2, 2% \ns. G. 36 6, 11 \nM. J. 18 496 \n5 9 9 nose; \nP 16 P 32 ecz \n6 9 \nCM64 CM 64 \n- - \n4 7 \nP64 P64 \n7 12 \n~8 P64 \n6 9 \n~8 ~8 \nVirus cult \nneg 4 mo \n6 ecz; \nnose; \nGI-W \n3 ecz and \nnose; \n5% wheeze \n4 nose; \necz \n3 ecz \nNone \n9 \nR-H, 1.8 \nH-G, 23 \nL-G, 4.8 \nL-CM, 2.6 \n6 \nR-W, 1.9 \nR-D, 1.9 \n3 \nR-D, 3.4 \nH-D, 13 \nR-G, 1.8 \nR-CM, 1.7 \n4 \nR-D, 2.2 \nR-G, 1.8 \nH-G, 17 \n7 \nR-H, 2.2 \nL-H, 3.0 \n7 \nR-D, 2.0 \nR-W, 1.8 \nNone \nNone \n1 4 \n1 1.6 \n2.6 11 \n0 1 \n7.5 \n1.2 \n1.8 \nof allergic sensitization may be more evident when \none examines the clinical and immunologic course for \nindividual patients. \nA 15month old oriental boy (C. F.) with a \n3-year-old brother with severe asthma and eczema \nwas breast-fed for %% months and then placed on soy \nformula for 6 months and whole cow’s milk at 12 \nmonths (Fig. 1). His brother transmitted two respira- \ntory infections to him at 1 and 2 months of age, but \ncultures from the nasopharynx were negative for bac- \nterial pathogens. At 3 months, he presented with \nmoderately severe eczema and mild nasal congestion. \nCMV titer was 64 and parainfluenza 3 titer was 8. \nTotal IgE was less than 5 U/ml. Cow’s milk RAST \nwhile breast feeding was borderline (E/C = I .7). Cat \nand mite RAST were negative. At 6 months, he had \nanother URI, although rhinitis had been constant for \nthe preceding 3 months, but eczema was somewhat \nimproved. There was a 4-fold rise in parainfluenza 3 \nantibody titer to 1: 32. Total IgE rose 1 O-fold to 5 1 \nU/ml. Results of RAST and LTT to cow’s milk were \npositive (E/C = 2.3 and 2.5, respectively) and they \nwere positive to mite (E/C = 1.5 borderline and 4.1, \nrespectively). At 7 months, he developed another \nURI; parainfluenza 3 was recovered from a nasopha- \nryngeal swab; moderate wheezing was relieved with \ntheophylline. At 9 months, in addition, RAST to cat \nwas positive (E/C = 2.6). Although there was no cat \nin his home, 5 days per week the children were at a \nbaby sitter’s home where there was a cat. By 12 \nmonths, he had continuous ‘rhinitis with nasal \neosinophilia, moderate eczema, wheezing with respi- \nratory infections, and was considered to be asthmatic. \nRAST was positive for cat, cow’s milk, and mite \nVOLUME 63 \nNUMBER 4 \nFeeding \nhistory \nCurrent Current \nwe allergic \n(yr) status \n(6178) (6178)Z \nN 12 mo; 2% \nCM \nN 24 mo 4% \nCM 2% \nCM 1 mo, \ncolic; s \n2% \nN 6 mo; 3% \nS \nS 3 \nN 1 mo; 1% \nCM \nAsth mild \nAR \nSOM \nDiarrhea & vomiting \nc wheat & milk \nAR & ecz mild \nAsth mild \nAR mod \nAR mod \nSOM mod \nNormal \nNormal \n(E/C = 3.0, 2.7, 2.1, respectively). In this child, \nonset of allergic sensitization to 3 or 4 allergens coin- \ncided with respiratory infections associated with pos- \nitive nasopharyngeal cultures and rising antibody titer \nfor parainfluenza 3. \nThe Caucasian boy (J. H.), now 4 years of age, \nwas breast-fed for 5 months and weaned to cow’s \nmilk (Fig. 2). He did well his first 5 months and \ndeveloped a URI when throat pneumococcus was cul- \ntured. At 6 months, his nose continued to run, but \nvirus titers were all negative, except 16 for RS V. His \nRAST was positive to cow’s milk (2.1) and borderline \nto mite (1.6). At 9 months, no new colds had oc- \ncurred, but his parainfluenza 3 titer had risen from \nundetectable to 1: 64, probably as a result of his cold \nat 5 months. However, by 9 months RAST titers had \nall fallen and he had a mild rash and nasal congestion. \nDevelopment of allergy with virus infections 235 \nBetween 9 and 15 months, he developed 3 more URIS \n(not associated with specific viral agents), more \nflexural rash, profuse watery nasal discharge, and \nrhonchi. Cat histamine release (55%) and RAST ( 1.8) \nwere positive at 12 and 15 months, but fell by 18 \nmonths. Although there was no cat in his home, he \nstayed with his grandmother several days each week; \nshe has a house cat. At 23 months, he developed \nsevere diarrhea, high fever and dehydration, negative \npathogenic bacterial stool culture, and was hos- \npitalized 2 days. One month later, his skin and \nchronic nasal congestion were worse; RAST to mite, \ncat, and cow’s milk were all more positive, as was \nmite LTT. His total IgE was steady at 5 IU, but after \nthe diarrhea it rose to 18, suggesting that gastrointes- \ntinal infection might have boosted his allergic sen- \nsitization, \nThe 18-month-old girl (S. G.), although from a \nbilaterally allergic family, might be considered a \ncontrol because she has had only 2 mild colds and \nminimal evidence of allergic sensitization, i.e., mild \nrash and nasal congestion, only borderline RAST to \ngrass ( 1.5) and mite (I.@, and negative HR and LTT \n(Fig. 3). Another l&month-old boy (M. J.) has had a \nsimilar benign course, with no immunologic evidence \nof allergic sensitization. \nMost dramatic was a 3-year-old girl (M. S.) from a \nhousehold with 3 cats, one of which slept in her room \nwhen she was 3 months of age (Fig. 4). The mother \nrefused to acknowledge animal allergy. She had 2 \nURIS by 3 months and at that time had an RSV anti- \nbody titer of 1: 16. At 3 months, cat RAST (1.8) and \nHR (10%) were borderline-positive; she had mild \nnasal congestion and coughing. At 5 months, she de- \nveloped otitis media and markedly increased persis- \ntent nasal congestion. At 7 months, she developed \ngeneralized urticaria and eyes swollen shut whenever \nshe was near the cat. Her cat HR was markedly posi- \ntive (80%) and cat RAST ( 1.6) and lymphocyte trans- \nformation (1.5) were borderline. Mite by these 3 \ntests were also positive (HR = 55%, RAST = 1.8, \nLTT = 1.8). The RSV titer rose to 1: 32. She had \nrecurrent serous otitis media for the first 15 months and \nat 3 years still has persistent chronic rhinitis and hives \nwhen near cats. At 12 months, she was switched from \nhuman to cow’s milk, with repeated infections. Cow’s \nmilk RAST (2.1) became positive within 2 months. \nRASTs to cat (1.6) and mite (1.4) were borderline. At \n2 years, cat and mite HR remain positive (38% and \n25%, respectively) while mite RAST (1.8) is border- \nline. It appears that early close exposure to cat \ntriggered the allergy by 3 months of age and may have \ncoincidentally followed two respiratory infections be- \nfore that time. No immunizations had been given. \n236 Frick, German, and Mills \nVIRUS CF TITERS \nJ. ALLERGY CLIN. IMMUNOL. \nAPRIL 1979 \n3.0 \n2.0 \nE/C \n( ARAST) \nPLW \n1 .o \n816 9163264 \n- - \n- I-ID. Mite \n-.- CAT \n‘\\ - - COW MILK \n‘\\ \n‘\\ \n‘\\ \n0 3 6 9 12 15 18 21 \nJll s D Mr Jtl s D M \nURI:t \nt \ntt t t \nHo3 \ndial \nt \nCult. IO! \np”*“lllO. \nw \nCOCCYI \nCM AGE -MONTHS \n60 \n40 \nHR% \n(0) \n20 \n1 J 0 \nip.2d \nrrhea \nin \nFIG. 2. Chronologic record of symptoms (Sx) and immunologic tests in Patient J. H. \n4.0 \nE/C \n(Al?hT) 2.0 \n(0 LTV \n. . . . ..m \n- H.D. MITE \n---GRASS \n-SOY \nDog in house \n60 \n40 \nHR% \n(0) \n20 \nIgE=IU/ml \n1.X low meorure \nI GI colic \nB SKIN -2+ \nI NOSE \nsx \n1975 1976 \n, \nI-M \n, \n1977 \n, \nOEAR \n-0 \n0 3 6 9 12 15 18 \ns Mr J \nD Mr \nN 5” URI: t tS Virus cult.-neg- \nCM \nAGE -MONTHS \nFIG. 3. Chronologic record of symptoms (Sx) and immunologic tests in Patient S. G., who is \nconsidered an internal control. \nVOLUME 63 \nNUMBER 4 \nDevelopment of allergy with virus infections 237 \n“6l”S CF TITERS \nE/C 2. \n(aRAST) \n(0 LTT) \n-- CAT \n- H.D. MITE \n0 -.- COW MILK \n--- GRASSES \nCat in BR \n61 SKIN \n100 \n60 \nHR% \n(0) \n20 \nL \n0 \n:,,t t D ),” M Lpax ‘”t ?*,,lk \nN \nATE -MONTHS \nFIG. 4. Chronologic record of symptoms (Sx) and immunologic tests in Patient M. S. \nImmunoglobulins G and M in our study group have \nfollowed ,a normal distribution for age. Serum IgA \nwas also within the normal range for age, but consis- \ntently in the low range (Fig. 5). \nDISCUSSION \nInfants with a biparental history of allergy were \nchosen for this prospective study because of the \nprevalence and early onset of allergy in such children. \nThe heritability of allergy is more complex than the \noriginal suggestion of a simple mendelian-recessive \ngene, based upon the observations of Cooke and \nVander Veer.2 Van Arsdel and Motulsky3 suggested \nan incomplete recessive gene or a polygenic inher- \nitance pattern. \nThe discovery of immune response genes in \nanimals” and their association with histocompati- \nbility antigens” led others to look for such associ- \nations in man. Levine, Stember, and Fotino4 described \na hay fever haplotype in seven families allergic to \nragweed. One haplotype occurred in all ragweed- \nallergic family members, but not all members with \nthat haplotype were allergic. However, no member of \nthe family allergic to ragweed failed to have that hap- \nlotype. In different families, different haplotypes \nwere associated with ragweed allergy. This was \nconfirmed by Yoo, Flink, and Thompson.‘3 No single \nhaplotype was associated with ragweed allergy. Cer- \ntain B cell (HLA-D) haplotypes were associated with \nextrinsic asthma within families. l4 Other genetic con- \ntrols in allergy affect the serum levels of IgE.i5* i6 \nTherefore, it may be possible by histocompatibility \ntyping of newborn infants from allergic families to \ndetermine which infants are at risk of allergic sen- \nsitization. We are conducting such a study in the \nfamilies of these allergic children in our group. \nOur study confirms the heritability of allergy in that \nall but 2 of our 13 children of two allergic parents \ndeveloped significant allergic symptoms and immu- \nnologic evidence of allergic sensitization within the \nfirst year of life. However, the intensity of this aller- \ngic sensitization appears to be transitory, both clini- \ncally and immunologically, and seems to be associ- \nated with virus infections. \nThe association of attacks of asthma with proved \nupper respiratory virus infections in children is now \nquite well established. 17-20 Boesen” pointed out that \nasthmatic children usually have their first attacks in \nconjunction with a respiratory infection, the initial \ndiagnosis usually being “asthmatic bronchitis.” In \nour study, we are suggesting a possible association \nbetween the allergic sensitization process and viral \ninfections. \nCulture-proved respiratory virus infections, pre- \n238 Frick, German, and Mills J. ALLERGY CLIN. IMMUNOL. \nAPRIL 1979 \n200 \n160 \n160 \n160 \n120 \nML \n100 \n60 \n60 \n60 \n20 \nIs.._...*.. ----- \n1 \n. -w-m-- \nMB 3 6 9 12 15 18 21 2, 27 30 33 36 \nKf -Mill6 \nFIG. 5. Serum IgA concentrations for the “allergy-prone” children (I-I) compared to a normal \nage-matched population (. . . . = mean and 2 SD range). \ndominantly parainfluenza 1 and 3 and RSV, occurred \nin 27% of the expiratory wheezing episodes in a retro- \nspective study of 357 young (most under 2 years old) \nchildren.16 Wheezing was associated with allergy and \npositive skin tests in 39% of those under 18 months, \nand in 73% of those over 18 months. Berkovich, Mil- \nlian, and Snyder lg found influenza A2 and parain- \nfluenza most frequently associated with the onset of \nwheezing in 40 asthmatic children; several also had \nadenovirus and mycoplasma. McIntosh and co- \nworkers,2o who investigated prospectively 32 hos- \npitalized asthmatic children under 5 years of age with \nbacterial and viral cultures at the onset of each acute \nrespiratory illness which subsequently led to wheez- \ning, found 42% (58/129) of wheezing episodes asso- \nciated with identifiable viral infections; almost half \nwere due to RSV; next in frequency were para- \ninfluenza and coronavirus. Infections with influenza \nAz (Hong Kong) and pathogenic bacteria had no \nstatistical association with wheezing. Therefore, in \nyoung asthmatic children, wheezing was associated \npredominantly with RSV, parainfluenza, and occa- \nsionally other viruses. \nIn schoolchildren with intrinsic asthma, Minor and \nco-workerP found that two thirds (42/61) of the \nepisodes of asthma occurred during symptomatic re- \nspiratory infections, mostly of viral origin. Severe \nasthma occurred in 14/ 15 of those with rhinovirus \ninfections and in all of 6 influenza AZ (Hong Kong) \ninfections. This group also observedz2 that asthmatic \nchildren in a family experienced a significantly \ngreater frequency of viral respiratory infections than \ntheir nonasthmatic siblings (5.1 vs 3.8/yr/subject; \np < 0.01); common viruses were rhinoviruses and \nmyxoviruses. This group had also foundz3 that a \nlarger adult population with intrinsic asthma had \nwheezing in 55% of infections, with positive virus \ncultures in about half (19/43) of the asthmatic \nepisodes; rhinovirus and influenza A were most fre- \nquently recovered. It appears, therefore, that wheez- \nVOLUME 63 \nNUMBER 4 \nDevelopment of allergy with virus infections 239 \ning is commonly associated with proved virus in- \nfections, but that the predominant associated virus \ntypes may (differ with age of the patients. \nIn our study, we were struck by the frequent onset \nof allergic sensitization as evidenced by a change \nfrom one or more negative immunologic test results to \npositive and onset of allergic symptoms within weeks \nof a URI. \\Ne found a coincidental temporal associa- \ntion within 6 weeks between onset of allergic sen- \nsitization and URI (Table IV). \nWe employed only in vitro tests for allergic sen- \nsitization and were precluded from performing re- \npeated skin tests because of the theoretical possibility \nthat such repetitious antigen exposure in vivo might \ncause an allergy. Although this has never been shown \nto occur, our Human Experimentation Committee \nasked us to omit serial skin testing. Our choice of \nallergens for our in vitro tests included allergens most \ncommonly encountered by infants and young chil- \ndren. Early-onset allergy to house dust occurred in \n7/ 11, to ani ma1 danders in 8/ 1 1, and to grass pollen in \n2. Among the 8 children who developed dander sen- \nsitivity, 4 had the animals in the home for years be- \nfore the infant arrived. The parents did not choose to \nremove the pet on the chance that the child might \nbecome allergic to it. The pets were removed once the \nchild became sensitized. The other 4 dander-sensitive \nchildren, despite having no pets at home, were ex- \nposed repeatedly at the baby sitters’ homes. Grass \npollen sensitization occurred in 2 children. Clinical \nfood sensitivity to cereals (oat and wheat) occurred in \n4 children Cow’s milk sensitivity occurred in 4 \nchildren; 3 were nursed-2 for 5l/f months and 1 \nfor 12 months; all of the mothers drank over one \nquart of cow’s milk per day to maintain their own \nmilk supply. This confirms the observation of Kaplan \nand Solliz that completely breast-fed infants often \nhad higher cow’s milk RAST than some infants \nfed cow’s milk directly; presumably partially di- \ngested cow’s milk proteins cross to the infant in \nthe mother’s milk. \nPositive immunologic tests and allergic symptoms \nfollowed within 6 weeks of a URI in 9/l 1 infants. In \nthe other 2 who became sensitized, there were 3- and \n4-month intervals between the URI and allergy onset, \nrespectively; a history of an intercurrent “cold” \nmight have been missed. The history was taken with- \nout knowledge of the immunologic test results. \nThe type of virus infections, parainfluenza in 7 \nchildren, RSV in 3, and CMV in 2, identified with \nrising or high titers of complement-fixing antibodies \nare the same as those predominantly associated with \nvirus-induced asthmatic attacks in children.18* *O \nThese are, however, not unusual infections in young \nchildren, It may be that in children with an atopic \nconstitution, such virus infections might trigger al- \nlergic sensitization. \nIf our continuing studies can show that virus in- \nfections are conclusively associated with the onset of \nallergic sensitization, several possible mechanisms of \nvirus action could be postulated. In the many acute \nvirus infections that cause a depression in T lym- \nphocytes that lasts several weeks,‘” conceivably \nIgE-T suppressor cells could be depressed preferen- \ntially, thus allowing helper T cells to stimulate B \nlymphocytes to make IgE antibodies. \nMembrane-binding organisms can accentuate /3- \nadrenergic blockade; Bordetella pertussis, 26 influ- \nenza, parainfluenza, RSV, and mycoplasma all are \nmembrane-binding organisms.27 Ouellette and Reedz8 \nfound an increased response, lasting 3 days, to in- \nhaled methacholine in asthmatics after influenza A \nvirus vaccination. Live measles virus vaccine in \nasthmatics also increases bronchoconstriction after \ninhalation of methacholine, an effect that lasts 4 \nweeks.2” Szentivanyi”j suggested that /3-adrenergic \nblockade might preferentially stimulate IgE antibody \nformation. \nVirus infections cause cytopathology of respiratory \nmucosal cells. This could facilitate mucosal penetra- \ntion of allergens to the IgE-forming lymphocytes that \nline the respiratory mucosa, which is rich in such \ncells.30 Furthermore, when Laitinen and co-workers3’ \ninfected normal human volunteers with an attenuated \nlive influenza A and B virus vaccine, bronchial re- \nsponsiveness increased 70% to histamine aerosols as \nmeasured by airway resistance (Raw) after the virus \ninfection. This group observed a similar increase in \nbronchial sensitivity to histamine in normal individu- \nals with colds.32 They suggested that the infection \ndenuded the epithelial surface and exposed irritant \nreceptors that responded easily to low concentrations \nof inhaled histamine (“sensitization” of sensory re- \nceptors in the airways). Histamine-induced edema \nmight make the respiratory mucosa more permeable \nand facilitate entry of allergens to antibody-forming \ncells. \nFinally, certain viruses enhance IgE-mediated HR \nfrom leukocytes of ragweed-allergic patients.33 When \ncells of such patients were incubated with herpes \nsimplex, influenza A, or adenoviruses, and sub- \nsequently exposed to ragweed or anti-IgE serum, al- \nmost twice as much histamine was released as in \nnon-virus-treated cells. This enhanced HR from such \ncells was associated with interferon production. It was \nsuggested 33 that this enhanced HR might be a co- \n240 Frick, German, and Mills J. ALLERGY CLIN. IMMIJNOL \nAPRIL 1979 \nfactor for potentiating asthmatic attacks during virus \ninfections. \n5. \nIf virus infections do, indeed, have a role in initiat- \ning allergic sensitization, then the possibility exists \nthat live attenuated virus vaccines used in routine im- \nmunizations of infants might contribute to this sen- \nsitization process. The infants in our study all re- \nceived live poliomyelitis vaccine and killed pertussis \nvaccine (DPT) between the ages of 3 and 7 months, \nand live measles, mumps, and rubella vaccines at 12 \nto 15 months; therefore, we cannot exclude a possible \nrole for these vaccines in the sensitization process. \nHowever, because our two internal control children \ndid not develop allergy and also received the same \nimmunizations, we felt that immunizations might be \nof subordinate interest. \n6. \nMancini GA, Carbonara 0, Heremans JF: Immunochemical \nquantitation of antigens by single radial immunodiffusion, \nImmunochemistry 2:235, 1965. \nCeska M, Lundquist V: A new and simple radioimmunoassay \nmethod for the determination of IgE, Immunochemistry 9: 102, \n1912. \nI. \n8. \nWide L, Bennich H, Johansson SGO: Diagnosis of allergy by \nan in vitro test for allergenic antibodies, Lancet 2: 1 105, 1967. \nMay CD, Lyman M, Albert0 R, Cheng J: Procedures for im- \nmunological study of histamine release from leukocytes with a \nsmall volume of blood, J ALLERGY CLIN IMMUNOL 46: 12, \n1970. \n9. \n10. \n11. \nThus, there are at least four possible mechanisms \nwhereby respiratory virus infections might induce al- \nlergic sensitization in a genetically susceptible child. \nThese hypotheses are being tested in continuing stud- \nies in our laboratory. \nSengar DPS, Terasaki PI: A semi-micro mixed leukocyte cul- \nture test, Transplantation 11: 260, 197 1. \nMufson MA: Respiratory syncytial virus and the parainfluenza \nviruses complement fixation, in Rose N, Friedman H, editors: \nManual of clinical immunology, Washington, D.C., 1976, \nAmerican Society of Microbiology, p. 438. \nKantor FS, Ojeda A, Benacerraf B: Studies on artificial anti- \ngens: Antigenicity of DNP polylysine and DNP copolymer of \nlysine and glutanic acid in guinea pigs, J Exp Med 117:55, \n1963. \n12. \nAlthough we cannot provide a final answer to our \noriginal question, we prefer the optimistic view that \ncertain possibly preventable environmental events \nmay trigger allergic sensitization in a genetically sus- \nceptible child. \n13. \n14. \nCONCLUSION \n1. Infants from families with two allergic parents \nusually but not always develop allergic signs and \nsymptoms in the first year of life. \n2. In such infants onset of allergic symptoms usu- \nally coincides with a demonstrable change in the re- \nsults of immunologic in vitro testing for allergy with \none or more allergens. \n15. \nMcDevitt HO, Sela M: Genetic control of the antibody re- \nsponse. I. Demonstration of determinant-specific differences \nin response to synthetic poiypeptide antigens in two strains of \ninbred mice, J Exp Med 122:517, 1965. \nYoo TS, Flink RJ, Thompson JS: The relationship between \nHL-A antigens and lymphocyte response in ragweed allergy, J \nALLERGY CLIN IMMUNOL 57~25, 1976. \nRachelefsky G, Terasaki PI, Park MS, Katz R, Siegel S, \nShoichiro S: Strong association between B-lymphocyte group \n2-specificity and asthma, Lancet 2: 1042, 1976. \nBazaral M, Orgel HA, Hamburger RN: Genetics of IgE and \nallergy: Serum IgE levels in twins, J ALLERGY CLIN IMMUNOL \n54:288, 1974. \n16. Marsh DG: Allergy as a genetic model, Nobel Symposium, \n1976. \n17. Boesen I: Asthmatic bronchitis in children, Acta Paediatr \n42:87, 1953. \n18. \n19. \n3. Onset of clinical and immunologic evidence of \nallergy usually coincides with, or follows within \nweeks, a URI, commonly with parainfluenza or respi- \nratory syncytial virus. \n20. \nWe wish to thank Mrs. Faith Ashton for her excellent \ntechnical assistance, Mrs. Anne Schmid for her editorial \nhelp, and Mrs. Wendy Carmody for preparation of the \nmanuscript. \n21. \n22. \nREFERENCES \n1. Maimonides: Treatise on asthma, in Muntner S, editor: \nPhiladelphia, 1963, J. B. Lippincott Co. (Original from 1190 \nA.D.) \n23. \n2. Cooke RA, Vander Veer A: Human sensitization, J Immunol \n1:201, 1916. \n3. Van Arsdel PP Jr, Motulsky AG: Frequency and heritability of \naSthma and allergic rhinitis in college students, Acta Genet \n(Basel) 9: 101, 1959. \n24. \n25. \n4. Levine BB, Stember RH, Fotino M: Ragweed hay fever: Ge- \nnetic control and linkage to HL-A haplotype, Science \nFreeman GL, Todd RH: The role of allergy in viral respiratory \ntract infections, Am J Dis Child 104:330, 1962. \nBerkovich S, Millian SJ, Snyder RD: The association of viral \nand mycoplasma infections with recurrence of wheezing in the \nasthmatic child, Ann Allergy 28~43, 1970. \nMcIntosh K, Ellis EF, Hoffman LS, Lybass TG, Eller JJ, \nFulginiti VA: The association of viral and bacterial respiratory \ninfections with exacerbations of wheezing in young asthmatic \nchildren, J Pediatr 82~578, 1973. \nMinor TE, Dick EC, DeMeo AN, Ouellette JJ, Cohen M, \nReed CE: Viruses as precipitants of asthmatic attacks in chil- \ndren, JAMA 227~292, 1974. \nMinor TE, Baker JW, Dick EC, DeMeo AN, Ouellette JJ, \nCohen M, Reed CE: Greater frequency of viral respiratory \ninfections in asthmatic children as compared with their non- \nasthmatic siblings, J Pediatr 85:442, 1974. \nMinor TE, Dick EC, Baker JW, Ouellette JJ, Cohen M, Reed \nCE: Rhinovirus and influenza Type A infections as precipitants \nof asthma, Am Rev Respir Dis 113: 149, 1976. \nKaplan MS, and Solli NJ: IgE to cow’s milk protein (CMP) in \nbreast-fed atopics, Ann Allergy 3975, 1977. (Abst 206.) \nWybran J, Fudenberg HH: Thymus-derived rosette-forming \ncells in various human disease states; cancer, lymphoma, bac- \nterial and viral infections and other diseases, J Clin Invest \n52: 1026, 1973. \n178:1201, 1972. 26. Szentivanyi A: The P-adrenergic theory of the atopic abnor- \nVOLUME 63 \nNUMBER 4 \nDevelopment of allergy with virus infections 241 \nmality in bronchial asthma, .I ALLERGY CLIN IMMUNOL \n42203, 1968. \n27. Zucker-Franklin D, Davidson M, Thomas L: The interaction of \nmycoplasma with mammalian cells. I. Hela cells, neutrophils \nand eosinophils. II. Monocytes and macrophages, J Exp Med \n124~521, 533, 1966. \n28. Ouellette JJ, Reed CE: Increased responses of asthmatic sub- \njects to methacholine after influenza vaccine, J ALLERGY CLIN \nIMMUNCIL 36~558, 1965. \n29. Kumar L, Newcomb RW, Molk L: Effect of live measles \nvaccine on bronchial sensitivity of asthmatic children to meth- \nacholine. J ALLERGY CLIN IMMUNOL 45: 104, 1970. \n30. Tada T, Ishizaka K: Distribution of y E-forming cells in lym- \nphoid tissues of the human and monkey, J Immunol 104~377, \n1970. \n3 I. Laitinen LA, Elkin RB, Empey DW, Jacobs L, Mills J, Gold \nWM. Nadel JA: Changes in bronchial reactivity after adminis- \ntration of live attenuated influenza virus, Am Rev Respir Dis \n113: 194. 1976. \n32. Empey DW, Laitinen LA, Jacobs L, Gold WM, Nadel JA: \nMechanisms of bronchial hyperreactivity in normal subjects \nafter upper respiratory tract infection, Am Rev Respir Dis \n113:131. 1976. \n33. Ida S, Hodes JJ, Siraganian RP, Notkins AL: Enhancement of \nIgE-mediated histamine release from human basophils by vir- \nuses: Role of interferon, J Exp Med 145:892, 1977. \nCopyright information \nThe appearance of a code at the bottom of the first page of an original article in this journal indicates the \ncopyright owner’s consent that copies of the article may be made for personal or internal use, or for the \npersonal or internal use of specific clients. This consent is given on the condition, however, that the copier \npay the stated per copy fee through the Copyright Clearance Center, Inc., P.O. Box 765, Schenectady, \nN. Y. 12301, 518-374-4430, for copying beyond that permitted by Sections 107 or I08 of the U. S. \nCopyright Law. This consent does not extend to other kinds of copying, such as copying for general \ndistribution, for advertising or promotional purposes, for creating new collective works, or for resale. \n",
    "Link": "https://core.ac.uk/download/323074541.pdf"
}