{
    "Title": "Carbon Farming Initiative review",
    "Authors": "Climate Change Authority",
    "Year": "No year available",
    "Abstract": "SUMMARY\n\nThe Authority is required by legislation to review the Carbon Farming Initiative (CFI) every three years; this is its first review. The review has benefited from consultations with stakeholders from a range of sectors and the Authority thanks those who contributed.\n\nWhen introduced in 2011, the CFI was designed to complement the carbon pricing mechanism. Accordingly, it focused on sectors not covered by the carbon price, namely: agriculture, waste (in part), and land use, land use change and forestry. CFI projects earned credits that could be sold to entities with liabilities under the carbon pricing mechanism.\n\nThe carbon price has since been repealed, and the CFI has been expanded to form the Emissions Reduction Fund (ERF) and now covers all sectors of the economy. The ERF is the central plank of the government’s Direct Action Plan to reduce Australia’s greenhouse gas emissions. It has been introduced through amendments to the Carbon Credits (Carbon Farming Initiative) Act 2011 (Cth), which brings it within the scope of this review. For simplicity’s sake, this report refers to the CFI as the scheme as originally configured, and the ERF as the scheme as approved by the parliament in November 2014.\n\nUnder the ERF, the government will purchase emissions reductions through auctions (and possibly other means). Fixed-price contracts, typically for seven years, will be offered to those who are successful at auction. Other changes to streamline the scheme are also being introduced, and a safeguard mechanism (that will discourage large emitters from increasing their emissions above historical levels) is to commence in July 2016.\n\nWhile these changes are substantial, the ERF retains an essential characteristic of the CFI in that it credits projects for reducing emissions below a defined baseline, and the baseline reflects what would have been expected to occur in the absence of the scheme.\n\nThe changes to the CFI are important for this review in two ways. First, as the scheme is being expanded to become the central element of Australia’s policy to reduce emissions and meet its targets, the lessons to be gleaned from its operation to date will be of interest in assessing the likely performance of the ERF. Second, as this review follows closely on the policy development process for the ERF, care has been taken not to duplicate that process, but to focus instead on the extent to which the design of the ERF addresses problems identified with the CFI, as well as other challenges that may arise",
    "Keywords": "No keywords available",
    "Publisher": "Climate Change Authority",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n  \n \nDECEMBER  \n2014 \nREPORT \nCARBON FARMING \nINITIATIVE REVIEW \n Published by the Climate Change Authority \nwww.climatechangeauthority.gov.au \nISBN: 978-0-9925422-2-1 \n© Commonwealth of Australia 2014 \nThis work is licensed under the Creative Commons Attribution 3.0 Australia Licence. To view a copy \nof this license, visit http://creativecommons.org/licenses/by/3.0/au \nThe Climate Change Authority asserts the right to be recognised as author of the original material in \nthe following manner: \n or  \n© Commonwealth of Australia (Climate Change Authority) 2014. \nIMPORTANT NOTICE – PLEASE READ \nThis document is produced for general information only and does not represent a statement of the \npolicy of the Commonwealth of Australia. The Commonwealth of Australia and all persons acting for \nthe Commonwealth preparing this report accept no liability for the accuracy of or inferences from the \nmaterial contained in this publication, or for any action as a result of any person’s or group’s \ninterpretations, deductions, conclusions or actions in relying on this material. \n  \n CONTENTS \nSummary 1 \nConclusions and recommendations 6 \nChapter 1. Introduction 8 \n1.1. About this review 8 \n1.2. Overview of the Carbon Farming Initiative and Emissions Reduction Fund 8 \n1.3. Criteria for assessing performance 13 \n1.4. The importance of additionality 14 \nChapter 2. Performance of the Carbon Farming Initiative 16 \n2.1. Methods, projects and credits 16 \n2.2. Environmental integrity 22 \n2.3. Scale of emissions reductions 25 \n2.4. Costs 27 \n2.5. Factors affecting participation 31 \nChapter 3. Prospects for improvement under the Emissions Reduction Fund 35 \n3.1. The Emissions Reduction Fund incorporates some important improvements 35 \n3.2. The Emissions Reduction Fund creates some new or expanded risks 41 \n3.3. There are some problems that the Emissions Reduction Fund cannot address 45 \n3.4. Striking the right balance—scheme participation and additionality 47 \nChapter 4. The Emissions Reduction Fund in the broader context 48 \n4.1. Interactions between the Emissions Reduction Fund and other policies 48 \n4.2. The Emissions Reduction Fund in the context of the 5 per cent target 52 \n4.3. The Emissions Reduction Fund in the context of longer-term goals 60 \nAppendix A Public consultation 62 \nAppendix B Issues for future reviews 63 \nGlossary 65 \nAbbreviations and Acronyms 68 \nReferences 69 \n \n \n  \n Figures \nFigure 1: The Carbon Farming Initiative in the broader policy context 9 \nFigure 2: Overview of the CFI process 10 \nFigure 3: The Emissions Reduction Fund in the broader policy context 11 \nFigure 4: Overview of the ERF process 12 \nFigure 5: Overview of governance arrangements 13 \nFigure 6: Methodology determinations, by sector 18 \nFigure 7: Project entry, by sector 19 \nFigure 8: Project entry—New and transition projects 20 \nFigure 9: Cumulative crediting, by sector 21 \nFigure 10: Cumulative crediting—New and transition projects 21 \nFigure 11: Project and crediting proportions to date, by lead developer 22 \nFigure 12: Australia’s deforestation emissions, 1990–2012 27 \nFigure 13: Sectoral investor abatement cost curve 34 \nFigure 14: Project with a seven year crediting period 43 \nFigure 15: Project with a 25-year crediting period 43 \nFigure 16: Australia’s abatement challenge to 2020 53 \nFigure 17: Potential emissions reductions at different carbon prices, 2015–20 55 \nFigure 18: ClimateWorks investor cost curve, 2020 56 \nFigure 19: RepuTex ERF credit supply forecast, 2013–20 57 \nFigure 20: RepuTex estimates of share of credits bid into ERF under existing and new \nmethods, 2015–20 58 \n \nTables \nTable 1: Methodology determinations made and proposals not endorsed, by activity 17 \nTable 2: Estimated emissions in sectors covered by the CFI—2011 and 2012 26 \nTable 3: Projects and crediting, by method 30 \nTable 4: Australia’s emissions reduction opportunities 54 \nTable 5: Submissions received 62 \n \nBoxes \nBox 1:   Contract length and timing of emissions reductions 43 \nBox 2:   ERF interaction with other schemes and regulation—the case of landfill waste 48 \n \nCARBON FARMING INITIATIVE REVIEW REPORT 1 \nSUMMARY \nThe Authority is required by legislation to review the Carbon Farming Initiative (CFI) every three \nyears; this is its first review. The review has benefited from consultations with stakeholders from a \nrange of sectors and the Authority thanks those who contributed. \nWhen introduced in 2011, the CFI was designed to complement the carbon pricing mechanism. \nAccordingly, it focused on sectors not covered by the carbon price, namely: agriculture, waste (in \npart), and land use, land use change and forestry. CFI projects earned credits that could be sold to \nentities with liabilities under the carbon pricing mechanism. \nThe carbon price has since been repealed, and the CFI has been expanded to form the Emissions \nReduction Fund (ERF) and now covers all sectors of the economy. The ERF is the central plank of \nthe government’s Direct Action Plan to reduce Australia’s greenhouse gas emissions. It has been \nintroduced through amendments to the Carbon Credits (Carbon Farming Initiative) Act 2011 (Cth), \nwhich brings it within the scope of this review. For simplicity’s sake, this report refers to the CFI as \nthe scheme as originally configured, and the ERF as the scheme as approved by the parliament in \nNovember 2014.  \nUnder the ERF, the government will purchase emissions reductions through auctions (and possibly \nother means). Fixed-price contracts, typically for seven years, will be offered to those who are \nsuccessful at auction. Other changes to streamline the scheme are also being introduced, and a \nsafeguard mechanism (that will discourage large emitters from increasing their emissions above \nhistorical levels) is to commence in July 2016. \nWhile these changes are substantial, the ERF retains an essential characteristic of the CFI in that it \ncredits projects for reducing emissions below a defined baseline, and the baseline reflects what \nwould have been expected to occur in the absence of the scheme. \nThe changes to the CFI are important for this review in two ways. First, as the scheme is being \nexpanded to become the central element of Australia’s policy to reduce emissions and meet its \ntargets, the lessons to be gleaned from its operation to date will be of interest in assessing the likely \nperformance of the ERF. Second, as this review follows closely on the policy development process \nfor the ERF, care has been taken not to duplicate that process, but to focus instead on the extent to \nwhich the design of the ERF addresses problems identified with the CFI, as well as other challenges \nthat may arise. \nPERFORMANCE OF THE CARBON FARMING INITIATIVE TO DATE \nThe CFI follows a set sequence. In essence: \n• A method (also known as a ‘methodology’) setting out rules for undertaking and monitoring \nCFI projects of a particular type is developed and approved. \n• Individuals or firms develop projects to reduce emissions that can be pursued under that \nmethod. \n• The project proceeds and credits are issued for verified emissions reductions—these credits \ncan then be sold. \nWhile the effectiveness of the scheme depends on credits, having a range of methods covering \ndifferent types of activities that have potential to attract projects is an essential building block. The \n \n2       SUMMARY \nfirst methods were approved in June 2012 and the number has since grown to 26. Methods are now \navailable for a range of activities in areas such as agriculture (for example, soil carbon and manure \nmanagement), landfill and waste treatment, reforestation, avoided deforestation and savanna \nburning. \nInitially, most projects that entered the CFI transitioned from other programs, such as the New South \nWales Government’s Greenhouse Gas Reduction Scheme. Over time, the number of projects has \nincreased to 178, and new projects now make up about two-thirds of the total. Just under half of all \nprojects are in landfill and waste treatment, with avoided deforestation, forestry and savanna burning \nprojects making up most of the remainder. Notably, only seven agriculture projects have been \napproved. \nReal emissions reductions have been achieved but they are relatively small \nThe number of credits generated under schemes such as the CFI does not necessarily equate to the \nemissions reductions brought about by the scheme. The number of credits may exceed ‘real’ \nemissions reductions because: \n• the emissions reductions that were measured or estimated did not in fact occur, or occurred to \na lesser extent (measurement risk) \n• the emissions reductions occurred, but would have happened even without the scheme \n(additionality risk) \n• the emissions reductions relate to sequestration that did not persist for the required period \n(permanence risk) \n• the project triggered an increase in emissions outside the project (leakage risk). \nIn the Authority’s view the CFI appears to have achieved a reasonably high level of environmental \nintegrity (i.e. it has brought about real reductions in emissions that would not otherwise have \noccurred). The main area of possible concern, as is usual for schemes of this type, is with \nadditionality. The problem is that it can be virtually impossible for governments, regulators or indeed \nanyone outside the firm concerned, to quantify what would have otherwise happened.  \nThe available evidence suggests that additionality rates for the CFI have been reasonably high. First, \nthe CFI has taken a conservative approach to method development and approval, tending to exclude \nmost activities that are potentially commercially viable in their own right. Second, a considerable \nproportion of CFI projects are for activities that have no commercial driver, and therefore would not \nhave happened without the scheme. Third, robust arrangements appear to be in place to exclude \nactivities that are required under government regulation. \nThat said, some CFI projects potentially had a commercial driver, and the tests applied are not \ncapable of definitively determining whether these are additional: some credits issued are likely to \nhave been non-additional. \nDespite the risks identified earlier, the number of credits issued is likely to be a reasonable indication \nof the emissions reductions the CFI has achieved. As at 3 December 2014, 10.6 million credits had \nbeen issued, with each credit representing one tonne of emissions reductions. This equates to \nemissions reductions of, on average, about 2.5 Mt CO2-e per year, with emissions reductions \nincreasing over time. This is equivalent to about a two per cent reduction in emissions covered by the \nCFI. This annual quantity of emissions reductions is roughly on par with reductions achieved by the \nRenewable Energy Target (RET) in recent years. \n \n \nCARBON FARMING INITIATIVE REVIEW REPORT 3 \nSome costs have been unnecessarily high \nSome emissions reduction policies in Australia have been criticised for being uncoordinated and high \ncost. The CFI is not in this category; abatement costs were capped by expected carbon prices. \nThis does not mean, however, that there was no scope for reductions in costs. The government \ninvested heavily in method development, sometimes in areas that have, at least to date, failed to \nattract projects. While it would be unrealistic to expect the level of interest in running projects of \ndifferent types to always be accurately predicted, more might have been done to better prioritise \nmethod development. Some private expenditure on method development also has been less \ncost-effective than it might have been, because proponents had an incentive to develop narrow \nmethods that were not suitable for use by other firms. \nAt the same time, some costs associated with measurement, verification and reporting appear to \nhave been higher than necessary, with costs not aligned with the risks being managed. \nPROSPECTS FOR IMPROVEMENT UNDER THE EMISSIONS REDUCTION \nFUND \nThe move from the CFI to the ERF created an opportunity to learn from experience with the CFI. \nFollowing extensive consultations throughout 2014, the new scheme was legislated in \nNovember 2014. \nThe Emissions Reduction Fund incorporates some important improvements \nUncertainty about future prices for credits was the single most important factor that discouraged \nparticipation in the CFI. Perhaps the most important improvement under the ERF is that project \nproponents will have the certainty of a fixed-price contract, typically over seven years, and in some \ncases, possibly up to 10 years. This is likely to provide an attractive investment proposition for \nactivities that generate a high proportion of their emissions reductions within the contract period. \nThe ERF also adopts a new approach to method development, which entails: \n• prioritising method development \n• developing methods that have broader applicability and are potentially more consistent in their \napproach to managing risks  \n• introducing facility-based methods (for multiple activities at the one facility) \n• allowing baselines based on emissions intensity (so that reductions in emissions per unit of \nproduction can be credited). \nSome potential downsides also exist, including potentially greater difficulties in managing \nadditionality risks for methods with very broad applicability. Overall, however, in the Authority’s \njudgement the new approach to method development and approval is an improvement; well \nimplemented it is likely to increase participation and reduce transaction costs (on a per tonne CO2-e \nbasis). \nAnother improvement is more flexible reporting. This allows project proponents to weigh up for \nthemselves the cash flow advantages of reporting—and therefore receiving credits—more frequently \nagainst the extra time and cost that might be involved. Risk-based auditing of emissions reductions \nwill also be introduced. The details are yet to be finalised, but, in-principle, a well-designed \nrisk-based audit regime should reduce transaction costs without eroding the environmental integrity \nof the scheme. \n \n4       SUMMARY \nBut it also introduces some new or expanded risks \nUnlike the CFI, which was a comparatively small land-based program, the ERF will operate across all \nsectors of the economy, has a funding commitment of at least $2.55 billion and is being relied upon \nto do a lot of the heavy lifting to meet Australia’s emissions reduction goals. Rapidly expanding the \nscale and scope of the scheme brings significant risks, especially for additionality. \nDeveloping robust methods and credible baselines for many new activities will be challenging, and \nrisks will need to be well managed if additionality rates are not to decline sharply, and/or many \nopportunities to achieve low-cost abatement remain outside the ERF. Good governance \narrangements will be critical, and the Department of the Environment and the Clean Energy \nRegulator are developing the expertise, capacity and consultation mechanisms that will be important \nfor the scheme to perform. The risks escalate for large projects, suggesting that consideration be \ngiven to introducing enhanced additionality tests for projects above a threshold level. \nAnother risk is that the ERF could fail to encourage investments that would achieve low-cost \nabatement over a long period. If contract periods are mostly capped at seven years, projects with \nmuch longer abatement profiles would probably need to rely on an expectation of reasonable prices \nbeyond the contract period. While there are some potential sources of demand for such credits, in \nthe near term at least, price expectations are likely to be both low and uncertain. \nAnd there are some problems that the Emissions Reduction Fund simply cannot address \nSome problems identified with the CFI cannot be fixed under the ERF because they are inherent in \ncrediting-below-a-baseline approaches. Even if the additionality risk is appropriately managed some \nnon-additional emissions reductions will inevitably be credited, and some genuine abatement \nopportunities excluded—for fear they are non-additional, or because they do not lend themselves to \nan activity- or facility-based method. In the process, considerable resources could be devoted to \nmanaging the additionality risk given the complex nature of the task. \nUncertainty has plagued Australian policy on climate change for many years. While the passage of \nthe ERF amendments and the availability of methods and contracts will bring a degree of certainty \nfor some activities over the next few years, the role and budget allocation for the ERF after 2020 is \nunclear. Expectations of longer-term policy stability and predictability will be important in supporting \ninvestments required to help Australia meet its long-term emissions reduction goals.  \nPOLICY INTERACTIONS \nCFI and ERF projects can deliver benefits other than emissions reductions. Sometimes these \nbenefits accrue to the project proponent—as, for example, when a firm installs more energy efficient \nequipment it also saves on energy costs, and when farmers plant trees they might also get shelter \nand soil protection benefits. At other times the benefits accrue more widely, such as the biodiversity \nbenefits of establishing native vegetation on previously cleared land.  \nSome stakeholders have argued that the ERF should pay a higher price for credits from projects with \nsignificant public co-benefits. The government has decided against this approach, and that the ERF \nwill focus on achieving lowest cost emissions reductions. The Authority endorses this approach for \ntwo reasons: \n• paying for co-benefits from the ERF would reduce the capacity of the scheme to reduce \nemissions, which would be at odds with its central role in achieving Australia’s targets  \n• the co-benefits concerned are better assessed and secured through other programs. \nThat said, to achieve the best outcomes the ERF will need to interact efficiently with other policies \nand programs. Projects should in general be able to secure support from both the ERF and other \n \nCARBON FARMING INITIATIVE REVIEW REPORT 5 \nrelevant programs where the programs are paying for different benefits and where this does not \nundermine additionality for the ERF.  \nIn addition to crediting approaches, which underpin the ERF, there are many policy tools available to \nreduce emissions, including regulatory standards and information campaigns. Carbon prices—\nanother tool—have been ruled out by the government. International emissions reduction units may \nalso have a role to play; the Authority has previously recommended they be used to bridge any gap \nbetween domestic reductions and Australia’s targets. Some tools are better suited than others in \nexploiting different emissions reduction opportunities, but the best approach to reducing emissions is \nto have access to the widest possible array of policy measures.  \nTHE EMISSIONS REDUCTION FUND AND EMISSIONS REDUCTION \nTARGETS \nAustralia has a minimum target to reduce emissions by 5 per cent relative to 2000 levels by 2020. \nEarlier this year, the government estimated 421 Mt CO2-e of cumulative abatement would be needed \nover the period 2015-20 to meet this target. Since then, falling electricity demand and other factors \nhave likely reduced the task, with one source recently estimating required abatement over the period \n2015-20 to be as low as 225-279 Mt CO2-e. \nThe government has not released estimates of the reductions it expects to secure through the ERF \nover the period to 2020. Available studies of Australia’s emissions reductions opportunities, and of \nwhat the ERF is likely to achieve with its current funding, however, suggest that the ERF would fall \nwell short of achieving the reductions required to meet Australia’s minimum 2020 target. This \nhighlights the need to strengthen the ERF wherever possible—the planned safeguard mechanism is \nimportant here but that is still in the design stage. \nMore generally, the limitations inherent in ERF-type schemes—together with the obvious budgetary \nlimitations—again highlight the imperative of policy-makers having access to the widest possible \nrange of policy instruments to achieve Australia’s targets for both 2020 and the period beyond.  \nOver the next 18 months the Authority will review Australia’s post-2020 emissions reduction goals, \nand the policies needed to achieve those goals. This review will take particular account of \ninternational action, and the implications for Australia. \n \n \n6       CONCLUSIONS AND RECOMMENDATIONS \nCONCLUSIONS AND RECOMMENDATIONS \nCONCLUSIONS NUMBER PAGE \nThe CFI has achieved about 10 Mt CO2-e of real emissions reductions over the \nlast four years. Its additionality rates seem reasonably high and it takes a \nconservative approach to the measurement of emissions. To date, no specific \nconcerns about permanence or leakage have been identified. \nC 1 25 \nParticipation in, and emissions reductions from, the CFI have been constrained, \nprincipally because policy uncertainty led to low price expectations and a lack of \nconfidence in longer-term returns. Participation has also been affected by gaps in \nmethod coverage and broad exclusions, and relatively high transaction costs. \nC 2 34 \nBy providing a fixed price for up to seven years, the standard ERF contract is likely \nto be attractive to many project proponents—particularly those with projects that \ngenerate a relatively large proportion of emissions reductions in their early years. \nC 3 36 \nChanges to streamline the ERF are likely to result in lower transaction costs than \nfor the CFI, in many cases without adversely affecting emissions reductions. The \nERF approach to method development and approval appears to represent an \nimprovement from the CFI approach, but much will depend on implementation. \nC 4 41 \nGiven uncertain and potentially low prices for credits beyond the ERF contract \nperiod, standard seven-year contracts (and even 10-year contracts) might not \nprovide sufficient incentive for some long-lived investments that deliver abatement \nover an extended period, thereby excluding some low-cost opportunities. \nC 5 42 \nExpansion and streamlining of the ERF are likely to result in additionality rates \ndeclining somewhat. Provided the decline is small and compensated by lower \ntransaction costs and greater participation, this ‘rebalancing’ would constitute an \nimprovement. There is a risk, however, that these changes could cause \nadditionality rates to decline sharply, particularly as the scheme is expanding into \nareas where it is inherently difficult to judge additionality (such as energy \nefficiency). \nC 6 44 \nDomestic and international experience suggests there are inherent limitations and \ncomplexities in crediting emissions reductions. The ERF purchasing scheme will \ninevitably miss some low-cost abatement opportunities because it is not feasible to \ndevise methods and baselines that would credit these opportunities without also \ncrediting many non-additional projects. \nC 7 46 \n \nCARBON FARMING INITIATIVE REVIEW REPORT 7 \nCONCLUSIONS NUMBER PAGE \nGovernance arrangements for the ERF will need to be responsive to unexpected \nproblems and render new projects ineligible should they become non-additional. \nC 8 47 \nThe size of Australia’s abatement task to 2020 is unclear, and it is difficult to \nestimate precisely the amount of emissions reductions the ERF purchasing \nscheme will deliver. It is clear, however, that by itself and as currently funded, the \nscheme is unlikely to deliver sufficient emissions reductions to reach even \nAustralia’s minimum 2020 target of 5 per cent below 2000 levels. A range of \ncomplementary actions will be required, now and beyond 2020. \nC 9 61 \n \nRECOMMENDATIONS NUMBER PAGE \nThe Department of the Environment, in consultation with the Clean Energy \nRegulator and other stakeholders, should consider introducing enhanced \nadditionality tests for individual projects that generate a large volume of credits \nunder the ERF, with particular regard to the financial viability of the project in the \nabsence of ERF support. \nR.1 45 \nThe ongoing appropriateness of the ERF for achieving emissions reductions in \nparticular situations should be monitored and subject to independent and periodic \nreview. \nR.2 52 \n \n \n8 CHAPTER 1 \nCHAPTER 1. INTRODUCTION \nThis chapter introduces the review and provides an overview of the Carbon Farming Initiative (CFI) \nand Emissions Reduction Fund (ERF). It also outlines the criteria the Climate Change Authority (the \nAuthority) has used to assess the performance of the scheme and introduces the concept of \nadditionality, which plays a central role in the operations of the CFI and ERF. \n1.1. ABOUT THIS REVIEW \nThe Authority is an independent statutory agency, established to provide expert advice on Australian \nclimate change policy. The Authority is required by the Carbon Credits (Carbon Farming Initiative) \nAct 2011 (Cth) to review the CFI every three years; this is its first review. \nUncertainty about the future of the Authority, together with staffing and other constraints, has led to \nthe review being conducted over a short timeframe. Reflecting this, the review is not comprehensive \nbut concentrates on what the Authority considers to be the some of the more significant issues. The \nreview considers: \n• performance of the CFI to date \n• prospects for improving on that performance in the newly introduced ERF \n• interactions between the CFI/ERF and other policies \n• the role of the scheme in meeting Australia’s greenhouse gas emissions targets. \nThe Authority recognises that the CFI is a relatively new scheme (with three years of operation) that \nhas recently morphed into the ERF. This is a relatively short period on which to assess the \nperformance of the scheme. \nDuring the course of the review, the Authority has engaged with a range of stakeholders across \nvarious sectors. An issues paper was released on 17 October 2014; this generated 17 submissions. \nThe Authority met directly with 20 individual stakeholders and held a roundtable meeting on \n25 November 2014, at which some preliminary conclusions were tested. Some stakeholders raised \nissues that the Authority has not been able to examine in this review; some of these are noted in this \nreport. Further details on consultations are included in Appendix A. \nGiven the competitive nature of the CFI market, some of the Authority’s discussions with \nstakeholders were conducted on a confidential basis; where relevant this confidentiality has been \nrespected in this report. \nThe Authority has had regard to the legislation passed recently to amend the CFI Act to form the \nERF, as well as to the extensive consultations (including public submissions on the ERF green \npaper) leading up to the legislative change. The Authority has also drawn on its own previous \nconsultations and research reports; in particular, the April 2014 study Coverage, Additionality and \nBaselines—Lessons from the Carbon Farming Initiative and Other Schemes. \n1.2. OVERVIEW OF THE CARBON FARMING INITIATIVE AND \nEMISSIONS REDUCTION FUND \nThe CFI was originally designed as a ‘carbon offset’ scheme to complement the carbon pricing \nmechanism. The carbon pricing mechanism has since been repealed, and the CFI has been \n \nCARBON FARMING INITIATIVE REVIEW REPORT 9 \ntransformed into the ERF, which is now the central element of the government’s Direct Action Plan to \nreduce Australia’s greenhouse gas emissions.  \nThe ERF has been introduced through amendments to the CFI Act, so the CFI could be said to \ncontinue. In the interests of simplicity, however, in this report references to the CFI are to the scheme \nas originally configured, while the ERF refers to the scheme as approved by the parliament in \nNovember 2014. This approach is consistent with the white paper on the ERF, which states that the \n‘Carbon Farming Initiative will be folded into the Emissions Reduction Fund so there is one \nprogramme’ (Commonwealth of Australia 2014, p. 58).  \n1.2.1. THE CARBON FARMING INITIATIVE AS ORIGINALLY CONFIGURED \nThe CFI, which commenced operation in December 2011, was a voluntary project-based initiative \nthat provided incentives for individuals and organisations to sequester carbon and avoid or reduce \ngreenhouse gas emissions. The CFI focused on sectors that were not covered by the carbon pricing \nmechanism, namely: agriculture; legacy waste (that is, emissions from waste deposited before the \nintroduction of the carbon pricing mechanism); and land use, land use change and forestry \n(Figure 1). Firms in the sectors covered by the carbon pricing mechanism (such as electricity \ngeneration and industrial processes) could buy credits from CFI projects and use these to ‘offset’ \ntheir carbon price liability. In this way, the CFI extended the reach of the carbon price to a wider set \nof activities across the Australian economy.  \nFIGURE 1: THE CARBON FARMING INITIATIVE IN THE BROADER POLICY CONTEXT \n \nNote: Green boxes are policy elements that are not part of the CFI and are not involved in the purchase of credits. \nSource: Climate Change Authority \nThe CFI created incentives by crediting projects for achieving emissions reductions below a defined \nbaseline (essentially ‘business-as-usual’ levels). To be accepted into the CFI, projects were required \nto meet a range of criteria, including that they could be conducted under an approved method or \n‘methodology’. Project proponents were issued with credits, known as Australian carbon credit units \n(ACCUs), for verified emissions reductions, and these could be sold to entities with liabilities under \nthe carbon pricing mechanism. This opportunity exists until 2 February 2015, which is the deadline \n \n10 CHAPTER 1 \nfor the final surrender period of the carbon pricing mechanism (CER 2014). The CFI process is \nsummarised in Figure 2 and discussed further in Chapter 2. \nFIGURE 2: OVERVIEW OF THE CFI PROCESS \n \nSource: Climate Change Authority based on DCCEE (2012) \nThe Land Sector Package was announced at the same time as the CFI, in July 2011. It was \ndesigned to improve the resilience of Australia’s flora and fauna to the impacts of climate change and \nenhance the environmental outcomes of carbon farming projects. Some parts of the package \nfacilitated participation in the CFI; for example, $20 million was allocated under Carbon Farming \nFutures to convert research into practical CFI methods (Commonwealth of Australia 2011, p. 95). A \n$22 million Indigenous Carbon Farming Fund was also established to assist Indigenous communities \nbenefit from the CFI (Commonwealth of Australia 2011, p. 97).  \n1.2.2. THE SCHEME IN ITS NEW FORM AS THE EMISSIONS REDUCTION FUND \nAmendments made recently to the CFI Act established the ERF. The amendments retain some of \nthe main features of the original scheme, while substantially altering or expanding others (Figure 3). \nThe amendments also require the development of a ‘safeguard mechanism’, to commence on \n1 July 2016. In developing the ERF the government has sought to build upon lessons learnt under \nthe CFI. \n  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 11 \n \nFIGURE 3: THE EMISSIONS REDUCTION FUND IN THE BROADER POLICY CONTEXT\n \nNote: Green box shows policy elements that are not part of the ERF and are not involved in the purchase of credits. \nSource: Climate Change Authority \nThe main changes under the ERF are: \n• Coverage has been expanded to allow all sectors of the economy to participate (whereas the \nCFI covered sectors that account for about 20 per cent of Australia’s emissions). \n• The government will be the main purchaser of credits (whereas under the CFI credits were \nsold mainly to liable entities under the carbon pricing mechanism).  \n• The processes for developing methods, approving projects and crediting emissions reductions \nhave been ‘streamlined’. \n• A safeguard (penalty) mechanism will operate from 1 July 2016.  \nThe government has committed $2.55 billion for purchasing credits, with further funding to be \nconsidered in future budgets (Commonwealth of Australia 2014). Credits will be purchased through \nauctions (and potentially also through other means) and the government will enter into contracts with \nsuccessful bidders. The standard contract period will be seven years, with longer contracts possible \nin some circumstances. A new set of draft rules proposes that longer contracts not exceed 10 years’ \nduration (DOE 2014a). Some private sales may occur through the voluntary market, make-good \nprovisions (under which ERF project proponents buy credits to make up for shortfalls in contracted \nquantities) and, possibly in the future, to entities with liabilities under the safeguard mechanism. The \nERF process is summarised in Figure 4. \nThe purpose of the safeguard mechanism is to ensure that emissions reductions paid for through the \nERF are not offset by increases in emissions elsewhere in the economy (Commonwealth of Australia \n2014, p. 51). While the mechanism is under development, the government has indicated it will:  \n• apply to facilities with direct emissions over 100,000 tonnes per year (covering about \n52 per cent of Australia’s emissions) \n \n12 CHAPTER 1 \n• use baselines that reflect the highest level of reported emissions for a facility over the period \n2009-10 to 2013-14 (DOE 2014b). \nExisting CFI projects will automatically be registered under the ERF and projects will receive a new \ncrediting period starting from the commencement of the scheme. Registered projects will have the \noption to continue to use the version of the method in force when the project was approved, or \nproponents may apply to use another applicable method. CFI project proponents will be able to \nparticipate in an auction run by the Clean Energy Regulator (CER) (DOE 2014c). \nFIGURE 4: OVERVIEW OF THE ERF PROCESS \n \nSource: Climate Change Authority based on Commonwealth of Australia (2014) \nGovernance arrangements for the ERF are different in some respects from those that applied to the \nCFI (Figure 5). The government has stated that it will review operational elements of the ERF \ntowards the end of 2015 (Commonwealth of Australia 2014). \n  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 13 \nFIGURE 5: OVERVIEW OF GOVERNANCE ARRANGEMENTS \n \nSource: Climate Change Authority \n1.3. CRITERIA FOR ASSESSING PERFORMANCE \nThe Authority’s work is guided by the principles set out in the Climate Change Authority Act 2011 \n(Cth). These include that measures to respond to climate change should: \n• be economically efficient, environmentally effective, equitable and in the public interest \n• support the development of an effective global response to climate change, and be consistent \nwith Australia’s foreign policy and trade objectives \n• take account of the impact on households, businesses, workers and communities. \nThe Authority has assessed the CFI (in its old and new forms) against both these guiding principles, \nand the objects of the CFI Act, which are to: \n• implement some of Australia’s obligations under the United Nations Framework Convention on \nClimate Change (UNFCCC) and the Kyoto Protocol to that convention  \n• create incentives for people to carry on offset projects \n• reduce greenhouse gas emissions in a way that protects Australia’s natural environment and \nimproves resilience to the effects of climate change. \nThe Authority’s view is that the most important criteria for this review are environmental effectiveness \n(i.e. generating additional reductions in emissions) and economic efficiency (i.e. and doing so in \ncost-effective ways relative to alternative approaches). Other criteria have been referred to where \nrelevant. \nThe scheme’s environmental effectiveness is a function of the quantity of real (that is, accurately \nmeasured, and ‘permanent’) emissions reductions it brings about. This means that effectiveness can \n \n14 CHAPTER 1 \nbe measured in tonnes of carbon dioxide equivalent greenhouse gases (CO2-e). To help interpret the \nsignificance of the emissions reductions achieved, this review compares the scheme’s impact with \nrelevant benchmarks, such as the emissions reductions achieved by other policies. Interim \nindicators, such as the number of methods developed and approved, and number of projects \nestablished are also useful, particularly for what is a relatively new scheme. \nThe emissions reductions achieved by the scheme depend on the level of participation and the \nenvironmental integrity of the scheme. Environmental integrity would be eroded if the scheme were \nto issue credits for emissions reductions that: \n• were measured or estimated, but did not in fact occur, or occurred to a lesser extent \n(measurement risk) \n• occurred, but would have happened even without the scheme (additionality risk) \n• relate to sequestration that did not persist for the required period (permanence risk) \n• triggered an increase in emissions outside the project (leakage risk). \nThe environmental effectiveness of the scheme determines its contribution to meeting Australia’s \nemissions reduction targets, and therefore its international commitments. This contribution is of direct \nrelevance to the performance of the CFI and ERF, given the CFI Act object relating to Australia’s \nobligations under the UNFCCC. It is particularly important now, given that the ERF is the centrepiece \nof the government’s plan to reduce Australia’s emissions.  \nEstimating the costs of dangerous climate change is a notoriously difficult task, but it is one that is \nunnecessary in a review such as this. Australia has set emissions reduction targets, and implicit in \nthis is an acceptance that the benefits of achieving those targets will outweigh the costs involved. \nThis means that assessing the economic efficiency of the CFI and ERF schemes predominately \nrelates to the cost to the community per tonne of emissions reductions brought about through the \nschemes. \nIn making this assessment a broad concept of cost should be adopted, factoring in: \n• direct project costs—for example, costs associated with planting trees, maintaining them and \nforgoing the income that could have come from using the land for agricultural production \n• transaction costs borne by project proponents—including the time and expense in contributing \nto method development, developing projects, and reporting and verifying emissions reductions \n• transaction costs borne by the government—including for developing policy and methods, and \nadministering the scheme. \nWhere any of these costs is higher than necessary there is at least some degree of inefficiency. \nTherefore, in this review assessments are made on the extent to which there are opportunities to \nreduce costs without reducing environmental integrity. \n1.4. THE IMPORTANCE OF ADDITIONALITY \nThe CFI and ERF are specific examples of a broad type of policy called ‘baseline and credit \nschemes’. These schemes take many different forms, but they all share some basic features, \nincluding setting a baseline, and issuing credits when the outcome is better than the baseline. \nAustralia has implemented a range of baseline and credit schemes at the state and national level, \nincluding the Renewable Energy Target (RET), the New South Wales Greenhouse Gas Reduction \nScheme (GGAS) and the New South Wales Energy Savings Scheme (ESS).  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 15 \nA key challenge in baseline and credit schemes is to set the baseline at a level that ensures credits \nare only issued for ‘additional’ emissions reductions—that is, reductions that would not have \noccurred but for the scheme. If the emissions reductions would have occurred anyway (that is, under \nbusiness-as-usual), they do not contribute to the environmental effectiveness of the scheme. \nMoreover, where this occurs, all transaction costs associated with participation in the scheme are a \nwaste of the community’s resources. Additionality is therefore central to the environmental \neffectiveness of baseline and credit schemes (CCA 2014; PC 2008; World Bank 2010). \nIt is possible for all or only some of the credits issued to a project to be non-additional. The former \noccurs where the project being credited would have taken place without the scheme. The latter \noccurs where the project would not have proceeded, but the baseline set is above business-as-\nusual. An example of the latter is where a firm upgrades to more energy efficient equipment and the \nbaseline is set based on the emissions associated with the old equipment, when business-as-usual \nbehaviour would have seen it upgraded in two or three years’ time.  \nExperience in Australia and elsewhere indicates that non-additional credits can substantially reduce \na scheme’s effectiveness: \n• One study estimated that 70 per cent or more of credits under the New South Wales GGAS \nscheme were likely to relate to non-additional emissions reductions over the life of the scheme \n(MacGill et al. 2005). \n• A recent review of the Victorian Energy Efficiency Target scheme estimated that only 8 million \ntonnes of emissions reductions could be attributed to the 16.7 million certificates created. Both \nnon-additional credits and measurement problems contributed to this discrepancy \n(DSDBI 2014). \nAdditionality tends to be harder to assess for projects that offer low-cost emissions reductions. If a \nfirm is proposing to undertake an activity that is rarely undertaken in its sector, and is (without \nscheme support) clearly commercially inferior to alternatives, additionality can be self-evident. In \ncontrast, if a firm proposes an activity that is only slightly commercially inferior to an alternative with \nhigher emissions, it can be all but impossible to independently verify that the activity is additional.  \nThere is no easy answer to how to deal with additionality issues under a baseline and credit scheme. \nA wide range of approaches has been developed and used, including considering regulatory \nrequirements, common practices in the industry and the individual project’s finances. Stringent \nadditionality tests can be costly and can exclude some projects that were actually additional, while a \nmore relaxed approach can impair the integrity (and therefore effectiveness) of the scheme. The best \napproach is to try to strike a reasonable balance between the costs involved in assessing \nadditionality and those resulting from incorrect assessments. \n \n \n16 CHAPTER 2 \nCHAPTER 2. PERFORMANCE OF THE \nCARBON FARMING INITIATIVE \nThis chapter assesses the performance of the CFI to date—that is, before its expansion into the \nERF. Section 2.1 documents progress that was made in developing methods, attracting projects and \ngenerating credits. Sections 2.2 to 2.4 examine particular aspects of performance relating to the \nemissions reductions achieved and the costs of the scheme. Section 2.5 identifies the main factors \nthat limited participation in the CFI. \n2.1. METHODS, PROJECTS AND CREDITS \nCFI methods, projects and credits sat within a legislative framework governed by the CFI Act. The \nframework involved a number of elements, as follows. \n• Legislation and regulations—specified the coverage and governing principles for the \nscheme. These principles helped ensure environmental integrity by requiring that:  \n- emissions reductions are measurable and verifiable \n- measurement methods are supported by peer-reviewed science and are not inconsistent \nwith Australia’s international greenhouse gas emissions accounts \n- measurement methods account for leakage and variability, and use conservative \nassumptions \n- emissions reductions are additional to what would occur in the absence of the project \n- carbon sequestration is permanent (carbon stocks maintained on average for at least a \n100-year period) \n- projects avoid negative social or environmental consequences, including impacts on water \navailability, biodiversity conservation, employment and other values. \n• Positive list—specified eligible activities under the CFI. This was a list of activities that were \nnot common practice in an industry and were therefore considered to generate additional \nemissions reductions. \n• Methods (or ‘methodologies’)—rules for undertaking and monitoring a project and \ngenerating credits. A method was required for each kind of activity that could be credited \nunder the scheme and was required to contain: \n- a list of emissions sources and sinks affected by the project \n- monitoring, verification and reporting requirements \n- instructions for determining a baseline that represents what would occur in the absence of \nthe project \n- procedures for measuring or estimating emissions reductions or sequestration relative to the \nbaseline. \n• Projects—activities that reduce emissions to gain credits. To be approved, a project was \nrequired to be covered by a method and implement an activity that was both included on the \npositive list, and was not on the ‘negative list’ (a list of activities that pose unacceptable risks \nto water, biodiversity, and so on). To undertake a CFI project, a person was required to \nbecome a ‘recognised offsets entity’.  \n• Crediting—after emissions reductions or sequestration from approved projects were verified, \nACCUs were issued by the CER. All ACCUs can be traded or sold in Australia. Prior to CFI \nAct amendments implementing the ERF, ACCUs could be converted into Kyoto units for \nexport, on request. It appears this option was never used. \n \nCARBON FARMING INITIATIVE REVIEW REPORT 17 \n2.1.1. AVAILABLE METHODS  \nA project was only able to participate in the CFI if it was covered by an approved method. The range \nof CFI methods therefore indicates the scope of activities that could participate.  \nMethod proposals were developed by the Australian Government or industry participants. The \nDomestic Offsets Integrity Committee (DOIC) considered each proposal and either endorsed or did \nnot endorse it on the basis of legislated criteria, including the ‘offsets integrity standards’. These \nstandards were designed to ensure that credits issued under CFI methods represented real and \nadditional emissions reductions.  \nThe Minister considered endorsed methods and could approve them by making a methodology \ndetermination, which is a legislative instrument under the CFI Act. All CFI methods that were \nendorsed by the DOIC were approved by the Minster.  \nIn all, 26 CFI methodology determinations were made and eight method proposals were considered \nby the DOIC but not endorsed (Table 1), while one CFI method was varied. The majority of \nmethodology determinations were for activities in the forests and waste sectors. Savanna burning \nand some agriculture activities (such as livestock manure management) were also covered by \nmethodology determinations. \nTABLE 1: METHODOLOGY DETERMINATIONS MADE AND PROPOSALS NOT ENDORSED, BY ACTIVITY \nACTIVITY \nMETHODOLOGY \nDETERMINATIONS \nMADE \nMETHODOLOGY \nPROPOSALS NOT \nENDORSED \nMethane in piggeries 3 1 \nLivestock feed additives 2 2 \nDairy manure management 1 – \nSoil carbon 1 – \nFeral camel culling – 1 \nManaged grazing systems – 1 \nAlternative fertiliser products – 1 \nReforestation and other forestry activities  10 1 \nAvoided deforestation 1 1 \nSavanna burning 2 – \nLandfill and waste treatment 6 – \nTotal 26 8 \nNote: Data current as at 3 December 2014. \nSource: Climate Change Authority based on DOE (2014a, 2014b) \n  \n \n18 CHAPTER 2 \nThe CFI Act commenced in December 2011 and the first methodology determinations were made in \nJune 2012. Since then, methods have become available for an expanding range of activities \n(Figure 6). Most CFI methods (20 of 26) were made by July 2013. \nFIGURE 6: METHODOLOGY DETERMINATIONS, BY SECTOR \n \nNote: Figure shows total CFI methods available at the end of the month specified. Data current as at 3 December 2014. ‘Forests’ \nrefers to reforestation, avoided deforestation and other forest activities. \nSource: Climate Change Authority, based on dates on which determinations were made \nThe DOIC refused to endorse method proposals that did not meet the offsets integrity standards or \nother legislated criteria. For example, a proposed avoided deforestation method was refused partly \nbecause some activities potentially within its scope were not covered by the additionality test \nregulations (the positive list) (DOIC 2013a, p. 2). A proposal for a method to establish agribelt forests \nwas refused endorsement partly because it did not provide adequate instructions for establishing \nproject baselines (DOIC 2013b, p. 1).  \nIn general, the greater the number of methods, the greater the range of activities that could be \naccommodated within the CFI. However, this was not always the case, because: \n• Methods could have broad or narrow applicability within a sector. For example: \n- the ‘Savanna burning 1.1’ method applies broadly across savanna areas in northern \nAustralia that receive more than 1000 millimetres long-term average annual rainfall \n- a method covering projects that divert construction and industrial waste from landfill and use \nit to manufacture fuel (‘Diverting waste from landfill for process engineered fuel \nmanufacture’) is only applicable to previous Greenhouse Friendly projects and only has one \nregistered project. \n• Some sectors had multiple methods for distinct activities (for example, within the forests sector \nthere is one avoided deforestation method, two methods for human-induced regeneration of \nnative vegetation and a number of methods for the planting of forests). Some activities had \nmultiple methods using distinct approaches to measuring or estimating the emissions \nreductions achieved (for example, there are three reforestation and afforestation methods, \neach with slightly different rules for measuring the quantity of carbon sequestered). \n• A small number of methods were revisions of previous methods. \n \nCARBON FARMING INITIATIVE REVIEW REPORT 19 \nGaps in the coverage of approved methods meant the CFI did not in practice encourage all ‘eligible’ \nemissions reduction activities. For example, commercial forestry and early finishing of beef cattle are \nactivities with potential to reduce emissions but no approved methods. Section 2.5 examines gaps in \nmethods.  \n2.1.2. PROJECT UPTAKE  \nOne object of the CFI Act is to create incentives for offsets projects. The number of projects is an \nindicator of how successful the CFI has been in meeting this objective. \nThere were 178 CFI projects as at 3 December 2014. Just under half of these (46 per cent) were \nlandfill and waste treatment projects, 19 per cent were avoided deforestation projects, and \n19 per cent were other types of forest projects. Savanna burning projects (13 per cent) and \nagriculture projects (four per cent) made up the remainder.  \nFigures 7 and 8 show there has been a slow but steady ramp-up of projects since the first method \nwas made in 2012. Landfill and waste treatment projects dominated initially, but over time \nparticipation in other sectors increased, particularly for forest activities. \nFIGURE 7: PROJECT ENTRY, BY SECTOR \n \nNote: ‘Current projects’ percentages do not add to 100 due to rounding. Data current as at 3 December 2014. \nSource: Climate Change Authority based on CER (2014a) \nProject types covered by an approved method were allowed to transition into the CFI from \npre-existing state and Commonwealth offsets schemes; for example the New South Wales \nGovernment’s GGAS. About a third of all projects that have entered the CFI have transitioned from \npre-existing schemes (Figure 8). These ‘transition projects’ dominated the early CFI period, but their \nentry has slowed considerably since mid-2013, likely because most projects that were eligible to \ntransition had already done so. \n \n20 CHAPTER 2 \nFIGURE 8: PROJECT ENTRY—NEW AND TRANSITION PROJECTS \n \nNote: Data current as at 3 December 2014. \nSource: Climate Change Authority, based on Clean Energy Regulator data \n2.1.3. CREDITS ISSUED \nThe number of credits issued is a key indicator of the CFI’s environmental effectiveness (as \ndiscussed later, the environmental integrity of credits also needs to be taken into account).  \nAs at 3 December 2014, 10.6 million ACCUs had been issued. Credit issuance has increased \nsharply in recent months. This is likely to be because CFI project proponents wish to sell credits to \nentities liable under the carbon pricing mechanism before the final surrender deadline on \n2 February 2015. As at 3 December 2014, 61 per cent of credits have been for landfill and waste \ntreatment projects, and 29 per cent have been for avoided deforestation projects. Reforestation and \nother forestry projects account for five per cent of credits; however, these are likely to generate \nincreasing amounts of credits over time because forest growth generally accelerates five to 10 years \nafter planting. Savanna burning projects (four per cent) and agriculture projects (one per cent) make \nup the remainder (Figure 9).  \n  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 21 \nFIGURE 9: CUMULATIVE CREDITING, BY SECTOR \n-  \nNote: Data current as at 3 December 2014. \nSource: Climate Change Authority, based on Clean Energy Regulator data \nThe proportion of credits issued to new projects has increased over time; however, more than half of \nall CFI credits have been issued to transition projects (Figure 10). \nFIGURE 10: CUMULATIVE CREDITING—NEW AND TRANSITION PROJECTS \n \nNote: Data current as at 3 December 2014. \nSource: Climate Change Authority, based on Clean Energy Regulator data \nAs noted in section 2.1.1, government and industry could develop a method for DOIC approval. At \n3 December 2014, 69 per cent of all projects and 64 per cent of total issued credits were under \ngovernment-led methods (Figure 11). This result is heavily influenced by the fact that the \n \n22 CHAPTER 2 \ngovernment-led method for capture and combustion of landfill gas accounted for 38 per cent of total \nprojects and 56 per cent of total credits. The most significant industry-led method is for avoided \ndeforestation, which accounted for 19 per cent of total projects and 29 per cent of total credits.  \nFIGURE 11: PROJECT AND CREDITING PROPORTIONS TO DATE, BY LEAD DEVELOPER \n \nNote: Data current as at 3 December 2014. \nSource: Climate Change Authority based on DOE (2014a) and CER (2014a) \n2.2. ENVIRONMENTAL INTEGRITY  \nThe CFI’s environmental effectiveness is determined by the quantity of additional and accurately \nmeasured emissions reductions that are permanent and not diminished by leakage.  \n2.2.1. ADDITIONALITY  \nFor a CFI project to qualify as additional it must initially fulfil two requirements: \n• The law must not require the activity (‘regulatory additionality’). \n• The activity must be on the positive list, which identifies a broad set of abatement activities \nthat are not ‘common practice’ in an industry or region (‘common practice test’).  \nMethods could not be approved unless the projects covered by the method passed these tests. \nThese tests were also applied at the individual project level before project approval. \nThe CFI established robust arrangements to prevent activities that were required under government \nregulation from being accepted into the CFI. The Authority has not found any evidence that the \nregulatory additionality test was not applied appropriately (although, as discussed later, some \ntransition projects were exempted from this test). \nSimilarly, the DOIC clearly considered common practice when advising the Minister that activities \nshould be included on the positive list. For example, its advice to include farm forestry plantations \nprovided evidence that this activity has low adoption rates (DOIC 2012d). Where the DOIC has \nadvised against inclusion, it was generally because an activity was already common practice (for \nexample, the diversion of mixed organic waste by the electricity generation industry: DOIC 2014) or \n \nCARBON FARMING INITIATIVE REVIEW REPORT 23 \nbecause there was insufficient evidence that the activity could reduce emissions or of the conditions \nunder which it could reduce emissions (for example, applying organic fertilisers to soil: DOIC 2013c).  \nThe DOIC also applied the common practice test in considering methods, even when the project \nactivity was already on the positive list. For example, while livestock feeding supplements appear on \nthe positive list, the DOIC refused to endorse two methods for livestock feed additives, partly \nbecause some of the supplements were already commonly used (DOIC 2012a and 2012c).  \nWhile the CFI has applied these requirements rigorously, a broader question arises—do these tests \nprovide a good assurance of additionality? Some baseline and credit schemes, such as the Clean \nDevelopment Mechanism, apply a detailed ‘financial additionality’ test at the project level. This \nassesses ‘the investment environment, business operations and motivations of the project provider \nor investor to determine their likely actions in the absence of the scheme incentive’ (CCA 2014a, \np. 31), which can provide a greater assurance that emissions reductions are really additional.  \nThe CFI did not apply a project-level financial additionality test. This was a deliberate design choice \nto avoid the high transaction costs associated with project-level assessments (Macintosh 2012). The \ncommon practice test could be seen as a rough proxy for financial additionality (applied at the \nactivity-wide rather than project-specific level). In practice, it appears to have delivered reasonable \nresults.  \nIt is clear that a significant proportion of CFI projects are financially additional. These projects have \nno apparent financial driver that would have made them attractive without the scheme. These include \nflaring of landfill gas, savanna burning, environmental tree planting and livestock manure \nmanagement. \nOther projects may not be financially additional. For example, in some cases land clearing involves \ncosts that exceed the returns from grazing or cropping on the cleared land. Accordingly, leaving the \nforest intact may be the best option from a commercial perspective. The CFI sought to exclude such \nnon-additional avoided deforestation projects by limiting participation to landowners who had \nobtained a permit to clear before July 2010. While this would undoubtedly have excluded many \nnon-additional projects, it is unlikely to have excluded them all. Some landowners could have \nobtained clearing permits for an area greater than what they actually intended to clear in order to \nretain some flexibility; others may have intended to exercise the permit but then found the returns \nfrom clearing did not justify the expense. Both categories of landowners would be in a position to put \nforward non-additional projects that could pass the CFI additionality test. \nThe Authority does not have any specific evidence that this has occurred. Nevertheless, the example \nhighlights the possibility that some CFI credits may not represent additional emissions reductions. \nAdditionality arrangements for transition projects were designed to ensure that a project was \nadditional at the time it commenced, not the time it entered the CFI. This is appropriate; when policy \nsettings change it is generally desirable not to penalise firms that made investments based on a \nreasonable expectation of the policy continuing.  \nIt is likely, however, that transition arrangements have resulted in some non-additional emissions \nreductions. This is because some landfill transition projects were exempt from the regulatory \nadditionality test and applied a baseline representing a default methane capture rate, which was \nzero per cent for previous Greenhouse Friendly projects and 24 per cent for GGAS projects \n(DIICCSRTE 2013). Landfills are now usually subject to at least some methane capture \nrequirements, and many non-transition landfills are likely to have a regulatory baseline of at least \n30 per cent (CER 2013). Greenhouse Friendly began in 2001; thus, the additionality of some project \ntypes, including baseline requirements, may not been have re-assessed for over a decade.  \n \n24 CHAPTER 2 \n2.2.2. MEASUREMENT  \nCFI methods use different approaches to calculate emissions reductions achieved. Some methods \ninvolve direct measurement of emissions reductions (for example, the reforestation and afforestation \nmethods require project proponents to sample and measure the trees they have planted). Others \nestimate reductions using a model (for example, the ‘Savanna Burning 1.1’ method uses a tool called \nSavBAT to estimate emissions reductions from changes in burning practices). \nSeveral sources of evidence suggest that the CFI’s measurement practices resulted in conservative \nlevels of crediting. \nFirst, stakeholders consulted for this review generally reported that measurement practices were \nrigorous and/or conservative. Indeed, some stakeholders criticised measurement requirements for \nbeing overly rigorous or conservative, noting this could deter participation. These claims were made \nby both project proponents and others who had no commercial interest in CFI projects. \nSecond, academic analysis has concluded that the CFI used conservative measurement \napproaches. Macintosh (2012, p. 16) discusses analysis finding that FullCAM, the model used to \nestimate sequestration from some reforestation projects, could underestimate the sequestration that \nsome projects actually achieve. Although its estimations are conservative, FullCAM is also used in \nthe calculation of Australia’s national greenhouse gas inventory. Therefore its use ensures \nconsistency between CFI methods and the inventory, a requirement of the offsets integrity standards. \nThird, there are examples of the DOIC refusing to endorse method proposals for reasons related to \nscientific measurement of emissions and sequestration. For example, it refused to endorse a method \nproposal for managing feral camel populations partly because there was not enough evidence that \nthe estimates, projections or assumptions used to calculate emissions reductions were conservative \n(DOIC 2012b).  \nTherefore, it seems likely that emissions measurements underpinning credit issue have been \nsomewhat conservative. \n2.2.3. PERMANENCE  \nThe CFI legislation contains permanence arrangements so that if sequestered carbon is released \nwithin 100 years (for example, through fire), project proponents are obliged to either restore carbon \nstocks or hand back credits. A five per cent risk of reversal buffer adjusts for the carbon that is \ntemporarily lost before carbon stocks are restored and for carbon losses due to wrongdoing by the \nproject proponent that are unable to be restored. \nThe Authority has not identified any specific problems with the permanence arrangements. Given \nthat these arrangements manage the effects of events that might only occur infrequently, such as \ndrought or fire, it is too early in the scheme to judge whether they will continue to work smoothly or \nwhether the five per cent risk of reversal buffer is set at the right level. The risk of reversal buffer \nshould be monitored carefully in future reviews. \n2.2.4. LEAKAGE  \nThe CFI Act provides that methods can include a leakage deduction (paragraph 133(1)(e)). This \nwould adjust crediting to account for increases in emissions that were caused by a CFI project but \noccur outside the project’s greenhouse gas assessment boundary. \nNo CFI methods included a leakage deduction. Leakage can be influenced by commodity markets, \nand can occur at different spatial scales and over time, so it is hard to estimate. This review has not \n \nCARBON FARMING INITIATIVE REVIEW REPORT 25 \nhad time to examine the effects of projects on emissions outside their accounting boundaries. This is \nan issue that could be explored in future reviews. \n2.3. SCALE OF EMISSIONS REDUCTIONS  \nThe total emissions reductions achieved by the CFI is the ultimate measure of the scheme’s \nenvironmental effectiveness.  \nCFI credits have been issued for 10.6 Mt CO2-e of emissions reductions (as at 3 December 2014). \nAlthough the CFI commenced in late 2011, some of these reductions occurred as early as \n1 July 2010, because some projects were allowed to receive backdated credits.  \nThe number of credits does not necessarily equate to the scheme’s actual emissions reductions. \nWhere non-additional projects are credited, actual emissions reductions would be less than the \nnumber of credits. On the other hand, credits are only issued after emissions reductions are reported \nand verified, so the scheme will have achieved some emissions reductions that are not reflected in \ncurrent credit numbers. \nConsidering these factors, and given that the CFI appears to have operated with a reasonably high \ndegree of environmental integrity, the CFI has likely achieved about 10 Mt CO2-e of emissions \nreductions in total or, on average, about 2.5 Mt CO2-e per year (with more emissions reductions in \nlater years than in earlier years). \nThe CFI specifically aimed to contribute to meeting Australia’s international commitments under the \nKyoto Protocol and UNFCCC. All CFI emissions reductions have counted towards Australia’s Kyoto \nProtocol commitments, because even though the scheme covered ‘non-Kyoto’ activities, no methods \nwere approved for these activities.  \n \nThe remainder of this section compares the emissions reductions achieved by the CFI with \nemissions in the sectors covered by the scheme and with emissions reductions achieved by other \npolicies. \n2.3.1. REDUCTIONS AS A SHARE OF SECTORAL EMISSIONS  \nThe land management and waste sectors were estimated to have emissions of about 110 Mt CO2-e \nin 2012 (or about 20 per cent of Australia’s total emissions in that year) (Table 2). \nCONCLUSION \nC 1. The CFI has achieved about 10 Mt CO2-e of real emissions reductions over the last four \nyears. Its additionality rates seem reasonably high and it takes a conservative approach \nto the measurement of emissions. To date, no specific concerns about permanence or \nleakage have been identified. \n \n26 CHAPTER 2 \nTABLE 2: ESTIMATED EMISSIONS IN SECTORS COVERED BY THE CFI—2011 AND 2012 \nEMISSIONS SECTOR 2011 EMISSIONS \n(Mt CO2-e) \n2012 \nEMISSIONS \n(Mt CO2-e) \nCHANGE  \n(Mt CO2-e) \nAgriculture 84.6 87.4 2.8 \nWaste 12.9 11.7 –1.2 \nLULUCF—deforestation 38.5 32.8 –5.7 \nLULUCF—afforestation and reforestation –26.4 –21.9 4.5 \nCFI sectors—total 109.6 110 0.4 \nNational Inventory Report total (excluding Kyoto Protocol Article \n3.4 activities) 553.6 554.6 1.0 \nCFI sectors—% of National Inventory Report total 19.8 19.8 \n \nNotes: Negative numbers for afforestation and reforestation represent sequestration. The National Inventory Report total does not \ninclude emissions and removals from activities accounted for under Article 3.4 of the Kyoto Protocol (forest management, \ncropland management, grazing land management and revegetation). Savanna burning emissions are part of the agriculture \ncategory in the National Inventory Report. \nSource: Climate Change Authority based on Commonwealth of Australia (2014a) \nThe CFI’s average annual emissions reductions of 2.5 Mt CO2-e represents about a two per cent \nreduction in emissions from the land management and waste sectors. This is not a precise \ncomparison of like with like, because not all reductions in waste emissions can be credited under the \nCFI; further, some activities that the CFI covers are not included in the National Inventory Report \n2012 (in particular, activities accounted for under Article 3.4 of the Kyoto Protocol).  \nThe average reductions caused by the CFI have been smaller than recent emissions increases in the \nland sector. In the latest quarterly update to the National Inventory, emissions from the land \nmanagement sectors are estimated to have increased by about 8 Mt CO2-e (or seven per cent) in the \nyear from March 2013 to March 2014 (Commonwealth of Australia 2014b), about three times the size \nof the CFI’s average annual emissions reductions. Nevertheless, the CFI helped reduce emissions \nfrom what they would otherwise have been. \n2.3.2. REDUCTIONS RELATIVE TO OTHER POLICIES  \nThe RET is estimated to have reduced electricity sector emissions by 20 Mt CO2-e between 2001 \nand 2012 (CCA 2012, p. 12) or about 1.7 Mt CO2-e on average per year. This is somewhat lower on \naverage than the CFI. That said, the RET achieved average annual emissions reductions of more \nthan 3 Mt CO2-e between 2009 and 2012 (Figure 16 in SKM 2012, p. 27), and is projected to deliver \nsubstantially more in the years to 2020 (Warburton review 2014, p. 60).  \nState restrictions on land clearing have contributed to a significant decline in emissions from \ndeforestation. Stronger land clearing regulations were introduced in New South Wales, Queensland \nand Western Australia from the early 1990s which, along with economic conditions, reduced the rate \nof first-time clearing of undisturbed forest and contributed to an emissions decline between 1990 and \n \nCARBON FARMING INITIATIVE REVIEW REPORT 27 \n2011 (Figure 12). Deforestation emissions fell from 140 Mt CO2-e in 1990 to 38 Mt CO2-e in 2011 \n(CCA 2014b, pp. 308–311). In Australia’s 2010 emissions projections, the Department of Climate \nChange and Energy Efficiency estimated that changes to vegetation management laws in \nQueensland and New South Wales would reduce deforestation emissions by 18 Mt CO2-e per year \nover the period 2008–2012 (DCCEE 2010). This illustrates that land clearing laws have been one of \nthe biggest contributors to Australia’s emissions reductions since 1990, delivering far greater \nemissions reductions than either the CFI or the RET.  \nDeforestation emissions increased to 47 Mt CO2-e in 2012 (CCA 2014b, p. 309) but recently \ndecreased to below 40 Mt CO2-e, according to 2014 quarterly estimates. Despite this decrease, the \nrecent relaxation of land clearing restrictions in New South Wales, Queensland and Western \nAustralia (CCA 2014b, p. 311) could, in future, contribute to reversing the large emissions reductions \nachieved. \nFIGURE 12: AUSTRALIA’S DEFORESTATION EMISSIONS, 1990–2012 \n \nSource: Climate Change Authority calculations using results from Treasury and DIICCSRTE (2013) \n2.4. COSTS  \nThe administration of the CFI created a number of transaction costs for project proponents and the \ngovernment. The level of transaction costs was important as it affected participation in the scheme \nand the cost to the community of achieving emissions reductions. Direct project costs were also \nimportant. \n2.4.1. TRANSACTION COSTS FOR PROJECT PROPONENTS \nIn addition to the direct costs of undertaking a project, project proponents incurred various \ntransaction costs associated with:  \n• CFI method development (if an appropriate method was not already available) \n• project applications  \n• reporting and verification requirements.  \n \n28 CHAPTER 2 \nThere is very limited public quantitative data on the transaction costs incurred by CFI project \nproponents. This makes it difficult to determine how important transaction costs have been in \ndetermining participation in the scheme. Nonetheless, available information provides some insights: \n• Private method developers reported that methods could cost hundreds of thousands of dollars \nto develop. These private costs are consistent with the Methodology Development Grants \nprogram, which are discussed below. \n• Where project proponents had to develop a new method to participate in the scheme, the cost \nwould likely have presented a significant financial disincentive. Development aside, the \nmethod approval process also imposed transaction costs on developers, who commonly \nobserved that the approval process was very time-consuming (for example, Australian \nIndustry Greenhouse Network sub. 13, p. 2) and took ‘longer … than would normally be \nexpected’ (Fares Rural sub. 3, p. 3). Some method developers expressed frustration at long \napproval timeframes ranging from 12 to 24 months.  \n• Project applications for sequestration projects were reported to have significant legal costs. \nProponents were required to obtain regulatory approvals, demonstrate they held applicable \ncarbon sequestration rights and obtain the consent of eligible interest holders. Some of these \nprocesses involved long waiting times. \n• The costs of complying with reporting and verification requirements varied significantly across \nactivities and methods, and are likely to have reduced participation by some types of projects.  \n- Some project proponents using methods with direct measurement and sampling approaches \nreported that monitoring and reporting costs constituted a large share of transaction costs. In \ncontrast, some proponents using methods with models and tools to calculate emissions \nreductions reported these were a much lower proportion of overall costs.  \n- Auditing costs usually ranged from $15,000 to $30,000 per audit. The Aboriginal Carbon \nFund (2014) noted that, for savanna projects, audit costs could be prohibitive and could \ninfluence a decision about whether to proceed with a project. On the other hand, Clear \nEnvironment, a consulting firm that provides audit services, commented that auditing costs \nwere often relatively low in the firm’s experience—usually under two per cent of the returns \nobtained from credits (sub. 6, p. 1).  \n- The time taken for the CER to approve project reports was initially slow in some cases. \nHowever, there is evidence that the CER is reducing its processing times. \n2.4.2. TRANSACTION COSTS FOR GOVERNMENT \nThe government incurred various transaction costs, including those relating to:  \n• developing methods (by the Department of the Environment) \n• administering the scheme (by the CER). The CER’s costs included costs incurred in assessing \nproject applications and reports; providing input to method development processes, education \nand engagement; and monitoring compliance. \nMethod development is likely to be the largest transaction cost incurred by the Department of the \nEnvironment; however, the direct costs incurred by the Department are not publicly available. \nGovernment grants for method development give some indication of government expenditure, \nhowever other significant costs (for example, staffing) would have been incurred. The Methodology \nDevelopment Grants program provided grants ranging from $110,000 to $214,000 for four method \ndevelopment projects, and the Indigenous Carbon Farming Fund allocated $2.7 million in five grants \nto develop methods and supporting tools—these grants ranged from $60,000 to $1.2 million.  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 29 \nDirect scheme administration costs incurred by the CER in the 2013–14 financial year amounted to \napproximately $6.1 million. This corresponds to over $40,000 for each project that was in the scheme \nby the end of 2013–14; or around $1.40 for every credit issued that year. The bulk of scheme \nadministration costs (almost $3 million) were incurred in developing and conducting assessment \nprocesses (for example, assessing projects for approval). Education and engagement accounted for \nover $1.5 million.  \nWhile transaction costs are necessary to ensure the environmental integrity of schemes such as the \nCFI, it is likely that costs have been unnecessarily high in some areas. In particular, the approach to \ndeveloping methods under CFI—whereby anyone could propose a method—resulted in a number of \nmethods that were very narrowly defined. For example, there are three reforestation and \nafforestation methods that relate to very similar activities, differing in their specific measurement \nrequirements. The need to develop a new method where there was a very similar method available is \nlikely to have increased transaction costs for some proponents, and discouraged other potential \nproponents from participating. \nThe lack of a formal prioritisation process is likely to have directed resources to less worthwhile \nmethods. For example, government and industry resources have been used to develop 10 methods \nfor activities that have had no uptake (Table 3). This partly reflects that some projects moved on to \nnewer methods (for example, savanna burning projects) and that some methods have only become \navailable recently (for example, ‘Measurement based methods for new farm forestry plantations’ \nbecame available in August 2014). However, some methods appear to have been developed for \nactivities that are not likely to be commercially viable. For example, there are two methods for dairy \nactivities but no projects, and the Australian Dairy Industry Council (sub. 1) has stated that these \nactivities are not viable at a carbon price of $23 per tonne of CO2-e.  \nSome stakeholders suggested some rules under the CFI (for example, some measurement, auditing \nand verification requirements) were too prescriptive, and neither proportional nor well-targeted to the \nenvironmental integrity risks that they sought to manage.  \nTo some extent, it is to be expected that transaction costs would be high in the early years of the \nCFI, as perfect foresight regarding which methods to develop is not possible and experience needs \nto be gained in how to best ensure scheme integrity. Accordingly, it would be expected that costs \nwould decline over time, and indeed there is some evidence that this has occurred already to some \nextent. \n \n30 CHAPTER 2 \nTABLE 3: PROJECTS AND CREDITING, BY METHOD \nSector Method Government or \nindustry applicant \nProjects Credits \nAgriculture \nDestruction of methane generated from dairy manure in covered anaerobic ponds Government 0 0 \nDestruction of methane from piggeries using engineered biodigesters Government 0 0 \nDestruction of methane generated from manure in piggeries Government 0 0 \nDestruction of methane generated from manure in piggeries 1.1 Government 7 56,827 \nReducing greenhouse gas emissions in beef cattle through feeding nitrate \ncontaining supplements Industry 0 0 \nReducing greenhouse gas emissions in milking cows through feeding dietary \nadditives \nIndustry and \ngovernment 0 0 \nSequestering carbon in soils in grazing systems Government 0 0 \nForests  \nEnvironmental plantings Government 14 430 \nMallee plantings Government 2 22,573 \nHuman-induced regeneration of a permanent even-aged native forest Government 0 0 \nHuman-induced regeneration of a permanent even-aged native forest 1.1 Government 3 92,068 \nMeasurement based methods for new farm forestry plantations Industry 0 0 \nNative forest from managed regrowth Industry 1 0 \nNative forest protection (avoided deforestation) Industry 33 3,087,341 \nReforestation and afforestation Industry 5 188,124 \nReforestation and afforestation 1.1 Industry 0 0 \nReforestation and afforestation 1.2 Industry 6 168,299 \nReforestation by environmental or mallee plantings—FullCAM Government 2 63,553 \nSavanna \nburning \nSavanna burning Government 0 0 \nSavanna burning 1.1 Government 23 467,542 \nLandfill and \nwaste \ntreatment \nAvoided emissions from diverting waste from landfill for process engineered fuel \nmanufacture Industry 1 64,103 \nAvoided emissions from diverting waste from landfill through a composting AWT \ntechnology Industry 4 111,366 \nCapture and combustion of landfill gas Government 68 5,875,622 \nCapture and combustion of methane in landfill gas from legacy waste—upgraded \nprojects Government 4 170,616 \nDiverting waste to an alternative waste treatment facility Industry 3 161,838 \nEnclosed mechanical processing and composting alternative waste treatment Industry 2 21,291 \nSubtotals—methods from industry applicants 55 3,802,362 \nSubtotals—methods from government applicants 123 6,749,231 \nTotals 178 10,551,593 \nNote: Method titles are taken from DOE 2014 and are shortened versions of the legislative instrument titles. Grey shading \nindicates methods with no projects or credits. ‘Government’ denotes methods developed by the Australian Government. ‘Industry’ \ndenotes methods developed by other participants, including other levels of government. Data current as at 3 December 2014. \nSource: Climate Change Authority based on CER (2014a) and DOE (2014a)  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 31 \n2.4.3. VERY HIGH-COST EMISSIONS REDUCTIONS HAVE BEEN AVOIDED \nThe CFI is a voluntary incentive-based scheme, so CFI project proponents would only have \nparticipated if they expected the price they would receive for credits would exceed their total costs \nper credit (comprising direct project costs and transaction costs). Liable entities under the carbon \npricing mechanism were the major buyers and, given that an ACCU represented an alternative \ncompliance unit, the carbon price set an effective cap on the ACCU price (the carbon price was fixed \nat $24.15 in 2013–14). As a result, the CFI almost certainly excluded the types of high-cost \nemissions reductions that have occurred under some other policies (see, for example, schemes \ndiscussed in PC 2011, pp. 123-124). \n2.5. FACTORS AFFECTING PARTICIPATION \nVoluntary programs such as the CFI only deliver results if they attract participants. Participation \nlevels in large part determine the amount of emissions reductions achieved. CFI project numbers \nsteadily increased from the beginning of the scheme; however, there is evidence that participation \nwas not as high as it could have been. Three main factors lowered participation in the CFI, and in \nturn reduced its environmental effectiveness. \n2.5.1. POLICY UNCERTAINTY \nThe first and most significant factor that deterred participation in the CFI was uncertainty about the \nfuture of carbon pricing (on which the price of CFI credits depended) and of climate change policy in \nAustralia more broadly. Policy uncertainty plays havoc with price expectations, in this case about \nfuture prices for credits, because a change in policy settings can change demand. Heightened \nuncertainty over future prices increases the risks around expected revenue streams from a project, \ndeterring some potential participants from taking up a project.  \nPolicy settings that determine demand for credits have largely been external to the CFI legislative \nframework. Under the carbon pricing mechanism, liable entities could buy credits (formally termed \nACCUs) and use them to meet some of their liabilities. This means the price of an ACCU could be \nexpected to reflect the price of a carbon unit, which was fixed at $23.00 in 2012–13 and $24.15 in \n2013–14.  \nCFI participants faced uncertainty about the carbon pricing mechanism since its inception, with the \nLiberal–National Coalition promising to repeal that mechanism (and doing so in 2014). Even if the \ncarbon pricing mechanism had remained in place, CFI participants faced substantial price \nuncertainty. The planned link between the carbon pricing mechanism and international carbon \nmarkets (such as the European Union’s Emissions Trading System) meant that the Australian carbon \nprice was projected to fall to much lower levels in 2015 (CCA 2014b, p. 130). The Labor Government \nannounced in 2013 that it would bring the link forward from 2015 to 2014 (Commonwealth of \nAustralia 2013).  \nIn consultations for this review, stakeholders overwhelmingly expressed the view that investment in \nCFI projects had slowed or ceased because of policy uncertainty. Fares Rural (sub. 3) argued that \nthis uncertainty has particularly discouraged projects involving long-term investment; and Country \nCarbon (sub. 7) submitted that, from the beginning of the scheme, policy uncertainty beyond the \n2013 election meant that projects would only be considered if they were low-risk and had short \npayback periods. Industry analysts (for example, RepuTex 2014, p. 11) similarly emphasised that \nlong-term price certainty is crucial to encouraging project investment, particularly for sequestration \nprojects. \n \n32 CHAPTER 2 \n2.5.2. ELIGIBILITY AND COVERAGE GAPS  \nWhile policy uncertainty was the most important factor, eligibility gaps and gaps in methods also \nreduced participation in the CFI. The CFI Act provided the basis for broad participation across the \nland sector and for legacy waste activities. Credits could potentially be earned for activities that:  \n• increased carbon stored in vegetation or soil (sequestration activities; for example, \nreforestation or improved management of forests) \n• reduced agricultural emissions (for example, emissions from livestock production or fertiliser \nuse) \n• reduced emissions from waste deposited at a landfill before 1 July 2012. \nProjects were ineligible, however, if the project activity was not on the positive list, was on the \nnegative list, or was excluded through other specific restrictions in the Act. Even if a project was \neligible under these criteria, it still could not participate if there was no applicable method.  \nEligibility constraints to prevent perverse impacts \nSome eligibility constraints have been the result of efforts to reduce perverse impacts. For example, \nthe negative list excluded projects that involved planting weed species and reforestation activities \njudged to have unacceptable risks of negative impacts on water availability. \nSome constraints that aimed to prevent perverse impacts may have been overly restrictive. For \nexample, projects that involved any harvesting of native forest, or using material obtained from a \nnative forest by clearing or harvesting, were excluded. This avoided providing a perverse incentive to \nclear native forest; excluding, for example, projects to clear low-density native forest and plant \nhigher-density forest which sequestered more carbon. This also meant, however, that the CFI \nexcluded projects to increase carbon sequestration through changing the timing and management of \nnative forest harvesting. Some analysts have argued that activities that delay harvest could \npotentially have provided a large amount of emissions reductions at low cost (Macintosh 2012, \np. 18).  \nThe Australian Forest Products Association (sub. 9, p. 2) also argued that: \nthe negative list remains a major impediment that prevents a large number of forestry and \nafforestation projects from playing a role in the CFI. It imposes unnecessary constraints \nthat effectively exclude forestry projects from the CFI, such as the restrictions on tree \nplanting in regions with average annual rainfall above 600 mm. \nWhile the concerns about water use that led to these constraints would ideally be dealt with through \nbroader water policy settings, rather than through the CFI, it not clear to the Authority whether \ncurrent water policy provides adequate protection.  \nPositive list gaps \nEligibility constraints have also arisen where activities are not included on the positive list. For \nexample, the positive list did not include projects to avoid harvesting on public land (such projects \nare eligible on private land: CFI Regulations, Reg. 3.28(1)(o)). Analysis by Perkins and Macintosh \n(2013) and Macintosh (2013) suggested that such projects could offer substantial emissions \nreductions, potentially at a low cost. \nHarvesting rates may decline for commercial reasons, such as reduced demand from wood \nprocessing facilities, or from other policy motives, such as ceasing harvesting to conserve \nbiodiversity. Accordingly, the decision to exclude harvesting of native forests on public land as an \neligible activity may reflect valid concerns about additionality.  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 33 \nGaps in method availability  \nWhen available methods are compared with identified emissions reduction opportunities in the land \nsector, gaps become apparent. Where a method was not available, the CFI could not access the \nemissions reduction opportunities. This is not to suggest that the ideal is to have no gaps. Methods \nare time-consuming and costly to develop and, therefore, should only proceed where the benefits are \nexpected to outweigh these costs. \nEstablishing commercial-scale forestry plantations was not covered by a CFI method and was one \nexample of such a gap. Even though establishing a new long-rotation hardwood plantation was on \nthe positive list (CFI Regulations, Reg. 3.28(1)(q)), there was no method for this activity. There were \nno other positive listings for establishing forest for commercial harvest (for example, establishing \nsoftwood plantations). Smaller-scale plantations could participate through the ‘Farm forestry’ method; \nhowever, this does not apply to plantations at a commercial scale (in areas generally considered to \nhave sufficient rainfall for commercial forestry, this method allows plantations to be no more than 100 \nhectares and to occupy no more than 30 per cent of a farm: CFI Regulations, Reg. 3.27).  \nThis appears to be a significant gap, given that ClimateWorks (2013, p. 40) identified establishing \nforestry plantations (‘reforestation of marginal land with timber plantation’) as a significant source of \npotential emissions reductions (4.3 Mt CO2-e of potential to 2020). Further, ClimateWorks identified \nestablishing plantations to be a relatively low-cost source of emissions reductions (Figure 13).  \nAs commercial plantations can have strong commercial drivers, the absence of methods could \npossibly be justified by additionality concerns. However, such blanket exclusions can rule out \ngenuinely additional projects that offer significant, low-cost emissions reductions. The Australian \nForest Products Association (2014, p. 8) argued that a: \nkey impediment has been the blunt interpretation of additionality, particularly for \ncommercial plantation forest projects. The reliance on a common practice test - defined \nsimply as an activity that represents 5 per cent of existing land use in a region - fails to \nacknowledge the spatial and historical (temporal) factors that have generated plantation \ninvestment. \nThis suggests that it may have been possible to identify particular types of plantations (possibly in \nparticular regions) that would be unlikely to be established in the absence of revenue from the CFI. \nGaps also arose where CFI methods were narrow, limiting coverage of emissions reduction activity. \nThis partly arose due to private method development—in some cases, proponents wrote prescriptive \nmethods to suit a particular project (and perhaps also to prevent others being able to free-ride on \ntheir investment). For example, the reforestation and afforestation series of methods each applied a \nslightly different measurement method for the same project type: establishing forest on clear land \n(CER 2014b).  \n2.5.3. TRANSACTION COSTS \nAs discussed in section 2.4, there is some evidence that transaction costs deterred participation. \nHigh method development costs and long approval timeframes are likely to have discouraged \nmethod development, which then reduced project entry. Current and potential participants reported \nthat high transaction costs deterred participation in some cases. In particular, costs associated with \nmeasurement and reporting were often high due to rigorous method requirements, and audit costs \nwere prohibitive in some cases. Measurement and verification was often very expensive for projects \nwhere emissions reductions are directly measured (for example, for soil carbon or reforestation \nprojects). \n \n \n34 CHAPTER 2 \nFIGURE 13: SECTORAL INVESTOR ABATEMENT COST CURVE \n \nSource: ClimateWorks 2013, p.13  \nTransaction costs are necessary in schemes like the CFI to protect environmental integrity. \nTherefore, the deterrent effect of transaction costs is only a concern to the extent that costs were \nhigher than necessary. As discussed in section 2.4, transaction costs have been unnecessarily high; \nalthough there is evidence that some are declining.  \n \nCONCLUSION \nC 2. Participation in, and emissions reductions from, the CFI have been constrained, \nprincipally because policy uncertainty led to low price expectations and a lack of \nconfidence in longer-term returns. Participation has also been affected by gaps in \nmethod coverage and broad exclusions, and relatively high transaction costs. \n \n \n \nCARBON FARMING INITIATIVE REVIEW REPORT 35 \nCHAPTER 3. PROSPECTS FOR \nIMPROVEMENT UNDER THE \nEMISSIONS REDUCTION FUND \nThe ERF, which is replacing the CFI, contains a number of new and altered elements, and some \naspects are still under development. The ERF has been introduced through amendments to the CFI \nAct, so it falls within the scope of this review.  \nIt is not yet possible to evaluate the performance of the ERF, as it is only just commencing and no \nauctions have been held. As a result, this chapter examines the extent to which the design of the \nERF addresses the problems with the CFI identified in Chapter 2. It also considers new or expanded \nchallenges that may arise, particularly in light of the expanded scale and scope of the scheme.   \n3.1. THE EMISSIONS REDUCTION FUND INCORPORATES SOME \nIMPORTANT IMPROVEMENTS \nSeveral changes under the ERF are likely to facilitate greater participation in the scheme and, \nprovided there are effective governance arrangements in place, are unlikely to pose a significant \nthreat to its environmental integrity.  \n3.1.1. INVESTMENT CERTAINTY PROVIDED THROUGH FIXED-LENGTH \nCONTRACTS WITH GOVERNMENT \nUncertainty about future prices for credits was the main factor discouraging participation in the CFI \n(Chapter 2). The ERF addresses this issue by providing price certainty over a fixed-length contract \nperiod. \nUnder the ERF, the government will purchase emissions reductions, in the form of ACCUs, through a \nreverse auction or other purchasing process. The CER will enter into contracts with successful \nbidders, which will guarantee the price paid for delivery of ACCUs over the life of the contract. The \nduration of ERF contracts will typically be seven years or less. Draft rules under the ERF create \nscope, however, for the CER to enter into contracts of up to 10 years for projects with a crediting \nperiod of more than seven years (DOE 2014a). The secondary market for ACCUs is likely to \ncontinue, to meet demand from ERF participants needing to ‘make good’ on contract volumes and \nfrom the voluntary market. \nBy providing a fixed price for up to seven years, the standard ERF contract is likely to be attractive to \nmany project proponents—particularly those with projects that generate a relatively large proportion \nof emissions reductions in their early years (for example, many energy efficiency projects). Projects \nwill, however, need to be developed and registered without any guarantee of success at auction. \nAccordingly, proponents with projects that would take a long time or be costly to develop would need \nto weigh up the risks of participating. \nThe extent to which the ERF is likely to stimulate investment in new projects that generate emissions \nreductions over a longer time (for example, afforestation) is more uncertain (section 3.2.1). \n \n36 CHAPTER 3 \nCONCLUSION \nC 3. By providing a fixed price for up to seven years, the standard ERF contract is likely to be \nattractive to many project proponents—particularly those with projects that generate a \nrelatively large proportion of emissions reductions in their early years. \n \n3.1.2. IMPROVED APPROACH TO METHOD DEVELOPMENT AND APPROVAL \nThe lack of a coordinated approach to method development under the CFI is likely to have created \nunnecessary transaction costs and inhibited participation (Chapter 2). To address this problem, the \nERF introduces a new approach to method development and approvals, which includes: \n• prioritising methods for development  \n• allowing more broadly applicable activity methods  \n• allowing facility-based methods \n• allowing baselines based on emissions intensity.  \nAs at 11 December 2014, the Department of the Environment had issued 17 draft ERF methods for \npublic consultation, including methods for facilities, coal mining, transport, industrial fuel and energy \nefficiency, and commercial building energy efficiency (DOE 2014b). \nThe Emissions Reduction Assurance Committee (ERAC) will assess methods and advise the \nMinister for the Environment on their suitability (in a similar manner to its predecessor, the DOIC). In \ndeciding whether to approve a method, the Minister will have regard to offsets integrity standards \nand any advice provided by the ERAC. Importantly, the Minister must not approve a method if the \nERAC advises that the method does not comply with the offsets integrity standards.  \nThe ERAC will monitor and review the effectiveness of emissions reduction methods over time and \nreview each method at least once every four years. A key focus of the reviews will be to ensure that \nemissions reductions credited under methods continue to be genuine and additional. The ERAC will \nalso have the power to suspend methods that do not comply with the standards.  \nDuring consultation for this review, many stakeholders supported the new approach to method \ndevelopment and approvals, including the government playing a more central role. Likely benefits of \nthis process include: \n• targeting government resources to the most prospective methods for reducing emissions  \n• avoiding narrow methods that limit competition and/or have very limited uptake \n• promoting a more consistent approach to managing risks, both within and between methods. \nStakeholders cautioned that there are a number of risks associated with the new approach \n(discussed below), and stressed that streamlining efforts should not undermine the integrity of the \nscheme. \n \nCARBON FARMING INITIATIVE REVIEW REPORT 37 \nBetter prioritising method development \nUnder the CFI, anyone could propose new methods to the DOIC for assessment. The ERF has \nremoved this process. \nUnder the ERF, the Minister for the Environment will determine priorities for developing methods, \nwith advice from stakeholders and the ERAC, and taking account of:  \n• the potential uptake of the method and the likely volume of emissions reductions \n• whether emissions reductions can be estimated with a reasonable degree of certainty and at \nan acceptable cost \n• whether the activity could have adverse social, environmental or economic impacts  \n• whether the activity could be promoted more efficiently through other government measures \n(DOE 2014d).  \nThe Department of the Environment will work with stakeholders through technical working groups to \ndevelop priority methods and identify priorities for future method development.  \nSome stakeholders expressed concern that a more centralised approach to method development \ncould inhibit innovation. For example, government agencies may not be as well placed as individuals \nor businesses with specialist knowledge to identify new, low-cost abatement opportunities. As \nillustrated in Chapter 2, however, to date government-led methods have generated more credits than \nprivate-led methods (both in total and on average per method). \nFurther, the ERF includes measures that should mitigate this risk to some extent. Technical working \ngroups (with relevant expertise in different sectors) and other individuals and businesses will be able \nto suggest methods for prioritisation (DOE 2014c). Nevertheless, it will be important that the \nDepartment maintains close links with the scientific community to ensure it remains informed of new \nabatement opportunities in sectors such as agriculture.  \nAnother concern is the potential politicisation of the process. For example, interest groups could \nlobby to have methods for their projects prioritised over other methods that have stronger claims \nagainst the prioritisation criteria. Similarly, there may be a temptation for government to prioritise \nmethods that are popular but have demonstrably high costs or a high risk of non-additionality.  \nOne way to address this concern would be for the Minister to publish the reasons for prioritising or \nnot prioritising particular methods, along with any accompanying analysis. This would, however, \nplace additional demands on the Department’s resources.  \nMore broadly applicable and consistent methods  \nThe ERF will allow a range of methods to cater for different sectors and activities. Where possible, \nmethods under the ERF will be designed to apply broadly to similar activities, across a range of \nbusiness circumstances.  \nThe government has indicated that activity methods will be developed for specific emissions \nreduction activities, such as landfill gas capture, energy efficiency and land sector projects. Existing \nmethods, for example from the Clean Development Mechanism, will be adapted where they meet the \nrequirements of the ERF. Where appropriate, the ERF will also draw on existing activity methods \ndeveloped under state-based energy efficiency schemes to develop nationally consistent methods \n(Commonwealth of Australia 2014). \nFor complex projects with the potential to deliver large volumes of genuine emissions reductions over \na longer period, the ERF provides for bespoke methods (Commonwealth of Australia 2014). \n \n38 CHAPTER 3 \nWhile standardising methods under the ERF could encourage greater participation, there will be \ntrade-offs: \n• If a method sets a very standardised baseline, this leaves less room to consider project-\nspecific variables. For heterogeneous activities, this runs the risk of crediting non-additional \nabatement or excluding additional abatement.  \n• Making methods less prescriptive could reduce the costs and the time it takes to develop \nthem, potentially making them more broadly applicable. This needs to be weighed against the \nincreased costs of determining and approving baselines at the project development and \napproval stage. \n• To remain robust and reduce the risk of non-additionality, methods need to be updated over \ntime to incorporate the latest information (CCA 2014a). \nProject-specific additionality tests, such as financial and barrier analysis, may be appropriate for \nlarge one-off projects for which standardised tests are not well suited (CCA 2014a). This has direct \nrelevance to the development of ‘bespoke methods’ under the ERF (section 3.2.2). \nSeveral stakeholders observed that some of the draft methods released for public comment were \nvery broad and should be complemented with plain English guidance on how to comply. (The CER \nwill be issuing further guidance on participating in the ERF.) The very broad nature of some draft \nmethods raises questions about whether it will be possible to apply them without increasing risks to \nenvironmental integrity (section 3.2.2).  \nMore consistent approach to managing risks \nSome stakeholders have suggested that the CFI over-emphasised scientifically-rigorous \nmeasurement of emissions, without really considering whether the prescriptive requirements \nimposed were proportionate to the risks. For example, some methods required a high level of \naccuracy for inputs that were unlikely to have a material effect on the overall estimate of emissions.  \nStakeholders suggested that the inconsistent application of stringent rules, both within and across \nmethods, compounded this problem. For example, CFI methods sometimes required a relatively low \nstandard of evidence for important inputs for measuring emissions, introducing inaccuracies that \nnullified the benefits of high standards for other inputs. Similarly, it was suggested that the \nDOIC/ERAC should put more emphasis on managing the risk of non-additional projects rather than \nthe risk of inaccurate measurement of emissions.  \nThe new approach to method development should help promote greater consistency in managing \nrisks. For example, the ERAC will be required to consider the advice from the CER about method \nimplementation, which should help ensure that methods are workable, do not create undue \ncompliance burdens, and are broadly consistent with each other. Periodic reviews of methods by the \nERAC may also identify opportunities to enhance consistency.  \nFacilities methods \nThe Department of the Environment is currently developing a facilities method (using existing data \nunder the National Greenhouse and Energy Reporting Scheme) to encourage emissions reductions \nfrom a wide range of activities. This method is limited to facilities that already report under the \nNational Greenhouse and Energy Reporting Scheme and produce an output. \nFacility methods are less common than activity methods in voluntary crediting schemes in Australia \nand other countries but, once established, can provide greater flexibility in the types of activities \nundertaken, and reduce measurement and audit costs (compared with activity methods) \n(CCA 2014a).  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 39 \nWhile many stakeholders supported the idea of a facility-wide method, some were concerned that \nthe draft ERF facility method was so broad that, if approved in its current form, it might be difficult to \nimplement without introducing risks to the integrity of the scheme (section 3.2.2). There will be an \nopportunity to address these concerns in the final ERF facility method. \nMethods based on improvement in emissions intensity  \nTo allow more types of projects to participate, the ERF will allow methods based on improvements in \nemissions intensity as well as methods based on absolute emissions reductions. This would allow \ncredits to be issued for improvements in the emissions intensity of production even where production \nis expanding and absolute emissions increase.  \nIntensity baselines can play a useful role in crediting mechanisms, depending on the specific nature \nof the activity, and the availability and suitability of the activity data. Issues to consider include:  \n• All baseline emissions are a product of the baseline activity (the action that would occur in the \nabsence of the project) and the baseline emissions factor of that activity (emissions per unit of \nbaseline activity). \n• Intensity baselines assume that baseline activity is equal to actual activity, which is a \nreasonable assumption provided that undertaking the project does not influence activity levels. \nIf the additional income from crediting makes it worthwhile to do more of an activity, then \nactual activity is not a good proxy for baseline activity. In these circumstances, an intensity \nbaseline would lead to over-crediting. An absolute baseline that estimates activity in advance \nwould be better.  \n• Intensity baselines are more challenging if an activity is not easily defined. For example, \nintensity baselines could be measured in terms of a unit of input or output (such as tonnes of \nCO2-e per square metre of building space used) but are more challenging if, for example, a \nfacility produces multiple products. \nMany energy efficiency and displacement methods from other schemes use intensity baselines. For \nexample, the New South Wales ESS methodologies use improvements in building energy efficiency. \nThe baseline is the emissions intensity of the floor space in the building (kgCO2/m2) required by \nregulation (CCA 2014a). \n3.1.3. STREAMLINED ADDITIONALITY ASSESSMENTS \nTo demonstrate additionality under the CFI, proposed activities or types of projects had to go beyond \ncommon practice (and be included on what was known as the ‘positive list’), and not be required to \nbe carried out by law. \nTo reduce transaction costs and encourage participation, the ERF removes the common practice test \nand the positive list and focuses additionality testing primarily in method development. While the \npositive list was originally designed to give early guidance to participants designing bottom-up \nmethods, feedback from stakeholders suggests that in practice the process has been duplicative and \ntime-consuming. As a result, the new approach should streamline the scheme and reduce costs for \nproject proponents. The more centralised method development process under the ERF weakens the \njustification for the positive list. \nWhile removing the positive list may eliminate duplication, the core task of determining which \nactivities create real and additional emissions reductions remains. This will require more than an \nexamination of historical activity; it will also require an assessment of whether the activities would \nhave occurred anyway (CCA 2014a). \n \n40 CHAPTER 3 \n3.1.4. MORE FLEXIBLE REPORTING AND VERIFICATION \nRisk-based audits \nUnder the CFI, project proponents received credits after submitting project reports and completing an \napplication. All project reports had to be accompanied by a reasonable assurance audit report, with \nminor exceptions in the CFI regulations. \nFor some types of activities, auditing costs may have impeded participation in the CFI (Chapter 2). \nFor example, project developer Fares Rural argued that the cost of current audit requirements is \nsignificant for sequestration projects, making many small projects unviable (sub. 3, p. 4). The \nAboriginal Carbon Fund (2014) similarly noted that audit costs can be prohibitive for savanna burning \nprojects. More broadly, placing onerous auditing requirements on low-risk projects is likely to impose \ncosts for little, if any, environmental benefit.  \nTo make it easier and less costly to participate in the scheme, the ERF removes the universal \nrequirement for an audit report and introduces a risk-based approach to auditing emissions \nreductions. Under this approach, the CER will determine project audit requirements taking into \naccount project risks and the risk profile of project proponents. This is likely to mean that proponents \nundertaking relatively small, uncomplicated projects could expect fewer audits than those \nundertaking projects that are more complicated (CER 2014).  \nWhile many stakeholders expressed in-principle support for risk-based audits, several noted that \nthey would require further details before coming to a firm view. The CER is currently developing rules \non the level of assurance, frequency and scope of the audit report that must be provided for different \ntypes of projects under the ERF (CER 2014, DOE 2014a).  \nClear Environment, a consulting firm that provides assurance services under various environmental \nschemes, argued that audits should be mandatory prior to every issuance of credits. It argued that \nmaterial misstatements were common in the CFI, and that if material issues were only identified after \ncredits had been issued, project owners could face hardship due to obligations to then ‘make good’. \nIt also argued that the proposed approach would significantly increase the administrative burden on \nthe CER, as it would have to develop audit and assurance requirements on a case-by-case basis. \n(sub. 6, p. 1)  \nIn principle, a well-designed risk-based audit regime should reduce transaction costs without eroding \nthe environmental integrity of the scheme or creating other adverse impacts. For example, higher risk \nproject proponents (such as those who have limited or no experience with similar schemes, who are \nusing a new method, who are contracted to deliver large volumes of emissions reductions or who \nhave a history of material misstatements) could continue to face the strict auditing requirements that \napplied under the CFI. Hence, they would pose no additional risk to the integrity of the scheme.  \nThe practical challenges associated with designing an effective risk-based audit scheme are not \ntrivial. A more conservative approach might be warranted in the early stages of the scheme to allow \ntime to address any teething problems. \nFlexibility to report more frequently \nIn addition to risk-based auditing, the ERF allows project proponents to report emissions reductions \nmore frequently, which in turn allows them to access revenue from selling their credits more \nfrequently. Under the CFI, the minimum reporting period was 12 months. Under the ERF, reporting \ncan occur as frequently as every six months (or less if prescribed by legislative rules).  \nDraft rules under the ERF specify a minimum reporting period of one month. To avoid obliging the \nCER to process large numbers of reports for a small amount of abatement, proponents will only be \n \nCARBON FARMING INITIATIVE REVIEW REPORT 41 \nable to report more frequently than every six months if they generate abatement of more than \n2000 t CO2-e for the reporting period (DOE 2014a). \nStakeholders generally supported the enhanced flexibility. One noted that, in addition to providing \nparticipants with more frequent cash flows, more frequent reporting could reduce the reporting \nbottlenecks that occur under a 12-month reporting cycle.  \nCONCLUSION \nC 4. Changes to streamline the ERF are likely to result in lower transaction costs than for the \nCFI, in many cases without adversely affecting emissions reductions. The ERF approach \nto method development and approval appears to represent an improvement from the CFI \napproach, but much will depend on implementation. \n \n3.2. THE EMISSIONS REDUCTION FUND CREATES SOME NEW OR \nEXPANDED RISKS  \nAs well as improvements, the ERF creates some new or expanded risks relative to the CFI. These \nrisks will need to be well managed if the scheme is to achieve its objectives. \n3.2.1. THE DESIGN OF THE NEW SCHEME MIGHT NOT SUPPORT LONG-\nTERM INVESTMENTS \nExperience in Australia and other countries demonstrates that uptake of emissions reduction \nprograms will inevitably be affected by perceptions of a scheme’s likely stability and longevity, and \nthat uncertainty about the policy time horizon will deter participation (CCA 2014a). Some activities, \nsuch as those that generate emissions reductions over a longer time period and/or have high upfront \ncosts, require confidence that an incentive will be provided over the long term. Under the ERF, the \ncrediting period for some activities, such as sequestration projects, will be up to 25 years.  \nProjects face uncertain (and potentially low) prices for any credits generated beyond the initial ERF \ncontract period, which will be typically for seven years or less. As ERF support is limited to a single \ncontract period, sales of credits beyond that would therefore rely on the secondary or voluntary \nmarket, including possible demand from entities with liabilities under the ERF safeguard mechanism. \nCurrent indications are that baselines under the safeguard mechanism will be set in a way that would \nbe, at least initially, unlikely to create strong demand for credits (Chapter 1). This issue will be \nexplored in the design of the safeguard mechanism; in the meantime it is hard to project the demand \nfor credits that it may generate.  \nOther areas of uncertainty affecting investment decisions include the specific operation of the ERF \n(including likely auction prices and rules), the longevity of the ERF, and broader climate policy \nsettings including for the RET, particularly in light of the lack of bipartisan agreement on climate \nchange policy. \nUncertainty about future demand for credits is likely to most affect activities that generate emissions \nreductions over a longer time and have high upfront costs. These projects will require relatively \nhigher prices to participate in the ERF, to account for the uncertain returns beyond the contract \n \n42 CHAPTER 3 \nperiod. In turn, this might render many of these projects uncompetitive relative to projects that \ngenerate a lot of emissions reductions in their early years of operation (Box 1). Moreover, lenders \nmight be reluctant to finance long-term projects that do not have a relatively secure long-term \nrevenue stream; these challenges are similar to those facing renewable energy investors \n(CCA 2014b). Existing CFI project operators who have approved methods and who are able to \nbackdate projects might be the exception. \nDraft rules on the duration of contracts give the CER the ability to enter into contracts of up to \n10 years for projects that have a crediting period of more than seven years. The extent to which this \nmitigates risks for long-term projects remains to be seen, and will in part depend on the precise \ncircumstances in which 10 year contracts are made available. Further, even 10 years might prove an \ninsufficient incentive for activities that deliver abatement over an extended period (for example, \nafforestation).  \nCONCLUSION \nC 5. Given uncertain and potentially low prices for credits beyond the ERF contract period, \nstandard seven-year contracts (and even 10-year contracts) might not provide sufficient \nincentive for some long-lived investments that deliver abatement over an extended \nperiod, thereby excluding some low-cost opportunities. \n \n3.2.2. THERE ARE RISKS TO ENVIRONMENTAL INTEGRITY  \nUnlike the CFI, which was a comparatively small land-based program that complemented the carbon \npricing mechanism, the ERF is the centrepiece of the Australian Government’s Direct Action Plan to \nreduce emissions. Expansion of coverage and the current funding commitment of $2.55 billion have \nthe potential to significantly scale-up activity relative to the CFI. This scaling-up of activity magnifies \nthe significance of risks to environmental integrity under the scheme. \nExpansion and streamlining of the ERF are likely to result in additionality rates declining somewhat. \nProvided the decline is small and compensated by lower transaction costs and greater participation, \nthis ‘rebalancing’ would constitute an improvement. However, buying a large volume of non-\nadditional emissions reductions would erode the scheme’s cost-effectiveness, crowd out genuinely \nadditional reductions and reduce the scheme’s contribution to meeting Australia’s targets \n(Chapter 4).  \nThe expanded scale and scope of the ERF requires new expertise, capacity and consultation \nmechanisms to be developed in a relatively short time. Developing robust methods for many new \nactivities will be challenging, particularly as the scheme is expanding into areas where it is inherently \ndifficult to judge additionality (such as energy efficiency) (Chapter 1). There is a risk that additionality \nrates could decline sharply.  \nAs noted above, the ERF includes some features that will help manage this risk; for example, \ntechnical working groups to leverage industry and other expertise, scrutiny by the ERAC, including \nperiodic reviews of methods, and provisions to suspend methods. The Department and CER have \nalso acquired important experience and expertise through the CFI.  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 43 \nBOX 1 CONTRACT LENGTH AND TIMING OF EMISSIONS REDUCTIONS \nThe ERF is designed to provide certainty for participants through contracts for emissions reductions; giving them confidence they can \nrecover costs and achieve an appropriate return. However, the benefit of this certainty is limited by contract length. Projects that generate \nERF credits beyond the contract period face considerable uncertainty on future returns for credits. This creates an incentive for \nproponents to try to recover all their costs within the contract period. This dynamic favours projects that realise a large proportion of credits \nwithin the contract period.  \nFIGURE 14: PROJECT WITH A SEVEN-YEAR CREDITING PERIOD \n \nFigure 14 illustrates an ERF project that involves an upfront capital investment with a life of around seven years (for example an industrial \nenergy efficiency project). The project is assumed to have a seven-year crediting and contract period. The project generates all of its \nemissions reductions (and all of its credits) within that period, so the project proponent does not have to factor in future demand risk when \nbidding into the ERF.  \nFIGURE 15: PROJECT WITH A 25-YEAR CREDITING PERIOD \n \nFigure 15 illustrates an ERF project with a 25-year crediting period and large upfront capital costs—a reasonable proxy for afforestation, \nfor example. Only a small proportion of credits is generated within the seven-year contract period, so the project faces substantial future \ndemand risk. As a result, the project proponent may need to bid a high price per credit into the ERF to make the project financially \nfeasible. \nAn increase in the contract length from seven to 10 years would increase the number of credits over which the project proponent could \nrecover a return (helping improve the project’s competitiveness). However, the project proponent would still face considerable demand \nuncertainty, which may still deter the investment. \n \n44 CHAPTER 3 \nVery broad methods that apply across a range of projects, with different characteristics and \ninvestment drivers, could make it more difficult to establish additionality. Greenhouse Gas Consulting \nServices observed: \nSome of the current [method] determinations have a scope that is wider than the previous \ndeterminations and the need to cover this wide scope has increased their complexity. \nThis increase in complexity makes it difficult to follow the [method] within the \ndetermination and understand any particular requirements. A complex determination can \nresult in … the content of the determination not matching its intent …The wide scope has \nresulted in some determinations not covering issues with the possible projects that can \nbe included in those determinations. (Greenhouse Gas Consulting Services, sub. 17, \np. 2) \nThe inclusion of even a small number of methods with questionable additionality can significantly \nerode the environmental integrity of these types of offset schemes. Under the Alberta Offset \nprogram, for example, projects that reduced or eliminated tillage of agricultural soils to increase \ncarbon sequestration generated 38 per cent of offset credits used between 2007 and 2012 (CCA \n2014a). As low tillage was already a relatively well-established practice, however, it is likely that \nmany of the funded projects were not additional.  \nAt present, it is too early to say how all this will play out, and whether the new governance systems \nand powers will be used effectively. \nCONCLUSION \nC 6. Expansion and streamlining of the ERF are likely to result in additionality rates declining \nsomewhat. Provided the decline is small and compensated by lower transaction costs \nand greater participation, this ‘rebalancing’ would constitute an improvement. There is a \nrisk, however, that these changes could cause additionality rates to decline sharply, \nparticularly as the scheme is expanding into areas where it is inherently difficult to judge \nadditionality (such as energy efficiency).  \n \nLarge projects and additionality \nWhile project-level additionality tests, such as financial and barriers analysis, can be resource-\nintensive and time-consuming, they are likely to be warranted for projects that generate a large \namount of credits—particularly in the industrial sector where there is often too few comparable \nfacilities to apply standardised approaches, such as common practice tests. These tests would apply \nto large projects regardless of whether they are using a ‘bespoke’ method or more generic method. \nThe Department, in consultation with the CER and other stakeholders, should consider introducing \nenhanced additionality tests (such as financial and barrier analysis) for individual projects that \ngenerate a large volume of credits under the ERF. Issues to consider include:  \n• the appropriate threshold for applying enhanced additionality tests \n• their appropriate design  \n• the potential for perverse incentives (such as encouraging proponents to split up larger \nprojects into smaller projects to avoid enhanced additionality tests). \n \nCARBON FARMING INITIATIVE REVIEW REPORT 45 \nRECOMMENDATION \nR.1. The Department of the Environment, in consultation with the Clean Energy Regulator and \nother stakeholders, should consider introducing enhanced additionality tests for individual \nprojects that generate a large volume of credits under the ERF, with particular regard to \nthe financial viability of the project in the absence of ERF support. \n \n3.3. THERE ARE SOME PROBLEMS THAT THE EMISSIONS \nREDUCTION FUND CANNOT ADDRESS \nThe ERF cannot address all the problems associated with the CFI. Some have arisen because of the \ngeneral limitations of project-based baseline and credit schemes. Other perceived ‘problems’, such \nas lack of participation by certain sectors, partly reflect the economic and practical realities of taking \naction in those sectors.  \n3.3.1. LIMITATIONS OF BASELINE AND CREDIT SCHEMES  \nLike all emissions reduction measures, baseline and credit schemes have their disadvantages. As \ndiscussed earlier, one of the main disadvantages relates to the complexity of determining what would \nhave happened to emissions in the absence of the scheme (that is, developing baselines and \ndetermining additionality). Government will often have limited information about cost structures and \nother factors influencing investment in different industries. This information asymmetry gives project \nproponents a financial incentive to engage in gaming, such as overstating financial barriers to \ninvestment, or arguing for a relatively generous baseline (above business-as-usual) to increase the \nnumber of credits received. Professor Garnaut has previously suggested: \nAdditionality is particularly difficult in a financial context … it actually requires \nclairvoyance to know whether or not, on financial grounds, an investor would have made \nan investment. So in the end you need to use rules of thumb—which, by the nature of \nthings, are imperfect. That does not mean to say it is not worth doing, but you are \ncertainly working with approximations. (Committee Hansard, Senate Environment and \nCommunications References Committee Inquiry into the Government's Direct Action \nPlan, 7 March 2014, p. 4) \nInformation asymmetries also mean that some low-cost abatement opportunities will inevitably be \nmissed because it is not feasible to devise methods and baselines that would credit these \nopportunities without also crediting many non-additional projects. For example, a firm considering \ntwo options for upgrading an industrial facility—one with high emissions and the other with low \nemissions—could approach the government with a proposal to undertake the low emissions option in \nreturn for a government contribution. Because the government has no way of verifying whether the \nfirm would have invested in the low emissions option without assistance, it faces the risk of either \nforgoing a very cost-effective opportunity (on a dollars per tonne CO2-e basis) or paying a relatively \nlarge sum of money for absolutely no additional emissions reductions. In the latter case, there would \nbe less money to buy additional reductions. \nThe Climate Institute (2014, p. 5) has argued that state-based energy efficiency schemes have \ndemonstrated these pitfalls.  \n \n46 CHAPTER 3 \nThe rapidity with which energy efficient technologies were taken up through the state \nschemes and diffused more broadly through the market meant that certain technologies \nbecame ‘common practice’ long before government systems were able to update their \neligibility criteria. Given the breadth of activities able to reduce emissions, the Emission \nReduction Fund will face an even greater challenge to ensure it credits only genuinely \nadditional emission reductions. \nRecent research by the Authority, which draws on experience from domestic and international \nbaseline and credit schemes, further highlights the inherent limitations and complexities in crediting \nemissions reductions (CCA 2014). \nCONCLUSION \nC 7. Domestic and international experience suggests there are inherent limitations and \ncomplexities in crediting emissions reductions. The ERF purchasing scheme will \ninevitably miss some low-cost abatement opportunities because it is not feasible to \ndevise methods and baselines that would credit these opportunities without also crediting \nmany non-additional projects. \n \n3.3.2. EMISSIONS REDUCTION MEASURES ARE INHERENTLY COSTLY IN \nSOME SECTORS  \nLimited participation in the CFI by particular activities or sectors is not necessarily a sign that there is \na problem. In fact, it can be a sign that measures to ensure environmental integrity are working. For \nsome activities or sectors, transaction costs are likely to remain unavoidably high because their \ncharacteristics necessitate relatively complicated methods to ensure abatement is real and \nadditional. In the agriculture sector, for example, there are challenges associated with measuring and \nverifying emissions reductions in natural systems that have high levels of local variability (CCA \n2014a). These challenges are exacerbated where projects only achieve a small quantity of emissions \nreductions, as transaction costs can quickly become high on a per tonne CO2-e basis. \nWhile transaction costs can be reduced through streamlining (for example, by using modelled \nabatement estimates rather than direct measurement), there is only so much that can be done before \nthe risk to environmental integrity becomes unacceptable.  \nLack of participation by particular activities and sectors may also reflect that abatement options in \nthose areas are not cost-effective. For example, analysis by researchers from the University of \nMelbourne suggests that few soil carbon projects are likely (based on a credit value of $24.15/t), as \nthe land management and land use changes required to achieve a consistent and verifiable increase \nin soil carbon are rarely to the financial benefit of a farmer (White & Davidson 2014). The Australian \nDairy Industry Council observed that opportunities for abatement from soil carbon are particularly \nlimited in the dairy industry (sub. 1, p. 14). \nTo the extent an objective of the ERF is to achieve lowest-cost abatement, one would expect higher \ncost sectors to have low representation. \n \nCARBON FARMING INITIATIVE REVIEW REPORT 47 \n3.4. STRIKING THE RIGHT BALANCE—SCHEME PARTICIPATION AND \nADDITIONALITY \nMany of the changes under the ERF involve trade-offs between encouraging scheme participation \nand ensuring the genuine additionality of emissions reductions. For example, more standardised \nmethods could increase the number of businesses willing to put forward proposals by reducing \ntransaction costs, but provides less scope to consider project-specific variables. \nStriking the right balance will always involve some degree of judgment and learning. The CFI placed \na reasonably heavy focus on additionality and accurate measurement of emissions, and required \nparticipants to adhere to relatively prescriptive rules. In the ERF white paper, the government \nsignalled an increased emphasis on making it easy for business to participate in the scheme through \nstreamlined administration.  \nGovernance arrangements will play an important role in minimising new or expanded risks under the \nERF. The ERAC and CER will need to be nimble so they can respond to unexpected problems in a \ntimely manner. Transparent processes and independent scrutiny of the scheme’s progress will help \npromote accountability.  \nCFI features maintained in the ERF can help manage risks. For example, the ERAC can effectively \nveto methods it considers inconsistent with the offsets integrity standards. This helps protect \nenvironmental integrity from political pressure and lobbying. ERAC’s regular review of methods and \nability to suspend methods together provide a backstop should problems arise following the approval \nof a method. This will help ensure activities that have become non-additional are transitioned out of \nthe scheme in a timely manner. (As noted in Chapter 1, the government has also stated that it will \nreview operational elements of the ERF towards the end of 2015.) \nIt is important that these backstop measures do not become a substitute for rigorous method \ndevelopment and approval processes, as problems undermine the environmental integrity of the \nscheme until the government is able to close any ‘loopholes’. Variations to methods will not apply \nretrospectively, so any non-additional projects that have entered into contracts will continue to \nreceive funding for the period of those contracts.  \nThe effectiveness of the ERF’s governance arrangements will ultimately depend on details contained \nin legislative rules and final methods, as well as other factors such as the resourcing of relevant \nagencies, and the quality and experience of staff and committee members. Several stakeholders \nnoted the importance of providing the Department of the Environment with adequate resources for \nmethod development.  \nCONCLUSION \nC 8. Governance arrangements for the ERF will need to be responsive to unexpected \nproblems and render new projects ineligible should they become non-additional.  \n \nDue to the short timeframe for this review, the Authority was unable to consider all proposed options \nfor improving the CFI. Appendix B outlines some further issues that may warrant consideration in the \nfuture. \n \n48 CHAPTER 4 \nCHAPTER 4. THE EMISSIONS REDUCTION \nFUND IN THE BROADER \nCONTEXT \nThis chapter examines interactions between the ERF and other policies. It considers whether the \nERF should focus on abatement or take account of the multiple environmental benefits of projects, \nand when it would be appropriate for ERF projects to access multiple sources of funding. It also \ncomments on the potential contribution of the ERF to meeting Australia’s 2020 target and \nlonger-term goals.  \n4.1. INTERACTIONS BETWEEN THE EMISSIONS REDUCTION FUND \nAND OTHER POLICIES \nThe ERF operates in concert with a range of other government policies implemented, including the \nRET, energy efficiency schemes, land management and biodiversity programs and various \nregulations. If these other policies are sufficient to drive a project (and the associated emissions \nreductions), supporting them through the ERF would increase the cost to the community without \nnecessarily providing any additional benefits. Managing these interactions is important to achieve \nmultiple policy objectives in an efficient way. \nUp to now, the CFI has managed policy interactions through the ‘additionality test’ and the ‘negative \nlist’. The existence of simultaneous policies has not triggered a general exclusion from the CFI, \nalthough the impact of other policies has been considered in developing methods and setting \nbaselines (Box 2). \nBOX 2 ERF INTERACTION WITH OTHER SCHEMES AND REGULATION—THE CASE \nOF LANDFILL WASTE \nMost landfill operators are required to treat methane emissions from landfill waste in a particular \nway under state regulations. The current method for the capture and combustion of landfill gas \nmust account for the emissions reductions achieved by the landfill under state regulation, and \ncredits only the additional amount. The reduction in credits helps ensure that state regulation \nand the ERF operate relatively efficiently. \nSome landfill operators use the captured methane to produce electricity and sell it into the grid. \nMany of these projects receive support under the RET. These projects displace electricity \ngenerated from other sources (particularly fossil fuels), leading to emissions reductions. The \nERF does not provide credits for these emissions reductions, however, as they are already \nsupported by the RET. In this case, an efficient outcome is achieved by separately identifying \nand rewarding the two distinct streams of abatement. \n \nUnder the recent amendments, the ERF ‘additionality test’ has been augmented by two new \nelements—the project must not have started prior to registration, and must be unlikely to be carried \n \nCARBON FARMING INITIATIVE REVIEW REPORT 49 \nout under another government program if not approved under the ERF. The latter helps ensure the \ngovernment avoids paying for the same emissions reductions twice. \nThe following sections explore three dimensions of policy interactions: \n• whether the ERF should focus on lowest cost abatement \n• when multiple sources of funding might be appropriate  \n• the circumstances in which ERF is the right tool to reduce emissions. \n4.1.1. SHOULD THE EMISSIONS REDUCTION FUND FOCUS ON LOWEST \nCOST ABATEMENT? \nThe government’s stated overriding objective is that the ERF will reduce emissions at the lowest cost \nover the period to 2020. At the reverse auction stage, and once bidders have passed \npre-qualification tests, the only consideration of bids is with respect to price. \nThis approach has distinct advantages. By focusing on price only, the ERF is likely to secure a \ngreater volume of emissions reductions. This in turn improves the scheme’s contribution to meeting \nAustralia’s emissions reduction goals. A singular focus also simplifies program administration, \navoiding the need for different areas of expertise and complex rules to assess and weigh up different \nbenefits (Australian Industry Greenhouse Network Issues Paper sub. 13, p. 3). Considering \noutcomes in a more holistic way, however, also could have advantages. All things being equal, it is \ndesirable to support projects that deliver more benefits for the same cost. The ERF currently has no \nway of assessing which projects do so. Focusing on the cheapest abatement may also miss value for \nmoney (albeit more expensive, in $/tCO2-e terms) projects delivering a broader range of benefits. By \nway of example, some projects, particularly in the land sector, could deliver benefits such as \nbiodiversity protection, reduced soil erosion and improved water quality, which contribute to the CFI \nAct objective of protecting Australia’s natural environment and improving resilience to climate change \n(Fares Rural sub. 3, p. 2, Kimberley Land Council sub. 12, pp. 1-2, and National Native Title Council \nsub. 14, p. 1). \nOn balance, however, the Authority considers the focus on lowest cost abatement appropriate for \ntwo main reasons. First, paying for other benefits through the ERF would reduce its capacity to \nachieve abatement, and in turn, reduce the prospect of meeting emissions reduction targets. \nSecond, many of the broader benefits related to ERF projects are better assessed at a local or state \nlevel, or pursued through separate national policies, such as the National Landcare Program, that \nspecifically target these types of benefits. Where there are barriers to ERF participation, the \nAustralian government can establish enabling policies, such as the Extension and Outreach program \nthat builds capacity for farmers and land managers.  \nRather than dilute the ERF’s primary focus, the challenge for the ERF should be to interact efficiently \nwith other programs to achieve the best overall outcomes. \n4.1.2. WHEN ARE MULTIPLE SOURCES OF FUNDING APPROPRIATE? \nIf the ERF concentrates on lowest cost abatement, it needs to interact appropriately with other \npolicies focused on other benefits. This could be facilitated by allowing projects to receive additional \nfunding directed to those other benefits in appropriate circumstances. \nIn assessing when multiple sources of funding are appropriate, it is helpful to consider whether the \nadditional government funding is directed towards the same outcome as the ERF. One of the main \nobjectives of state energy efficiency programs is to reduce emissions and if projects supported under \n \n50 CHAPTER 4 \nthese programs are simultaneously allowed to access the ERF, they would be paid twice for \nessentially the same outcome. This is obviously undesirable. \nThe assessment would prove more difficult where other programs have multiple objectives: \n• a scheme that supports forestry projects for biodiversity benefits, for example, may also have \na carbon sequestration objective. In this case—particularly if the biodiversity program provides \nsufficient support for the forestry projects to proceed—it would be inappropriate to allow ERF \nsupport as well. \n• a landfill waste project could receive funding from the ERF and the RET. While both programs \nshare the objective of reducing emissions, in this case ERF support could be appropriate as it \nsupports a distinct stream of abatement (Box 2). \nIn contrast, some projects achieve multiple outcomes because they are able to secure support from \nmultiple programs. The Kimberley Land Council submission highlighted the importance of co-funding \nto the success of the North Kimberly Fire Abatement Project: \nThis project has already successfully abated over 200,000 tonnes of carbon dioxide \nequivalent, while providing jobs, training, and supporting cultural aspirations for native \ntitle holders. The success of the North Kimberley Fire Abatement Project has been the \nresult of a number of factors, including the strong relationships between project partners, \ninvestment in governance and business planning processes and prioritisation of training \nand capacity building for Traditional Owners. This success has been made possible \nthrough access to support from multiple channels, including Working on Country and \n[Indigenous Protected Area] programs, the Biodiversity Fund and the sale of carbon \ncredits. (sub. 12, p. 2) \nThese examples highlight the need to test whether the project would have proceeded on the basis of \nsupport from the other program. One of the new elements of the ERF additionality test—that the ERF \nwill not support activities that are likely to go ahead under another government program—is likely to \nprove helpful. The draft ERF rules elaborate on this test, listing specific government programs such \nas the 20 Million Trees Programme and various state energy efficiency schemes (DOE 2014b, s. 20). \nProjects that receive support from these schemes would be ineligible for ERF support. This should \nhelp enhance the cost-effectiveness of the ERF.  \nFurther, by assessing additionality at the program level (rather than on a project-by-project basis), \nthe new approach should reduce transaction costs and improve predictability. Consultation with the \nrelevant program administrator(s) will be important to identify programs that provide sufficient support \nfor their participating projects to proceed. While it is possible that allowing ERF support to some \nindividual projects may enhance abatement outcomes, this program-listing approach should provide \na reasonable guarantee of additionality with relatively streamlined administration. The list of excluded \nprograms will need to be reviewed and updated periodically to avoid creating perverse outcomes. \nFinally, where other policies share the ERF’s objective of reducing emissions, the government could \nconsider establishing a mutual recognition arrangement. This would allow certificates from one \nscheme to be sold into the other (and then cancelled). This would avoid double-paying for \nreductions, but would also give project proponents the flexibility to access both schemes. Linking \nschemes in this way would require an assessment of the eligibility, measurement, reporting and \nverification arrangements, as well as the administration and objectives of the respective schemes, to \nensure they are compatible. While this assessment would take some time and resources, it could \nexpand options for project developers, and (by broadening and deepening the set of participants) \nmay also make the ERF (and the linked schemes) more efficient. \n \nCARBON FARMING INITIATIVE REVIEW REPORT 51 \n4.1.3. CHOOSING BETWEEN THE EMISSIONS REDUCTION FUND AND \nREGULATORY APPROACHES \nDetermining when the ERF is preferred to regulatory approaches, such as minimum standards or \ndisclosure obligations, is difficult. The choice principally comes down to when incentives are more \neffective at unlocking emissions reduction opportunities. If the benefits of lower emission activity \nclearly outweigh the costs, the costs are fairly evenly spread across the sector, and the government \nhas sufficient information to craft efficient rules, regulation may be more appropriate. If the costs and \nbenefits vary greatly across the sector, or the government has little information, ERF incentives may \nbe more effective. Depending on the circumstances, the best approach may be incentives provided \nby the ERF, regulation or a combination. \nTo illustrate, the Minimum Energy Performance Standards (MEPS) specify standards that appliances \nmust meet before they can be offered for sale. The government has based the standards on solid \ninformation about the performance levels of appliances in a way that does not impose a big burden \non any particular producers or purchasers. In this case regulation is suitable (see Commonwealth of \nAustralia 2014c, p. 40).1  \nOn the other hand, the costs and associated benefits of many forestry and agriculture opportunities \nvary greatly from location to location and the government does not possess good information about \nthem. Applying a regulatory standard for these activities would impose greater costs on some \nlandholders than others, and the government would have difficulty in setting appropriate standards. \nApplying incentives through the ERF still requires a level of knowledge to set methods and measure \nprojects; in this case, however, landholders can decide for themselves whether to (voluntarily) \nparticipate. Incentives in this case are likely to be more cost-effective in driving abatement than \nregulation. \nThe example of landfill waste is illustrative of a case where the choice is not clear cut. To date, many \nlarger landfills have participated in the CFI (and are expected to participate in the ERF). This might \nindicate that the costs of implementing methane capture and flaring equipment are relatively low and \neven and, combined with the government’s increased knowledge about the landfill sector, may be \nsuited to a stronger regulatory approach. \nThe ERF may be more effective in combination with other policies. The Commercial Building \nDisclosure Program, for example, requires owners to disclose the energy use of commercial \nbuildings. This makes valuable information accessible to building users and to the government, and \nin turn makes it easier to identify when ERF support is appropriate, and might enhance participation \nin building energy efficiency projects.  \nThere is a risk that ERF incentives may discourage other levels—and areas—of government from \npursuing other policies. If the national government funds an activity, the state government may be \nreluctant to regulate it, as it secures the desired outcome without any effort. That said, policies are \ntypically implemented for a variety of reasons, and the ERF may not be a major consideration. Good \ncoordination within and across government would help minimise this risk.  \nRegular assessments would help to maintain a reasonable balance between incentives through the \nERF and regulation. The pattern of costs and benefits of an opportunity might change, and the \ninformation held by the government might improve over time. While regular reviews of methods by \nthe ERAC will help identify whether activities are still additional, they will not answer the broader \nquestion of whether the ERF is and remains the right tool for the job. On-going independent periodic \n1 Government policy is that regulation should not be adopted as the default position; rather the policy \noption offering the greatest net benefit should be pursued (Commonwealth of Australia 2014). \n \n                                                          \n52 CHAPTER 4 \nreviews could determine whether an ERF method is still the best approach for unlocking the \nopportunity, or whether another approach might achieve abatement at lower cost. Such reviews \nshould consider a broad range of policy instruments. \nRECOMMENDATION \nR.2. The ongoing appropriateness of the ERF for achieving emissions reductions in particular \nsituations should be monitored and subject to independent and periodic review. \n \n4.2. THE EMISSIONS REDUCTION FUND IN THE CONTEXT OF THE \n5 PER CENT TARGET \nThe ERF is the centrepiece of the government’s Direct Action Plan to reduce Australia’s emissions, \nand the primary measure to achieve the minimum 5 per cent target by 2020. In assessing the ERF, it \nis therefore appropriate to consider how much abatement it is likely to deliver in its current form—\nincluding its current budget of $2.55 billion—and taking account of the government’s intention that \nthe safeguard mechanism will prevent emissions growing beyond business-as-usual levels. \nAs noted at the outset, these are still early days for the ERF. The government has not published any \nmodelling of the likely emissions reductions under the ERF. It plans to purchase emissions \nreductions at the lowest cost through reverse auctions or other purchasing processes. ‘Official’ \nestimates of the likely price and quantity of emissions reductions could influence bidding behaviour \nand increase the price of emissions reductions, so it is understandable the government is reluctant to \nrelease such data (Commonwealth of Australia 2014b). The Authority has, however, considered \npublicly available material on Australia’s abatement opportunities and the potential impact of the \nERF. \n4.2.1. AUSTRALIA’S EMISSIONS REDUCTION CHALLENGE AND \nOPPORTUNITIES \nAustralia’s abatement challenge to 2020  \nWhile Australia has made an international commitment to unconditionally reduce its emissions by \n5 per cent compared with 2000 levels by 2020, and by up to 15 or 25 per cent if ambitious \ninternational action is agreed (Commonwealth of Australia 2013, DOE 2014a), the government has \nrecently focused only on meeting the minimum 5 per cent target (DOE 2014c, p. 1). It has also \nindicated it plans to use Australia’s carryover of an estimated 131 Mt CO2-e under the Kyoto Protocol \ntoward meeting this target (Commonwealth of Australia 2014a, p. 15). \nOfficial estimates of the abatement task to meet a 5 per cent target have been declining in recent \nyears. In 2012, official projections suggested the task was a cumulative 754 Mt CO2-e over the \nperiod 2013–20 (DCCEE 2012). In 2013, the Authority estimated the task to be 593 Mt CO2-e (CCA \n2014a, pp. 132-133). Taking account of the carryover under the Kyoto Protocol, and the emissions \nreductions achieved by two years of the fixed carbon price, the current government estimate \nsuggests 421 Mt CO2-e of cumulative abatement over the period 2015–20 (including 131 Mt CO2-e in \n2020) would be required to meet the 5 per cent target (Figure 16). This estimate assumes existing \n \nCARBON FARMING INITIATIVE REVIEW REPORT 53 \npolicies (including energy efficiency schemes, the RET and some existing projects under the CFI) \nwould remain in place. \nFIGURE 16: AUSTRALIA’S ABATEMENT CHALLENGE TO 2020 \n \nSource: Commonwealth of Australia 2014a, p. 7. \nSeveral factors, and particularly falling electricity demand projections, suggest that the next official \nestimate of the abatement task to 2020 will be lower again. Frontier Economics estimates the \ncumulative abatement task to 2020 is closer to 225–279 Mt CO2-e, assuming there is no change to \nthe RET (Frontier Economics 2014). On the other hand, any further relaxation of land clearing laws, \nand/or any changes to the RET would add to the abatement task. \nAs discussed in Chapter 2, as at 3 December 2014, 10.6 million CFI credits had been issued. The \nhighest contributions have come from landfill gas flaring and avoided land clearing projects. This \nabatement has been driven by a carbon price of $23 in 2012–13 and $24.15 in 2013–14. This \nindicates that activity under the ERF would need to be scaled up, substantially relative to the CFI \nperformance, to meet the 2020 target. \nAustralia’s emissions reduction opportunities to 2020 \nThe Authority has conducted a detailed assessment of Australia’s emissions reduction opportunities \n(CCA 2014a). This highlighted substantial opportunities across the Australian economy in the \nelectricity, energy efficiency, transport and land sectors. These opportunities vary considerably in \nscale, reflecting each sector’s proportion of Australia’s total emissions and its responsiveness to \nincentives (Table 4). \n \n54 CHAPTER 4 \nTABLE 4: AUSTRALIA’S EMISSIONS REDUCTION OPPORTUNITIES \nSECTOR OPPORTUNITY \nElectricity Electricity offers the largest opportunity for emissions reductions by lowering the emissions intensity of \ngeneration, including through the continued deployment of wind and solar technologies, energy efficiency \nimprovements, and retrofitting of existing fossil fuel-fired plant and equipment. \nDirect combustion, \nfugitives and \nagriculture (export \ndriven sectors) \nSectors that are primarily driven by export demand—direct combustion, fugitives and agriculture—present the \ngreatest challenge. Emissions growth is projected for these even with a high carbon price.  \nDirect combustion emissions could be reduced through improvements in emissions intensity—such as \nincreased gas turbine and machinery efficiency—and a switch to alternative lower emissions energy sources, \nsuch as biofuels. \nFugitive emissions could be reduced through a shift away from higher to lower emissions mines, and the \ndeployment of additional pre- and post-mine drainage, where gas could be flared or used to generate \nelectricity. \nAgriculture emissions could be reduced by improved manure management, animal feed supplementation, \nfeedlot finishing and pasture improvements. Most technologies and practices for reducing livestock emissions \nare still in development and not ready for commercial use. \nTransport Transport emissions can be reduced in three ways: \nincreasing vehicle efficiency \nreducing the emissions intensity of fuels \nimproving demand management through mode shift from road freight to rail or shipping, and from private \nvehicles to public transport and physical activity (cycling and walking). \nIndustrial \nprocesses \nIndustrial process emissions are projected to be highly responsive to an incentive. Emissions could be \nsignificantly reduced through the use of nitrous oxide conversion catalysts for nitric acid production and the \ndestruction and replacement of synthetic greenhouse gases. \nForestry Greater reforestation and afforestation activities, avoided deforestation and improved land management \ncould deliver emissions reductions from the land sector. \nWaste Waste emissions reductions are still available through the expansion of alternative waste treatment facilities \nto reduce waste volumes being sent to landfill. \nSource: Climate Change Authority, based on Targets and Progress Review (CCA 2014a, Chapter 11) \nSimilar results are evident in other studies. ClimateWorks (2010) conducted a comprehensive \nanalysis identifying the 54 lowest-cost opportunities across the economy; ClimateWorks estimated \nthat adoption of all these opportunities would be sufficient to achieve a 25 per cent reduction in \nAustralia's emissions below 2000 levels by 2020. The opportunities were identified across six key \nsectors of the economy—power, forestry, industry, buildings, agriculture and transport (Figure 18). \n4.2.2. POTENTIAL SCALE AND COSTS OF EMISSIONS REDUCTIONS TO 2020 \nA number of studies have examined the scale of available emissions reduction opportunities, and \ntheir potential cost.  \nThe Authority’s Targets and Progress Review showed how much abatement a broadly applied, \nmandatory carbon price in force from 2013 might deliver (CCA 2014a, pp. 139-140). It examined \nthree different carbon price levels. The low price scenario, with a carbon price rising to around \n$6/tCO2-e in 2020, was projected to drive 162 Mt CO2-e of domestic abatement over the period \n2015–20. A high price, growing to $65/tCO2-e in 2020, was projected to drive sufficient domestic \nemissions reductions to meet the 5 per cent target (CCA 2014a, pp. 140, 151; Figure 17).  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 55 \nThe ERF scheme is likely to drive fewer emissions reductions at any given price. This is because the \nERF is voluntary, can only deliver abatement where and when the necessary methods are in place \nand projects are approved, and involves transaction costs in registering and verifying all abatement. \nFurther, it will only support emissions reductions at the project and facility level, rather than change \nincentives at the sector- and economy-wide level. Many of the emissions reductions in the Targets \nand Progress Review scenarios are not suited to project-based crediting—for example, changing the \ngeneration mix in the electricity sector toward low-emission generators, or making less-gassy coal \nmines more attractive to develop than more-gassy mines. Only a subset—such as improving the \nenergy efficiency of an industrial facility, or capturing and flaring methane from a coal mine—will be \nwell-suited to the ERF. For these reasons, the likely abatement under the ERF could be expected to \nbe less than the modelling-generated volumes shown in Figure 17. \nFIGURE 17: POTENTIAL EMISSIONS REDUCTIONS AT DIFFERENT CARBON PRICES, 2015–20 \n \n \n56 CHAPTER 4 \nNote: The modelling underpinning this figure applied a carbon price from 2013. The potential emissions reductions arising under \ndifferent carbon price incentives are calculated from 2015 to align with the current government estimate of 421 Mt CO2-e over the \nperiod 2015–20. All scenarios start from a carbon price of $5.49, with the low price rising to $6/tCO2-e in 2020, the medium price \n$27/tCO2-e and the high price $65/tCO2-e. \nSource: Climate Change Authority, based on modelling undertaken as part of Targets and Progress Review (CCA 2014a) \nThe ClimateWorks analysis tells a broadly consistent story. Its results are presented in a marginal \nabatement cost curve (Figure 18). The width of each box on the curve represents the potential scale \nof the opportunity in 2020 compared to a business-as-usual scenario. The height of each box \nrepresents the average cost for each tonne of abatement; this does not include policy-related \ntransaction costs that would be needed to realise the opportunities. If abatement is purchased up the \ncost curve to meet the minimum 5 per cent target, ClimateWorks’ analysis suggests a marginal price \nof $25 per tonne would be required. This assumes that all of the energy efficiency and half of the \nland sector abatement would be purchased, and no abatement opportunities would be missed. \nFIGURE 18: CLIMATEWORKS INVESTOR COST CURVE, 2020 \n \nNote: The cost curve shows the cost (or return) to the investor for various opportunities across the economy, with opportunities \nstacked from the least expensive on the left to the most expensive on the right. \nSource: ClimateWorks 2011, p. 3 \nIn summary, these studies suggest low incentives are unlikely to deliver sufficient emissions \nreductions to meet a 5 per cent target. Other appropriate policy drivers will be required. Even if the \nabatement task was significantly smaller, a substantial incentive might still be required. \n4.2.3. WHAT CAN THE EMISSIONS REDUCTION FUND ACHIEVE BY 2020? \nWhile the Authority modelling and ClimateWorks analysis point to possible emissions reduction \nopportunities, they do not attempt to estimate how many of these opportunities are likely to be \ncaptured by the ERF. Other studies have tried to address this question, in the absence it has to be \nsaid, of any practical experience with the ERF (no reverse auctions have been conducted, and \nmethods for newly covered sectors are yet to be approved); the studies, therefore, involve many \n \nCARBON FARMING INITIATIVE REVIEW REPORT 57 \nassumptions. That said, these published studies suggest that, based on the current funding \nprovision, ERF purchasing alone will not achieve emissions reductions of the scale required to reach \nthe minimum 5 per cent target. \nRepuTex has been estimating possible ERF activity throughout 2014 and in its November 2014 \nupdate (released after the CFI amendment legislation had passed the Senate) it concluded \n(Figure 19): \n[T]he ERF as currently funded will purchase between 40 and 130 million ACCUs \ncumulatively by 2020. This range is highly dependent on the price of abatement paid by \nthe government, primarily influenced by the benchmark price set to cap abatement bids. \n(RepuTex 2014, p. 8) \nFIGURE 19: REPUTEX ERF CREDIT SUPPLY FORECAST, 2013–20 \n \nSource: RepuTex 2014, p. 8 \nThe RepuTex projections are based on assumptions about reverse auction rules, possible \nbenchmark prices and expected early bidders but do not include the safeguard mechanism. They \nalso project that existing CFI participants are likely to be advantaged at the beginning of the ERF \nbefore this trend is reversed as projects ramp up under new methods. By 2020, RepuTex projects \napproximately 80 per cent of all credits purchased will come from high-emitting companies \n(Figure 20). \n \n58 CHAPTER 4 \nFIGURE 20:  REPUTEX ESTIMATES OF SHARE OF CREDITS BID INTO ERF UNDER EXISTING AND NEW \nMETHODS, 2015–20 \n \nSource: RepuTex 2014, p. 9 \nIn its July 2014 study, Bloomberg New Energy Finance forecast that the ERF may contract 51–\n178 Mt CO2-e of abatement in an efficient market, or as little as 23 Mt CO2-e if there is limited \nparticipation or the market is gamed (because of the auction design) (Bloomberg 2014a and 2014b). \nBloomberg speculated that auction design will encourage participant bids to deviate from the cost of \nabatement, increasing the unit costs paid under the scheme.  \nThe Climate Institute has calculated that the ERF and other policies could realise emissions \nreductions of around 180 Mt CO2-e in the period 2015–20 (The Climate Institute 2013a; based on \nmodelling by SKM–MMA and Monash University Centre of Policy Studies). This forecast was made \nin August 2013, prior to the detailed development of the ERF. It assumed the ERF was implemented \nin accordance with the government’s election commitments (including a safeguard mechanism using \nhistorical baselines) and that the RET continued unchanged. At the time the Institute forecast an \nadditional $4 billion of ERF funding to 2020 would be required to achieve the minimum 5 per cent \ntarget (The Climate Institute 2013b). \nIn short, these studies suggest that the ERF’s contribution to reducing emissions is likely to fall some \nway short of what is required to meet Australia’s minimum 2020 target.  \nBuying up the cost curve—limitations of the Emissions Reduction Fund \nAustralia can achieve its emissions reduction goals at lowest cost to the community by undertaking \nthe cheapest opportunities first and unlocking more expensive opportunities over time. \nThe ERF is likely to unlock some low-cost opportunities such as industrial energy efficiency, better \nwaste management, industrial building retrofitting and waste coal mine gas capture (ClimateWorks \n2013). Where sector-wide change or long-lived investment is required, however, the ERF is likely to \nbe less effective. Activities like increasing the share of lower emissions electricity generation are \nmore likely to benefit from a sector-wide policy, rather than project or facility-level incentives. Policy \nuncertainty and limited ERF contract periods may deter some long-lived projects such as \n \nCARBON FARMING INITIATIVE REVIEW REPORT 59 \nreforestation and afforestation. Even some of the cheapest opportunities may prove hard to unlock \n(ClimateWorks’ cost curve suggests transport fuel efficiency is the cheapest abatement opportunity \nin Australia; the Authority investigated options to improve vehicle efficiency and identified mandatory \nstandards as the best approach (CCA 2014b, pp. 31-38)). \nSome other factors that could reduce the ERF’s ability to purchase abatement efficiently up the cost \ncurve include: \n• Additionality concerns will mean some low-cost abatement opportunities will be missed. Some \ngenuinely additional commercial forestry and waste coal mine gas projects, for example, are \nlikely to be excluded from the ERF because they are hard to distinguish from non-additional \nprojects. At the same time, it is likely that some non-additional abatement, which would have \noccurred without ERF support, will be purchased, reducing the funds available to purchase \ngenuine emissions reductions. \n• Some companies will choose not to participate because of the cost and complexity of the \nscheme. The ERF’s voluntary nature makes it less effective at picking up all abatement \nopportunities relative to a compulsory approach. \n• Uncertainty regarding prices and likely demand may affect participation. It may take a number \nof auctions before participants can form reasonable expectations for ERF contract prices. \nPrices for any purchasing outside the ERF auctions (for example, through make-good or \nsafeguard provisions), and the extent of market demand beyond the government contract \nperiod, are also highly uncertain at this time. \n• CFI experience shows that it will take time for the ERF to achieve large-scale emissions \nreductions. Early emissions reductions have resulted from well-established technologies and \nactivities, and pre-existing projects that transitioned into the scheme. Similarly, the \nGreenhouse Gas Abatement Program (a $400 million national program to purchase \nabatement) also experienced significant take-up problems, mainly due to a lack of competitive \nproposals and the termination of approved projects (ANAO 2010, p. 85). While the ERF has \nmade significant improvements on earlier schemes, the inherent limitations of project-based \nbaseline and credit schemes (discussed in Chapter 3) remain.  \nThese limitations mean that the ERF will not pick up all the lowest-cost opportunities—only a subset \nof opportunities are likely to be realised. It is likely that the scheme will leave gaps along the cost \ncurve where projects are excluded, opportunities are not taken up and methods do not exist. The \nscheme will also take some time to deliver actual emissions reductions. \nUltimately, scheme impacts will be determined by the budget allocation (see Grattan Institute 2014, \np. 4), currently set at $2.55 billion, with possible further funding to be considered in future budgets. \nBased on the most recent official estimate, the abatement task to the 5 per cent target in 2020 is \n421 Mt. For the ERF to meet the target with only its current allocation, and without other policies, it \ncould only spend an average of $6/tCO2-e. While the abatement task appears to be shrinking, even if \nit halved to 210 Mt CO2-e the average price could only be $12/tCO2-e. These are very low prices. \nExisting state energy efficiency schemes in New South Wales and Victoria have paid an average of \n$14-35/tCO2-e (NSW Government 2014, p. 10, DSDBI 2014, p. 20) to capture some of the lowest \ncost opportunities available in the economy. To the extent that some of the tonnes purchased are \nnon-additional (which is not an unrealistic assumption) and some of the abatement is delivered after \n2020 (which is likely given that contract periods will extend beyond 2020), the number of purchased \ncredits actually contributing to the 2020 target would be reduced. \nMore emissions reductions could be purchased if the government provided additional funding to the \nERF in future budgets but this is not assured. The safeguard mechanism could drive additional \nreductions beyond those purchased by the government through the ERF but again there is no \n \n60 CHAPTER 4 \ncertainty on this front—the mechanism is still being designed, and will only apply to facilities with \ndirect emissions over 100,000 tonnes a year (about 130 companies covering 52 per cent of national \nemissions; Commonwealth of Australia 2014a, p. 52).  \nThe safeguard mechanism has the potential to complement ERF purchasing by driving emissions \nreductions below business-as-usual levels, but even if that potential is tapped, the existing RET and \nother policies (including the possible purchase of international credits) are likely to be necessary to \nachieve the minimum target. The Authority has previously recommended international emissions \nreduction units be used to help meet stronger 2020 targets (CCA, 2014a). International units could \nalso play a role in closing any gap between domestic reductions achieved, and the minimum \n5 per cent target.  \n4.3. THE EMISSIONS REDUCTION FUND IN THE CONTEXT OF \nLONGER-TERM GOALS \nThe preceding discussion has focused on the role of the ERF in meeting Australia’s minimum \n5 per cent target by 2020. In an earlier report the Authority expressed its view that not only was the \nminimum 5 per cent target inadequate, but that even with a somewhat stronger 2020 target Australia \nwould need to pursue deeper cuts beyond 2020 if it were to play its part in combatting the dangers \nposed by climate change. This raises the question of the possible role of the ERF in this longer-term \nendeavour. \nThe government supports the global goal of limiting warming to less than two degrees, and will \nconsider a longer-term target for Australia in 2015 (DFAT 2014). The Authority’s previously \nrecommended set of targets for Australia comprised a minimum target of 15 per cent below 2000 \nlevels by 2020 (rising to 19 per cent with the carryover from the Kyoto Protocol), a target range of \n40–60 per cent below 2000 levels by 2030, and a national emissions budget of 10,100 Mt CO2-e for \nthe period 2013–50. The Authority considered these goals to be consistent with Australia’s \ncontribution to meeting the overall goal of keeping global warming below two degrees. Its \nrecommendations were based on the latest climate science and the actions of other countries, and \ntook account of the cost of meeting the targets (CCA 2014a, pp. 10-11). \nAdopting stronger longer-term targets necessarily means the abatement task will become larger \neach year as the gap between business-as-usual emissions reductions and the target trajectory \nwidens over time. As the cheapest opportunities are taken up, the cost of unlocking the next \nopportunities on the cost curve also increases on a per tonne CO2-e basis (possibly offset to some \nextent by advances in relevant technologies). This combination of greater emissions reductions and \nhigher unit cost implies that funding for the ERF would need to increase steeply year after year, if it \nwere to remain the central policy in reducing Australia’s emissions.  \nThis exposes the limitations of government-funded models like the ERF in achieving longer-term \ntargets. As the abatement task grows, the scale of the budget outlays required becomes unrealistic. \nOn the basis of modelling for its Targets and Progress Review the Authority indicated that a marginal \ncarbon price of $65/tCO2-e would be required in 2020 to meet a 5 per cent target through domestic \nabatement; if the projected 2020 abatement task of 131 Mt CO2-e was purchased at this price it \nwould require spending of $8.5 billion in 2020 alone. In short, it is not feasible for governments to buy \ntheir way to decarbonisation. \nAs discussed in Chapter 3, project-by-project crediting against business-as-usual baselines has its \ninherent limitations, which have been demonstrated through international experience. The Clean \nDevelopment Mechanism is a project-based baseline-and-credit scheme that encourages emissions \nreductions in developing countries. That scheme’s documented problems with scalability have meant \nthat is has become widely regarded as an introductory mechanism, to be complemented or \n \nCARBON FARMING INITIATIVE REVIEW REPORT 61 \nsupplanted eventually by more effective mechanisms as the level of development of the host country \nincreases. \nUltimately, if Australia is to decarbonise its economy, credible long-term price signals will be needed \nto change behaviours and investment decisions. Government purchasing arrangements will always \nstruggle to provide such signals that are credible, comprehensive and long-term.  \nThe Authority has recently been tasked to conduct a special review under section 59 of the Climate \nChange Authority Act over the next 18 months. This review will consider future national emissions \nreduction targets, emissions trading and other measures relevant to Australia pursuing its post-2020 \ngoals. The Authority will undertake extensive public consultation throughout the review.  \nCONCLUSION \nC 9. The size of Australia’s abatement task to 2020 is unclear, and it is difficult to estimate \nprecisely the amount of emissions reductions the ERF purchasing scheme will deliver. It \nis clear, however, that by itself and as currently funded, the scheme is unlikely to deliver \nsufficient emissions reductions to reach even Australia’s minimum 2020 target of 5 per \ncent below 2000 levels. A range of complementary actions will be required, now and \nbeyond 2020. \n \n \n62 APPENDIX A \nAPPENDIX A PUBLIC CONSULTATION \nThe Authority is required to conduct public consultation for all of its reviews. Throughout this review, \nthe Authority consulted with a wide range of interested parties, including carbon farming participants, \nindustry and government.  \nOn 17 October 2014, the Authority released an issues paper, which can be accessed on the \nAuthority’s website. As part of the issues paper submissions process, the Authority received 17 \nstakeholder submissions. Three submissions were confidential. \nTable 5 lists the individuals and organisations that provided submissions. These submissions are \navailable on the Authority’s website at: \nhttp://www.climatechangeauthority.gov.au/submissions/submissions-received. \nThe Authority also held a stakeholder roundtable in Canberra on 25 November 2014. This roundtable \ntested the review's preliminary conclusions with 24 stakeholders.  \nIn addition to specific consultation activities, the Authority conducted less formal consultation with \ninterested parties and government agencies. The Authority held 20 one on one meetings with \nstakeholders over the course of the review. \nTABLE 5: SUBMISSIONS RECEIVED \nRECEIVED FROM SUBMISSION \nNUMBER \nRECEIVED FROM SUBMISSION \nNUMBER \nAustralian Dairy Industry \nCouncil  1 \nGreenhouse Gas Consulting \nServices 17 \nAustralian Industry \nGreenhouse Network 13 \nGrowcom 10 \nAustralian Forest Products \nAssociation 9 \nKimberley Land Council  12 \nClear Environment 6 LMS Energy 2 \nCountry Carbon 7 National Farmers’ Federation 5 \nFares Rural 3 National Native Title Council 14 \nGovernment of Western \nAustralia 4 \nRAMP Carbon 15 \n \n \nCARBON FARMING INITIATIVE REVIEW REPORT 63 \nAPPENDIX B ISSUES FOR FUTURE REVIEWS \nThis appendix summarises issues raised that were not considered in this review, but that could be \nconsidered in future reviews. \nB.1  25-year permanence option \nUnder the CFI, sequestration projects were subject to a 100-year permanence obligation. Several \nstakeholders noted that this obligation acted as a barrier to participation for some types of projects, in \npart due to concerns about the potential adverse effects on future generations of landholders. \nTo address this concern, the ERF includes a 25-year permanence option. The number of credits \nissued for projects that take up this option will be discounted by 20 per cent relative to 100-year \nprojects. This discount reflects the potential cost to government of replacing carbon stores if 25-year \nprojects are later discontinued.  \nAlthough several stakeholders supported the 25-year permanence option, there are issues to \nconsider: \n• Discount calculations are very sensitive to assumptions about future carbon prices, and the \nprobability, timing and pace of reversal (Macintosh 2012). The appropriateness of the 20 per \ncent discount depends on whether these underlying assumptions are reasonable, given \navailable information, and the level of financial risk the government (and public) is willing to \naccept. \n• Using a uniform discount of 20 per cent reduces administrative complexity but may not reflect \ndifferences in risks across different types of projects. \n• Without a binding cap or an obligation for future governments to replace any carbon stores \nthat are reversed, the environment may ultimately bear the cost. \nB.2  Deductions for risk of reversal and leakage \nUnder the CFI, a risk of reversal buffer of five per cent was applied to all sequestration projects, \nmeaning that for every 100 tonnes of carbon stored by a project, 95 credits were issued. This risk \nbuffer was to account for some carbon stores being temporarily lost, for example through bushfire. \nThe risk of reversal buffer is unchanged under the ERF. \nFares Rural (sub. 3, p. 6) submitted that the risk of reversal buffer should be set at a lower level \nbased on the real incidence of fire and other reversal in Australia.   \nUnder the CFI, methods can apply a deduction to credits for leakage, which refers to the risk that the \nproject will trigger an increase in emissions from sources, or reduction in removals by sinks, that \noccurs outside the project boundary. In practice, no CFI methods included a deduction for leakage. \nAs noted in Chapter 2, leakage can be influenced by various factors (including commodity prices) \nand can occur at different spatial scales and over time. Consequently, it is difficult to estimate.  \nB.3  Project aggregation \nThe ERF aims to support aggregation in the land sector by relaxing the requirement that project \ndevelopers need to own the land (or hold another relevant property right). \nThe National Farmers’ Federation noted there are benefits and risks associated with participation in \nan aggregated project; risks include that individuals could be misled into participation by \n \n64 APPENDIX B \nunscrupulous aggregators. To address this risk, National Farmers’ Federation proposed a consumer \nprotection framework similar to the model used for residential tenancy (sub. 5, pp. 2-3).  \nRAMP Carbon advocated the development of a dedicated mechanism to promote aggregation, \nsimilar to the programmatic approach under the Clean Development Mechanism or accredited \ncertificate provider under GGAS/ESS. To the extent this is not feasible in the short term, RAMP \nCarbon suggested an interim step would be to create flexibility within the legislative rules to allow \nless stringent audit requirements for project aggregators (sub. 15, p. 4).  \nB.4  Negative list \nPoorly designed projects can lead to perverse outcomes (for example a forest project may put \nexcessive pressure on water resources). Like the CFI, the ERF manages negative impacts through \nrequirements to: \n• hold required water, planning and environmental approvals \n• take account of regional natural resource management plans.  \nIt also excludes projects that could pose social and environmental risks (via the ‘negative list’). \nIn principle, where the concerns apply generally (and are not unique to ERF projects) other policies \nshould address them. For example, an afforestation project under ERF could draw up large volumes \nof water, thereby degrading local wetlands and/or depleting water resources available to towns or \nirrigators. This problem could arise with any afforestation project—not just one supported by the \nERF. An appropriate response would be to have a general policy that included, for example, a \nrequirement for forest plantations in particular areas to buy a water licence. ERF and non ERF \nprojects would all have to comply with this requirement. \nIn practice, however, such general policies are not always in place. As a result, the ERF could \nreasonably play a role in mitigating negative impacts, either by making some types of projects \nineligible or by putting obligations into methods. This should be the exception rather than the rule. \nB.5  Improving transparency \nThe ERF includes a number of measures to promote transparency and provide opportunities for \npublic input to methods and reviews. Stakeholders identified some opportunities for improvement, \nincluding: \n• reviewing the outcomes achieved and the effectiveness of the Carbon Farming Futures ‒ \nExtension and Outreach program (National Farmers’ Federation, sub. 5, p. 1) \n• publishing the Minister’s final decisions on methods, along with the ERAC’s advice \n• publishing the reasons for prioritising or not prioritising particular methods, along with any \naccompanying analysis  \n• formalising arrangements for individuals outside the technical working groups to contribute to \nmethod development (Law Council of Australia 2014, p. 5). \n \nCARBON FARMING INITIATIVE REVIEW REPORT 65 \nGLOSSARY  \nTERM DEFINITION \nadditionality Emissions reductions that are additional to what would have occurred \nin the absence of a policy-induced project or activity. \nAustralian carbon \ncredit unit (ACCU) \nA type of emissions unit issued for verified emissions reductions under \nthe Carbon Farming Initiative and the Emissions Reduction Fund, and \nheld in the Australian National Registry of Emissions Units. \nbaseline A counterfactual scenario of future emissions that would have been \nexpected to occur without the emissions-reducing activity.  \nbusiness-as-usual Emissions that would occur without any additional policy intervention. \nbaseline and credit \nscheme \nType of scheme that identifies measures and provides incentives for \nactivities that reduce emissions below a baseline. This general name \ncovers a large variety of schemes.  \nCarbon Farming \nInitiative (CFI) \nAn Australian emissions offset scheme that credits emissions \nreductions from certain sources, such as forestry and agriculture, which \nwere not covered by the carbon pricing mechanism. \ncarbon pricing \nmechanism \nAn emissions trading scheme that put a price on Australia’s \ngreenhouse gas emissions. It was introduced under the Clean Energy \nAct and applied to Australia’s biggest emitters (called ‘liable entities’). It \nwas repealed in July 2014. \ncoverage Which entities would be eligible or required to participate in a scheme, \nand which emissions would be included. \nDirect Action Plan The Commonwealth Government’s policy to reduce greenhouse gas \nemissions and establish a clean-up and environment conservation \nprogram. A central element of the plan is the Emissions Reduction \nFund. \nDomestic Offsets \nIntegrity Committee \n(DOIC) \nAn independent expert committee that assessed proposals for methods \nunder the Carbon Farming Initiative and advised the Minister for the \nEnvironment on their approval. \nemissions intensity A measure of the amount of emissions associated with a unit of output; \nfor example, emissions per unit of gross domestic product. \nemissions reduction The act or process of limiting, restricting or sequestering greenhouse \ngas emissions. \n \n66 GLOSSARY \n \nEmissions Reduction \nAssurance Committee \n(ERAC) \nAn independent, expert committee that will assess whether methods \nmeet the requirements of the Emissions Reduction Fund and provide \nadvice to government. \nEmissions Reduction \nFund (ERF) \nA scheme resulting from the expansion of, streamlining and other \nchanges to the CFI in November 2014. The ERF involves purchases of \ncredits by the Government. It will also include a safeguard mechanism \nfrom 1 July 2015. \nenvironmental \nintegrity \nThe attribute of whether (and the extent to which) credits issued under \nthe CFI or ERF are based on accurate measurement, are additional, \npermanent and do not cause an increase in emissions outside of the \nproject (no leakage). \ngreenhouse gas Any gas (natural or produced by human activities) that absorbs infrared \nradiation in the atmosphere. Key greenhouse gases include carbon \ndioxide, water vapour, nitrous oxide, methane and ozone. \nKyoto Protocol An international agreement adopted under the United Nations \nFramework Convention on Climate Change in 1997. It includes binding \nnational targets for developed countries and flexible mechanisms \nincluding the Clean Development Mechanism (CDM). \nKyoto unit Emissions units eligible for compliance with Kyoto Protocol targets—\nthese include assigned amount units (AAUs), certified emission \nreduction units (CERs), emission reduction units (ERUs) and removal \nunits. \nland use, land use \nchange and forestry \n(LULUCF) emissions \nEmissions associated with human-induced changes in land use, such \nas deforestation, afforestation and forest management. \nlegacy waste Waste that is deposited into a landfill prior to 1 July 2012. Projects that \nreduce emissions from legacy waste were eligible for credits under the \nCFI. \noffset scheme A scheme, typically voluntary, that complements a policy creating a \nliability for emissions, such as a carbon tax or cap-and-trade scheme. \nOffset schemes can provide a way for liable entities to meet their \ncarbon tax or cap-and-trade liabilities at lower cost and drive emissions \nreductions in a wider set of sectors. \npositive list A register of emissions reduction activities eligible to earn carbon \ncredits under the Carbon Farming Initiative. The positive list played a \nrole in trying to ensure that credits were only issued for additional \nemissions reductions. A method could not be approved for use under \nthe Carbon Farming Initiative unless it related to an activity on the \npositive list. \n \nCARBON FARMING INITIATIVE REVIEW REPORT 67 \nnegative list Identifies types of projects that are likely to cause adverse impacts to \none or more of the following: the availability of water, the conservation \nof biodiversity, the local community, and land access for agriculture \nproduction. The negative list is designed to address residual risks from \nCFI and ERF projects that are not addressed through existing \nregulations and planning regimes.  \nRenewable Energy \nTarget (RET) \nA Commonwealth Government scheme that places a legal obligation \non electricity retailers and large electricity users to buy a certain \nproportion of their electricity from renewables-based generation. \nsafeguard mechanism An element of the ERF that will establish penalties for large emitters \nthat exceed a defined baseline. The safeguard mechanism is to \ncommence in July 2016. \nsequestration The removal of atmospheric carbon dioxide, either through biological \nprocesses (for example, photosynthesis in plants and trees), or \ngeological processes (for example, storage of carbon dioxide in \nunderground reservoirs). \ntransaction costs The costs of participating in a market. In the case of the CFI and ERF, \ntransaction costs are all costs involved in developing, approving and \nadministering projects apart from those costs directly associated with \nimplementing and maintaining the project itself. Transaction costs also \ninclude costs to government and project proponents for method \ndevelopment, reporting and verification. \nUnited Nations \nFramework \nConvention on \nClimate Change \n(UNFCCC) \nAn international treaty that commits signatory countries (Parties) to \nstabilise greenhouse gas concentrations in the atmosphere at a level \nthat would prevent dangerous human-induced interference with the \nclimate system. \n \n \n68 ABBREVIATIONS AND ACRONYMS \n \nABBREVIATIONS AND ACRONYMS \nTERM DEFINITION \nACCU Australian carbon credit unit, issued under the Carbon Farming Initiative \nBAU business-as-usual \nCFI Carbon Farming Initiative \nCO2-e carbon dioxide equivalent \nDOIC Domestic Offsets Integrity Committee, Carbon Farming Initiative methodology review \nbody \nERAC Emissions Reductions Assurance Committee \nERF Emissions Reduction Fund \nLULUCF land use, land use change and forestry \nMt megatonne (mass, one million metric tonnes) \nRET Renewable Energy Target \nUNFCCC United Nations Framework Convention on Climate Change \n \n \nCARBON FARMING INITIATIVE REVIEW REPORT 69 \nREFERENCES \nCHAPTER 1  \nClean Energy Regulator (CER) 2014, Step 5: Surrender enough units to satisfy liability in ANREU, \nCER, Canberra, viewed 8 December 2014, http://www.cleanenergyregulator.gov.au/Carbon-Pricing-\nMechanism/steps-for-liable-entities/step-5/Pages/default.aspx. \nClimate Change Authority (CCA) 2014, Coverage, Additionality and Baselines: Lessons from the \nCarbon Farming Initiative, CCA study, Melbourne. \nCommonwealth of Australia 2011, Securing a Clean Energy Future: The Australian Government’s \nClimate Change Plan, Canberra. \nCommonwealth of Australia 2014, Emissions Reduction Fund White Paper, Canberra. \nDepartment of Climate Change and Energy Efficiency (DCCEE) 2012, The Carbon Farming \nInitiative Handbook, DCCEE, Canberra.  \nDepartment of State Development, Business and Innovation (DSDBI) 2014, Business Impact \nAssessment Victorian Energy Efficiency Target, DSDBI, Victoria. \nDepartment of the Environment (DOE) 2014a, Carbon Credits (Carbon Farming Initiative) Rule \n2015 (exposure draft), DOE, Canberra, viewed 5 December 2014,  \nwww.environment.gov.au/climate-change/emissions-reduction-fund/carbon-credits-carbon-farming-\ninitiative-rule-2015-under-emissions-reduction-fund. \nDOE 2014b, The Emissions Reduction Fund: The Safeguard Mechanism, fact sheet, DOE, \nCanberra, viewed 26 November 2014, \nhttp://www.environment.gov.au/system/files/resources/40b02d31-9e4c-4359-b812-\n81a86945d06f/files/erf-fs-safeguard.pdf. \nDOE 2014c, The Emissions Reduction Fund: Carbon Farming Initiative Transition, fact sheet, DOE, \nCanberra, viewed 24 November 2014, \nhttp://www.environment.gov.au/system/files/resources/e202e73d-8745-468b-92dd-\nb549950e41c4/files/erf-fs-cfi-transition.pdf. \nMacGill, I, Passey, R, Nolles, K, & Outhred, H 2005, The NSW Greenhouse Gas Abatement \nScheme: An assessment of the scheme’s performance to date, scenarios of its possible performance \nto 2012, and their policy implications, draft discussion paper, Centre for Energy and Environmental \nMarkets, Sydney. \nProductivity Commission (PC) 2008, What Role for Policies to Supplement an Emissions Trading \nScheme?, Submission to the Garnaut Climate Change Review. \nWorld Bank 2010, 10 Years of Experience in Carbon Finance: Insights from working with the Kyoto \nmechanisms, Washington. \nCHAPTER 2 \nAboriginal Carbon Fund 2014, Submission to the Emissions Reduction Fund Green Paper, viewed \n5 December 2014, www.environment.gov.au/submissions/emissions-reduction/green-paper/219-\naboriginal-carbon-fund.pdf.  \n \n70 REFERENCES \n \nAustralian Forest Products Association 2014, Submission to the Emissions Reduction Fund \nGreen Paper, viewed 12 December 2014, http://www.environment.gov.au/submissions/emissions-\nreduction/green-paper/251-australian-forest-products-association.pdf.  \nCarbon Credits (Carbon Farming Initiative) Act 2011 (Cth) (CFI Act).  \nCarbon Credits (Carbon Farming Initiative) Regulations 2011 (Cth) (CFI Regulations). \nClean Energy Regulator (CER) 2013, Transcript: Landfill webinar, CER, Canberra, viewed \n27 November 2014, http://www.cleanenergyregulator.gov.au/Carbon-Farming-\nInitiative/events/Pages/transcript-landfill-webinar.aspx.  \nCER 2014a, Register of Offsets Projects, CER, Canberra, viewed 4 December 2014, \nhttp://www.cleanenergyregulator.gov.au/Carbon-Farming-Initiative/Register-of-Offsets-\nProjects/Pages/default.aspx.  \nCER 2014b, Sequestration methodology: Reforestation and Afforestation, CER, Canberra, viewed \n27 November 2014, http://www.cleanenergyregulator.gov.au/Carbon-Farming-Initiative/methodology-\ndeterminations/Pages/Sequestration-methodology-Reforestation-and-Afforestation.aspx. \nClimate Change Authority (CCA) 2012, Renewable Energy Target Review, Melbourne. \nCCA 2014a, Coverage, Additionality and Baselines: Lessons from the Carbon Farming Initiative and \nOther Schemes, CCA study, Melbourne. \nCCA 2014b, Reducing Australia’s Greenhouse Gas Emissions – Targets and Progress Review, \nMelbourne. \nClimateWorks 2013, Tracking Progress towards a Low Carbon Economy: 5. Land-Use & Waste, \nMelbourne.  \nCommonwealth of Australia 2013, Australia to move to a floating price on carbon pollution in 2014, \nTownsville, viewed 27 November 2014, \nhttp://ministers.treasury.gov.au/DisplayDocs.aspx?doc=pressreleases/2013/006.htm&min=cebb&Do\ncType. \nCommonwealth of Australia 2014a, National Inventory Report 2012 Volume 1, Canberra. \nCommonwealth of Australia 2014b, Quarterly Update of Australia’s National Greenhouse Gas \nInventory: March 2014, Canberra. \nDepartment of Climate Change and Energy Efficiency (DCCEE) 2010, Australia’s emissions \nprojections 2010, DCCEE, Canberra. \nDepartment of the Environment (DOE) 2014a, Methodology determinations, DOE, Canberra, \nviewed 17 November 2014, http://www.environment.gov.au/node/36555. \nDOE 2014b, Methodology proposals – not endorsed, DOE, Canberra, viewed 17 November 2014, \nhttp://www.environment.gov.au/node/36677.  \nDepartment of Industry, Innovation, Climate Change, Science, Research and Tertiary \nEducation (DIICCSRTE) 2013, Carbon Farming Initiative: Guidelines for Calculating Regulatory \nBaselines for Legacy Waste Landfill Methane Projects, DIICCSRTE, Canberra,  \nviewed 27 November 2014, http://www.environment.gov.au/system/files/resources/c4762a93-bde4-\n444e-9980-f508460472cd/files/regulatory-baseline-guidelines.pdf.  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 71 \nDomestic Offsets Integrity Committee (DOIC) 2012a, Reasons for Refusal to Endorse \nMethodology Proposal—Addition of feed additives to reduce methane emissions from enteric \nfermentation in ruminants, DOIC, Canberra, viewed 28 November 2014, \nhttp://www.climatechange.gov.au/sites/climatechange/files/files/reducing-carbon/043FE2012-DOIC-\nstatement-of-reasons-PDF.pdf.  \nDOIC 2012b, Reasons for Refusal to Endorse Methodology Proposal—Management of large feral \nherbivores (camels) in the Australian rangelands, DOIC, Canberra, viewed 28 November 2014, \nhttp://www.environment.gov.au/system/files/pages/28f29237-22e3-4a92-bcb8-\n8c28989abeea/files/001fa2011-doic-statement-reasons.pdf.  \nDOIC 2012c, Reasons for Refusal to Endorse Methodology Proposal—Reduction of emissions of \nmethane through the application of a feed supplement to dairy cows, DOIC, Canberra, viewed \n28 November 2014, http://www.climatechange.gov.au/sites/climatechange/files/files/reducing-\ncarbon/027LD2012-DOIC-statement-of-reasons-PDF.pdf.  \nDOIC 2012d, Statement of reasons, letter to Parliamentary Secretary for Climate Change and \nEnergy Efficiency, 11 December 2012, DOIC, Canberra, viewed 11 December 2014, \nhttp://www.environment.gov.au/system/files/pages/9086508c-e449-41b3-8b0c-\n13d05c4af4e1/files/doic-advice-letter-positive-list-20121211.pdf. \nDOIC 2013a, Reasons for Refusal to Endorse Methodology Proposal—Avoided Deforestation \nMethodology, DOIC, Canberra, viewed 28 November 2014, \nhttp://www.climatechange.gov.au/sites/climatechange/files/files/reducing-\ncarbon/Web%20update%202013-01-31%20-%202012AD030%20-%20statement%20reasons%20-\n%20pdf.pdf. \nDOIC 2013b, Reasons for Refusal to Endorse Methodology Proposal—Enhanced Carbon Sink \nthrough the Establishment of Agribelt Forests for a Coppice Harvest System, DOIC, Canberra, \nviewed 28 November 2014, \nhttp://www.climatechange.gov.au/sites/climatechange/files/files/reducing-\ncarbon/Web%20update%202013-01-31%20-%202012RF038%20-%20statement%20reasons%20-\n%20pdf.pdf. \nDOIC 2013c, Statement of reasons, letter to Parliamentary Secretary for Climate Change and \nEnergy Efficiency, 12 March 2013, DOIC, Canberra, viewed 11 December 2014, \nhttp://www.environment.gov.au/system/files/pages/9c89b543-4c37-4376-add1-\nf9b1d3eaccb6/files/advice-organic-fertilisers-130312.pdf.  \nDOIC 2014, Advice to the Minister, letter to Minister for the Environment, 4 July 2014, DOIC \nCanberra, viewed 11 December 2014, http://www.environment.gov.au/system/files/pages/9c89b543-\n4c37-4376-add1-f9b1d3eaccb6/files/doic-advice-letter-not-suitable-20140704.pdf.  \nMacintosh, A 2012, The Carbon Farming Initiative: removing the obstacles to its success, Working \nPaper Series 2012/3, Australian National University Centre for Climate Law and Policy, Canberra. \nMacintosh, A 2013, Chipping away at Tasmania’s future: Alternatives to subsidising the forestry \nindustry, Institute Paper no. 15, The Australia Institute, December 2013, Canberra.  \nPerkins, F, & Macintosh, A 2013, Logging or carbon credits: Comparing the financial returns from \nforest-based activities in NSW's Southern Forestry Region, Technical Brief No. 23, The Australia \nInstitute, June 2013, Canberra.  \nProductivity Commission (PC) 2011, Carbon Emission Policies in Key Economies, Research \nReport, Canberra. \n \n72 REFERENCES \n \nRepuTex 2014, Unlocking Land Sector Abatement: Outlook for the Emissions Reduction Fund, \nRepuTex, Melbourne. \nSinclair Knight Mertz (SKM) 2012, Benefit of the Renewable Energy Target to Australia’s Energy \nMarkets and Economy, Report to the Clean Energy Council, August 2012. \nTreasury and the Department of Industry, Innovation, Climate Change, Science, Research and \nTertiary Education (Treasury and DIICCSRTE) 2013, Climate Change Mitigation Scenarios, \nmodelling report provided to the Climate Change Authority in support of its Caps and Targets \nReview, Treasury and DIICCSRTE, Canberra.  \nWarburton review (Expert Panel) 2014, Renewable Energy Target Scheme: Report of the Expert \nPanel, Canberra. \n \nCHAPTER 3 \nAboriginal Carbon Fund 2014, Submission to the Emissions Reduction Fund Green Paper, viewed \n5 December 2014, www.environment.gov.au/submissions/emissions-reduction/green-paper/219-\naboriginal-carbon-fund.pdf.  \nClean Energy Regulator (CER) 2014, Audit in the Emissions Reduction Fund: Risk-Based audit \nframework, November, Version 1.0., CER, Canberra, viewed 5 December 2014, \nwww.cleanenergyregulator.gov.au/Emissions-Reduction-Fund/Want-to-participate-in-the-Emissions-\nReduction-Fund/step4/Pages/default.aspx. \nClimate Change Authority (CCA) 2014a, Coverage, Additionality and Baselines: Lessons from the \nCarbon Farming Initiative and Other Schemes, CCA study, Melbourne. \nCCA 2014b, Renewable Energy Target Review, CCA, Melbourne. \nCommonwealth of Australia 2014, Emissions Reduction Fund White Paper, Canberra. \nDepartment of the Environment (DOE) 2014a, Carbon Credits (Carbon Farming Initiative) Rule \n2015 (exposure draft), DOE, Canberra, viewed 5 December 2014,  \nwww.environment.gov.au/climate-change/emissions-reduction-fund/carbon-credits-carbon-farming-\ninitiative-rule-2015-under-emissions-reduction-fund. \nDOE 2014b, Emissions Reduction Fund Methods, DOE, Canberra, viewed 5 December 2014, \nwww.environment.gov.au/climate-change/emissions-reduction-fund/methods. \nDOE 2014c, Emissions Reduction Fund Update, newsletter, November 2014, Canberra. \nDOE 2014d, The Emissions Reduction Fund: Emissions Reduction Methods, fact sheet, DOE, \nCanberra, viewed 5 December 2014, www.environment.gov.au/system/files/resources/a3938f6b-\nbe31-496b-a34a-0027439b0332/files/erf-fs-method-development.pdf. \nGarnaut, R, Government’s Direct Action Plan, Senate: Environment and Communications \nReferences Committee: Official Committee Hansard, 7 March 2014.  \nWhite, R, & Davidson, B 2014, Submission on the Carbon Farming Initiative component of the \nproposed Emission Reduction Fund, University of Melbourne.  \nThe Climate Institute 2014, Submission to Emission Reduction Fund Green Paper, February 2014. \n \n \nCARBON FARMING INITIATIVE REVIEW REPORT 73 \nCHAPTER 4 \nAustralian National Audit Office (ANAO) 2010, Administration of Climate change policies, Audit \nreport No.26 2009-10, ANAO, Canberra. \nBloomberg New Energy Finance (Bloomberg) 2014a, Why Australia’s Emissions Reduction Fund \nmay not work, Bloomberg, Melbourne. \nBloomberg 2014b, Australia’s Emissions Reduction Fund passes Senate, Bloomberg, Melbourne. \nClimate Change Authority (CCA) 2014a, Reducing Australia’s Greenhouse Gas Emissions – \nTargets and Progress Review, Melbourne. \nCCA 2014b, Light vehicle emissions standards for Australia, CCA study, Melbourne. \nClimateWorks 2010, Low Carbon Growth Plan for Australia, ClimateWorks, Melbourne. \nClimateWorks 2011, Low Carbon Growth Plan for Australia – 2011 update, ClimateWorks, \nMelbourne. \nClimateWorks 2013, Submission to the Emissions Reduction Fund Terms of Reference, viewed \n10 December 2014, http://www.environment.gov.au/climate-change/emissions-reduction-fund/terms-\nreference. \nCommonwealth of Australia 2013, Australia’s sixth national communication on climate change—a \nreport under the United Nations Framework Convention on Climate Change, Canberra. \nCommonwealth of Australia 2014a, Emissions Reduction Fund White Paper, Canberra. \nCommonwealth of Australia 2014b, Senate Standing Committee on Environment and \nCommunications Legislation Committee, Question on notice no.80, 10 June 2014, viewed \n9 December 2014, \nhttp://www.aph.gov.au/~/media/Committees/ec_ctte/estimates/bud_1415/Environment/answers/q80.\npdf. \nCommonwealth of Australia 2014c, The Australian Government Guide to Regulation, Canberra \nDepartment of Climate Change and Energy Efficiency (DCCEE) 2012, Australia’s emissions \nprojections, DCCEE, Canberra. \nDepartment of the Environment (DOE) 2014a, Australia’s emissions reduction targets, DOE, \nCanberra, viewed 12 December 2014, http://www.climatechange.gov.au/climate-\nchange/greenhouse-gas-measurement-and-reporting/australias-emissions-projections/australias. \nDOE 2014b, Carbon Credits (Carbon Farming Initiative) Rule 2015 (exposure draft), DOE, Canberra, \nviewed 5 December 2014,  \nwww.environment.gov.au/climate-change/emissions-reduction-fund/carbon-credits-carbon-farming-\ninitiative-rule-2015-under-emissions-reduction-fund. \nDOE 2014c, Reducing Australia’s Emissions, DOE, Canberra, viewed 10 December 2014, \nhttp://www.environment.gov.au/climate-change/emissions-reduction-fund/publications/reducing-\naustralias-emissions. \nDepartment of Foreign Affairs and Trade (DFAT) 2014, Climate change, DFAT, Canberra, viewed \n11 December 2014, http://www.dfat.gov.au/issues/climate-change/. \nDepartment of State Development, Business and Innovation (DSDBI) 2014, Business Impact \nAssessment Victorian Energy Efficiency Target, DSDBI, Victoria. \n \n74 REFERENCES \n \nFrontier Economics 2014, Can Australia still meet its emissions target with changes in the RET?, \nFrontier Economics, Melbourne. \nGrattan Institute 2014, Submission to the Emissions Reduction Fund Green Paper, viewed \n11 December 2014, http://www.environment.gov.au/climate-change/emissions-reduction-fund/green-\npaper. \nNSW Government 2014, Review of the Energy Savings Scheme: Issues Paper, NSW Government, \nSydney. \nRepuTex 2014, The ERF in Focus – Who Dares, Wins in FY15, RepuTex, Melbourne. \nThe Climate Institute 2013a, A Review of Subsidy and Carbon Price Approaches to Greenhouse \nGas Emissions Reduction, The Climate Institute, Sydney. \nThe Climate Institute 2013b, Coalition Climate Policy and the National Climate Interest,  \nThe Climate Institute, Sydney. \n \nAPPENDIX B \nLaw Council of Australia 2014, Submission to Senate Standing Committees on Environment and \nCommunication, Carbon Farming Initiative Amendment Bill 2014, 27 June 2014. \nMacintosh, A 2012, The Carbon Farming Initiative: removing the obstacles to its success, ANU \nCentre for Climate Law and Policy Working Paper Series 2012/3. \n  \n \nCARBON FARMING INITIATIVE REVIEW REPORT 75 \n \n \n \n",
    "Link": "https://core.ac.uk/download/pdf/30673003.pdf"
}