{
    "Title": "Review Of  The Soviet Budget  By R. Hutchings",
    "Authors": "Pryor, Frederic L.",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Swarthmore College Works Economics Faculty Works Economics Fall 1984 Review Of \"The Soviet Budget\" By R. Hutchings Frederic L. Pryor Swarthmore College, fpryor1@swarthmore.edu This work is brought to you for free and open access by . It has been accepted for inclusion in Economics Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. Follow this and additional works at: https://works.swarthmore.edu/fac-economics  Part of the Economics Commons Let us know how access to these works benefits you  Recommended Citation Frederic L. Pryor. (1984). \"Review Of \"The Soviet Budget\" By R. Hutchings\". Slavic Review. Volume 43, Issue 3. 492-493. DOI: 10.2307/2499428 https://works.swarthmore.edu/fac-economics/214  ReviewAuthor(s): Frederic L. PryorReview by: Frederic L. PryorSource: Slavic Review, Vol. 43, No. 3 (Autumn, 1984), pp. 492-493Published by: Association for Slavic, East European, and Eurasian StudiesStable URL: http://www.jstor.org/stable/2499428Accessed: 11-04-2016 13:45 UTC Your use of the JSTOR archive indicates your acceptance of the Terms & Conditions of Use, available athttp://about.jstor.org/terms JSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusteddigital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information aboutJSTOR, please contact support@jstor.org.Association for Slavic, East European, and Eurasian Studies is collaborating with JSTOR todigitize, preserve and extend access to Slavic ReviewThis content downloaded from 130.58.65.20 on Mon, 11 Apr 2016 13:45:59 UTCAll use subject to http://about.jstor.org/termsThis content downloaded from 130.58.65.20 on Mon, 11 Apr 2016 13:45:59 UTCAll use subject to http://about.jstor.org/terms Reviews 493 and his associates. Certain parts of Hutchings's discussion, for example, the analysis of the relationship of the dates of the budget laws and resulting relationships between planned and actual magnitudes, make an original and useful contribution. To use a distinction made by stock market analysts, Hutchings focuses on the tech- nical, rather than on the fundamental, aspects of the various budget series. He does not attempt to isolate causal factors underlying changes in particular taxes or expenditures or to analyze the relation between various physical and financial magnitudes (for example, the relation between the size of the Soviet armed forces and the reported defense ex- penditures). Further, he does not recalculate various series in order to make them more comparable over time but in many instances accepts the data at face value. He also does not devote much space to the impact of the budget or the financial system on the rest of the economy; and, indeed, some of his remarks on the subject, for instance, those on the increasing amount of personal savings, are based on a comparison of a stock (of savings) with a flow (of income), a point which gives rise to many serious objections. Although it is possible to take issue with much of his analysis, Hutchings has provided an important service in illuminating this murky corner of the Soviet economic system. How depressing it is that a nation with such pretensions about democracy should provide so little information to its citizens about the financial activities of their government. FREDERIC L. PRYOR Swarthmore College PROSPECTS FOR SOVIET AGRICULTURE IN THE 1980s. By D. Gale Johnson and Karen McConnell Brooks. Bloomington: Indiana University Press, 1983. x, 214 pp. Tables. $17.50, cloth. $8.95, paper. The combination of an \"old pro,\" D. Gale Johnson, and a young scholar, Karen Mc- Connell Brooks, offers an unusual double-barreled evaluation of Soviet agriculture in the 1980s. This is not a coauthored volume in the usual sense, but rather two monographs under a single cover. An advantage is the presentation of complementary views on many subjects. The advantage is offset somewhat, however, by the radical differences in style and presentation, which reflect a generational difference between the two authors. Judged by comprehensiveness of coverage and sober professionalism, the volume is required reading for anyone preparing an article or lecture on contemporary Soviet agriculture. Stylistically, however, the book is flawed. Many who should read it will give up in despair. Others,, particularly those who keep up with the literature on Soviet agricuilture, will find it repetitive both internally and with material published elsewhere by the authors. The book is unevenly divided between the two authors. D. Gale Johnson is respon- sible for part 1 (pp. 1-114) and the conclusion (pp. 195-204). Those who have kept abreast of Johnson's publications on Soviet agriculture over the years will find few sur- prises in his contributions to this volume. They will also immediately recognize the scru- pulous impartiality and the steady hand of a veteran agricultural economist. In view of the many myths that still circulate about Soviet agricultural performance, Johnson's bal- anced evaluations cannot be broadcast too widely. Johnson identifies three critical shortcomings of Soviet agriculture. First, although output has grown rapidly since 1950, it has not kept up with demand. Second, the cost 1. Daniel Gallik, et al., The Soviet Financial System: Structure, Operation, and Statistics, U.S. Bureau of the Census, International Population Statistics Report, Series P-90, No. 23 (Washington, D.C.: Government Printing Office, 1968). While this is probably the most serious omission in Hutch- ings's bibliography, a number of other monographs and articles in East and West that would have been useful to his analysis are also missing.This content downloaded from 130.58.65.20 on Mon, 11 Apr 2016 13:45:59 UTCAll use subject to http://about.jstor.org/terms",
    "Link": "https://core.ac.uk/download/84121887.pdf"
}