{
    "Title": "2019 Climate Change Institute Organizational Chart",
    "Authors": "Climate Change Institute",
    "Year": "No year available",
    "Abstract": "The 2019 organizational chart for the University of Maine Climate Change Institute submitted with the institute\\u27s annual report. The chart reveals names of research staff and research themes",
    "Keywords": "No keywords available",
    "Publisher": "DigitalCommons@UMaine",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "The University of Maine DigitalCommons@UMaine General University of Maine Publications University of Maine Publications 7-9-2019 2019 Climate Change Institute Organizational Chart Climate Change Institute Follow this and additional works at: https://digitalcommons.library.umaine.edu/univ_publications  Part of the Higher Education Commons, and the History Commons Repository Citation Climate Change Institute, \"2019 Climate Change Institute Organizational Chart\" (2019). General University of Maine Publications. 1596. https://digitalcommons.library.umaine.edu/univ_publications/1596 This Chart is brought to you for free and open access by DigitalCommons@UMaine. It has been accepted for inclusion in General University of Maine Publications by an authorized administrator of DigitalCommons@UMaine. For more information, please contact um.library.technical.services@maine.edu. R. HOOKE (CP)A. KELLEY (RAsP)ORGANIZATIONAL CHARTR. ADDESSIM. SCHAUFFLER S. BIRKEL (MAINE STATE CLIMATOLOGIST )ADMINISTRATION & OUTREACHRESEARCH THEMESREVISED  7/9/2019E. KOROTKIKH               IC, LA-ICP-MS                                              D. INTRONE                   STABLE ISOTOPE LABORATORYM. HANDLEY                  ICP-MS            K. BIRD                                     ARCHAEOLOGY LABORATORYANALYTICAL LABORATORY STAFFAtmospheric ClimateReconstruction & GlaciologyD. BELKNAPS. BIRKELP. BOHLEBERD. DIXONI. FERNANDEZ J. GILLJ. KELLEY K. KREUTZ A. KURBATOVP. MAYEWSKI K. MAASCHJ. SCHAEFERA. SEIMON J.  SIMOESEcosystems & Environmental Change I. FERNANDEZJ. GILL R. HOOKES. JAIN J. KELLEYD. LEVESQUEJ. MAHON B. MCGILLL. McNALLYP.  MAYEWSKI S. NORTONR. NORTHINGTONB. OLSEN A. PERSHINGJ. SAROS M. SCHAUFFLERA. SEIMONK. SOBOLIKM. SORGA. THOMAS G. ZARO  Paleoecology & Environmental Reconstruction R. DAVISJ. GILLG. JACOBSON A. KELLEY J. KELLEYK. KREUTZA. KURBATOVP. MAYEWSKIS. NORTON R. NORTHINGTON A. NURSE B. OLSEN D. SANDWEISS M. SCHAUFFLERJ. SAROSK. SOBOLIK C. STAGER Glacial Geology & Climate ReconstructionH. BORNS, JR. G. BROMLEY G. DENTON B. HALLR. HOOKE A. KELLEY A. PUTNAMJ. SCHAEFERAnthropology & ArcheologyK. SobolikD. SandweissB. RobinsonG. ZaroC. Ocampo-RaederP. RoscoeD. BELKNAPH. BORNS, JR. J. GILLC. ISENHOURD. KEEFERA. KELLEYJ. KELLEYA. KURBATOVP. MAYEWSKIL. RICKARD P. ROSCOED. SANDWEISS  D. SANGER K. SOBOLIKM. SORGG. ZARO S. BIRKELP. BOHLEBERH. BORNS, JR. E. ENDERLINJ. FASTOOK B. HALL R. HOOKEP.  KOONS K. KREUTZ A. KURBATOVP.  MAYEWSKI G. OSWALDJ. SCHAEFER W. SNEEDGlaciologyRenewable Energy & Environmental Monitoring I. FERNANDEZ P. KOONSB. LYONJ. MAHON P. MAYEWSKI L. McNALLY  J. THALERA. THOMAS Climate Change Impacts, Policy & SustainabilityClimate Prediction & ModelingS. BIRKELS. CHAWATHEJ. FASTOOKP. KOONSA. KURBATOV P. MAYEWSKI S. BIRKELF. CHAIJ. FASTOOKS. JAINP. KOONS B. LYONK. MAASCHP. MAYEWSKIA. PERSHINGA. SEIMONS. BIRKELS. CHAWATHED. DIXONI. FERNANDEZJ. GILLC. ISENHOURG. JACOBSONS. JAINA. KELLEYJ. KELLEYD. LEVESQUEB. LYONL. McNALLYJ. MAHONP. MAYEWSKIP. NEILLB. OLSENA. PERSHINGL. RICKARDP. ROSCOEA. SEIMONM. SORGJ. THALERG. ZAROPEER REVIEW COMMITTEEK. KREUTZ (GRADUATE COORDINATOR, FY18)D, LEVESQUE (FY21)               POLICY ADVISORY COMMITTEECyberinfrastructureI. FERNANDEZ (FY18)A. KELLEY (FY20)K. MAASCH (FY18)D. SANDWEISS (FY20)G. ZARO (FY20)                                  GRADUATE COMMITTEEJ. KELLEY (CHAIR, FY18)B. HALL (FY18)K. MAASCH (20)D. SANDWEISS (FY 19)J. SAROS (FY18)Marine GeologyK. ALLEND. BELKNAP A. KELLEYJ. KELLEY Anthropology & ArchaeologyDIRECTORP. MAYEWSKIASSOCIATE DIRECTORJ. SAROSASSISTANT DIRECTORB. LEECLIMATE CHANGE  INSTITUTE - FY2019 ANNUAL REPORT                                                                                                                                                            G. JACOBSONA. NURSE  B. HALL (FY18)C. ISENHOUR (FY20)P. DICKENSD. WINSKID. WINSKI D. WINSKIS. CAMPBELLK. SCHILDK. SCHILDS. CAMPBELLA. MORE A. MOREA. MORE A. MORE A. MORE A. MORE K. ALLEN D. DIXOND. SANDWEISS  S. SNEED                        IC, LA-ICP-MS                                              ",
    "Link": "https://core.ac.uk/download/475635164.pdf"
}