{
    "Title": "Teacher Leader Administrators: Part 3 Of A Symposium On Teachers As Leaders",
    "Authors": "Green, J., Lunstead, J., Norris, B., Smulyan, Lisa, , \\u2776",
    "Year": "No year available",
    "Abstract": "In this latest continuation of our multipart symposium on teacher leadership, we examine what happens when self-defined teacher leaders become school administrators. Do teacher leaders who become administrators maintain a teacher identity? Can they remain committed to their vision of teacher leadership when they take on the normative requirements and responsibilities of school administration? Through a conversation with three teachers leaders, we explore the rewards and trials of teaching, the choice to become teacher leaders and then administrators, and the unique challenges that face administrators who deeply value the professional, political, and collaborative work of teachers",
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "SYMPOSIUMTeacher Leader AdministratorsPart 3 of a Symposium on Teachers as LeadersLISA SMULYANSwarthmore CollegeJARROD GREENChildren’s Community School, West Philadelphia, PennsylvaniaJENNIFER LUNSTEADWissahickon Charter School, Philadelphia, PennsylvaniaBECKI NORRISCommunity Charter School, Cambridge, MassachusettsSchools: Stu© 2017 byAll use OD: Would you still refer to yourself as a teacher, now that you’veleft the classroom? If you would, what does that mean? Ifyou wouldn’t, how does that feel? It’s something that I’ve beenJARRthinking about.CKI: I don’t usually anymore, although I call myself an educator.I think I spend a lot of my time being a teacher of teach-ers. I spend a lot of time with kids, too. I know what it meansto lead a classroom and to run a class. I want to respect thework that teachers are doing for all those hours every week,but that’s not where I spend my time anymore. There’s a lotof freedom that comes along with not having to be in those clas-ses for so many hours every week. If I’mmeeting somebody forthe ﬁrst time, and they work at a school, a lot of times I’ll say,“Oh, Iwork at a school, too, or oh, I’man educator, too.”There’sdeﬁnitely a discomfort with placing myself in that administratorBEdies in Education, vol. 14, no. 1 (Spring 2017).Francis W. Parker School, Chicago. All rights reserved. 1550-1175/2017/1401-0006$10.0089This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMsubject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).90 SchAll use subject tocategory and having that be the only way people think of me. Iwant us all to be educators.—Two teacher leader administrators in conversation,August 9, 2016IntroductionWe introduced our multipart symposium on teacher leadership in thespring 2016 issue of Schools. Our goal was to share with other educatorssome of the thinking, pathways, successes, and challenges experienced byseveral cohorts of teachers who have deﬁned themselves as teacher leaders.In this latest entry for the symposium, we examine what happens when self-deﬁned teacher leaders become school administrators. Do teacher leaderswho become administrators maintain a teacher identity? Can they remaincommitted to their vision of teacher leadership when they take on the nor-mative requirements and responsibilities of school administration?A Recap: Deﬁning Teacher LeadershipIn the summer of 2011, 16 experienced teachers and ﬁve college professorsgathered under the auspices of a Ford Foundation grant to talk about teacherleadership. We met during two summer institutes and several times dur-ing 2011–12 and 2012–13 to explore what we meant by teacher leader-ship and to provide support and conversation for the teachers involved.Since then, we have continued to meet in various subgroups through to thepresent.One spin-off group, Teachers Write Now (TWN), has met monthly inPhiladelphia since 2013. At a TWN writing retreat, the teachers in thatgroup developed a deﬁnition of teacher leadership that they believe challengesneoliberal constructions of teachers and teaching that “position[s] teachersas either nameless cogs in a product-driven system or as those to blame forsystemic failure” (Smulyan 2016, 9). TWN teacher leaders deﬁne teacherleadership as “a stance, a way of being a teacher, that coalesces around beinga professional, an intellectual, a ﬁerce advocate for students and colleagueswho ensures that everyone has the opportunity to learn and grow, and acollaborative member of a community dedicated to civic and social justice.They argue that no one could have taught them this stance; it developedthrough a process of interaction with others who shared their questions, theirconcerns, and their commitments” (Smulyan 2016, 16–17). This deﬁnitionaims to capture teachers’ own experiences and to broaden the conversationsools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PM University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).they hear in their schools, their districts, and in the public sphere aboutteachers and teaching and teacher leadership. In the ﬁrst two parts of oursymposium (in Schools, spring 2016 and fall 2016), we presented writingby myself, Lisa Smulyan, one of the college professors in the original cohortand a founder of Teachers Write Now, and ﬁve of the teacher leaders whoparticipate in Teachers Write Now.A New Twist: Teacher Leaders Become School AdministratorsSome of the teacher leaders in the groups described above have remainedclassroom teachers. Others have taken on hybrid roles, such as teacher andteacher mentor or teacher and department chair. And some have chosen,over the past ﬁve years, to assume administrative positions, often in theschools in which they once taught. As the conversation above suggests, theseteacher leader administrators wonder, both before entering administrationand as they work through their development as administrators, if and howthey can hold on to their teacher leadership stance and identity. They wantto honor teachers, believing that teachers are professionals who have the bestinterests of children always in mind. They want to engage with the teachersin their schools, providing opportunities for collaboration and growth. Andthey want to maintain an environment within which teachers can recognizeand continue to act upon the political work of education. But they are con-cerned that the demands and structures of more traditional administrativepositions will challenge them in this work.Others have written about school administrators, focusing on leadershiproles and style (Hoerr 2005; McCleary et al. 2013), on issues relating togender and racial differences in experience and approach (Brooks 2012;Shakeshaft 1989), and on effectiveness (Stronge 2008). In my own explora-tion of school administrators (Smulyan 2000), I found that most of the lit-erature on administration focused on traditional styles of management thatemphasized the tasks, skills, and roles of effective principals. Much of thework assumes a style of management and an organizational role that de-pends on acceptance of hierarchy and power over people and decision mak-ing (see, e.g., Gosetti and Rusch 1995). Some of the work in gender andschool administration suggests that while women may use a more distrib-uted or collaborative approach to leadership, their behaviors are often lim-ited by the structures, expectations, and demands of the institutions andpeople with whom they work (Smulyan 2000). Despite more recent em-phasis on developing communities of practice that empower teachers withinschools and districts, the realities of current policies (testing, assessment ofSymposium / Lisa Smulyan et al. 91This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usteachers, etc.) and the historical conventions of leadership tend to push ad-ministrators into more hierarchical stances and styles.In the growing literature on teacher leadership (see Smulyan [2016] for anoverview of this literature), there has been no writing that we know of thatexplores how and why teacher leaders might choose to enter school admin-istration, or on how their experiences as teacher leaders might impact theirchoices in these more traditional roles. There is also no examination of howteacher leaders may emphasize different approaches, or face different chal-lenges, than administrators who do not come to the role with this stance.Our goal, here, is to begin that exploration, providing a forum for ourselvesand for other teacher leaders who might be considering such a path.In this contribution to our symposium, three teacher leader administra-tors engage in a reﬂection on their work. We recorded two conversations inAugust 2016. Lisa Smulyan provided questions for the ﬁrst conversation;the teacher leader administrators’questions guided the second. Lisa then trans-cribed, edited, and organized the conversations into a piece that all four par-ticipants initially co-edited. Lisa has also provided this general introductionto the article and to each section. In the discussion that follows, we talk ﬁrstabout how and why these teacher leaders entered teaching and what theyfound rewarding and challenging about that work. Then we explore how andwhy they became teacher leaders and, subsequently, entered administrativepositions. We talk next about the challenges—foreseen and unforeseen—that they have experienced as teacher leader administrators. And, ﬁnally, wereturn to the question of identity that is raised by Jarrod in the epigraph.The Teacher Leader Administrators in This ConversationJarrod Green has worked in early childhood education for over a decade andis currently the assistant director of the Children’s Community School ofWest Philadelphia, a preschool serving children ages 18months to ﬁve years.In addition to working as a preschool teacher, Jarrod has consulted privatelywith the families of young children, taught early childhood education classesat several community colleges, and led workshops at national early childhoodconferences. He has published several articles in national journals, and he hasrecently published his ﬁrst book: I’mOkay: Building Resilience through PhysicalPlay (Green 2016). He holds a master’s degree in early childhood educationfrom San Francisco State University.Jennifer ( Jenny) Lunstead has been the lower school director at Wissa-hickon Charter School in Philadelphia for two years. Prior to moving intothis position, Jenny taught ﬁrst grade and second grade at the school for nine92 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).years. She also served as a literacy intern in the Philadelphia public schoolsfor several years. As lower school director at Wissahickon, Jenny supportsteachers, students, and families in kindergarten through ﬁfth grade, witha focus on teacher coaching, curricular support, and professional develop-ment She holds a master’s degree in school leadership from the Universityof Pennsylvania.Becki Norris is currently the middle school principal at the CommunityCharter School of Cambridge. Becki joined CCSC as a founding staff mem-ber and science teacher in 2005. At CCSC Becki supports middle schoolstudents in their academic and behavioral growth, communicates with mid-dle school parents, coachesmiddle school teachers, and works with the CCSCadministrative team to develop curriculum and provide a positive learningenvironment for students, teachers, and staff. Becki has master’s degreesfrom MIT and the Harvard Graduate School of Education.Becoming a TeacherI, Lisa, have always been interested inwhy people to choose to teach.Women,who make up close to 80 percent of the teaching staff (NCES 2016, http://nces.gov/fastfacts/display.asp?id528), enter the teaching profession for sev-eral reasons, including the fact that it has been, historically, one of the few jobsopen to them outside of the home that provides some ﬁnancial and intel-lectual autonomy. Others become teachers because their families includeteachers. Some fall into it as an acceptable and available alternative after col-lege. Others see teaching as a way of taking a public stance, of working tomake their local, regional, and national communities a more just and equi-table place (Smulyan 2004, 2006). Teacher leaders in the Ford Foundationand Teachers Write Now cohorts described many of these rationales in theirexplanations of why they chose to teach (Tamir 2013). As they taught, andmet with other like-minded teachers, they developed the teacher leadershipstance described above and explored ways of expanding their inﬂuence asteachers. In this section, we hear how Becki, Jarrod, and Jenny backed intoteaching, ﬁnding that it provided the kind of work that allowed them tomeettheir own personal, political, and social goals.. . .LISA: I thought we could start by having everybody talk a little bit abouthow you became a teacher. What was your path into teaching? What didyou like about teaching? What was challenging?Symposium / Lisa Smulyan et al. 93This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usBECKI: I was a TA [teaching assistant] in college and really liked it. Then Iended up going to grad school for a PhD program in linguistics, and I TA-edvarious linguistics classes as part of my grad program and loved it. I was toldby my advisor that I needed to teach less so I could actually work on mydissertation, and I was just crushed by that. I realized that I should be doingwhat I loved and not what I was dreading. That’s why I decided to be ateacher. I have a physics background, and linguistics isn’t something that’susually taught to kids, so I went and got trained to teach science.I was student teaching at the district high school in Cambridge, and mymentor teacher was good friends with somebody who was helping start thischarter school that hadn’t started yet and hooked me up with them when Iwas looking for a job. I thought it was pretty exciting to get a chance to starta new school. It was the wild west years and it was fun, and we got to ﬁgureout what we wanted this place to be. I was teaching middle school math andscience. I was told if I wanted to teach high school kids physics as we gotolder kids I could, but it turns out I really love teaching middle schooland never wanted to go back from that.I always really liked helping kids who thought they were bad at math orscience realize that they could do this; seeing that light bulb go off is one ofmy main driving forces as a teacher. Working at a charter school we tend tocreate a lot of our own curriculum, so I always enjoyed being able to createcontent. That part’s always been fun to me. But teachingmiddle school, youhave to be doing so many things at once, and you have to be managing theclassroom tightly enough that everybody can learn. You have to be manag-ing hormones and still have to make sure that some kind of point is gettingacross. It’s sort of chaotic and fun to ﬁgure out how to manage that chaos. Ijust always liked that challenge, too.I don’t think Iwould have wanted tomove away from the classroom into afull-time leadership position if I had been a veteran teacher at the schoolwhere I am now. We’ve made this place into a place that can be such a stim-ulating, growth-oriented environment even for teachers who have been do-ing this for a long time, and I see how excited they get to become mastersmore and more and more. I never had any of that when I was a teacher here.The whole six years, I never really had anybody helping me very much at allto grow in my classroom practice.JENNY: I studied education at Swarthmore (as an undergraduate) and wasmore interested in education as an academic study or a political topic thanteaching, but then I had the opportunity to be an intern teacher when I grad-uated. My reasons weren’t particularly grand. I was looking for jobs, I wasqualiﬁed to do it, it kept me in Philadelphia, it paid pretty well. When I94 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).had thought about teaching or education, I’d been interested in workingwith older students–in middle school programs—but the internship pro-gram was only for K–3, and it was literacy focused. I found myself in asecond-grade classroom, and, like Becki, I found that I love that age of kids.I went very quickly from being an intern to being a lead teacher because theteacher I was interning with quit suddenly in October of my second year andjust never came back. Like Becki, I deﬁnitely had the experience of justjumping into things and behaving as if I knew what I was doing when Ididn’t; I didn’t have any support really at all.I then moved to a charter school, partly because my intern position wasdone, but partly because I was interested in being in a place where teachersdid have control of the curriculum that they taught. The district at that timewas doing a very scripted curriculum where every school in the whole dis-trict was supposed to be on the same page of the basal reader on the same dayof the school year. I didn’t like that. Also, I wanted to be in a place whereteachers were involved in the running of the school to some degree. Wis-sahickon wasn’t a teacher-led school, but it was still evolving from being astart-up school where everybody did everything. There were a lot of teacherswho were unofﬁcially involved in administration. Everyone was required toserve on a committee, and everyone was required to serve on a task force.There were a lot of everybody-pitch-in opportunities. A lot of opportunitiesto write curriculum, not just for your own classroom, but to share.I really enjoyed my relationships with my students. That for me was thedeepest driver of my work. I loved having a classroom. It became my world,and I could make that little world the way I wanted the outside world to be.In the outside world people could be rude or punishment and reward couldbe the primary means of controlling people, but in the classroom, I couldsay, “This is a place where everybody’s going to be polite; this is a place whereeveryone’s going to be kind, this is a place where we’re not going to use pun-ishment and reward in that way.” I really loved making that space with mykids.JARROD: I became a teacher kind of gradually. As the child of two passion-ate and energetic teachers I always had the possibility of becoming a teacherin the back of my mind—but I majored in theater in college and neverthought seriously about teaching. After college, for a few years I did a lotof miscellaneous jobs, and one of them was at Gymboree Play & Music,where I sort of planned lessons, butmostly I played with kids. I foundmyselfthinking, “How am I supposed to change their lives in 45 minutes a week?”Which made me realize, “Oh, maybe what I want to do is work with youngchildren in a more serious way.” For reasons that escape me now I decidedSymposium / Lisa Smulyan et al. 95This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usthat before I started teaching I should start my master’s in early childhood.So I started the master’s and I started substitute teaching in a bunch of dif-ferent preschools, and then I began teaching full-time at one of the schoolswhere I had been subbing. I taught at that school in Oakland for a year, thenat a school in San Francisco for two years, and then I went back to the schoolin Oakland as head teacher for another two years.Then wemoved to Philadelphia, and I took a year off from teaching. I wasfeeling medium done with the classroom. I knew early childhood educationwas going to be my ﬁeld for the long haul, but classroom practice was . . .well, I knew that classroom practice wasn’t my thing long-term. I had beenteaching early childhood education classes at a community college for a littlewhile and really enjoyed that, and I had been presenting at workshops andconferences as well. I had an idea about working directly with families ofyoung children instead of working at a school, and when we moved to Phil-adelphia, I used it as an opportunity to stop teaching and try out being aconsultant for families of young children. That was an interesting exper-iment, but it became clear consulting wasn’t going to be a long-term ﬁtfor me.Becoming a Teacher Leader/AdministratorPast work on school leaders suggests that women and men may take differ-ent paths into administration (Smulyan 2000).Men often know before theystart teaching that they want to move into administration, and they tend toteach for a shorter period of time before becoming school heads. Womenoften remain in the classroom longer, partly to gain more experience, partlybecause they do not always consider moving into administration until some-one else suggests it to them. They therefore bring a different set of perspec-tives to the task. More important, perhaps, than these somewhat essential-ized gendered assumptions is the understanding that an educator’s priorexperiences as a teacher will clearly affect her or his entry into, and perspec-tives of, administration and impact their assumptions about the role. Thethree teacher leaders here describe their pathways into administration, dem-onstrating that push and pull factors played into their decisions.. . .LISA: Becki said if she currently taught at her school, she might not havemoved into administration. But after six years with little opportunity togrow and develop in the classroom she was ready to try something else. Eachof you became teacher leaders in your schools and then administrators. Why96 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).did you decide to become a teacher leader? What led to your move into amore formalized administrative position?BECKI: Being in a charter school, I started doing other stuff right away.Everybody did. We didn’t even have department chairs when we startedthe school because we had very few people. We started with 15 teachers,but as we got bigger and we needed to be more in departments, I becamea science chair. We hadn’t really ﬁgured out what that meant yet. I don’tthink I did that much at ﬁrst, but I pushed really hard for us to have anew teacher mentor program, and it took a couple of years to get thatoff the ground just because we were all kind of new. Once we got thatoff the ground, I helped out with that. That was probably the ﬁrst real lead-ership thing I started to do.I felt really challenged with all the leadership work I was doing. I had some-body at school whowas mentoringme through the practice of leading adultsbecause I didn’t know how to lead adults. I had someone who would sit inon meetings with me and debrief with me afterward and help me know howI could have handled things better with my science team or whatever. Thatwas what I wasn’t getting in the classroom. I wasn’t getting somebody com-ing in and watching me and debrieﬁng lessons with me and somebody tobounce ideas off of.I taught six years before I entered an administrative position. I hadplanned to teach a little longer, but a position came up, and they don’t comeup that often, and I love the school, so I ﬁgured I would try for it. I did wantto become an administrator before I got burned out if being burned out wassomething that was going to happen. I always knew that I wouldn’t want toget to that point; I’d rather move on to something new before that, because Idon’t think it’s good for kids or me. I wasn’t anywhere close to burned out. Ireally enjoyed teaching. I enjoyed being in the classroom every day. I justdidn’t have anyone really working withme and challenging me when it cameto my teaching.When I applied for the [administrative] job, I didn’t know if I would getit. I said to the administration, “I will continue to be your science chair andthe science teacher here if I don’t get this.” I was happy where I was, but Iwas also okay with moving on.JENNY: I served on lots of committees; that was a big thing at my school.Interviewing and hiring new candidates, organizing big family and commu-nity events like our reading night, writing curriculum, serving on the schoolimprovement committee when we didn’t make AYP [Adequate Yearly Prog-ress] one year. I would volunteer whenever they needed a teacher represen-Symposium / Lisa Smulyan et al. 97This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All ustative for something. I think I also became a leader more informally with mypeers, just a person who would speak up at meetings and that kind of thing.As much as I loved being in the classroom, I began to feel like I needed anew set of challenges. Even though I had a new group of students each year,and each kid is different, the types of challenges with kids and with the cur-riculumwere starting to repeat year after year. I was also tired, because teach-ing is really, really hard work. Being in the classroom doesn’t ever let up for asecond. Inmy ﬁrst year as an administrator, I found it less tiring, because thetasks were different and the challenges were new. And being an administra-tor does let up in a different way than classroom teaching; you can take abreath during the day. It was a nice change.In the second year, I felt that newness start to wear off. I started to ﬁnd itequally tiring to be answering e-mails and going to meetings, and I startedmissing the classroommore. The ﬁrst year I was an administrator everybodyasked me, all the time, “But don’t you miss the classroom?” I was like, “No,honestly I really don’t.”The second year I started missing the classroom, butnobody asked me the question anymore.JARROD: The thing that I liked and still like about early childhood is thepuzzle of young children. The constant questions of, What’s going on inyour brain? What needs are you expressing? How can I alter what I’m doingto meet those needs? I liked ﬁguring out what’s going on for the child, whatwork the child is doing, and helping to support that work. And from thefamily side as well, working with the family to help support the individualchild. I like the relationship aspects of the work. On the other hand, as ateacher I was ﬁnding myself . . . not disliking, but tired of curriculum. Cur-riculum planning is ﬁne, but it never excited me all that much. Tired ofclassroom management, too, which I’m pretty good at, but it’s a lot of yourday when you’re teaching three-year-olds. I was ﬁnding it tiring and not en-ergizing. There were still a lot of aspects of how we support children andtheir families that I found really exciting and engaging, and I still do, butthat was only a portion of my job description as a teacher.When I moved to Philadelphia, I was looking for administrator positions.I was thinking about leaving the classroom but continuing to work directlywith children and families in a school, so I was looking to be a director ormaybe an assistant director. That was now three and a half years ago. Thenmy wife found this ad for the Children’s Community School; it was for ateacher position, and she said, “I know you’re not looking for a teachingjob, but these kind of sound like your people, you should call them.” Shewas right, they were just the kind of educators I was eager to work with,and it turned out that in addition to looking for a teacher they were also98 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).looking for an assistant director to start very part-time and work theirway up in the organization and in the meantime be a teacher. I thought thatthat sounded like a pretty good ﬁt, because secretly I didn’t actually knowanything about administration, and I was worried that I was taking toobig of a leap, so it would be good to start small at a school with great people.So I was a classroom teacher for two years and a very part-time assistant di-rector at the same time. Then a year ago I left the classroom and became thefull-time assistant director.I want to be an administrator who still gets to focus on individual chil-dren and individual families, and I want to add individual teachers to thatlist. I want to be a supporter of all the different constituents of a school.How can I be supporting each one of those in that investigate-y, problemsolve-y, relationship-y way? And I know that administration isn’t just prob-lem solving and relationships, that a lot of it is e-mails and budgets and soon. But hopefully, I’m ﬁnding, so far at least, that the other stuff that’s apart of any job description is less tiring than those aspects of classroomteaching that wore me out. I feel like, so far at least, I made a good tradein terms of how I’m spending my time.LISA: I think I originally left the classroom with the plan of becominga school administrator because I wanted more power to make more subs-tantive change. What were your hopes and goals as you moved into admin-istration?JENNY: As a teacher I couldn’t help thinking, “How would I do things dif-ferently if I was in charge?” This was true no matter what administrators Iwas working with. Whether or not I thought they were doing a good job, Istill found myself thinking, “How would I do things?” So that’s a way ofthinking about having more power.BECKI: I wanted more inﬂuence. By the time I ﬁnished teaching I wasteaching half-time because I was getting freed up to be a chair and a mentor,so Iwas strongly inﬂuencing 40 kids every year. Then Iwouldmentor teach-ers, and Iwould be in their classrooms and help them be getting better, and Ifelt like I was inﬂuencing their kids, too. I was inﬂuencing those teachers tobe better and to feel fulﬁlled in their jobs. I really liked that adult work sideof things, feeling like I can help these people who are in there on the groundevery day with students to be doing better and better with those students.To be teaching them more and forming better relationships with them andhelping them to turn into wonderful adults. I could do that with a lot morekids if I’m working with their teachers. That was part of what drove me.JARROD: I am a systems-and-big-picture kind of thinker in general. I reallyenjoy things like writing policies. I might be fooling myself, but it doesn’t feelSymposium / Lisa Smulyan et al. 99This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usto me like I’m saying, “Yes, I canmake it the way I want it!” It more feels like,“I can solve this problem. I can see a way that we can all be doing this.” Or,“Oh, we’re doing six different things at this school. and we can combinethem and make it one thing that really works.”LISA: And what were your concerns as you entered the administrative po-sition?JARROD: I was most worried—and remain most worried—about losingthe personal connections with the children. Years ago in grad school I wasin a class on administration, and I did a project where I interviewed a halfdozen different preschool directors. In answer to the question, “What doyou ﬁnd most frustrating or disappointing about the job?” every singleone of them said, “I feel like I never see the kids anymore. I feel like I’mneverin the classroom anymore.” That really worried me, because I love being onthe ﬂoor in the classroom relating to the kids.I have thought really hard about whether I can make this a position whereI’m in the classroom frequently, regularly, building those relationships—andhonestly it’s been a mixed success so far. The ﬁrst half of last year I was prettygood at being in the classroom every day. After our school moved for thesecond time in a single year, and I was really slammed working on accred-itation, my presence in the classroom really fell away during the spring.I’m thinking hard now about how can I recommit to being in the classroomevery day, to be one-on-one with teachers, one-on-one with kids. And Idon’t know if I can do it as much as I will need. Like Jenny was saying, thiswork gets more tiring the less new it is. I feel like interacting directly withkids will always stay energizing, so how will I make sure that’s a long-termpart of my job?JENNY: I felt concern about losing touch with teachers or with teaching,with what things really feel like in the classrooms. And I think that’s proventrue to some degree. I was concerned about my relationships with peoplewho’d been my peers, but I really wanted to make the school better, I reallywanted to make teachers’ lives better, I really wanted to enable them to dogood work in the classroom. Right in the beginning I felt like I knew how todo that, but the further away from the classroom I get, the harder it is toknow. The answer might be to be in classrooms more. It is hard to get intoclassrooms, as Jarrod was describing, because so much other stuff can ﬁll upmy day.However, I haven’t found it hard to stay in daily contact and build rela-tionships with lots of kids. One thing I really like about my current posi-tion is that, while I don’t have that insular little community in my class-room anymore, I have relationships with hundreds of kids. I like the parts100 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).of my day when I am with kids. I like doing hallway monitoring in themorning, because, yes, my purpose in being there is partly to stop kids fromrunning in the halls, but my purpose is also to say good morning to every-body. I really enjoy it, and the kids are always like, “How do you knoweverybody’s name?” I enjoy trying to learn the names of every kid in theschool.I enjoy knowing something about each of them. I enjoy walking intoclassrooms and having the kids know me.I feel my perspective shifting; it isn’t always ﬁrst from that classroom placeanymore. Sometimes that’s my second thought, not my ﬁrst thought. Oreven my third thought. Maybe my ﬁrst thought is the institutional need,and my second thought is the need of a particular family or kid, and mythird thought is how this will feel for the teacher, where that would alwaysbe my ﬁrst thought before. That shift is uncomfortable for me.BECKI: I was really excited tomove into administration. I remember want-ing very badly to make sure that teachers trusted me and that I wouldn’t beone of those administrators who people were always complaining about. Itdidn’t mean that I thought I would always make decisions that everybodyagreed with, because you can’t, but I’ve seen administrators who, even whenthey make a decision that a teacher doesn’t like, teachers feel that they cango talk to them and not hold it in or have to just talk about it behind theirback.I really wanted to be that person and not somebody who could be blamedfor not listening and just doing things my way. I’ve always worked on beingreally transparent, sometimes probably to a fault. There’ve been times thatI’ve realized I was probably too transparent because sometimes you don’tneed to see the sausage factory. I’ve had to ﬁgure out the balance, but I thinkI’ve maintained a level of transparency where people do usually feel like theycan come and talk to me. Even if I’ve made a decision they didn’t like and Idon’t change it, they will be heard and they’ll also understand more aboutthe reasons behind it that they might not have thought about, especiallyif their sole context is the classroom. I think I’ve done well with that. There’smore stuff that’s come up as I’ve been an administrator that I just hadn’tthought to be worried about.I think one of the things that weighs onme the most is howmuch power Ihave to inﬂuence the direction the kids’ future will go. What do you dowhen a kid brings a weapon to school, especially if you know that their onlyother alternative if you don’t let them come back is going to be a schoolwhere they probably will not end up with a great future? You feel like youcan get them through this, but what about all the other parents who, if theySymposium / Lisa Smulyan et al. 101This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usknew you’d let a kid stay there who had brought a dangerous weapon toschool would feel like their kids aren’t safe? I just had never thought aboutit as a teacher about how much inﬂuence you could have over a kid’s futurejust by a decision that youmade and how hard that would be and howmanydifferent sides of it there are.Challenges in Being a Teacher Leader AdministratorIt is not a new story that being a principal is hard work. From Wolcott’s(1973) classic, TheMan in the Principal’s Ofﬁce to Barth’s (1980) Run SchoolRun, to my own (2000) Balancing Acts: Women Principals at Work, researchersand practitioners have documented the challenges of being a middle man-ager in the public schools. School administrators must respond to multipleconstituencies—higher administrators, parents, teachers, and students—andbalance budgets, curriculum, and personnel. So it is not surprising that thesethree teacher leader administrators have found their early years challenging.But these educators have an additional challenge that comes from their com-mitment to value the professional, political, and collaborative community ofteachers from which they came. In addition to ﬁnding the time to do all ofthe work required of them, these teacher leader administrators explore howto balance conﬁdentiality with transparency and what is best for a singleteacher or a community of teachers with what is required for the school.. . .LISA: I get the sense, based on different people’s trajectories and how longyou’ve been there, that it was fun to start with and then it got harder, in partbecause things came up that you didn’t anticipate. One of the questionsyou raised at the end of our ﬁrst conversation was, “What are some of thechallenges that you’ve had being an administrator that you didn’t antici-pate?” I’m also wondering, “Why didn’t you anticipate them, and how haveyou adjusted?” One of the key challenges that I heard you starting to talkabout was how to maintain some kind of teacher-based relationship withyour colleagues and, at the same time, be the kind of administrator that youhoped to be.JENNY: Becki talked about the balance between being transparent and“not everyone needs to see the inside of the sausage factory.” That has beena challenge for me, that kind of balance between the things I thought Iwanted from an administrator when I was a teacher, like transparency in ev-erything, and the realization that there’s such a thing as too much transpar-102 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).ency. Similarly, as a teacher I wanted more ownership over everything, butsometimes more ownership is more burden to people, sometimes peoplewant you to make the decision, and not every decision needs to go througha consensus committee. Those balances are a challenge.JARROD: One challenge for me, and in some ways it seems incredibly pe-destrian, but one of the things I didn’t anticipate is that as a teacher, I felt likeI knew how much time everything would take, how many hours in a class-room. I knew how long it would take me to plan a lesson. I knew how longit would take me to respond to an e-mail, or I knew how long it would takeme to do an assessment. As an administrator, I feel like that’s rarely true.Tasks balloon, they spool out, they get as big as you’re willing to let themget. There are very few things that I ever actually ﬁnish. More things getto the point of, “Oh, this is as good as it’s going to be, and I have to moveon to other things.” The nebulousness of both tasks and the time tasks takehas been a big adjustment for me. I’m trying to ﬁgure out, how do I regi-ment my schedule? How do I assign myself tasks and manage my tasks?That’s something I struggle with.LISA: Jarrod, does that then make it feel less rewarding? When you saythings don’t get ﬁnished, or that they’re more nebulous, it sounds like it’smore difﬁcult to know when you’ve got it.JARROD: In some ways. I have felt like the rewards, when they come, feelbigger, when I get to put a thing to bed. For instance, the day I got to say, “Allright, accreditation! We are ready to go. Come on.”That felt really huge in away that I didn’t often feel in my day-to-day work as a teacher. I would sayit’s differently rewarding than teaching, but not necessarily less than.JENNY: When I was in my school leadership program, there was some-thing we read along the lines of, “A principal’s work is chaotic, fragmented,and never ending.” There was a list of adjectives to describe what Jarrod istalking about where the work consists of so many small tasks that are alwaysoverlapping and don’t have clear ends. The word fragmented deﬁnitely comesup in my mind a lot. It is very fragmented work.Also, you know what Becki was saying about the challenge of knowingthat you represent your school? For me, that’s connected to the challengeof remaining deeply connected with colleagues, with teachers. I ﬁnd myself,to a degree that I didn’t anticipate, caught in between what I know to beobjectives of the school or the constraints on the school as an institution—regardless of how I feel about them personally—and what I would be advo-cating for as a teacher, or what the teachers are advocating for. Sometimes thatmeans having information I can’t share. Sometimes it means having informa-tion I can share but can’t do anything about. And sometimes I have informa-Symposium / Lisa Smulyan et al. 103This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All ustion that I can share and could do something about, but given the perspectivethat I now have, I don’t think it’s the right thing to do. So part of what’s chal-lenging about maintaining that teacher stance is that I have access to differentinformation, and it’s part of my job is to represent the institution whether ornot I agree with the institution. I feel like a middle man more often than Iexpected. I just didn’t think about that much before I began.LISA: Can you give us an example?JENNY: Sure. One example is that our school is lucky to be able to haveassistant teachers in every classroom K–5, but we can’t pay a lot. It’s alow-wage job for what we ask people to put into it.We get good people, pro-spective teachers or young teachers who have just ﬁnished student teaching,and they put a ton of heart into their work, but they don’t stay. It’s a tran-sitional job. That means that teachers have the responsibility year after yearof training a new assistant. So some teachers came up with a proposal to havefewer assistant teachers but pay themmore, so that we might be able to keeppeople for longer and teachers wouldn’t have to retrain their assistant everyyear. This is a reasonable, good idea.It happens, though, that the math of it didn’t work out, because our as-sistant teachers also do a lot of other jobs around the school. They cover re-cess. They go with the kids to art, library, and things like that. They serve assubstitute teachers when our teachers are sick. All those are other positionswe would have to pay someone to ﬁll. If you do the math in the budget, thisproposal, which seems logical and good, could raise assistant teachers’ sala-ries by such a small amount that it wouldn’t realistically impact retention.It was a great idea, and I appreciated it, but I wasn’t going to push for it,because it didn’t work. I felt like the teachers who brought this forwardnever fully believed that we really had explored their idea to its fullest po-tential or even really considered it. I felt like we were just talking across eachother because they were experiencing in a daily way, “It’s so frustrating thateach year I have to retrain somebody,” and I was experiencing in a daily way,“It’s so frustrating that this is how much money we have.”Amore typical example has to do with personnel. Like, if a teacher or staffperson is ﬁred or not rehired, then almost everything to do with that is con-ﬁdential. Right? Other teachers who’ve had positive experiences with thatperson may feel threatened, may feel lost when that person is not stayingon the team, and I can’t explain.JARROD: The issue of how much transparency is possible and desirable issomething that I’ve run up against. We had to let a teacher go mid-year thispast year. We went through quite an extensive process with this teacher. Inthe aftermath of it, a lot of staff came to us with concerns and were, essen-104 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).tially, nervous about their own jobs. For some of them, it seemed like thedeparture of this teacher came out of nowhere. Of course, we couldn’t tellother staff everything that happened, but we tried to say, “Oh, no, we wentthrough a whole big process with that teacher. You would never be in thatsituation and not know that you were in that situation, not see it coming.”But they didn’t see the process as it was happening, and so some of thembecame worried.BECKI: There’s all the things that you didn’t know when you were in theclassroom, that you used to wonder about. People couldn’t tell you for con-ﬁdentiality reasons, and then once you know of them, there’s this real clarityof knowing. Sometimes it’s a lot to hold. It’s a lot to try and make decisionsabout. I have realized what a burden it is to know about things studentsare going through—abuse, sexual assault, suicidal depression, family trauma.I have to make decisions about how to support students who are goingthrough these very deep situations, but I have very few other adults to whomI can come for support or advice myself because of conﬁdentiality concerns.You realize as an administrator that all those years you were in the class-room, these things were probably happening, and you didn’t know anythingabout them. You sort of like catch wind of these things here and there as ateacher. Now I hear all of it. If it comes across anybody’s desk, I hear about it.I’ve seen teachers save lives because they report a concern about a student,and it turns out that student was planning to harm himself or herself. Thefamily often does not want teachers to knowwhat’s going on. I want so badlyjust to tell that teacher, “Youmight have saved this student’s life by reportingthis,” and let them know what a good, good thing they’ve done by actingquickly, but I can’t. So often you just hold this stuff, and you just can’t tellanyone. It’s so heavy. All the stuff when you were a teacher that you couldblame admin for, I have to take the blame. I have to take that responsibilitynow. I try and say, “It’s my responsibility.”Sometimes, like in your situation, Jenny, there’s like nothing anybodycould do about it. You still have to just say, “You know what? I’m going toown this.” You have to be that one that people can complain to and maybecomplain about, especially if it’s something that’s not movable, but peopleare still very frustrated. I don’t think I was fully prepared for what it feels liketo always have to be the person that owns that stuff, no matter what.Like the eighth-graders this year got into this negative culture space. Wehad a pep rally for the sixth to twelfth grades, and they had this little contestthat each grade was trying to make the most noise and stuff. The eighth-graders just sat there. Eighth-grade teachers and advisors were coming tome saying, “The culture of the eighth grade is just awful, and they’re so neg-Symposium / Lisa Smulyan et al. 105This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usative all the time.” They’re basically saying, “So, what are you going to doabout it, Becki?” I wanted to say, “They’re adolescents. What can I do aboutthat?” I had to take responsibility for the eighth grade being irritable andhormonal. It’s certain times sort of just a powerless, frustrating feeling tohave to be the person that takes that on.JARROD: A thing that has occurred to me is the way that tasks and issuesget pushed to the side by other tasks and issues, I think particularly in ways Ithink teaching staff often doesn’t see. For instance, somebody’s brought up aconcern, whether it’s Jenny with this particular budget concern, or evenjust, “Hey, I have a question about this kid, and I e-mailed you last weekand then I e-mailed you at end of last week, and then I e-mailed you onMonday. I still haven’t heard back.” You’re like, “Oh, gosh, I’m sorry.” It’sbecause one of these other issues has come up and pushed the other thingsto the side. At our school, there was the week that we thought one of theteachers had tuberculosis. We thought that for a long time. She turnedout not to have tuberculosis, but the week when my director and I knewthat this was going on—that the department of health was saying, “You can’ttell anybody quite yet”—THAT was what we were doing all day. And ofcourse we found ourselves saying a lot of, “Oh, yeah. No, I’m sorry I forgotthat e-mail about your curriculum for next week.” That e-mail was still onthe teacher’s plate, but it looks very different from the other side.Strategies That Have WorkedOne documented aspect of school leadership is its isolation (Regan and Brooks1995; Smulyan 2000). While these teacher leader administrators work hardto support and sustain communities of which they are a part, including theteacher leadership groups described in the introduction to this article, on adaily basis they constantly make decisions on their own. As we talked, theyrecognized that ideas and strategies emerging from their reﬂections seemeduseful. They asked if we could spend some time directly addressing the ques-tion, what works?. . .LISA: What are some of the strategies you have used to be an effectiveteacher leader administrator?JARROD: I’m thinking a fair amount these days about making part ofmy role helping the teachers I supervise be the best teachers they can be.That means a lot of different things. It means supporting teacher voice. It106 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).means offering them support in a variety of ways. It also means having inmind a trajectory for teachers. I think that speaks to the point of teacher voicebeing important and valuing teacher’s perspectives and expertise and tryingto hold onto that perspective as an administrator.For the children I taught, I would try and take a multi-year perspectiveabout that. Saying to myself, “Some of these kids need more than a schoolyear to change into whoever they’re going to be.” Now I’m thinking aboutthat for teachers, too, and trying to think of my school’s relationship withteachers as being a multi-year relationship and that we’re at one point ineach teacher’s trajectory. You have years to become the teacher you’re goingto be. I have been trying to look at it that way and trying to help teacherslook at it that way. Something to calm my mind.BECKI: I think I went into it really appreciating administrators who I feltrespected my point of view and were transparent with me and told me asmuch as they could about the whys behind their decisions. I wanted todo that for people. It got a lot more complicated after that. You start to re-alize what Jenny was saying about howmuch is oversharing. Howmuch youare actually not able to share. More and more I’ve also wanted to help teach-ers grow in the classroom. I’ve always wanted to help teachers grow in theclassroom, but believing how important that is, making it a bigger and big-ger priority in my head, especially for the more veteran teachers, has melooking at how that wasn’t really done for me.When it comes to helping veteran teachers grow in their practice, I’vepushed a lot to differentiate. We have an intensive coaching-based model.We’re always asking how we can differentiate it, to meet the needs of veter-ans versus newer teachers. One thing I’m always pushing for is for the vet-erans to get the differentiation that helps them to continue to feel chal-lenged and to grow, so that shouldn’t look like us spending a lot less timewith them. I think it’s just really easy to be like, “Oh, we’re going to observeevery new teacher once every two weeks, but we’ll only observe the veteransa few times a year.” I’m always a nagging voice saying, for the veterans Icoach, I still want to meet with them every week, because even though theydon’t have as many immediate things that have to be ﬁxed in their practicelike a newer teacher might, those meetings are sometimes where we reallyhave some of those higher-level conversations.One of the other things that I’ve done a lot of here is if I see something atthe school that could be made better or changed in some way, I try to start aproject that teachers and administrators can both opt into working on. I ac-tually had a two-year-long committee of teachers and administrators look-ing at all our discipline systems. I had teachers who opted into being on aSymposium / Lisa Smulyan et al. 107This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All uscommittee to look at round tables, which are our end-of-year portfolio as-sessments that every student has to do to go on to the next grade, exploringhow other schools do these assessments and how we could get better. Justtrying to bring teachers in to decision making.JENNY: For me the pendulum is swinging back in a good way toward try-ing to do what Becki’s saying about getting teachers to do more of the cre-ative work—leading more of the conversations. I came to Wissahickonwhen we were a young school. Over the years, teachers, including me,had begun to feel taxed by the number of decisions we were expected tobe part of. We had reached a point as a faculty where there was a strong callfor administrators to just make the decisions and tell us what to do aboutcertain things. I was trying to respond to that as a new administrator, tobe more decisive in order to respect teachers’ time.But our staff has shifted. A lot of our veteran teachers have moved on asthe school has grown.We have a lot of newer, younger teachers again. I thinkwe’re back in a place where there are people who have more energy to giveand want to be more part of decision making. I also have to remember thatwhat I wanted, or what people wanted when I was a teacher, is not what allteachers want or what all teachers want at every moment.I’ve been a little behind the curve. I’m picking up on the fact that changehas happened. And I’m excited about that change. That’s actually the kindof leader I’d like to be. I just didn’t know I was going to get a chance. I as-sumed I knew what people wanted because of my experience as a teacher onthis faculty. And I think Iwasn’t right, because the faculty has changed or theclimate’s changed. The moment has changed.JARROD: There’s also, I’ve been ﬁnding, a balance to be struck in givingstaff the opportunity to be involved in decision making. One thing thathappened this past year was that I rewrote our whole hiring procedurefor the school. In the early days of the school, every teacher interviewed ev-ery applicant, which was great when we had three teachers—it really made ita communal and community-based process. Then about two years ago itjust got ridiculous, because all of a sudden we had like seven teachers tryingto interview every applicant, and it was absurd. This year I rewrote thewhole thing. It felt really important to us to have a lot of people have a voicein the process and have a lot of people have the opportunity to connect withapplicants because we as a school are welcoming new teachers into a com-munity. So I wrote this revised hiring process, and it provides all these op-portunities for teachers to choose to participate in the hiring committee.But it turned out to be pulling teeth to get teachers to actually be on thehiring committee! We had to say, “Really, we need a couple a more teachers,108 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).please! Who wants to do this?” I feel like the opportunity for teachers to beinvolved in decision making is very important—but whether they choose totake advantage of that opportunity is something else.I think about that with families, too. How much opportunity can I givefor families to be involved in all the things our school does? But that doesn’tnecessarily mean people are going to choose to be involved all the time. Ithink it really does mean something for there to be genuine opportunity.It is helpful for families and teachers to have a voice, to hear things, evenif they’re not always taking those opportunities.BECKI: One thing that I’ve discovered, too, is that different teachers areready for different amounts of responsibility. Even if people feel like theyreally want to be in on the decision making, they’re not always prepared foreverything that comes along with that. I had an experience with a teacherrecently who had helped to revise a curriculum and conduct the profes-sional development for other teachers on the new curriculum. A year intothe program, when it was time to make revisions, she said, “You know, Idon’t think I want to do it.”We sat down with her and said, “What’s goingon here? Is it the scope of it? Is it too much time?” She said, “I don’t minddoing revisions. It’s just like I don’t want to stand there in front of theteachers and present it and be that person, because all year long, I was hav-ing to hear about it when things weren’t going well.”She’s really strong with what she was doing. She’s not ready for the ongo-ing people leadership part of it. I think that’s okay. What it means is that weneed to let her create the program and then we need to say, “Okay, howmuch do you want to lead throughout the school year? Do you just wantone of the principals or whatever to be the point person, and you handoff the program just like you would if we had purchased something pre-made?” I think she would be okay with that. I tend to get excited if someonewants to lead a project because I can give it to them and not worry about it.That’s not always how it is. Sometimes you still have to take parts of it andscaffold that person into it. Maybe it’s a person that will never really wantthe people leadership side of it, and that’s okay, too.IdentityIdentifying as a teacher is fraught.Time (November 3, 2014) and News-week (March 5, 2010) magazines have both featured covers that depictteachers as bad apples, responsible for the problems and failures of thepublic schools. In the past 25 years, women have faced the question ofwhy they would choose teaching when so many other options are nowSymposium / Lisa Smulyan et al. 109This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usavailable to them (Smulyan 2004), and men have always had to justifytheir choice of a female-dominated profession (King 2000). But it turnsout that for teacher leaders who are proud of their professional, political,and collaborative stance, identifying as an administrator is, perhaps, evenmore troubling. Given the historical hierarchy and traditional power dif-ferentials between administrator and teacher, these teacher leaders who en-ter administration struggle to negotiate the administrator identity as theyhave internalized it and as they imagine others see it.. . .JARROD: Would you still refer to yourself as a teacher, now that you’ve leftthe classroom? If you would, what does that mean? If you wouldn’t, howdoes that feel? It’s something that I’ve been thinking about.BECKI: I don’t usually anymore, although I call myself an educator. I thinkI spend a lot of my time being a teacher of teachers. I spend a lot of timewith kids, too. I know what it means to lead a classroom and to run a class. Iwant to respect the work that teachers are doing for all those hours every week,but that’s not where I spend my time anymore. There’s a lot of freedom thatcomes along with not having to be in those classes for so many hours everyweek. If I’mmeeting somebody for the ﬁrst time and they work at a school,a lot of times I’ll say, “Oh, I work at a school, too, or oh, I’m an educator,too.” There’s deﬁnitely a discomfort with facing myself in that administra-tor category and having that be the only way people think of me. I want us allto be educators.I think a lot of teachers have complicated relationships with their admin-istrators. I think that in a lot of schools it’s pretty dysfunctional overall. Idon’t mind at my school, people knowing that I’m the principal, and if Imeet somebody who’s trying to work here, I obviously don’t hide my role.That would be weird. When it’s somebody who might be coming from aschool where it’s a lot more dysfunctional, and there’s this divide betweenthe teachers and the admin, and it’s the good guy versus the bad guy, I guessI want to protect myself from how I might be viewed.I don’t know. I probably need to talk this out with a therapist. It’s a reallyinteresting question. My husband works for a union company, but he’s aproject manager, so he’s not part of the union. The guys who are in the unionthink the project managers maybe don’t get it. He has to really, really earntheir respect. It helps that he used to do what they did. I think if I earn therespect of the teachers, it might be partially because I used to do what theydid and partially because I think I usually do good work with them.110 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).JARROD: In the early days of my work in preschool classroom, I had a realcrisis about what to call myself to people who weren’t in the ﬁeld. You meetsomeone at a party, and they say, “What do you do?” I’d say, “I’m a preschoolteacher.” And they’d say, “Hey, ﬁnger painting and diapers, right?” And I’dhave to say, “No. Well, I mean, yes, we do ﬁngerpaint and I do change di-apers, but no, that doesn’t speak to what I ﬁnd important about my role atall.” But that was always a very difﬁcult conversation to have, and very dif-ﬁcult to have it go in the direction I wanted it to go.In the same way, if I say “I’m an assistant director of a preschool,” peopledon’t even have anything to say about it at all! They’re thinking “E-mailsand forms, I guess.” It really frustrates me. The part that excites me aboutmy role and what I think of as the major part of my role is teacher develop-ment and support of children and support of families, things that I think ofas intrinsically being of a teaching nature. But that’s not what the perceptionusually is.I don’t know how to say it. I think you’re right, Becki. I agree that saying“I’m a teacher” doesn’t respect the work that classroom teachers are doing.Also, I feel like “teacher” is the best descriptor of the parts I care about in myjob. I feel weird saying assistant director because it feels like that’s not a greatdescriptor of what I spend my days doing.JENNY: I think it’s probably 50/50. Sometimes I say I’m a teacher, andsometimes I say I’m a principal. Inmy position, “principal” is not really righteither. I don’t have the degree of autonomy that you think of when you thinkof a principal. It’s much more of a middle management position. I rarely tellsomeonemy actual position title, lower school director, because unless some-one’s coming from an independent school background, that doesn’t probablymean that much to them. I’m not the sort of leader that I imagine when Ihear the word principal—this guy with a mustache who’s in his ofﬁce mostof the time, and he shaves off his mustache because the kids read 100 booksor something like that. I’mmuch more involved in the daily life of kids andteachers in classrooms than the principals I remember from my own school-ing. But then, as a teacher, I also felt the need to expand somehow on whatpeople might be imagining when I said I was a second-grade teacher. A lot ofus felt that. I think that’s part of what led us to articulate the teacher leaderstance in the ﬁrst place.ConclusionWe share this conversation in order to demonstrate several aspects of ourwork. First, we see the development of teacher leader administrators as aSymposium / Lisa Smulyan et al. 111This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All uswork in progress. Jarrod and Jenny commented, toward the end of the con-versation, that Becki, as an administrator of ﬁve years, seemed more settledin her sense of self in her position than they did after two years of exploringthe role. Clearly it takes time to negotiate any administrative position, and,if you are open to growing and changing, you take advantage of time to re-ﬂect on your own practice.Second, context matters. All three of these teacher leaders work in schoolsin which they, as teachers, had unusual opportunities for leadership rolesfrom the start. Becki was a founding teacher at her school; Jenny and Jarrodcame to their schools early in the life of their institutions. All three schoolswelcomed teacher input and provided opportunities for teachers to try outleadership roles. These three teachers note how changes in school cultureand practice over time inﬂuenced their own growth as teacher leaders and,subsequently, the demands put on them as teacher leader administrators.For example, Becki has helped to provide opportunities for teachers to growas teachers so they do not have to leave the classroom as she did in order toexperience a challenge. Jenny notes that teacher turnover has created a con-text in which she can now begin to turn some of the decision making back toteachers, after a period in which more seasoned teachers had looked to ad-ministration to be more decisive. And Jarrod points out that the increasednumber of staff in his school demands some new processes in order to wel-come but not require teacher input. Context, speciﬁc school context and thetime period in the life of that school, both creates opportunities and con-strains the possibilities for any school leader.Third, it seems that administrators who emerge from the ranks of teacherleaders may bring an unusual self-consciousness to their roles. This conver-sation suggests that the desire to keep teacher voice and perspective in theforefront of their work has an impact on the goals and practices of these ad-ministrators. They ﬁnd themselves examining what is possible and what ischallenging about maintaining this perspective as they interact with col-leagues around curriculum, school policy, and daily practice. Entering ad-ministration with a teacher leadership framework, one that emphasizes thepolitical, collaborative, and professional work of teachers, inﬂuences theseadministrators’ actions, reﬂections, and identities. They still see themselvesas teachers, even as they take on positions and responsibilities that sometimesdemand a different viewpoint.Our goal in sharing this conversation within this symposium is to con-tinue to explore teacher leadership for teachers at all stages of their work inschools: beginning teachers, veteran teachers, those who identify as or whowant to become teacher leaders, and those who are considering or who have112 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).taken on more traditional administrative positions. We believe that ourvoices open up new possibilities for teachers and for administrators whosee themselves as political, collaborative professionals working to providea democratic education for students and colleagues.ReferencesBarth, Roland. 1980. Run School Run. Cambridge, MA: Harvard Univer-sity Press.Brooks, Jeffrey. 2012. Black School, White School: Racism and EducationalMisleadership. New York: Teachers College Press.Gosetti, Penny, and Edith Rusch. 1995. “Reexamining Educational Leader-ship: Challenging Assumptions.” In Women Leading in Education, ed.Diane M. Dunlap and Patricia A. Schmuck. Albany, NY: SUNY Press.Green, Jarrod. 2016. I’m Okay: Building Resilience Through Physical Play.St. Paul, MN: Redleaf.Hoerr, Thomas. 2005. The Art of School Leadership. Alexandria, VA: Asso-ciation for Supervision and Curriculum Development.King, James. 2000. “The Problem(s) of Men in Early Education.” Mascu-linities at School, ed. Nancy Lesko. Thousand Oaks, CA: Sage.McCleary, Lloyd, Gary Crow, L., and JosephMatthews. 2013. Leadership: ARelevant and Realistic Role for Principals. Hoboken, NJ: Taylor & Francis.NCES (National Center for Education Statistics). 2016. “NCES Fast Facts.”http://nces.ed.gov/fastfacts/display.asp?id528.Regan, Helen, and Gwen Brooks. 1995. Out of Women’s Experience: Creat-ing Relational Leadership. Newbury Park, CA: Corwin.Shakeshaft, Charol. 1989.Women in Educational Administration. NewburyPark, CA: Sage.Smulyan, Lisa. 2000. Balancing Acts: Women Principals at Work. Albany,NY: SUNY Press.Smulyan, Lisa. 2004. “Choosing to Teach: Resisting a Gendered Identity.”Teachers College Record 106 (3): 513–43.Smulyan, Lisa. 2006. “Teachers and Teaching.” In The SAGE Handbook ofGender and Education, ed. Christine Skelton, Becky Francis, and LisaSmulyan. London: SAGE.Smulyan, Lisa. 2016. “Stepping into Their Power: The Development of aTeacher Leadership Stance.” Schools: Studies in Education 13 (1): 8–28.Stronge, James. 2008. Qualities of Effective Principals. Alexandria, VA: As-sociation for Supervision and Curriculum Development.Symposium / Lisa Smulyan et al. 113This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMAll use subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).All usTamir, Eran. 2013. “Final Report to the Ford Foundation.” CETE UrbanTeacher Leadership Institute.Wolcott, Henry F. 1973. The Man in the Principal’s Ofﬁce. New York: Holt,Rinehart & Winston.114 Schools, Spring 2017This content downloaded from 130.058.065.013 on July 28, 2017 12:13:40 PMe subject to University of Chicago Press Terms and Conditions (http://www.journals.uchicago.edu/t-and-c).",
    "Link": "https://core.ac.uk/download/84705186.pdf"
}