{
    "Title": "When the Going Gets Weird, The Weird Turn Pro*: Management Best Practices in the Age of Medicinal Marijuana",
    "Authors": "Winn, John I., JD, LLM",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "DOCS@RWU",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Roger Williams University Law Review Volume 25 Issue 1 Article 5 Winter 2020 When the Going Gets Weird, The Weird Turn Pro*: Management Best Practices in the Age of Medicinal Marijuana John I. Winn JD, LLM Professor of Business Law at the Harry F. Byrd, Jr. School of Business (AACSB) at Shenandoah University Follow this and additional works at: https://docs.rwu.edu/rwu_LR  Part of the Disability Law Commons, Labor and Employment Law Commons, and the Workers' Compensation Law Commons Recommended Citation Winn, John I. JD, LLM (2020) \"When the Going Gets Weird, The Weird Turn Pro*: Management Best Practices in the Age of Medicinal Marijuana,\" Roger Williams University Law Review: Vol. 25 : Iss. 1 , Article 5. Available at: https://docs.rwu.edu/rwu_LR/vol25/iss1/5 This Article is brought to you for free and open access by the School of Law at DOCS@RWU. It has been accepted for inclusion in Roger Williams University Law Review by an authorized editor of DOCS@RWU. For more information, please contact mwu@rwu.edu. 60 When the Going Gets Weird, The Weird Turn Pro*: Management Best Practices in the Age of Medicinal Marijuana   John I. Winn, JD, LLM** Although marijuana remains a prohibited Schedule-I narcotic1 drug under federal law, so-called “medicinal”2 marijuana is legal in thirty-three states and the District of Columbia.  Eleven states and * HUNTER S. THOMPSON, FEAR AND LOATHING IN LAS VEGAS: A SAVAGE JOURNEY TO THE HEART OF THE AMERICAN DREAM (1971).  **  John Winn (Campbell Law ‘84) is currently Professor of Business Law at the Harry F. Byrd, Jr. School of Business (AACSB) at Shenandoah University in Winchester, VA.  Mr. Winn is also a retired Army Judge Advocate General’s Corp (JAG) Officer.  While on active duty, Mr. Winn was as Associate Professor of Law at the United States Military Academy (West Point) and Assistant Professor of Criminal Law at The Judge Advocate General’s Legal Center and School in Charlottesville, VA. 1. 21 U.S.C. § 812 (2012).  Other Schedule I drugs include heroin, lysergicacid diethylamide (LSD), 3,4-methylenedioxymethamphetamine (ecstasy), and peyote.  Id.  There are some prescription “cannabinoid” drugs on the U.S. market.  See infra p. 3.  There are also highly-regulated human-subject clinical THC trials requiring the approvals of the National Institute on Drug Abuse (NIDA), the Drug Enforcement Agency (DEA), plus “investigational new drug” (IND) application and research protocol approval from the Food and Drug Administration (FDA).  Marijuana Research with Human Subjects, U.S. FOOD& DRUG ADMIN., https://www.fda.gov/news-events/public-health-focus/ marijuana-research-human-subjects [https://perma.cc/H74E-SHG2] (current as of Apr. 2, 2019). 2. “The term medical marijuana refers to using the whole, unprocessedmarijuana plant or its basic extracts to treat symptoms of illness and other conditions.”  What is Medical Marijuana?, NAT’L INST. DRUG ABUSE, https://www.drugabuse.gov/publications/drugfacts/marijuana-medicine [https: //perma.cc/33BZ-XM4T] (revised July 20, 2019). 2020] EMPLOYMENT LAW 61 the District of Columbia have recreational marijuana laws in force.3  Nevada goes so far as to prohibit most employers from denying employment to job applicants submitting positive drug-screens for marijuana.4  Several states now require employers to accommodate medical cannabis users under disability discrimination laws.5  As the number of THC-friendly jurisdictions steadily increase, it becomes difficult, if not impossible, to maintain “drug-free workplaces.”  Employers with safety-sensitive jobs or deploying motor vehicles face “damned if you do, damned if you don’t” trade-offs: either maintain a safe, drug-free workplace6 to preserve insurance coverage and federal contracts, or yield to the inevitable and seek practical accommodations for employees using medicinal or lawful, recreational THC.  This article reviews the current legal environment and proposes management best practices for businesses seeking to establish lawful, non-discriminatory 3. Recreational marijuana is used without medical justification in stateswhich have decriminalized possession, use, or sale of certain types or amounts of THC products.  Currently, the Department of Justice follows guidance from the United States Attorney General’s Enforcement Memorandum of January 4, 2018 regarding prosecutorial enforcement and discretion standards.  See Memorandum from Jefferson B. Sessions III, Attorney General, to all United States Attorneys, on Marijuana Enforcement (Jan. 4, 2018), https:// www.justice.gov/opa/press-release/file/1022196/download [https://perma.cc/ Q772-4GLW]. 4. Assemb. B. 132, 80th Sess. (Nev. 2019) (providing, inter alia, limitedexceptions for EMTs, firefighters, motor-vehicle operators, or safety-related positions). 5. Arizona, Arkansas, Connecticut, Delaware, Illinois, Maine,Massachusetts, Minnesota, Nevada, New Jersey, New Mexico, New York, Oklahoma, Pennsylvania, Rhode Island, and West Virginia currently have laws affording some degree of employment protection for medicinal marijuana use.  State Laws Protecting Medical Marijuana Patients’ Employment Rights, CAL. NORML, https://www.canorml.org/employment/state-laws-protecting-medical-marijuana-patients-employment-rights/ [https://perma.cc/ZKB6-SE PL] (last accessed Nov. 20, 2019); e.g., W. VA. CODE ANN. § 16A-15-4(b)(1) (West 2019) (“No employer may discharge, threaten, refuse to hire or otherwise discriminate or retaliate against an employee regarding an employee’s compensation, terms, conditions, location or privileges solely on the basis of such employee’s status as an individual who is certified to use medical cannabis.”). 6. Procedures for Transportation Workplace Drug and Alcohol Testing,49 C.F.R. § 40.23 (2012).  See also Exec. Order No. 12,564, 51 Fed. Reg. 32,889 (Sept. 17, 1986) (establishing federal government agencies as drug-free workplaces).  62  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 cannabis use policies that will not unduly compromise safety or productivity.   I. BACKGROUND“Lawful” cannabis use in the American workplace is exceedingly complicated.  One source estimates that there are more than three million registered medical marijuana users in the United States.7  Nevertheless, many private sector employers in America still conduct pre-employment drug screening.8  Thirty-five percent conduct suspicion-based testing, and fifty-one percent conduct post-accident testing.9  Workplace THC policies generally depend upon where businesses are located.  Jurisdiction determines the rights of employers to fire or discipline workers for lawful medicinal use.  However, businesses in all states currently retain the right to terminate or discipline workers who use, possess, or are impaired by marijuana on premises during work hours.  Although most states still allow employers to ban recreational marijuana use and to test for pre-employment drug use,10 the lack of uniformity across jurisdictions can be bewildering.  Maine restricts most employers from pre-employment drug testing and prohibits terminating most employees for an initial positive drug test.11  In states where medical or recreational marijuana use is legal, testing agencies are reporting declines in pre-employment drug testing for job applicants, especially for marijuana.12  Simultaneously, positive screening results for all recreational drugs are at an all-time high13 (no pun intended).  7. Medical Marijuana Patient Numbers, MARIJUANA POL’Y PROJECT,https://www.mpp.org/issues/medical-marijuana/state-by-state-medical-mariju ana-laws/medical-marijuana-patient-numbers/ [https://perma.cc/2RE2-FE5L] (last updated July 10, 2019). 8. SHRM Poll: Half of Employers Performed Drug Tests on Final JobCandidates, SOC’Y FOR HUMAN RES. MGMT. (Sept. 7, 2011), https://www.shrm. org/about-shrm/press-room/press-releases/pages/drugtestingefficacypoll.aspx [https://perma.cc/4SW9-MKJD]. 9. Id.10. E.g., CAL. HEALTH & SAFETY CODE § 11362.45 (West 2017).11. 26 ME. STAT. tit. 26, §§ 683, 685 (2017).12. Jim Reidy & Danna Hewick, Are Employer Drug-Testing ProgramsObsolete? SOC’Y FOR HUMAN RES. MGMT., (May 23, 2018), https://www. shrm.org/hr-today/news/hr-magazine/0618/pages/are-employer-drug-testing-programs-obsolete.aspx [https://perma.cc/NU6H-R8SR]. 13. Id.2020] EMPLOYMENT LAW 63 While private U.S. employers generally are not required to test job applicants for illicit drug use, many still do.  Employment drug testing is important because workplace drug use has serious negative consequences.  The nexus between illicit drug abuse and compromised workplace safety, productivity, absenteeism, theft, and increased medical costs has been documented for decades.14  Also, three decades of standardized, non-forensic, drug testing makes it almost impossible for otherwise “innocent” applicants to be excluded from employment because of a false positive tested by certified drug-testing laboratories.15  Despite internet claims of false positive test results from substances like ibuprofen, current immunoassay screening (EMIT) confirmed by gas-chromatography or mass-spectrometry testing is essentially foolproof.16  Where still lawful, job applicants should be tested even when there is no reason to believe prospective employees have used illegal drugs.   The Drug-Free Workplace Act of 198817 mandates employers receiving federal grants or fulfilling federal contracts to establish comprehensive programs to achieve workplaces “essentially free of drugs.”18  Recently, opiates have become a major source of overdose deaths due to increased prescription and sale.19  Opioid abuse is a major factor in declining labor force participation among workers ages 25 to 54.20 Deaths from prescription painkillers or street 14. See Arthur L. Frank, Employee Health, 264 JAMA 1177, 1178–79(reviewing MARK A. ROTHSTEIN, MEDICAL SCREENING AND THE EMPLOYEEHEALTH COST CRISIS (1989)). 15. The Department of Health and Human Services (HHS) certifieslaboratories as “Instrumented Initial Testing Facilities” (IITF) meeting Mandatory Guidelines for Federal Workplace Drug Testing Programs.  See Mandatory Guidelines for Federal Workplace Drug Testing Programs, 82 Fed. Reg. 7920 (Jan. 23, 2017). 16. See Veronica I. Luzzi et al., Analytic Performance of Immunoassays forDrugs of Abuse Below Established Cutoff Values, 50 CLINICAL CHEMISTRY, 717, 720–21 (2004). 17. See 41 U.S.C. § 8101–8106 (2012).18. 10 C.F.R. § 707.11 (requiring government contractors to test (at aminimum) for marijuana, cocaine, opiates, phencyclidine and amphetamines). 19. See Press Release, Center for Disease Control, March 15, 2016, CDCReleases Guideline for Prescribing Opioids for Chronic Pain; see also, Michael C. Milone, Laboratory Testing for Prescription Opioids, 8 J. MED. TOXICOLOGY408 (2012).20. Mamta Badkar, Yellen: Opioid Crisis Weighing on US Labour ForceParticipation, FIN. TIMES (July 13, 2017), https://www.ft.com/content/ 776ba9e3-d47c-3554-8421-9238f79ef1b7 [https://perma.cc/92JX-NPHB]. 64  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 substitutes have nearly tripled over a fifteen-year span.21  As for cannabis use, despite the rapid expansion in lawful use jurisdictions, drug testing for THC still matters.22  Marijuana remains unlawful under federal law.  Even California’s expansive Proposition 64 amendment, which makes recreational marijuana use lawful, preserves the employer’s right to maintain strict drug and alcohol-free workplaces.23  Use of any psychoactive drug can affect work performance even when drug use occurs outside of work hours.  Although some employers have relaxed drug-use policies, there are compelling reasons to not do so, including safety, productivity, Workers’ Compensation coverage, and third-party civil liability.24  Impaired workers expose employers to liability even when employees act outside of the normal “scope of their employment.”25  If an impaired employee acts out and injures fellow workers or third 21. Rose A. Rudd et al., Increases in Drug and Opioid-Involved OverdoseDeaths—United States, 2010–2015, 65 MORBIDITY MORTALITY WKLY. REP. 1445, 1445 (2016), https://www.cdc.gov/mmwr/volumes/65/wr/mm655051e1. htm?s_cid=mm655051e1_w [https://perma.cc/Y69T-GHA8]. 22. THC is the psychoactive chemical found in the cannabis plantproducing euphoria, elation, delusions, changes in thinking, and even hallucinations.  See Zerrin Atakan, Cannabis, a Complex Plant: Different Compounds and Different Effects on Individuals, 6 THERAPEUTIC ADVANCESPSYCHOPHARMACOLOGY 241, 242 (2012). 23. California’s “Control, Regulate and Tax Adult Use of Marijuana Act”states: Nothing in section 11362.1 shall be construed or interpreted to amend, repeal, affect, restrict, or preempt:  . . . (f) The rights and obligations of public and private employers tomaintain a drug and alcohol free workplace or require an employer topermit or accommodate the use, consumption, possession, transfer,display, transportation, sale, or growth of marijuana in the workplace, or affect the ability of employers to have policies prohibiting theuse of marijuana by employees and prospective employees, or preventemployers from complying with state or federal law.CAL. HEALTH & SAFETY CODE § 11362.45 (West 2017). 24. See Steve Bates, Rethinking Zero Tolerance on Drugs in the Workplace,SOC’Y FOR HUM. RESOURCES MGMT., (December 5, 2017), https://www.shrm. org/resourcesandtools/hr-topics/talent-acquisition/pages/rethinking-zero-toler ance-drugs-workplace.aspx [https://perma.cc/6BVD-M243]. 25. See George Fitting, Careless Conflicts: Medical MarijuanaImplications for Employer Liability in the Wake of Vialpando v. Ben’s Automotive Services, 102 IOWA L. REV. 259, 271 (2018). 2020] EMPLOYMENT LAW 65 parties, employers can be sued for negligent hiring or retention.26  Although employees using marijuana off duty may not feel high or be noticeably impaired, there is evidence that THC metabolites are not fully metabolized for days and sometimes even weeks after use, especially among chronic THC users.27  There is little doubt that if polled, most people would prefer to not be under the care of a nurse whose judgment is even slightly impaired by THC.  Would a commercial pilot feel comfortable knowing her aircraft was being serviced or inspected by a recreational drug user?  One CEO states that, “[i]f you’re in the construction industry, marijuana use is not acceptable at any time, under any circumstance or condition.”28 II. MEDICINAL MARIJUANAThe two most recognized compounds found in the cannabis plant, from which marijuana is derived, are Tetrahydro-Cannabinol (THC), which has a psychotropic effect, and Cannabidiol (CBD), which has no psychotropic effect.29  The Food and Drug Administration (FDA) has approved the use of therapeutic medicines containing THC or CBD in a limited number of circumstances, such as the drug Epidiolex, which contains CBD, for the treatment of seizures associated with Lennox-Gastaut syndrome or Dravet syndrome.30 Additionally, two drugs containing a synthetic form of THC—Marinol and Syndros—have been approved by the FDA to reduce anorexia that sometimes occurs in tandem with treatment for AIDS, along with Cesamet, which also contains synthetic THC.31  There are, however, data 26. See Elliot S. Kaplan et al., Drug and Alcohol Testing in the Workplace:The Employers’ Perspective, 14 WM. MITCHELL L. REV. 365, 372 (1988). 27. See Robert S. Goodwin et al., Urinary Elimination of 11-Nor-9-Carboxy-∆9- Tetrahydrocannnabinol in Cannabis Users During Continuously Monitored Abstinence, 32 J. ANALYTICAL TOXICOLOGY, 562 (2008). 28. Drug Use a Problem for Employers, GAZETTE, (Mar. 24, 2015),https://gazette.com/news/drug-use-a-problem-for-employers/article_ab53e66f-4923-55a5-a48c-00b05cf262f9.html [https://perma.cc/NRU4-CCMS]. 29. Atakan, supra note 22, at 245–46.30. FDA Regulation of Cannabis and Cannabis-Derived Products,Including Cannabidiol (CBD), U.S. FOOD & DRUG ADMIN., https://www.fda.gov/news-events/public-health-focus/fda-regulation-cannabis-and-cannabis-derived-products-including-cannabidiol-cbd#approved [https:// perma.cc/N6BX-K3VF] (last updated Jan. 15, 2020) [hereinafter, FDA Regulation of Cannabis]. 31. Id.66  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 suggesting that marijuana or compounds found in marijuana may help relieve certain types of pain, nausea, glaucoma, lupus, multiple sclerosis, depression, and other conditions.32 A shortcoming of most of these trials is that the National Institute of Health (NIH) approved research on marijuana therapies that focus upon specific cannabinoid chemicals, or group of chemical compounds.33  Therapeutic effects are difficult to determine because most trials lack appropriate control groups and long-term follow-up, or use inadequate sampling sizes.34 Tests involving double-blind testing using smoked marijuana leaves have not produced consistent or measurable outcomes.35 While risks from side effects and psychoactive properties of marijuana are usually mild compared to alcohol or other drugs, there is no formal pharmacological regulation of ‘lawful’ cannabis products.  Composition and quality of THC and CBD products are typically not guaranteed.  Dosages vary widely from one study to the next (as does observed effectiveness from participating subject to subject).36  What remains unchallenged is that inhaled Cannabis smoke has well-documented harmful effects upon the lungs.37  In addition to THC and CBD, marijuana products contain literally hundreds of other chemicals.  Measured potencies of THC content in marijuana have also increased substantially over the past thirty years; from roughly 2% THC in 1980 up to 15-20% THC in more recent studies.38  Despite growing public acceptance, there are no recognized medical conditions in which marijuana-based therapy is a first-line clinically approved treatment.  32. See NAT’L ACAD. OF SCI., ENG’G, & MED., THE HEALTH EFFECTS OFCANNABIS AND CANNABINOIDS: THE CURRENT STATE OF EVIDENCE ANDRECOMMENDATIONS FOR RESEARCH, 87 (Nat’l Acad. Press 2017). 33. See generally id. at 377–90 (challenges include regulatory, financial,and access barriers, limited funding and supply, and lack of standardized procedure). 34. Id.35. See id. at 386–87.36. See id. at 254.37. Donald P. Tashkin, Effects of Marijuana Smoking on the Lung, 10 AM. THORACIC SOC’Y, Feb. 2013, at 239, 239–40. 38. WORLD HEALTH ORG., THE HEALTH AND SOCIAL EFFECTS OF NONMEDICALCANNABIS USE, 3–4, (2016). 2020] EMPLOYMENT LAW 67 Along with medicinal-THC, there has been a major upsurge in the popularity of transdermal CBD oils and lotions.39  CBD products, derived from low-THC industrial hemp plants, are marketed over the counter as treatment for arthritis, anxiety, depression, and numerous other conditions.40  The FDA does not regulate CBD because it is classified as a “hemp-plant-based-supplement” and not a drug.41  Like medicinal THC, however, there are no established standards for dosage, purity, efficacy, or safety for CBD, except that CBD supplements may not be comprised of more than 0.3% THC to be classified as a “hemp-product”.  The DEA opines that  for practical purposes, all extracts that contain CBD will also contain at least small amounts of other cannabinoids . . . . Although it might be theoretically possible to produce a CBD extract that contains absolutely no amounts of other cannabinoids, the DEA is not aware of any industrially-utilized methods that have achieved this result.42   Although CBD products should not result in impairment or trigger a positive THC drug screen, a recent study found that many CBD products were mislabeled as to CBD content.43  More troublesome was that the study also found THC in 18 of 84 CBD products purchased online.44  39. Cannabidiol, more commonly referred to as CBD, is a“phytocannabinoid derived from Cannabis species, which is devoid of psychoactive activity, with analgesic, anti-inflammatory, antineoplastic and chemopreventive activities.” Cannabidiol, NAT’L CANCER INST.:NCITHESAURUS, https://ncit.nci.nih.gov/ncitbrowser/ConceptReport.jsp?diction ary=NCI_Thesaurus&ns=ncit&code=C118452 [https://perma.cc/PW55-Q5H6] (last visited on Jan. 25, 2020).  40. See FDA Regulation of Cannabis, supra note 30.41. See id.42. Establishment of a New Drug Code for Marihuana Extract, 81 Fed.Reg. 90194, 90195 & n.1 (Dec. 14, 2016) (to be codified at 21 C.F.R. pt. 1308). 43. Marcel O. Bonn-Miller, et al., Research Letter: Labeling Accuracy ofCannabidiol Extracts Sold Online, 318 JAMA 1708, 1709 (2017). 44. Id. at 1708–09.68  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 III. AMERICANS WITH DISABILITIES ACT AND FAMILY AND MEDICALLEAVE ACT With limited exceptions, noted below, because marijuana remains a “Schedule I” drug, courts have held employers are not required to accommodate medical marijuana under the Americans with Disabilities Act (ADA) in states that allow medical marijuana use.45  Nevertheless, employees lawfully using medicinal marijuana may seek unpaid time-off under the Family and Medical Leave Act (FMLA)46 or request medical leave under the ADA.47  The ADA and FMLA often overlap in coverage.  For example, an employee with a “serious health condition” under the FMLA may simultaneously have a qualifying “disability” under the ADA. Under FMLA, the maximum allowable term of usable leave is twelve weeks within a twelve month period.48  The ADA does not limit the amount of leave an employee is allowed, so long as it is a “reasonable accommodation” that does not cause the employer “undue hardship.”49  FMLA leave can run concurrently with paid time off, including sick-leave or vacation leave.50  Under the ADA, however, all other leave to which the employee is entitled must be exhausted before ADA leave applies.51 45. See James v. City of Costa Mesa, 700 F.3d 394, 405 (9th Cir. 2012).But see Noffsinger v. SSC Niantic Operating Company, LLC, 273 F. Supp. 3d 326, 337–38 (D. Conn. 2017) (holding that federal law does not preempt the state’s palliative marijuana statute prohibiting (most) employers from hiring qualified applicants who may be medical marijuana users). 46. 29 U.S.C. §§ 2601–2654 (2012).47. 42 U.S.C. §§ 12101–12213 (2012).48. 29 U.S.C. § 2612(a)(1).49. 29 C.F.R. § 825.702(b) (2018).  Indefinite leave has not been considereda “reasonable accommodation” by many courts that have considered the issue because it often causes the employer “undue hardship.”  Stephen F. Befort, The Most Difficult ADA Reasonable Accommodation Issues: Reassignment and Leave of Absence, 37 WAKE FOREST L. REV. 439, 463 (2002). 50. 29 C.F.R. § 825.207(a).  See also U.S. DEP’T OF LABOR, WAGE & HOURDIV., FACT SHEET #28: THE FAMILY AND MEDICAL LEAVE ACT 2 (2012), https://www.dol.gov/whd/regs/compliance/whdfs28.pdf [https://perma.cc/BS7D -ZM77].51. See U.S. EQUAL OPPORTUNITY EMP’T COMM’N, EMPLOYER-PROVIDEDLEAVE AND THE AMERICANS WITH DISABILITIES ACT 2–3 (2016),https://www.eeoc.gov/eeoc/publications/upload/ada-leave.pdf [https://perma.cc/9GAE-UT57].2020] EMPLOYMENT LAW 69 The FMLA requires employees to share patient medical information with the employer in order to certify that a “serious medical condition” exists.52  Medical inquiries under the ADA, on the other hand, are strictly limited to disability-related inquiries which are “job-related and consistent with business necessity.”53  In other words, medical inquiries by employers under the ADA are used only to determine if an ADA qualifying disability exists or how the employer can “reasonably accommodate” the employee.54  In some locations, medical marijuana might be prescribed by a physician (or other healthcare provider) for treatment of a medical condition that is a recognized “disability” under the ADA55 despite the fact that the ADA expressly excludes from its coverage “any employee or applicant who is currently engaging in the illegal use of drugs.”56   For medicinal marijuana use, several states, including Arizona, Illinois, and Delaware, prohibit terminating employees lawfully using therapeutic marijuana without proof of on-the-job impairment.57  In other states, such as Minnesota and Nevada, employers may not terminate medical marijuana users unless (1) the employee displays on-the-job impairment, (2) not taking disciplinary action violates applicable federal regulations, or (3) it would result in the loss of a federal contract, federal licensure, or related federal benefits.58  Some states without specific statutory 52. 29 C.F.R. § 825.305(a).53. U.S. EQUAL OPPORTUNITY EMP’T COMM’N, NOTICE NO. 915.002, ENFORCEMENT GUIDANCE: DISABILITY-RELATED INQUIRIES AND MEDICALEXAMINATIONS OF EMPLOYEES UNDER THE AMERICANS WITH DISABILITIES ACT(ADA) (2000), https://www.eeoc.gov/policy/docs/guidance-inquiries.html [https: //perma.cc/9MKX-AC7W] [hereinafter U.S. EQUAL OPPORTUNITY EMP’TCOMM’N]. 54. Id.55. Medical use for an ADA-recognized disability qualifying medicalcondition should be distinguished from “drug addiction” (or alcohol dependency) which has been recognized as a qualifying disability under the ADA.  See Alexander v. Washington Metro. Area Transit Auth., 826 F.3d 544, 550 (D.C. Cir. 2016) (quoting 29 C.F.R. 1630.2(j)(1)(ii)); Mauerhan v. Wagner Co., 649 F.3d 1180, 1185 (10th Cir. 2011) (quoting Nielsen v. Moroni Feed Co., 162 F.3d 604, 609 (10th Cir. 1998)). 56. 42 U.S.C. § 12114(a) (2012); 29 C.F.R. § 1630.3(a) (2018).57. See Sachi Barreiro, State Laws on Off-Duty Marijuana Use, NOLOhttps://www.nolo.com/legal-encyclopedia/state-laws-on-off-duty-marijuana-use.html [https://perma.cc/94J9-WNSB] (last visited Jan. 25, 2020). 58. Id.70  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 guidance, including Oregon,59 Colorado,60 and California61 have upheld the rights of employers to terminate employees for medical cannabis use, even those with legitimate medical conditions.  In Barbuto v. Advantage Sales and Marketing, LLC, however, the Massachusetts Supreme Judicial Court held that “the use and possession of medically prescribed marijuana by a qualifying patient is as lawful as the use and possession of any other prescribed medication.”62  The court further held that employers must provide “reasonable accommodation” for medicinal use of THC unless the accommodation resulted in undue hardship for the employer.63  It is important to note that Barbuto involved medicinal marijuana use during off-duty hours without workplace impairment in a non-safety-sensitive position.64 In a similar case, Callaghan v. Darlington Fabrics, a Rhode Island trial court ruled the employer discriminated against the employee under the state medical marijuana law by refusing to employ an applicant holding a state medical marijuana therapy card.65  The court in Callaghan held that the applicant’s prescription card put the employer on notice that the applicant had a qualifying disability under Rhode Island law.66  Under those circumstances, the employer was obligated to determine if any reasonable accommodation for the prospective employee was feasible.67   In Noffsinger v. SSC Niantic Operating Co. LLC, the United States District Court for the District of Connecticut ruled that the ADA does not preempt Connecticut state law because the ADA was not intended to preempt state antidiscrimination laws affording greater anti-discrimination protections.68  Noffsinger represents the first federal court ruling recognizing that the federal Controlled 59. Emerald Steel Fabricators, Inc. v. Bureau of Labor and Indus., 230P.3d 518, 520 (Or. 2010).60. See Coats v. Dish Network, LLC, 350 P.3d 849, 850 (Colo. 2015).61. Ross v. RagingWire Telecomms., Inc., 174 P.3d 200, 203 (Cal. 2008).62. 78 N.E.3d 37, 45 (Mass. 2017).63. Id. at 43.64. See id. at 41.65. No. PC-2014-5680, 2017 WL 2321181, at *10 (R.I. Super. May 23,2017). 66. Id. at *11.67. Id. at *13.68. 273 F. Supp. 3d 326, 338 (D. Conn. 2017).2020] EMPLOYMENT LAW 71 Substances Act does not preempt state anti-discrimination provisions favoring medical marijuana users denied employment after testing positive for marijuana.69  The judge in Noffsinger did take pains to point out that the facts of the case did not involve workplace drug use and that the Connecticut Palliative Use statute expressly declines to sanction workplace cannabis use.70   Under the ADA, employers should generally avoid asking applicants about lawful drug use, as inquiries of this type may tend to elicit personal information about a qualifying disability.71  On the other hand, if an employee or job applicant tests positive for THC, employers may lawfully ask for an explanation for the positive result.72  Whether or not a business is located in a state recognizing medicinal THC use, workplace disciplinary actions in which an employee claims lawful “medical cannabis” as justification or excuse for the behavior becomes a bit more complicated.  In such cases, the best practice for management is focusing upon actual documented “misconduct.”  In other words, the issue is not whether the employee used medicinal marijuana.  The issue is whether the employee has been chronically late for work.  Focusing inquiries away from claimed medical conditions helps prevent claims that proposed disciplinary action is merely “pretextual” discrimination based upon an otherwise qualifying ADA-disability.  Although medical marijuana users are never entitled to a “free pass,” in EEOC v. Pines of Clarkston, a federal district court denied a motion for summary judgment by the employer after concluding that a jury could have determined the actual reason for terminating the employee was the employee’s epilepsy, a protected disability, rather than a positive drug test.73   IV. IMPAIRMENT TESTING AND WORKERS’ COMPENSATIONScientific “testing” for measuring actual THC-induced impairment via blood, breath, or urine is currently not possible in light of individual drug tolerance levels, different strains of 69. Id. at 334.70. Id. at 337 (citing CONN. GEN. STAT. §§ 21a–408(b)(2)–(3)).71. U.S. EQUAL OPPORTUNITY EMP’T COMM’N, supra note 53.72. See id.73. No. 13-CV-14076, 2015 WL 1951945, at *7 (E.D. Mich. Apr. 29, 2015).72  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 marijuana, varying forms of ingestion, and frequency of use.74  Although employers retain the right to discipline employees violating workplace drug use in all jurisdictions, it can be difficult to prove actual workplace consumption since drug testing cannot determine where or when marijuana was ingested.  Disciplinary action against employees is authorized even if the employee’s drug use is connected to treatment for a disability.75 Although Colorado76 and Washington77 have enacted statutes allowing an inference of impairment with a measured THC blood level of five ng/ml or higher, there are currently no generally accepted standards as to what constitutes THC impairment.78  Reductions in motor skills, except in gross impairment situations, are generally not measurable by standardized neurocognitive tests.79  One study points out a problematic “all or none” scenario in which THC patients receive either a “sub-therapeutic” effect or are dosed past the point of impairment.80  In another study, THC content of marijuana products varied from package labeling by over 40%.81  74. Hallvard Gjerde et al., Evaluation of Dräger DrugTest 5000 in aNaturalistic Setting, 42 J. ANALYTICAL TOXICOLOGY 248, 248–49 (2018). 75. The Americans With Disabilities Act: Applying Performance AndConduct Standards To Employees With Disabilities, U.S. EQUAL EMP.OPPORTUNITY COMMISSION, http://www.eeoc.gov/facts/performance-conduct. html [https://perma.cc/K66B-CDYF] (last modified Dec. 20, 2017). 76. COLO. REV. STAT. § 42–4–1301(6)(a)(IV) (2016).77. WASH. REV. CODE § 46.61.506(1) (2013).78. The Government Accountability Office (GAO) reported in 2015 that“identifying a link between impairment and drug concentrations in the body, similar to the 0.08 BAC threshold established for alcohol, is complex and, according to officials from the Society of Forensic Toxicologists, possibly infeasible.”  U.S. GOV’T ACCOUNTABILITY OFFICE, DRUG IMPAIRED DRIVING:ADDITIONAL SUPPORT NEEDED FOR PUBLIC AWARENESS INITIATIVES 15 (2015), https://www.gao.gov/products/GAO-15-293?source=ra [https://perma.cc/H25D-6KDA].  Hound Laboratories, Inc. claims to have developed a reliable “Pot Breathalyzer” which is capable of measuring THC-levels in exhaled breath correlating to impairment; the device has not been approved for law enforcement use by any agency at the time of this writing.  See Eric Westervelt, The Pot Breathalyzer is Here.  Maybe., NAT’L PUB. RADIO (Aug. 4, 2018 8:02 AM), https://www.npr.org/2018/08/04/634992695/the-pot-breathalyzer-is-here-maybe [https://perma.cc/89AM-Y3GU]. 79. Robert S. Goldsmith et al., Medical Marijuana in the Workplace:Challenges and Management Options for Occupational Physicians, 57 J. OCCUPATIONAL & ENVTL. MED. 518, 522 (2015). 80. Id.81. Id.2020] EMPLOYMENT LAW 73 Synthetic cannabinoids are also available and pose unique testing problems.  Substances such as “K2” and “Spice” may cause severe impairment but most workplace drug screening (EMIT) tests do not detect synthetic THC analogues.82  Testing for synthetic drugs is significantly more expensive than THC-screening and constantly changing chemical compositions make detection impracticable.83  Presently, urine is the most tested sampling matrix, but blood, saliva, hair, and even breath samples may be utilized.84  Non-chemical “interactive” impairment testing methods typically measure physical reaction times to a signaled “que” and are currently being marketed to test general workplace fitness for duty.85  Some interactive or instrument impairment testing involves measuring hand-eye motor skills as employees manipulate a cursor in a video simulation.86  Other tests utilize eyepiece scanners to measure ocular response times and compares the results to previous “baseline” tests.87  Computer algorithms calculate impairment scores and provide alerts when test-takers are potentially impaired.88  Although chemical testing is advised whenever an employee “fails” a machine-based impairment test, interactive testing has no delay time awaiting urine or blood tests.89  Employees should always be removed from dangerous duties or be sent home to ensure safety is not compromised. Interactive testing can also identify non-drug-related impairments such as fatigue, alcohol, prescription drugs, or illness.90   82. See Ken Kulig, Interpretation of Workplace Tests for Cannabinoids, 13J. MED. TOXICOLOGY 106, 110 (2016).83. Id.84. Id. at 106; Kara L. Lynch et al., Correlation of Breath and Blood Δ9-Tetrahydrocannabinol Concentrations and Release Kinetics Following Controlled Administration of Smoked Cannabis, 65 CLINICAL CHEMISTRY 1171,1171 (2019).  THC levels of self-reported volunteer marijuana users were measured through breath samples; the study found detectable levels of THC in breath samples up to three hours after ingestion.  Lynch, supra, at 1171.  85. Evelyn Beck, Is the Time Right for Impairment Testing, WORKFORCE(Feb. 1, 2001), https://www.workforce.com/2001/02/01/is-the-time-right-for-impairment-testing/ [https://perma.cc/R3AA-WYZY].  86. Id.87. Id.88. Id.89. Id.90. Id.74  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 THC has well-documented effects upon depth perception, reaction time, and coordination.91  Research on the psychomotor and judgment effects of marijuana ingestion demonstrate an increased risk for fatal motor vehicle accidents.92  Postal workers who tested positive for marijuana had 55% more accidents, 85% more injuries, and 78% greater absenteeism.93  One can probably assume that in higher dosages, THC may create significant sensory distortion.  Although at least one study found that marijuana ingestion by experienced users had only modest effects upon complex task performance,94 the use of THC is totally incompatible with someone working in a safety-sensitive position.  Safety, however, is far from the only consideration.  Attention to detail remains important even in office environments.  A misplaced digit or failure to recognize a phony email address could cost a business thousands of dollars.95  No one would ever claim that marijuana use reduces the frequency of workplace accidents or mistakes.  Considering the variables in dosages and effects on individual users, it is not feasible to ensure industrial workplace safety if workers use marijuana.  Under OSHA regulations, employers may not create conditions endangering safety and health in the workplace and must ensure that workplaces are essentially “free from serious recognized hazards.”96  In safety-sensitive positions, this means “zero tolerance” for illicit drug use should remain in 91. Rebecca L. Hartman & Marilyn A. Huestis, Cannabis Effects onDriving Skills, 59 CLINICAL CHEMISTRY 478, 479 (2013). 92. Mark Asbridge et al., Acute Cannabis Consumption and Motor VehicleCollision Risk: Systematic Review of Observational Studies and Meta-analysis, 344 BRIT. MED. J., Feb. 6–12, 2012. https://www.bmj.com/content/bmj/ 344/bmj.e536.full.pdf [https://perma.cc/RZ2W-HUA4]. 93. Craig Zwerling et al., The Efficacy of Preemployment Drug Screeningfor Marijuana and Cocaine in Predicting Employment Outcome, 264 JAMA 2639, 2643 (1990).  94. See Carl L. Hart et al., Effects of Acute Smoked Marijuana on ComplexCognitive Performance, 25 NEUROPSYCHOPHARMACOLOGY 757, 764 (2001). 95. The North Carolina State Bar Journal recently noted an incident inwhich a law firm was defrauded of over $300,000 when an employee (albeit with no evidence of drug use) inadvertently failed to notice an email address in which an “I” was replaced by the number “1.”  See Leanor Bailey Hodge, Mark the Rea1Estate Guy, N.C. ST. B.J., Spring 2019, 25, 25, 31. 96. Occupational Health and Safety Admin., Employer Responsibilities,U.S. DEP’T LAB, https://www.osha.gov/as/opa/worker/employer-responsibility.html [https://perma.cc/SU64-LUNA] (last visited Nov. 30, 2019).2020] EMPLOYMENT LAW 75 place and be enforced even if other employees are simultaneously allowed to use medicinal or recreational cannabis.  V. SUMMARYIn states with liberal recreational use laws, finding qualified workers may be a challenge.  While a complete prohibition of marijuana on or off duty is a responsible and logical standard, in some jurisdictions off-duty bans are no longer feasible.  In some states, bans on THC use in general may lead to discrimination claims under the ADA, state disability, or therapeutic use laws. Medical cannabis may have potential benefits for employees, while lawful off-duty recreational THC use by employees holding non-critical and non-safety-sensitive jobs may be compatible for some businesses.  No employer, however, should lose sight of the fact that THC in the workplace always carries some risk to safety, productivity, liability, and worker health.  Until the right to maintain a drug-free workplace is modified by state or federal laws, many employers will not find an advantage (other than expediency) in hiring employees using medical or recreational THC.  Costs, benefits, and risks must be carefully evaluated.   In states where medical THC is already a reality, employer cannabis policies should be carefully tailored for each workplace and each unique job position.  As legal landscapes shift, managers should work closely with human resources (HR) and legal professionals to implement clear, workable, and up-to-date policies. In addition, assistance from an employment lawyer and occupational health specialist may be necessary to maintain full compliance with state laws and federal mandates.  Given the rapid evolution of both THC legislation and case law, cannabis policies should be reviewed and updated annually to reflect current law and best practices.  HR should remain primarily responsible for ensuring screening and use policies are consistent across departments because most HR departments are already familiar with drug testing.  Managers should be trained to be fair and consistent in the enforcement of these policies.97  Intervention 97. For an excellent resource for managers to evaluate impartment issues,see generally FIRST LAB INC., A SUPERVISOR’S MANUAL: GUIDELINES FORREASONABLE SUSPICION DRUG AND ALCOHOL TESTING (Nov. 2002), 76  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 support should always be available for employees with substance abuse problems.  Continuous commitment is essential in maintaining safe workplace standards, especially if policies create separate “THC allowed” and “THC forbidden” worker subsets.  The following best practices may be worthy of consideration in formulating workplace cannabis-use policies.   VI. SUGGESTED BEST PRACTICESThe first best practice would be for businesses developing medicinal (or lawful recreational) use policies to evaluate whether medicinal cannabis use is compatible with the duties and responsibilities of each job position.  For example, lawful use may not affect housekeeping staff, but accommodating marijuana use for delivery drivers poses significant safety and liability risks.   A second suggested best practice would be to require self-reporting medicinal-use employees (or applicants) to complete ADA accommodation request forms.  Employees should certify medical use is a necessary accommodation under applicable state law.  All employees should affirm they will not use or possess cannabis products at work or share cannabis with other employees.  Policies must clearly indicate that workplace impairment is unacceptable and will result in termination or other discipline.   Businesses may choose to discontinue THC testing completely or limit testing to safety-related positions.  Employers choosing the latter course of action should retain the right to drug test employees following workplace accidents or when there is a reasonable suspicion of on-the-job impairment.98  Non-THC-specific workplace impairment policies should specify broadly and generally what constitutes unacceptable conduct.  Disciplining or terminating an employee for clearly observed and documented impaired behavior is less complicated than discipline for a positive drug-screen following reported suspicion of drug use.  Bear in mind that ng/ml levels in chemical screening tests are not reliable indicators of http://ppta.net/pdf/ReasonableSuspicionTestingSupervisorManual%20.pdf [https://perma.cc/F3SG-SXKM]. 98. See, e.g., 21 R.I. GEN. LAWS § 21–28.6–4(e) (1956) (allowing employersto refuse employment where marijuana use would affect workplace safety).  In Rhode Island, employees must be provided copies of positive drug test results and opportunities to challenge the testing, explain results, or request sample re-testing.  28 R.I. GEN. LAWS § 28–6.5–1. 2020] EMPLOYMENT LAW 77 impairment.  Employers should still reserve the right to test urine or blood for high ng/ml levels as one of several factors in determining impairment following observed impaired behavior. Additionally, if an applicant that is a lawful medical marijuana user with a claimed ADA-qualifying medical condition is denied employment for reasons not related to medicinal use, the employer policies should dictate that management documents exactly why the applicant was not qualified, was not the best candidate, or could not be reasonably accommodated.  To avoid claims of pretextual discrimination,99 documentation should address why a claimed disability was not a factor in denying employment or that reasonable accommodation was not feasible.  Medical use policies in federally regulated workplaces and industries should clearly state that in the event of conflicts between local, state, and federal law, federal drug-free workplace regulations may overrule state medicinal THC protections.  Further, after reported misconduct, an employee might claim the workplace policy violation arose from an ADA-recognized disability and request accommodation.  If misconduct is serious enough to warrant termination, no accommodation discussion needs to take place.  If proposed discipline does not involve termination, the employer should begin the “interactive process”100 needed to determine if accommodation is feasible.  Further, post-accident testing policies should remain in place.  An employer may also consider establishing rules or guidelines to follow if an employee is arrested for or convicted of impaired (off-duty) driving.  All requests for employee medical records, employee medical questions, or requests for employees to undergo medical examinations should be based upon documented necessity per FMLA or ADA standards.  Medical inquiries under the ADA must be based upon a reasonable belief that the employee’s ability to perform an essential job function will be impaired by a “qualifying disability” or that performing the task or tasks with the qualifying disability poses a direct threat of physical harm to the employee or 99. See Warshaw v. Concentra Health Servs., 719 F. Supp. 2d 484, 491–92(E.D. Pa. 2010); see also EEOC v. Pines of Clarkston, No. 13-CV-14076, 2015 WL 1951945, at *5 (E.D. Mich. Nov. 29, 2015). 100. See, e.g., McBride v. BIC Consumer Prods. Mfg. Co., 583 F.3d 92, 99–100 (2d Cir. 2009). 78  ROGER WILLIAMS UNIVERSITY LAW REVIEW [Vol. 25:60 others.101  Employers faced with FMLA-related medical issues should follow the FMLA “certification” process to determine if the employee has a qualifying “serious health condition” that requires inpatient care or continuing treatment by a healthcare provider.102  All medical information provided by employees (or applicants) must be treated as confidential medical records.103  These standards should apply regardless of whether the applicant or employee is seeking a formal accommodation under the ADA or certification under the FMLA. Managers should remain sensitive to any management practices that might result in disparate treatment or disparate impact complaints by employees using medical marijuana.  For example, if a supervisor knows an employee is a medical marijuana cardholder and feels the employee is tardy because of THC yet fails to hold other, non-THC-using employees to the same standard, the supervisor’s conduct may trigger an ADA or Title VII claim.104  Where strict “drug free” work safety standards must be maintained, consider using non-chemical interactive impairment testing equipment.  Ensure impairment policies allow managers to remove workers from the jobsite and to test blood or urine following any interactive testing result indicative of impairment.  When a lawful-use employee shows evidence of on-the-job impairment, the employer may elect to provide the employee a “firm choice” between Employee Assistance Program (EAP) (or other rehabilitative treatment) and termination.105  Effects of cannabis on behavior vary from person to person.  Unprofessional workplace behavior should never be tolerated.  Drug-free co-workers may resent the “freedom” of medicinal users, especially if they are forced to cover for the other worker’s absenteeism or lower productivity.  Employers might also consider a CBD use policy.  Because CBD products are unregulated, CBD products containing THC may 101. U.S. EQUAL OPPORTUNITY EMP’T COMM’N, supra note 53.102. See U.S. DEP’T OF LAB. WAGE AND HOUR DIVISION, EMPLOYERS GUIDE TOTHE FAMILY AND MEDICAL LEAVE ACT 28, https://www.dol.gov/whd/fmla/ employerguide.pdf [https://perma.cc/4JS6-ACFU] (last visited Nov. 27, 2019). 103. 42 U.S.C. § 12112(d)(3)(B), (4)(C) (2008).104. See The Americans With Disabilities Act: Applying Performance AndConduct Standards To Employees With Disabilities, supra note 75. 105. See Dustin Riddle & Richard Bales, Disability Claims for Alcohol-Related Misconduct, 82 ST. JOHN’S L. REV. 699, 702 (2008). 2020] EMPLOYMENT LAW 79 result in a positive urine drug test.  If so, the burden of proof should be on the employee to show that the THC use was unintentional. CBD use should be at the sole risk of the employee.  If the employee is subject to Department of Transportation mandated standards, CBD use cannot be an acceptable justification for a positive THC test.  Any significantly elevated level of THC metabolite106 on a drug test (or evidence of actual impairment plus positive THC test) should be presumptive of knowing ingestion of THC.  Employers should ensure that job descriptions accurately describe essential job functions and responsibilities.  If there is an “essential” aspect of a job which excludes medical marijuana use, make sure other employees in the group who are authorized to use medicinal THC do not perform those duties or responsibilities (e.g. “this task is only suitable for, and only to be performed by, non-THC users”).  When questions arise, consider submitting employees’ job descriptions to doctors or physician assistants involved in reviewing or certifying ADA or FMLA eligibility.  Employers should not hesitate to ask medical providers what specific tasks or responsibilities employees may safely or efficiently perform while using medical marijuana.  Such inquiries may also include whether an employee is capable of working overtime or rotating shifts.  If a specific job duty is essential to the employer’s mission, make sure that is expressly noted in the job description.  106. Fifteen or more nanograms of THC metabolite per milliliter of urine isa typical industry screening standard.  See Kulig, supra note 82, at 107. ",
    "Link": "https://core.ac.uk/download/322810175.pdf"
}