{
    "Title": "Do Individual Interests Make A Difference?",
    "Authors": "Renninger, K. Ann",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Do Individual Interests Make a Difference?• K. Ann Renninger Swarthmore College Think about times when you have worked collaboratively with another colleague or student Chances. are good that even though you were both very involved in the project, you each often had different kinds of contributions to make to it In fact, it is also probable that there were dimensions to the thinking you did that would not have existed if you had been working alone. While you each may have known a fair amount about the project and felt that it was important, the differences in your contributions couldbe identified in terms of what you each saw as possibilities for acting on the task. What you saw as possibilities for action is related to your representation of the task. What you represented to yourself as being the task were related to your prior activity. It is simple enough to say that other things you have done influence what you end up doing. On the other hand, it is not so easy to say more spccifically why it is that this influence occms and to what extent this iintlucncc effects the kinds of things you learn. Ccarly there are some imponant differences in how individuals represent a task to themselves as they engage in it What is not so *The research reported in this essay has been supported through grants from the National Academy of Education Spencer Fellowship Program, Educational Testing Service Postdoctoral Fellowship Program, and the Swarthmore College Faculty Research Fund. I would like to thank Robert H. Womi~ Barbara L. Klock, Irving E. Sigel, and Ann S. Morgan who were co-investigators; and Usha Balamorc, Hubert Chang, Wendy Davidson, Marijke Goossens, Herbert Kerns, Barbara L. Klock, Christina B. Maybee, Sherry Hartenstine Levy, Kenneth Pitts, and Tessa Prattos who were research assistants on the studies presented. 228 clear are the differences between people in the content of their representations and the extent to which these differences might make a difference in terms of how tasks are completed and new taskS are undertaken. This essay will focus on three questions in ol'der to address the query, \"Do individual interests make a difference?\" FlISt, what is interest? Second, what can be said about individual interests at this time? And thini, in what ways might individual interests make a difference? What is Interest? Interest is here concepnJalfaed as being composed of two components: stored knowledge and value. Knowledge refers to the experience and value refers to the feelings of competence (White, 1959) the individual brings to his/her activity. From this perspective, what a child brings to action with an identified interest in, say, the play object ~ is a combination of both that child's previous experience with trains and that child's feelings about that experience. This combination of stored knowledge of and value for trains leads to increasing differentiation and reintegration (W emer, 1978) of understanding about trains in relation to what the child already knows and values about trains, as well as about other objects (events or ideas)* in hisJher environment. At first, this developing understanding is thought to be associated with the class of objects called train. Later, the activity characteristic of these engagements with trains influences subsequent actions (question asking, challenge setting, and activity) with other classes of objects (events or ideas). Thus, the way in which the child plays with the train, the kinds of challenges he/she sets for him/herself, influences the kinds of things he/she does with other play objects even when no train is present. In other words, interest as a psychological state influences the way in *Play object, or simply object, will be used throughout this essay to refer to the class of objects, events, or idea5--the tasks- with which children might engage in a nursery school class. Thus, object could refer to trains, playdough, a doll, or dramatic play among other play \"objects\". 229 which the child represents possibilities for action to him/herself. As such, interest influences the way in which the child engages in activity. However, it is not the identified object of interest, e.g. train, which is \"interest,\" rather train is the content of the activity, the object with which interest is identified. Instead, Interest is conceptualized as the individual's cognitive and affective engagement with the identified object of interest: perceiving possibilities for action; representing these possibilities to the self; making choices about activity; and finally setting, resolving, and resetting challenges. Rather than simplybeing information about the object, interest is information about the relationship between the object and the self as social other since the knowledge and value components of interest derive from what the individual brings to present action from past engagements with both objects and others. With respect to the task on which you and a colleague work, it is hypothesized that you have interests- ways of qucstionning, making leaps in your thin)cjng, and completing the task-- which influence how you understand what the problem under study is and how you go about addressing it. These interests may be linked with \"objects\" or domains of study, but are more clearly identified with patterns of action within these domains. As such , what is identified as an interest is in fact, a domain within which particular patterns of action- questionning, challenge setting, and activity are repeatedly engaged and within which subsequent possibilities for action are constructed. What can be said about interest at thjs time? In contemporary discussions of interest, it has generally taken one of the following three forms: (a) Attractions as assessed by sclf-rei>ort. such as the matching of individuals and careers (e.g. Fryer, 1931); (b) Emotions and studied through facial reactions, or heart rate (e.g. Izard, 1977); or (c) Situation-specific motivators characteristic of a group (e.g. Gerson & Damon, 1978). In contrast, the present conceptua1intion of inte.rcst as including both stored knowledge and value draws on discussions of interest conducted earlier in this century by James (1890), Baldwin (1911), Dewey (1913), and more recently by Piaget (1968) and Vygotsky (1966). From this 230 perspective, interest can be thought of as a kind of filter through which an individual represents information to him/herself. As such, interest is a potentially important influence on how individuals understand, engage in, and complete tasks.* Defining interest in terms of stored knowledge and value, however, leads to questions about the assumptions underlying most contemporary studies. Fust, all attractions are not necessarily interests, even though all interests are also attractions. One can for example be attracted to something and have value for it and still have very little knowledge of it. Second, it is not expected that individuals will necessarily be reflectively aware of interests which are identified in terms of patterns of questionning, challenge setting, as well as activity in domains for which there is both ~tored knowledge and value, Thus self report as it is typically employed in these studies may not be as effective as observation for the identification of interest. Third, measures of facial reaction or hean rate are physiological responses to the state of interest, but the response itself is not the interest. Fourth, sittlati.on-specific measures, as well as those which are used to characterize a group, can be loosely construed as temporary intere~, or what Piaget (1968) called secondary interests, and as such impact on performance, but cannot be described as substantially impacting on the process of learning more generally. Due to differences in the way that interest has been studied and given the present use of the term as reflecting stored knowledge and value, it was necessary to establish that interest does effect the way in which information is processed before testing other hypotheses. However, to do so required identification of a sample which: (a) was not able to feign interest and was not experimenter-wise, (b) could follow directions, and (c) would accommodate to videotaping (so that identification of interest could be based on observed behaviors rather than self-report). Thus, the *The work of Eckblad ( 1981) has also influenced the present conccptuali7.ation of interest, atthough her work focuses more specifically on intrinsic motivation than on interest. 231 studies to be described have focussed on one to three samples (total N= 44, 22M, 22F) of children between 2.9-and 4.2-years-of age whose nursery school class was conducted in the same nursery school classroom.* Each of these studies was conducted using either combined naturalistic and experimental methodologies or through independent coding of videotapes collected for the naturalistic part of the combined studies. All children were individually videotaped during six 40-minute (or twelve 20-minute) sessions of naturally occurring free play during their nursery school class. From these videotapes, children were identified as having an interest in a particular class of objects if, over the sessions of free play, they: (a) returned to that object repeatedly, (b) spent more time playing with that object than with other play objects; (c) would at times play with that object in solitary play; and ( d) would at times play in other than manipulative play with that object.** On the other hand, children were identified as having a nonintcrest in a particular class of play objects if, over the videotaped play sessions, they: (a) did spend time with these play objects; (b) could use something other than manipulative play with the noninterest object; iDd ( c) did not spend as much time *Thus, the groups of children used for each study arc drawn from the same classroom, with the same play objects, under teachers sharing the same \"whole-child\" approach to education, during the second half of the school year. To the extent that it is possible to provide them with equal sets of experiences, the children were equally familiar with the play objects and the others in the class. **Given that objects of interest can be identified for each child, the focus of the present set of studies is the impact of the identified object of interest, regardless of what that object is, on activity. Thus, objects of interest to other children arc employed as comparison stimuli when an individual child's performance with his/her identified object of interest is not directly compared to his/her identified object of nonintercst. 232 with these play objects as they did with their identified objects of interest; and/or (d) did not play with the object in solitary play. Effect of interest on att.cntion and memory. The first study was designed to investigate the effect of interest on attention and memory (Renninger & Womiak, 1985), since interest as it is conceptualized here has not been evaluated previously in terms of its effect on the way in which information is processed. In this study, children's behaviors in free play were first coded to identify objects of interest and these were then employed as stimuli in three experimental tasks assessing attentional shift, recognition, and recall memory. Videotapes of children in free play were collected and individual interests were identified for each child as described above. Results from this portion of the study indicated that: (a) at least two (out of a possible 16) objects of interest could be identified for each child; (b) children's interests tended to be strong and relatively well focused; and (c) among children, inteJ'CSts varied widely; such that what is of interest to one child is not usually an interest for the next child, although one child's identified interest in, say, trains is as strong as the next child's identified interest in animals. Following identification of interests for each child, their objects of interest were then employed in stimulus sets (interest obj~ comparison objects) for three experimental tasks designed to evaluate the effect of intezest on direction of attentional shift, level of pictoral recognition, and object recall. Briefly, to study attentional shift, slides depicting stimulus sets were backprojected on a screen such that all stimuli fell in the child's visual peripheral field and shifts in their gaze from the center of the screen to a stimulus, or from stimulus to stimulus, required large, easily monitored eye movements. Findings from this task indicate that children are more likely to shift their attention to and shift their attention first to their identified object of interest than they are to a comparison item. To study recognition, stimulus objects were nested in a larger set of filler objects which the experimenter explained had been received as birthday presents. The task for the child was to 233 determine which objects had been taken over to a friend's house. Findings from this task indicate that children are more likely to recogniz.e a given interest item and to choose their identified object of interest as one of the toys received as a birthday present than they were to recognize comparison items or to choose them first. These findings which differentiate items by their recognition value are all the more impressive when one considers that recognition memory among young children is quite good for a large numbers of items (c.f. Brown & Campione, 1972; Brown & Scott 1971). To study recall, the child was presented with each of nine objects (stimulus and filler objects) one-at-a-time and asked to recall which objects were in the box. The identified object of interest for each child was placed in the middle serial position, the position least likely to be recalled. Findings from this task indicate differences in recall with respect to serial position (interest and recency) and age. The effect of interest on recall was strong for both age groups. Interest effected the recall of younger children more than did the recency object. Recall of interest and recency items were the same for older children. These findings are particularly powerful when one considers that previous work with this kind of task suggested that children at this age had recall memory for only those objects in the recency position (Perlmutter & Myers, 1979). In summary, results from the experimental portion of this study indicate that: children's interests exert a marked influence on: shifts in focal attention with respect to objects in peripheral visual fiel~ the likelihood that an item will be correctly recognized when encountered again, and the level of recall. These findings suggest that individual interests reflect the knowledge/value systems that individuals bring to the task of organizing experience, memory and activity. What this study did not address was how or why interest might function in this way. Thus, a series of studies were designed to evaluate the structure and variation of children's actions with objects identified as interests and objects identified as nonintercsts; the effect of interest on play in which the children represented the object to themselves even though the object was not really present (transfonnational play); the effect of the perceived properties of interest objects on the way 234 in which the children engaged in a set of novel tasks; and the effect of interest and affiliation on sustained interactions among dyads. Effect of interest on StruCNre and yariation of action. In order to evaluate the effect of interest on structure and variation of children's play across discrete play areas, this study was designed to identify the range and quality of individual children's actions with each of 16 play objects readily available to them in free play at nursery school. For the purposes of this study, five types of play were identified and then the specific actions of each of the children within each type of play with each play object were coded across tapes in which the child was the focal child for free play. The five types of play selected for study include: investigative, functional, operational, transformational, and facilitative play (Renninger, 1984). * In inyesti&ative play, children's actions involve exploring the physical attributes of an object. Thus, in investigative train play a child might drop the train, push it side-ways, or play with the coupler. In functional play, children's actions arc more conventional, thus a child might hook cars together capably, push the train (engine first), or load and unload the train. In qperational play, children's actions reflect preoccupation with relations such as: counting, dividing, ordering, etc. In operational train play the child might: connect and disconnect the cars of a train, get down to eye level, and pull it forward and backward while focusing on the wheels; or order the cars by size, color, etc. In traos!ormational play. children's actions suggest the use of one object to represent another object, thus a child might make tickets out of paper or use a line of chairs to denote a train. Finally, in facilitative play. the object supports the children's actions in other play areas. Thus, the train might be carried to the easels and placed on a nearby window ledge while the child paints. Particular actions within each type of play refer to what the child was doing. Thus one child's exploratory play with trains might involve holding the engine upside down and spinning one wheel *These types of play arc in no way meant to be an exhaustive listing of types of play. 235 and then another wheel. Whereas, another child's exploratory play with trains might include pushing a train with one car sideways, stopping the pushing motion, pushing again, and then reorganizing the way the train was connected so that the wheels would allow the train to be pushed more smoothly. All shifts in action were also coded so that it was possible to evaluate the sequence of the child's actions both between and within play objects. Thus, for example, \"pushing the train\" and \"stopping the pushing motion\" would count as two actions. A repeated action sequence might include: \"pushing the train,\" \"stopping the train,\" \"pushing the train,\" \"reorganizing the connections,\" or \"a,b,a,c\". By comparing each child's typeS of play and actions within types of play with both his/her identified objects of interest and noninterest, it is possible to evaluate the effect of individual patterns of interest and noninterest, or value, on structure and variation in the children's play actions.* Because interest previously had been found to influence the way in which the children process information (Renninger & Womiak, 1985), it was expected that children might be able to represent more possibilities for action to themselves with their identified object of interest than with their identified object of noninterest. Analyses of the structure and variation in each child's play involved evaluation of the mean proportion of types of play (and actions within types of play) with objects of interest to those of *For the evaluation of structure and variation of children's play, all of the children's play types and actions were coded regardless of how long or short the duration of play with that object. This coding contrasts with that for identification of interests and noninterests in which the only play evaluated was that with objects which lasted 2.S or more minutes. It further contrasts with the identification of objects of interest and noninterest in that it focuses on the process of the child's engagement with each play object such that it is possible to compare the individual child's exploratory play with one play object with his/her exploratory play with another play object 236 noninterest objects. Findings from these analyses reveal that: (a) Children have a wider range of types of play available to them when playing with their identified objects of interests than when playing with objects identified as noninterests; (b) Children are more likely to play longer amounts of time, reJ)eating particular sequences of action with their identified object of interest, than when they play with objects identified as noninterests. (c) Children's actions within play types are more likely to include more variations of action with their identified objects of interest than with their identified objects of noninteresL (d) Children who shared the same identified object of interest did not necessarily share the same action sequences in play with their identified object of interest (e) Orildren in play with objects identified as noninterests are more likely to either not repeat prior action within play types, or only rq)eat prior actions with no incorporation of changes in action sequences. Fmdings from this study indicate that children may sec more possibilities for action when playing with an identified object of interesL This explanation serves, in tum, to explain the increased variation in the types of play and repetition of particular action sequences in the children's play with identified objects of interest These findings indicate that particular play objects appear to represent possibilities for action to children which are not found in the other play objects with which they engage. That the children continue to re-engage their identified objects of interest , to repeat particular patterns of action which incorporate systematic variations in these actions, and that these actions vary even when children share the same identified object of interest, further suggests that children are responding not only to the challenges which the play object affords, but that they are setting challenges for themselves with these play objects which build on their prior actions. The finding that children who shared the same identified object of interest did not necessarily share the same patterns of action within play types supports the contention that the representations for actions are individual- the fact that there is overlap in the actions children employ also suggests that what the child represents to him/herself is probably related to both the properties of the object 237 and what others do with that play object. Repetition of particular patterns of action in play with identified objects of interest further suggests that the children arc able to coordinate types of play in pursuit of a goal and, even when a particular goal is \"unrealistic\" (e.g. defying gravity in the effort to balance a block on an angle), to stay on task and reorganize their goals as alternative possibilities for action arc explored. That play lasts longer when the object is an identified object of interest suggests further that the child is more engaged in play, needs more time to explore and employ actions, and may even be less distractible when playing with an identified object of interest than when playing with an identified object of noninterest. Fmally, the finding that children either do not repeat actions or only repeat the same actions with their identified objects of noninterest suggests that they arc not representing as many possibilities for action to themselves with these objects and, as a result, not invested in exploration. Effect of interest on trapsfonnatiooal play behayiors. In order to evaluate the effect of interest on the possibilities children perceive for action with different play objects, this study was designed to focus on children's naturally occurring transformational play behaviors- play in which children represent an object to themselves even though the object is not really present (Renninger & Klock, 1986). Thus, the child who picks up a train, wraps it in a blanket and rocks it back and forth in his/her anns is using the play object train as a doll, even though a doll is not present. The doll is the transformational play object. The train is the (means-to-transformation) object. In this study, all instances of transformational play behaviors were first identified and then the effect of interest on these behaviors was evaluated. Findings revealed that: (a) all children ' demonstrated transformational play behaviors; (b) a wide variety of mcans-to-transfonnation play objects arc used by children; and (c) interest effects the objects children chose to represent in transformational play. Previous work on children's transformational play has suggested that what the child represents to him/herself as possibility for action depends on what the means-to-transformation object is. 238 Thus, if the child is presented with a formless doll, the child is expected to play doll or house. The process whereby the child employs one object to represent another object has been thought to initially require prototypical objects to anchor the transformation. The present findings suggest that the specific physical and functional attributes of the object the child represents to him/herself do not need to be characteristics of the means-to-transformation object in order for the means-to-transformation object to be able to support the represented object in transformational play. Instead, the child's interest (stored knowledge and value) in an object may be a sufficient anchor for the representation of that object in transformational play. Fmdings from this study indicate that there are individual differences in what children represent to themselves as possibilities for action in transformational play. Moreover, this representation appears to occur regardless of what the means-to-transformation object is.* Such a suggests that interest not only influences what the children are doing in the present sense (rocking a \"doll\"), *These findings are further corroborated by a study conducted by Krapp and Fink ( 1986) in which they report that the structure of interests, or accustomed and highly preferred person-object-relationships, remain largely unaffected as a child moves from the family into kindergarten. Although there is an initial period of exploring the novelty represented by the new setting, any change in interests can only be detected after a period of months. Changes in interests are generally subtle, involving, for example, the internal sttucture of the person-object relationship, the interaction of various person-object-relationships, or the meaning of a particular person-object-relationship for the solution of \"a developmental task.\" While Krapp and Fink found that the new setting fostered the incorporation of new elements into existing person-object-relationships and within and among different person-object-relationships, it did not alter the impact of the particular person-object-relationship, or interest, on the child's pattern of actions. 239 but that it also influences what they will do even when the identified object of interest is not present (employ doll-related actions). Effect of functional pmperties of pla,y interests on cowitiye orianization. In order to further evaluate the extent to which interest influences both what is represented to the self and its influence on subsequent activity, this study was designed to investigate the effect of the functional properties• of play objects on the way in which children engage in a set of novel tasks (Renninger & Sigel, 1986). There are several ways to classify properties of the objects with which children play. One of these is the extent to which the properties of the object lead to re-engagement in investigative play once the child is able to do more than manipulate the object in play (Renninger, 1984). Objects such as blocks, books, cars, dishes, dolls, tire trucks, puzzles, and trains generally do not involve re-engagement with investigative play. These objects arc labeled fixed because engagement with them generally involves more functional or task-based actions after the child's initial exploration of the properties of these objects. For example, children rarely go back and explore how trains hook together once they know how they hook together. Thus, trains are categorized as having properties which are fixed. On the other hand, objects or events such as dramatic play, painting, pasting, playdough, and water, encourage re-engagement in investigative play because the properties of these objects are condusive to manipulation. These objects are labeled fluid because engagement with them is just as • Rather than using Gibson's (1979) term \"affordances\" which would suggest that the play object itself projects possibilities for action, the term functional properties is used to refer to the features of the play object which the child represents to him/herself. It is thought that the functional properties of play objects are a kind of shared knowledge about the affordances of these play objects and will vary by cultural context 240 likely to involve investigative play behaviors as it is to involve functional, transformational, or operational play behaviors. For example, children often switch back and forth from squeezing playdough between their fingers to building something such as a castle with the playdough. Thus, playdough is categorized as having properties which are ~uid. Fmdings from previous work on children's interests indicate that: (a) children generally are interested in only 2-3 out of 16 discrete play object areas in their nusery school. (b) The 2-3 play objects identified as interests for one child are not the same 2-3 areas of interest for the next child. (c) The 2-3 objects in which a child is interested can be categorized as either fixed or fluid (Renninger, 1984). Thus, a child who has an identified interest in playdough, is likely also to have an identified interest in say painting-both playdough and painting are objects with properties which often lead to re-engagement in investigative play. On the other hand, a child who is interested in trains may also be interested in trucks. Both of these objects have properties which are fixed. By definition then, a child's identified interests reflect the child's prior history with these objects, their value for them, as well as the attributions for these objects which distinguish them from the other objects in the nursery school classroom. Given the strength of interest as a subject characteristic and the finding that the properties of children's play interests can be labeled either fixed or fluid, it might be expected that the intem:lation of subject characteristics and object properties effect the underlying basis of cognitive organbation in young children. To evaluate the effect of the pioperties of interest objects on cognitive structure, children were videotaped in free play in their nursery school class and participated in experimental task sessions with a set of novel tasks. These tasks consist of 6 sets of brightly colored wooden pieces which vary in form but are neutral in content. Three of the sets can fit together much as a puzzle does and three of the sets are more difficult to fit together. Children are introduced to the tasks as a set of pieces which they can use to make anything they would like and their performance with the tasks was evaluated independently with respect to (a) patterns of organization in the child's approach to 241 the tasks; (b) the process of task completion; as well as ( c) the characteristics of the finished product Performance of the children whose identified interests had properties which were fixed reveal: (a) more reflective behaviors on tasks which did not have pieces which fit together than on those tasks which did fit together; (b) repetition of both label and product on performance across trials of tasks in general and even more repetition on tasks in which the pieces could fit together than on the tasks where the pieces did not fit together; (c) a relation between the product and its label on the tasks which could fit together, and (d) products which either were limited to the manifest cues of the tasks or evidenced no connection to the label which the child assigned it In contrast, the performance of the children with interests in objects whose properties were identified as fluid reveal: (a) more reflective behaviors on tasks in which the edges do not fit together, (b) more repetition in the use of labels overall and labels which were narrative (Th1:15, rather than simply identifying the arrangement of pieces as, say, a door, the child would describe that it was a door for a giant); (c) more repetition of the same labels for tasks which could fit together; and (d) on tasks in which the pieces could fit together, a relation between the product and its label Findings from this study of the effect of the functional properties of children's play interests on their cognitive organization suggest that while reflective behaviors of the young child are more apparent on the tasks in which pieces fit together, there are some important differences in the ways in which children organize themselves with repect to both the process of task completion and the completed product Specifically, childien whose play interests are identified as having fixed properties appear to be most constrained on tasks where pieces can fit together. They are less fluent with respect to labeling and product and they have difficulty moving beyond the manifest cues-- the color or shape of the pieces. Whereas, childien whose play interests are identified as having fluid properties appear to be less attentive to whether the pieces fit together, are narrative in 242 their reponses about their products and arc fluent in their use of new labels and products across trials of each task. One way to understand differences in childicn's actions with objects is to think about these differences as reflecting children's representational competence (Le. the ability to transform objects by attributing meaning to them). From this perspective, the children's attributions on the tasks are in part constrained by the physical properties of the objects with which they generally engage in free play and they arc partly constrained by the kinds of actions or challenges which children can and do select for themselves in their play with these objects. Thus what children bring to activity is informed at least in part by their representations of the properties of the object for which they are identified as having an interest. Effect of interest on child:child-object relationships. The studies described previously provide a strong argument for differences in what the child represents to him/herself as a function· of his/her identified object of interest. However, the others in the class who arc also moving between and engaging with different play objects with their respective responses to their ideas about possibilities for action with these objects arc also an important part of the child-interest object relationship. (For further discussion of social influences on children's interests, see Renninger 1988.) The effect of both interest and affiliation on children's play behaviors was studied through evalaution of children's naturally occuning sustained interactions (those involving at least three relational exchanges) around play objects (Renninger & Morgan, 1986). The tapes of children in free play were independently coded three ti.mes. First, the tapes were coded to identify objects of interest and noninterest for each child. Second, the tapes were coded to identify interactions among dyads and then these interactions were identified as synchronous or asynchronous based on the directing, rejecting, and following behaviors of each child in the interaction. Third, these tapes were coded to identify the affiliative behaviors (Blicharski & Strayer, 1985) for each child with every other child in the class. 243 Findings from this study which specifically relate to the effect of interest on sustained interaction around objects include: (a) Children's sustained interactions occur most frequently around objects of interest for one but not both children. (b) Children's sustained interactions around a play object identified as an interest of one child, but not the other child are most likely to be asynchronous. ( c) In asynchronous interactions around objects identified as being of interest for one but not both childlen, the child for whom the play object is an interest is more likely to initially direct action, direct actions throughout the interaction, and use nonverbal rather than verbal directives. These findings indicate that a distinction between play with identified objects of interest and noninterest and this influences their engagement with others. Since sustained interactions occurred more frequently around objects of interest to one dyad member, there were significantly fewer interactions between dyads when the object of play was of interest to either bOth or to neither of the childlen. This finding suggests that the identified object of interest exerts a powerful influence on the children's play. Presumably when an object is of interest to the child, the child has a clear idea about how the activity could and should unfold. As such it is not surprising that these interactions are usually as}rnchronous, involving more dilccting and rejecting behaviors on the part of the child for whom the object is an identified interest. What is not so obvious, perhaps, is the finding that there are fewer sustained interactions when the object is an identified interest for both of the children. However, it seems reasonable to assume that the reason there were so few of these interactions is directly linked to the strength of the child's ideas about the possibilities for action. The strength of their ideas probably aborted potential interactions before they could be classified as such. Similarly, there might have been more instances of sustained interactions around objects not of interest to either of the children if the children had had more of a sense of the possibilities for acting with those objects. That the interactions which did get identified were usually asynchronous, and as such had more directing 244 and rejecting behaviors, suggests that the\"other\" child in these interactions, the child for whom the object is not an interest, was willing to stick out the interaction because either the object and/or the other involved were attractions, and as such, potential interests. Findings from this study suggest that what the child represents to him/herself as potential action with objects of interest does influence how and perhaps with whom they engage in interaction. Further study is necessary to determine how these findings might be qualified as the children develop and have more experience with both \"their\" objects and others. In what ways mi&ht individual interem make a difference? At this time, findings from research on individual interests indicate that they do make a difference. In particular, individual interests were found to effect: attention and memory for tasks, structure and variation of actions with play objects, representation of play objects, performance on novel tasks, and sustained interaction with a peer ~und a play object. Thus, individual interests can be said to affect what children represent to themselves about the possibilities for action with an object/task, and the way in which tasks arc both undertaken and completed. That all children in the studies could be identified as having an intcrest(s) and that they all performed similarly with respect to that item of ipterest, suggests more specifically that attention to individual interests may make a difference in children's learning. Attention to individual interests could influence how childrcn accommodate to formal schooling; how children interpret the expectations of and complete the tasks they arc assigned; and how teachers organize their teaching. Tasks typical of formal schooling generally require that children reconstruct some preset question by themselves. The only task in the nursery school environment (at least the one used for these studies) which parallels this kind of task demand is the puzzle. Playdough, trains, and dolls, for example, may each have more typical kinds of actions associated with them, but there is no preset expectation about how these \"tasks\" will be completed. With the exception of puzzles, the kinds of interests children evidence in nursery school do not appear to map directly onto school 245 tasks. Thus, only some children will have interests in domains with properties which correspond to the actions required by the preset tasks characteristic of formal schooling. Children with less interest in these domains may either not know how/or are not be ready to delve into the complexities of these domains and may need help to develop the requisite patterns of actions in order to succeed, since their own interests have involved them in other kinds of questions, challenges, and goals. Just as properties of the identified interests of the children influenced their performance on fit and nonfit tasks (Renninger & Sigel, 1986), so it is expected that the properties of the identified interests of children may well influence the kinds of questions, challenge setting, and products they produce on more formal school tasks. One implication of these findings is that more attention might be paid to the range of tasks which are generally available in the nursery school environment. However, taken together with the finding· that young children are flexible as one another in their actions with play objects for which they have been identified as having an interest, differences between the range of tasks available to children in nursery and more formal school classrooms imply that the performance differences identifiable in any formal classroom setting may be more directly related to the types of tasks with which individual children arc presented and the way in which these tasks arc presented than has previously been understood. Findings from the studies reviewed imply that children's interests influence the kinds of questions they come to ask, the kinds of challenges they set for themselves, and when they consider goals met. For example, playdough presents the possibility of re-engaging in investigative play whereas generally trains do not. Similarly, playdough presents the possibility of social exchange whereas generally trains do not (In this classroom, playdough occurs at a table with four chairs where children congregate, punch the playdough and chat. In contrast, there arc only two trains, these arc housed on a shelf and when being used they can be driven any place in the room, so the likelihood of being involved with another around trains is much less than it is with 246 playdough.); and playdough generally does not lead to transformational play behaviors whereas trains do (e.g. children have been observed representing trains to themselves with chairs in a line, blocks, boats, etc.) (Renninger, 1984). The questions children ask are at least in part related to the possibilities for play supponed by their identified object of interest. Since re-engaging in investigative play with the train is highly unlikely, a lot of the revising and restructuring of action possible with playdough may not occur if children are predominantly involved with trains. Lack of experience with such revision, at least with respect to play with trains, suggests that revision of actions will not be a part of children's question asking unless it is a potentially characteristic action/functional property of their play with another play object. Similarly, the kinds of challenges childrcn set for themselves are influenced by the functional properties of the objects with which they play, and so is their sense of what is considered a completed product. It appears that thckinds of questions, challenges, and goals with which children become involved are directly related to the kinds of objects, and more specifically their interest for the objects, with which they play. Fmdings from a project currently being conducted serve to further underscore the imponance of what students represent to themselves as \"the task,\" reganllcss of whether they are aware of how they are representing the task to themselves or not. Since, children at three-years-of age are not able to talk about what they understand a task's demands to be, or what their rationale for action is, the focus of this project is the effect of context on fifth and sixth graders' reading comprehension and mathematical word problem solving. Preliminary findings from this work suggest that students arc more competent in their passage recalVproblem solving, regardless of the domain, if the context of the passage/word problem is one of their identified items of interest. Findings from this study also suggest that tasks in certain domains (e.g. reading) arc usually evaluated according to interest in their content as more or less interesting and the students who were protocoled and interviewed discussed their performance in these terms; whereas tasks in other domains (e.g. word 247 problems in mathematics) are not associated with interesting content and student explanations of strategy use for these tasks generally focused on structural qualities and not the context used. That student performance varies as a function of their interest for the context in which the task is embedded, suggests that interest may affect the accessibility of tasks for students and actually lead the students to approach the same task structures as radically different problems.* These data also suggest that the ability to disembed the problem structure from the context of the problem may be a characteristic of students with more effective problem solving strategies; however, the effect of interest on students' problem performance generally, and for less effective problem solvers in particular, suggests that interest may provide a means through which inexperienced problem solvers can engage problems successfully. Such findings would support Dewey's (1913) contention that interest affects effort and is an effective way to introduce new material to students. In fact, from a develqjmcntal perspective, such findings might be interpreted as suggesting that when students have ineffective strategies for solving a particular kind of problem they will show improvement if they are encouraged to first learn to solve that type of problem nested in interesting contexts. Then, as they are able to master these problems they can move on to solve similar problems in less interesting contexts. Thus the students would be developing strategies for particular problem types, in addition to developing strategies which would allow them to overcome the influence of interest on their performance. They also would be in the process of developing an ability to focus on the problem/task intended by the teacher; and they would also become more aware of the possibilities for acting on problems of this type. Finally, when students were able to transcend the use of strategies in a particular task and were able to apply thcSe to a class of tasks then the \"inexperienced problem solver\" would have developed into an effective problem solver-- at *Here, problem is used in the broad sense to refer to task structure and requirements for task solution in both reading comprehension and mathematics. 248 least with respect to that preset task.* Facilitating the generalization of strategy use requires that the preset questions with which students have difficulty be broken into chunks that they are ready to handle.** Presumably the teacher as expert is in a position to adjust instruction to meet the needs of students. This requires that the teacher disengage from his/her interests (own way of organizing material), observe how it is that students are interpreting and completing their problems, and then help them acquire the necessary strategies to master the question as it was originally intended. This suggests that teachers should be aware that their own organization of the content they teach probably affects the kinds of questions they ask and the challenges they set for themselves in teaching. Thus the organization which the teacher may need to effect would be a response to what students appear to understand of the task. This may involve adjustment of the task and/or work with students around understanding .the task as presented (c.f. Feurstein, 1980; Sigel, 1982; Rogoff and Gardner, 1984). Similar to the adjustmellt of tasks necessary for student learning, collaborative work with a colleague requires a process of negotiating which needs to occur if the project is truly collaborative. *In subsequent work with both fifth and sixth graders and young children, it would be useful to employ a microgenetic design which permitted evaluation of the degree to which this sequence for working with students was universal and such a developmental approach resulted in the child's generalizing of strategies learned in this manner to other problem solving situations. **Simply breaking all material into chunks may be a generally effective teaching strategy; however, for students who know the information it can be boring and for students who are struggling, normalized chunks could be too discrepant. The plea here is for adjusting questions to match the pattern of actions characteristic of individual students' interests and to introduce alternative possibilities to these patterns as it is necessary to enable students to further develop their strategies for problem solving. 249 This negotiation involves attempts by both participants to understand the questions of the other. Findings from the study on the effect of interest on child-child-object relationships suggest that differences probably will arise between collaborators in the process of completing a task which reflect differences in what they identify as the task and the possibilities for completing it Assuming that each has similar knowledge of the task, the extent to which they each value it (because they are learning, being challenged, or simply want the task completed) will probably influence how much directing and rejecting in the ielationship they are willing to tolerate. Even if they both could be identified as having an interest in the project, representation of the probem on which they are jointly working is not going to be exactly the same for each of them. Rather, the individual quality of their intercst(s) stems from the range of experiences with objects, events, or ideas not necessarily piesent in this project. However, even on a project for which they are not identified as having a particular interest, their interests would probably infl.uence their ideas and the course of their actions. Just as a developmental approach to teaching involves figuring out how students represent information to themselves and adjusting problems so that they are appropriate for the students, so too work with a colleague involves understanding his/her questions and building on these such that the individual differences in each of yo1D' interests strengthens the product of the collaboration. The studies reported here indicated that investigating and attending to individual interests may make a difference in generating strategies for effective collaboration, particularly the collaboration which is teaching. 250 Re(ercnces Baldwin, J.M. (1911). Tuou&ht and thin&s: A study of the dcyelQpment and meanin& of thou&ht, m. New York: Macmillan. Brown, A.L. & Campione, J. C. (1972). Recognition memory for perceptually similar pictures in preschool children. Journal of Experimental Psycholoa, ~ 55-62. Brown, A.L. &Scott, M.S. (1971). Recognition memory for pictures in preschool children. Journal of Em;riroental Child Psycholoa, 11. 401-412. Blicharski, T. & Strayer, F.F. (1985). Procedures and Taxonomy for Observation of Preschool Social Ecology. Unpublished coding manual. Dewey, J. (1913). Interest and effon in c;ducation. New York: Houghton·Miftlin. Eckblad, G. (1981). Scheme thcm:y: A conceptual framework for comye-motiyational processes. New York: Academic Press. Feurstein, R. (1980). Instrumental enrichment An intervention pmmm for co&Jlitiyc mcx:lifiability. Baltimore: University Parle Press. Fryer, D. (1931). The mea.surement of interests in relation to human adjusnwmt. New York: Holt Gerson, R. & Damon, W. (1978). Olildren's understanding and moral conduct. New Directions for Child Deyclopment.1. Gibson, J.J. (1979). The ecolo&icaJ ap,pmach to yisuaJ perception. Boston: Houghton Mifflin. Izard, C.E. (1977). Human emotions. New York: Plenum. James, W. (1890). The principles ofpsycholoa. London: Macmillan. Krapp, A. & Fink, B. (1986). The transition from family to lcinderprten and its impact on person-objr.ct-relationships. Paper presented at the meeting of the International Association for the Study of People and their Physical Sourroundings. Haifa, Israel. Perlmutter, M. & Myers, N.A. (1979). Development of recall in 2- to 4-year-old children. Developmental Psycholoa, ll. 73-83. 251 Piaget, J. ( 1968). Six psycholo&ical Studies, New York: Vintage Books. Renninger, K.A. (1988). Individual patterns in children's play interests. In L.T. Winegar (Ed.), Social interaction and the develo.pment of social understandin&. Norwood, NJ: Ablex. Renninger, K.A. (1984). Object-child relations: Implications for both learning and teaching. Children's Enyironments Ouarterly, 1(2), 3-6. Renninger, K.A. & Klock, B.L. (1986). Effect of indiyidual patterns of interest on traosfonnational play of youn& children. Paper presented at the meeting of the International Conference on Infancy Studies, Beverly Hills, CA. Renninger, K.A.& Morgan, A.S. (1986). Other and pll,Y object as yalue in social understandin&. Paper presented at the meeting of the Jean Piaget Society, Philadelphia, PA. Renninger, K.A. & Sigel, LE. (1986). Effect of functional properties of play interests of cowitive or&anization of youn& children. Paper presented at the meeting of the Conference on Human Development, Nashville, 1N. Renninger, K.A. & Wozniak, R.H. (1985). Effect of interests on attentional shift, recognition, and recall in young children. Dcyelopmental Psycholoc. 21. 624-632. Rogoff, B.& Gardner, W.P. (1984). Adult guidance of cognitive development. In B. Rogoff & J. Lave (Eds.), Eyezyday co&nition: Its <ievelo.pment in social context. Cambridge, MA: Harvard University Press. Sigel, I.E. (1982). The relationship between parents' distancing strategies and the child's cognitive behavior. In L.M. Laosa & I.E. Sigel (Eds.), Families as leamin& enyiropments for children, New York: Plenum. Vygotsky, L. (1966). Play and its role in the mental development of the child Soyjet Psycboloc . .ll. 62-76. Werner, H. (1978). Process and achievement: A basic problem of education and developmental psychology. In S.S. Barten & M.B. Franklin (Eds.), Deyclo.pmcntal processes: Heinz 252 Werner's selected writin~s. Yol. I: General theoxy and perce.prual eXPCfience. New York: International Universities Press, Inc. Originally published in 1937. White, R. (1959). Motivation reconsidered: The concept of competence. Psycholodcal Reyiew, ~ 297-333. 253 ",
    "Link": "https://core.ac.uk/download/73339807.pdf"
}