{
    "Title": "Regulating Human Gene Therapy",
    "Authors": "Areen, Judith C.",
    "Year": "No year available",
    "Abstract": "Scientific developments have moved the public debate on genetic engineering to the issue of human gene therapy.\nBecause so many important societal values must be weighed in deciding which, if any, of the first protocols for human gene therapy should be approved, it is obviously important to look closely at who will make the decision to approve or disapprove the protocols",
    "Keywords": "No keywords available",
    "Publisher": "Scholarship @ GEORGETOWN LAW",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Georgetown University Law Center Scholarship @ GEORGETOWN LAW 1985 Regulating Human Gene Therapy Judith C. Areen Georgetown University Law Center, areen@law.georgetown.edu   This paper can be downloaded free of charge from: https://scholarship.law.georgetown.edu/facpub/1437  This open-access article is brought to you by the Georgetown Law Library. Posted with permission of the author. Follow this and additional works at: https://scholarship.law.georgetown.edu/facpub  Part of the Health Law and Policy Commons West Virginia Law ReviewVolume 88 Fall 1985 Number 2REGULATING HUMAN GENE THERAPYtJUDITH AREEN*I. SETTING THE STAGEThe question became whether A-T and G-C base pairs would easily fit thebackbone configuration devised during the previous two weeks. At first glance thislooked like a good bet, since I had left free in the center a large vacant area forthe bases. However we both knew that we would not be home until a completemodel was built in which all the stereochemical contacts were satisfactory. Therewas also the obvious fact that the implications of its existence were far too impor-tant to risk crying wolf. Thus I felt slightly queasy when at lunch Francis wingedinto the Eagle [a pub near the laboratory], to tell everyone within hearing distancethat we had found the secret of life.'The \"Francis\" in question is Francis Crick, then a young scientist who hadnot yet even earned his Ph.D. The author of the excerpt is James Watson, thentwenty-four. It is England, 1953, and Watson and Crick have just uncovered thestructure of deoxyribonucleic acid (DNA)-thus inaugurating a new era in the historyof science.Watson's boastful account of the events surrounding their achievement, TheDouble Helix, combines the excitement of a good mystery with enough competi-tion to warm the heart of the most ardent capitalist. There is Linus Pauling, withinweeks or days of making the discovery himself, in hot pursuit of the answer-andthe Nobel Prize it would eventually bring to Watson and Crick for getting therefirst. But was the excitement justified? It is true that the structure that Watsonand Crick had just decoded was related to life itself-but only to its physical struc-ture. The larger meaning of life, however-or of their discovery-was not to beuncovered so easily.f This Article is based on an address delivered at the 1985 Benedum Centennial Lecture, WestVirginia University College of Law.* Professor of Law and Associate Dean, Georgetown University Law Center; Professor of Com-munity and Family Medicine, Georgetown University Medical Center; member of the Working Groupon Human Gene Therapy of the National Institutes of Health. I was assisted in preparing this articleby a helpful suggestion made by W. French Anderson, Richard Cooper, and Leroy Walters and bythe research of Jan Montgomery and Nadine Samter.' J. WATSON, THE DOUBLE HELIX 197 (1968).WEST VIRGINIA LA W REVIEWSir Isaac Newton once observed: If I have seen further it is by standing onthe shoulders of giants. 2 The work. of Watson and Crick similarly rested on theearlier achievements of many others. The path that led to the code for DNA beganat least as far back as the mid-nineteenth century in the garden of Gregor Mendel,an obscure monk in Austria whose breeding experiments with sweet pea plants ledhim to postulate the existence of genes. In 1868, just three years after Mendelpublished his findings, Frederick Miescher identified DNA, which he termed\"nuclein.\" 4 The function of DNA was not really understood until after almosta century of work, 5 capped by the report of Watson and Crick, which revealedthe structure of DNA, thereby demonstrating how information could be transformedbetween generations. 6Each cell in the human body has a nucleus, where genetic material is stored.In essence, this material acts as a blueprint guiding the cell to perform its appropriatefunction. Each cell normally contains twenty-three pairs of chromosomes, for atotal of forty-six, with half of each pair inherited from one parent. 7 Watson andCrick determined that each chromosome is a double helix of DNA. Particularsegments of the DNA strands are more commonly termed genes.8 Each cell con-tains all the genetic blue-prints for the whole person. It is able to perform itsspecialized functions because only a portion of the genetic material (5-10%) is activeat any one time-telling it to be a liver cell or a muscle cell, etc.9The pace of scientific development in this field has moved with ever increasingI Letter to Robert Hooke, Feb. 5, 1675-76. For a delightful romp through the alleged historicorigins of the phrase see G. MERTON, ON THE SHOULDERS OF GIANTS: A SHANDEAN POSTSCRIPT (1965).Metalogicon bk. III, ch. iv (1159).CONGRESS OF THE UNITED STATES, OFFICE OF TECHNOLOGY ASSESSMENT, IMPACTS OF APPLIEDGENETICS 30 (1981) [hereinafter cited as OTA APPLIED GENETICS].M. ROGERS, BIOHAZARD 22 (1977).In 1944, Avery, McLeod, and McCarty, researchers at Rockefeller Institute, demonstratedbacterial transformation. They found that mixing DNA from a deadly strain or pneumonia bacteriathat was itself dead with a live but harmless form of bacteria was lethal when injected in rats. Resistancecontinued, however to the suggestion that DNA was the source of heredity. See M. ROGERS, supranote 4, at 36.In 1952, Alfred Hershey and Martha Chase performed a \"blender experiment\" at Cold SpringHarbor, Long Island, in which they marked phages [masses of DNA encased in a shell] with radioactiveisotopes, allowed them to infect bacteria, then spun the mixture in a blender. They found that theDNA of the phage was securely inside the bacteria, with only its protein case left behind. M. ROGERS,supra note 4, at 37.6 OTA APPLIED GENETICS, supra note 3, at 34. In what has been termed \"one of the most coystatements in the literature of science,\" Watson and Crick concluded their paper on their discovery,which was published in Nature, April, 1953, by saying, \"It has not escaped our notice that the specificpairing we have postulated suggests a possible copying mechanism for genetic material.\" M. ROGERS,supra note 4, at 38.7 PRESIDENT'S COMMISSION FOR THE STUDY OF ETHICAL PROBLEMS IN MEDICINE AND BIOMEDICALAND BEHAVIORAL RESEARCH, SPLICING LIFE 26 (1982) [hereinafter cited as SPLICING LIFE]. Sex-cells (spermand ova) or germ-line cells, as they are termed, normally contain only twenty-three chromosomes.OTA APPLIED GENETICS, supra note 3, at ix.SPLICING LIFE, supra note 7, at 29.[Vol. 88GENE THERAPYspeed. It was almost a century from Mendel to Watson and Crick, but only seven-teen years passed until the next scientific breakthrough-the discovery in 1970 ofthe first DNA-cleaving enzyme, termed a \"restriction\" enzyme.'\" These enzymes,extracted from bacteria, cut a DNA molecule at specific sequences that occur hereand there along the double helix. Thus they enable scientists to reduce a very longDNA molecule into a set of discrete fragments that can be recombined with eachother or joined with DNA from another organism to make a hybrid molecule.\"II. ACT 1: SAFETY ISSUESIn 1971, only one year after the discovery of restriction enzymes, Paul Bergannounced plans to join DNA from the SV40 human virus with another virus,and to insert this recombined DNA (rDNA) into E. coli bacteria.' 2 Cancer researcherRobert Pollack, on hearing of the Berg proposal, reported:I had a fit. SV40 is a small animal tumor virus; in tissue cultures in the lab,SV40 also transforms individual human cells, making them look very like tumorcells .... And E. coli just naturally lives in people. [Those involved] seemed tosee it as a neat academic exercise. And I said, of all stupid things, at least putit into a phage [virus] then, that doesn't grow in a bug that grows in your gut.Because what if the combination escapes from the lab; then you have [the humanvirus] replicating in step with the E. coli and a constant exposure of the cells inyour gut to the DNA of SV40. Which is a route in for the virus that never occursin nature.., and therefore something you might not be prepared to fend off.'\"Pollack called Paul Berg, who soon learned that his Stanford colleagues werealso uneasy about the risks of rDNA. Discussion of the risks spread. At the sametime, work with restriction enzymes made it possible for anyone with \"a moderatelevel of microbiologic skill [to] perform potentially hazardous genetic manipula-tions that two years earlier had not even been imaginable.\"\"' By January, 1973,one hundred researchers met at the Asilomar Conference Center on California'sMonterey peninsula to discuss the risks. By June, 1973, at the Gordon Conferencein New Hampshire, a majority of those present voted to send a letter to PhillipHandler, president of the National Academy of Sciences. The letter, published in,0 Id. at 32.\" Weinberg, The Molecules of Life, 253 Sci. AM. 48, 50, 52 (1985).12 Swazy, Sorenson & Wong, Risks and Benefits, Rights and Responsibilities: A History of theRecombinant DNA Research Controversy, 51 S. CAL. L. REv. 1019, 1021 (1978) [hereinafter cited asRisks and Benefits].At the time, genetic work has focused only on the simple bacterium Eschericola coli or E. coli,which can be \"infected\" with foreign DNA using a bacteriophage or \"phage.\" But once the focusmoves to more complex mechanisms, a bacteriophage will not work to carry the DNA to the cell.Berg turned to SV40 because he believed that a tumor virus could be used to bring DNA into a mammaliancell. M. ROGERS, supra note 4, at 43.\"1 Risks and Benefits, supra note 12, at 1021.\" M. ROGERS, supra note 4, at 52.1985]WEST VIRGINIA LA W REVIEWScience in 1973, expressed concern about the risks of creating hybrid DNAmolecules.Is In April 1974, ten individuals, including Paul Berg and James Watson,met at MIT and decided to ask for a temporary moratorium on further research. 6Their letter, also published in Science, stated in part:Some of the rDNA molecules could prove hazardous. [We propose] that untilthe potential hazards of such recombinant DNA molecules are better evaluated,or until adequate methods are developed for preventing their spread, scientiststhroughout the world join with members of this committee in voluntarily deferring[experiments that pose such risks].\"Think of it: the scientists were concerned enough about the possible risks toask for a self-imposed moratorium-an act without precedent in the history ofscience.III. ACT 2: INTRAGOVERNMENTAL BATTLES-THE FIGHT TO REGULATECongress immediately set about holding hearings, although no legislationemerged.' 8 The executive branch, by contrast, moved fairly quickly to regulate.The National Institutes of Health (NIH) in 1974, building on the discussions begunin the scientific community, established a Recombinant DNA Advisory Committee(RAC). The RAC, chaired by NIH's deputy director for science, initially was madeup entirely of scientists; it functioned more as a \"kitchen cabinet\" for NIH Direc-tor Donald S. Frederickson then as a group of outside advisors. 9In 1975 a second Asilomar conference was held. One very important productof Asilomar II was the suggestion of participants that a new safety measure couldand should be employed for some rDNA work. In their view, safety could be assuredfor some rDNA experiementation by using not only physical containment, a safetymeasure already widely used in microbiology laboratories, but also \"biological con-tainment\" by which they meant limiting either the infectivity of the vector (theI Singer & Soil, Guidelines for DNA Hybrid Molecules, 181 Sci. 1114 (1973) (letter).16 J. AREEN, P. KING, S. GOLDBERG &A. CAPRON, LAW, SCIENCE, AND MEDICINE 15 (1984)[hereinafter cited as J. AREEN].185 ScI. 303 (1974) (letter).\" For a discussion of legislation passed in 1985 over a veto by President Reagan, see text atnote 90 infra.'1 J. AREEN, supra note 16, at 46. The membership of RAC was enlarged and broadened in1978 by HEW Secretary Califano. Mr. Califano later reported:[W]e sparked [the scientists'] spirited resistance when we added a number of ethicists, clergy,lawyers and lay persons to the committee. Fredrickson, however, saw the move as enrichingthe advisory group and strengthening a potential consensus on DNA research. Eventuallymany of the scientists who originally opposed the action appreciated some of the benefitsof broad public participation.CALIFANO, GOVERNING AMERICA: AN INSIDER'S REPORT FROM THE WHITE HOUSE AND THE CABINET 203(1981).[Vol. 88GENE THERAPYagent that transfers a piece of DNA from one host to another), or limiting itsdissemination and survival in the environment. The idea of biological containmentwas soon to be adopted by the RAC.20At about the same time, new research suggesting that DNA recombinantsoccurred more frequently in nature than had previously been recognized put torest some of the early fears of opening a genetic Pandora's box. 2' The influenceof these new developments was reflected in 1976 when Dr. Frederickson, with theadvice and counsel of the RAC, issued \"Guidelines for Research Involving Recom-binant DNA Molecules.\" ' 22 These regulations ran to thirty-two triple-column printedpages in the Federal Register. Revised periodically since, most recently in 1984,the guidelines establish the RAC of NIH as the primary point of regulatory over-sight in the federal government. Although in theory the guidelines apply only torDNA research that is conducted or sponsored by an institution that receives sup-port for such research from NIH, in practice most private research protocols havebeen submitted to the RAC for 'clearance.23The first judicial test of these new guidelines was also the first time the thirdbranch of government looked at rDNA. In Mack v. Califano,24 a resident ofFrederick, Maryland, sought a temporary restraining order to stop any rDNAexperiments from being conducted at nearby Ft. Detrick. The district court deniedthe request, noting that the defendants were in full compliance with the NIHguidelines. The court added:In the planned experiment a derivative of E. coli K-12, which has been specificallydesigned to \"self-destruct,\" will be employed. E. coli K-12 is unable to colonize10 Guidelines for Research Involving Recombinant DNA Molecules, 41 Fed. Reg. 27,902 (1976),(revised 49 Fed. Reg. 46,266 (1984)) [hereinafter cited as rDNA Regulations].2, RISKS AND BENEFITs, supra note 12, at 1070.22 rDNA Regulations, supra note 20.\" A notable exception is the proposal by Advanced Genetic Sciences, Inc. to field test geneticallymodified bacteria intended to protect crops against I ost damage. The experiment was recommendedfor approval by the RAC in June, 1984, but the dir.cmor of NIH withheld his approval to avoid apply-ing different standards to private companies as opposed to academic researchers. (A previous injunc-tion prevented NIH from approving an almost identical experiment proposed by Stephen Landow atthe University of California. See infra note 26 and accompanying text.) Advanced Genetic Sciencestherefore withdrew its application for the RAC and submitted it to EPA. 316 NATURE 183 (1985). OnNovember 15, 1985, EPA approved the experiment against the advice of Martin Alexander of CornellUniversity, the chairman of EPA's own Scientific advisory panel Wash. Post, Nov. 15, 1985 at A2, col. 5.In the absence of federal legislation, New York and a number of locations have passed legislationmaking the NIH guidelines mandatory. These localities are Amherst, Massachusetts; Berkeley,California; Boston, Massachusetts; Cambridge, Massachusetts; Emeryville, California; Newton,Massachusetts; Princeton, New Jersey; Somerville, Massachusetts; and Waltham, Massachusetts.Hearings on The Potential Environmental Consequences of Genetic Engineering, Subcommittee on theToxic Substances and Environmental Oversight of the Senate Committee on Environment and PublicWorks, 98th Cong., 2d. Sess. 40 (Sept. 25, 1984) (statement by Bernard Talbot, Acting Director, Na-tional Institute of Allergy and Infectious Diseases of the National Institutes of Health).' Mack v. Califano, 447 F. Supp. 668 (D.D.C. 1978).1985]WEST VIRGINIA LA W REVIEWin the human intestinal tract and causes no known human or animal disease. ThisK-12 host-vector system will not survive passage through the intestinal tract ofanimals and will \"die\" because of its dependency on chemicals not found in nature.Defendants further point out that the complete experiment will be conductedin P4 physical containment laboratories which have been shown to contain microbespresenting a known and demonstrable hazard to man.\"Biological as well as physical containment was now recognized in case law.At the same time, the court's decision implicitly gave strong support to the powerof the RAC by demonstrating that compliance with the NIH guidelines would helpto protect future rDNA experiments from legal challenge.Seven years later, in Foundation on Economic Trends v. Heckler,\"6 the UnitedStates Court of Appeals for the District of Columbia Circuit was also asked tostop an rDNA experiment, this time an experiment involving the deliberate releaseof genetically engineered organisms into the air. The experiment in question, tobe conducted by Drs. Nicholas Panopoulos and Steven Lindow, two scientists atthe University of California, Berkeley, was designed to test the possibility ofincreasing the frost resistance of certain crops by applying genetically alteredbacteria. 7 The RAC had approved the experiment in question without objection.\"The minutes of the RAC meeting revealed only one sentence on the issue of disper-sion, however, and that came almost verbatim from the proposal:Although some movement of bacteria toward sites near treatment locationsby insect or aerial transport is possible, the numbers of viable cells transportedhas been shown to be very small; and these cells are subject to biological and physicalprocesses limiting survival. \"9The court observed, \"Remarkably ... RAC completely failed to consider thepossible environmental impact from dispersion of genetically altered bacteria,however small the number and however subject to procedures limiting survival.\" 30The court therefore halted the experiment until an adequate environmental assess-ment was completed.Factual differences in the two cases may explain the difference in outcome.Deliberate release clearly raises safety issues different from those presented byexperimentation that is intended to be confined to a laboratory setting. In Mack,moreover, unlike Foundation on Economic Trends, an environmental impact state-\" Id. at 669.26 Foundation on Economic Trends v. Heckler, 756 F.2d 143 (D.C. Cir. 1985). A federal districtcourt had enjoined the experiments on May 18, 1984 at the request of the plaintiffs. The Court ofAppeals was viewing that decision.Id. at 152., Id. at 153. This vote occurred after the proposal was modified and resubmitted. At an earliermeeting, the RAC vote was seven in favor, five opposed and two abstentions. Id.29 Id.30 Id.[Vol. 88GENE THERAPYment was completed prior to the court's decision. Nonetheless, the strong impres-sion remains that the willingness of the judiciary to defer to the expertise of theRAC had somewhat diminished, at least in the absence of evidence that relevantrisk factors were fully considered by the RAC.IV. ACT 3: HuMAN SUBJECTSScientific developments once again have moved the public debate on geneticengineering to a new issue. The concern now is human gene therapy. Within thenext year or so, it is probable that protocols will be submitted to NIH to test theuse of genetic engineering techniques to treat patients suffering from genetic defects.3\"It is also likely that the subjects of this first use of genetic engineering in humanswill be children; in this instance, children suffering from presently incurable condi-tions caused by a deficiency in a single gene. The most likely gene to be used inthe first experiments on human gene therapy is adenosine deaminase (ADA), theabsence of which results in severe combined immunodeficiency disease in whichchildren have a greatly weakened resistance to infection and cannot survive theusual childhood diseases.3\"A. HHS RegulationsThe shift in scientific focus means that a separate set of federal regulatorystandards are relevant-the regulations of the United States Department of Healthand Human Services (HHS) that protect human subjects of research conductedin any institution receiving HHS funds.3 3 Again, a brief review of the pertinenthistory is in order both to understand why this separate set of regulations cameinto being in the first place and to understand why they are now relevant.1. Historical FoundationsFor the most part, the federal government does not attempt to regulate therelationship between a physician and his or her patient. Requirements are imposedon drugs and medical devices before they can be marketed,34 but as if to underscore\" See Anderson, Prospects for Human Gene Therapy, 226 SCIENcE 401 (1984) [hereinafter citedas Anderson].\" Interview with W. French Anderson, September 23, 1985. Other possible genes to be used inthe first experiments are: hypoxanthine-guanine phosphoribosyl transferase (HPRT), the absence ofwhich results in Lesch-Nyhan disease (a severe neurological disorder that includes uncontrolled self-mutilation); and purine nucleoside phosphorylase (PNP), the absence of which results in another formof severe immunodeficiency disease. Anderson, Human Gene Therapy: Scientific and Ethical Considera-tions, 10 J. MED. & PmL. 276 (1985).\" 45 C.F.R. § 46 (1983).', See generally 21 C.F.R. § 314 (1985).1985]WEST VIRGINIA LA W REVIEWthe traditional deference shown to the medical profession, once the Food and DrugAdministration has approved a drug for one purpose, federal law does not prohibita licensed physician from prescribing that drug for another purpose.\"The deference shown to the medical profession is in part a reflection of prin-ciples of federalism: licensure and discipline of physicians are by tradition a matterof state rather than federal responsibility. But even at the state level, relativelylittle intrusion on the doctor-patient relationship occurs.How, then, can one explain the federal regulations designed to protect patientsor other human beings who are the subject of medical experimentation? The answerlies in large part in the revelations at Nuremburg about the activities of the ThirdReich. In United States v. Karl Brandt,3 also known as \"The Medical Case,\" twentyphysicians, including Karl Brandt, Hitler's personal physician, were tried for crimesthat the defendants claimed were committed in the name of medical or scientificresearch. The court, composed of three judges from the United States, determinedthat:In every single instance appearing in the record, subjects were used who didnot consent to the experiments, indeed, as to some of the experiments, it is noteven contended by the defendants that the subjects occupied the status of volunteers.In no case was the experimental subject at liberty of his own free choice to withdrawfrom any experiment. In many cases experiments were performed by unqualifiedpersons, were conducted at random for no adequate scientific reason, and underrevolting physical conditions. All of the experiments were conducted with unnecessarysuffering and injury and but very little, if any precautions were taken to protector safeguard the human subjects from the possibility of injury, disability, or death.\"Indeed, the revelations of Nuremberg were so shocking, the conduct revealedso inhumane, that one is tempted to dismiss them as an aberration best buriedin the past. But other, more recent examples of documented abuses in medicalexperimentation make it impossible to dismiss Nuremberg so easily. Two in par-ticular stand out. First, in 1966, Dr. Henry Beecher, the Henry Isaiah Dorr Pro-fessor of Research at Harvard University, published a study in the New EnglandJournal of Medicine, in which he documented study after study that had beenpublished in professional journals and that violated the very principles of ethicalresearch enunciated at Nuremberg.2For instance, consider example eighteen in Beecher's study:Melanoma [a cancerous tumor] was transplanted from a daughter to hervolunteering and informed mother, \"in the hope of gaining a little better understand-ing of cancer immunity and in the hope that the production of tumor antibodies3$ 21 C.F.R. § 1306.03 (1985).\"' Trials of War Criminals Before the Nuremberg Military Tribunals Under Control Council LawNo. 10 (1949), reprinted in part in J. AREEN, supra note 16, at 907.j. AREEN, supra note 16, at 926.\" Beecher, Ethics and Clinical Research, 274 N. ENG. J. MED. 1354 (1966).[Vol. 88GENE THERAPYmight be helpful in the treatment of the cancer patient.\" Since the daughter diedon the day after the transplantation of the tumor into her mother, the hope expressedseems to have been more theoretical than practical, and the daughter's conditionwas described as \"terminal\" at the time the mother volunteered to be a recipient.The primary implant was widely excised on the twenty-fourth day after it had beenplaced in the mother. She died from metatastic melanoma on the four hundredand fifty-first day after transplantation. The evidence that this patient died of dif-fuse melanoma that metastasized from a small piece of transplanted tumor wasconsidered conclusive. 9Second, in 1972, the national press broke the story of an experiment first begunby the United States Public Health Service in Tuskeegee, Alabama, in 1932, todetermine the natural course of untreated syphilis.\"' The subjects were 400 poor,black men who were never informed that they were subjects in an experiment-oreven that they had syphilis. The \"experiment\" continued long after effective treat-ment was available. Indeed, the Public Health Service warned the Alabama HealthDepartment not to treat the test subjects when they took a mobile VD unit intoTuskeegee in the early 1940s.4 1 As late as 1969, officials of the Centers for DiseaseControl decided to let the \"experiment\" continue still further.4 2 It stopped onlywhen the headlines appeared.Nuremberg could no longer be classed as a single aberration. The fact thatthe victims of Tuskeegee were members of a minority group only strengthened theparallel. The time had come to establish national standards for protecting humansubjects of research. As with rDNA, when Congress failed to act, the task of design-ing the standards fell by default to the executive branch.4 32. Role of IRB'sHHS, an executive agency, was responsible for developing regulations dealingwith such matters. The heart of the HHS regulations is a new entity: the Institu-tional Review Board (IRB). The regulations provide that each IRB must have atleast five members, who represent more than one profession and both genders.4 4One is to be a lawyer, ethicist, or member of the clergy, and at least one mustcome from outside the institution sponsoring the research.43 Each institution is freeto establish its own IRB so long as the listed constraints are honored.Id. at 1356., See generally, J. AREEN, supra note 16, at 937-50; J. JONES, BAD BLOOD: THE TUSKEEGEE SYPHILISEXPERIMENT (1981).\" Brandt, Racism and Research: The Case of the Tuskeegee Syphilis Study, 8 HASTINGS CTR.REP. 21 (1978).42 Id.\"' There is some indication that NIH may have acted to pre-empt Congressional legislation. SeeJ. AREEN, supra 16, at 959.\" 45 C.F.R. § 46.107 (1983).\" Id.19851WEST VIRGINIA LA W REVIEWAlthough the selection process may at first smack of the fox guarding the chickencoop, my own experience as a member of an IRB has dispelled most of my initialskepticism. The very process of presenting a proposal protocol for research involv-ing human subjects to a committee assembled for the sole purpose of avoidingundue risk or harm to those subjects has done more to raise the consciousnessof both researchers and IRB members about these issues than I would haveanticipated. An unexpected benefit I have also observed is that the scientific qual-ity of some protocols has been improved through the same process of presentation,explanation, and discussion with a group involving other experienced scientists andphysicians.\"3. Problems in Application of HHS RegulationsThe HHS regulations formally direct the IRB to approve protocols only if \"risksto subjects are minimized ... by using procedures which are consistent with soundresearch design and which do not unnecessarily expose the subject to risk\" andif \"risks to subjects are reasonable in relation to anticipated benefits, if any, tosubjects.\"\" 7 Unfortunately, no guidance is given on how to apply these principlesto experiments on the frontiers of science such as human gene therapy.The difficulty of deciding whether to approve a proposed experiment involvinghuman subjects is compounded when the proposed subjects are children. Reflect-ing the traditional concern our society has felt for children, separate regulationshave been issued to govern such research.\"8 In addition to meeting the requirementsimposed on research involving adult human subjects, these separate regulationsspecify that no more than minimal risk may be imposed on child-subjects unlessthe research \"holds out the prospect of direct benefit to the individual subjects.\" 9\" See generally Nat'l Comm'n for the Protection of Human Subjects, Institutional Review Boards:Report and Recommendations (1978).45 C.F.R. § 46.111(a)(1) & (a)(2) (1983).,' 48 Fed. Reg. 9814 (1983).,9 45 C.F.R. § 46.405. There are two other sections of the regulations that may be relevant. Sec-tion 46.406 addresses research involving \"greater than minimal risk,\" but only if the risk representsa \"minor\" increase over minimal risk. The section permits such research if it is \"likely to yield generallyable knowledge about the subject's disorder or condition.\" Section 46.407 applies to research not coveredby other sections. Thus, it would apply to research involving greater than minimal risk where the riskmay not be justified by the anticipated benefit to the subjects. Research covered by section 46.407can proceed only if:(a) The IRB finds that the research presents a reasonable opportunity to further the under-standing, prevention, or alleviation of a serious problem affecting the health or welfare ofchildren; and(b) The Secretary, after consultation with a panel of experts in pertinent disciplines (for example:science, medicine, education, ethics, law) [determines](1) The research presents a reasonable opportunity to further the understanding,prevention, or alleviation of a serious problem affecting the health or welfare of children....[Vol. 88GENE THERAPYUnfortunately, the regulations do not clarify how likely the prospect of direct benefitmust be to meet the standard.Consider the children presently suffering from severe combined immunodefi-ciency disease (SCID). One of the best known victims was David, the boy wholived for twelve years in a germ-free bubble at the Baylor College of Medicine inHouston. Because of the disease, David's immune system failed to develop, leavinghim vulnerable to common and normally harmless bacteria or viruses.\" The cur-rent treatment for the disease is a bone marrow transplant, but there are not enoughcompatible, bone marrow donors.'Should we proceed to experiment with the use of genetic engineering techniquesto treat these children? The answer will turn in large part on whether the experimentalprocedure appears likely to be both safer than and at least as effective as the bestavailable conventional treatment, which in the case of SCID would be a bone mar-row transplant. To try an experimental procedure that was less effective or justas effective but less safe than available therapies would be clearly unjustified.The first protocols to be submitted for approval concerning SCID will prob-ably propose treating the subjects by altering the genetic structure of their bonemarrow cells to enable them to produce the missing enzyme.52 The protocols willlikely propose removing some of the subject's own bone marrow, delivering themissing genetic material to the bone marrow cells by \"infecting\" them with aretrovirus\" to which the missing DNA segment has been added, and then reimplant-ing the treated bone marrow in the subject. 4 Such a treatment proposal, whiledesigned to minimize the risk to the subjects that would arise if all the cells intheir bodies were infected with rDNA, does not eliminate the possibility of inadver-tantly producing cancer. Viruses deposit the transplanted gene randomly in the cell'schromosomes. If it lands in a control region for one of the approximately twentyoncogenes-genes that can turn a normal cell into a cancer cell-a tumor couldresult.\"Another possible risk of this procedure is that the altered genetic material mightin some way be transmitted to third parties. One way of understanding the possibledangers of using a retrovirus to transfer the genetic material is to consider AIDS(acquired immune deficiency syndrome). AIDS is also caused by a retrovirus, one11 Thompson, Researchers Ready to Try Gene Therapy, Wash. Post, Dec. 19, 1984, at D7, col.3. See also text at note 32 supra. See generally E. Gelfand & H. Dosch, Diagnosis and Classificationof Severe combine Immuniodeficiency Disease, 19 BRITISH DFECTS 65 (1983).\" Id.\" Anderson, supra note 31, at 401-02.\" A retrovirus, unlike almost every other organism such as viruses, bacteria, plants, animals,and humans, stores its genetic information in ribonucleic acid (RNA) rather than in its DNA. Thomp-son, Like No Other Human Disease, Wash. Post, Sept. 4, 1985, at Health 10, col. 1.\" Anderson, supra note 31, at 401-02.\" Thompson, supra note 53.19851WEST VIRGINIA LA W REVIEWcalled human T-cell lymphotropic virus (HTLV-3). The AIDS virus can be trans-mitted from one person to another in some circumstances, particularly via bloodtransfusions or sexual contact.5 6 Similarly, a subject infected with a retrovirus mightbe able to transmit the virus to others who might then suffer any adverse effectsassociated with the retrovirus.One of the most difficult aspects of assessing the immediate risks and benefitsof a human gene therapy protocol for the reviewing committees is likely to bedeciding whether there are sufficient animal data to justify proceeding with humanclinical trials. A very controversial part of this assessment will be weighing whetheror not it is necessary to conduct studies in primates, or at least in large animals,which could delay human trials for several years. 7 On this issue, at least, scientistsare likely to be able to present data based on other situations in which the issuewas the appropriateness of moving from animal to human trials. On the issue oflonger term risks, by contrast, it will be harder to find appropriate analogies.The first experiments that deliberately expose humans to rDNA arguably posetwo longer term risks. First there is the risk of damage to the future of offspringof treated patients. The protocols described above are intended to involve onlysomatic cells,5\" or body cells, and thus should not affect future offspring of thepatients. But there remains the risk of unintended consequences. There is also littledoubt that the information gained by conducting such experiments may increase\" See generally Curran, Morgan, Hardy, Jaffe, Darrow & Dowdle, The Epidemiology of AIDS:Current Stakes and Future Prospects, 229 SCIENCE 1352 (1985):The first cases of AIDS were reported in mid-1981 .... By 30 August 1985, 12,932 casesof AIDS had been reported to the Centers for Disease Control ..... Over 6,480 (50 percent)persons were known to have died.... In most cases of AIDS in the United States, the virus appears to have been transmittedthrough one of four routes: sexual contact, intravenous drug administration with contaminatedneedles, administration of blood and blood products, and passage of the virus from infectedmothers to their newborns.... A recent report, however, describes a nurse in England who developed confirmed HTVL-III/LAV [the retrovirus that causes AIDS] antibody following a needlestick injury and exposureto the blood of an AIDS patient.\" W. French Anderson has argued: \"Studies in vivo with primates are needed. A protocol similarto the one planned for human application should be carried out in primates, not just mice, becausethe endogenous proviral sequences in primate, including human, DNA are different from those in mouseDNA.\" 226 SCIENCE 401, 407 (1984).The initial points to consider posed the following question: \"2.a (1)(e) Has a protocol similarto the one proposed for a clinical trial been carried out in non-human primates and with what results?Specifically, is there any evidence that the retroviral vector has recombined with any endogenous orother viral sequences in the animals.\" 50 Fed. Reg. 2943 (1985).The revised version provides: 2.e.(I)(e) Has a protocol similar to the one proposed for a clinicaltrial been carried out in non-human primates and/or other animals? What were the results? (emphasisadded). 50 Fed. Reg. 33,465 (1985). The document thus has moved to a more neutral position on theissue of primate testing.\" \"Somatic cells\" are cells of the body other than germ-line cells which are the sex cells, i.e.sperm and egg cells.[Vol. 88GENE THERAPYthe possibility of developing techniques for altering germ line cells at some pointin the future. That technological ability, once it exists, means that humans willhave the capacity to alter their own genetic future-the power to remake man inhis own image.Second, single gene therapy inevitably takes us closer to the possibility of beingable to alter human traits that are shaped by more than one gene. Treating severecombined immunodeficiency disease is one thing, but it would be quite anotherfor parents to be able to choose the IQ or appearance of their unborn child. Thedistinction has been described by Dr. French Anderson as the difference betweengene therapy and eugenic genetic engineering. 9B. Assessing the RisksBruce Mazlisch, in The Fourth Discontinuity,\"0 built on Freud's notion of thegreat thinkers of the past who \"had outraged man's naive self-love.\" First in theline was Copernicus, who taught that the earth was not the center of the universe.Second was Darwin, who \"robbed man of his peculiar privilege of having beenspecially created, and relegated him to a descent from the animal world.\" Freudplaced himself third for endeavoring to prove that we are not master of our ownhouse, but influenced by unconscious motivations. American psychologist JeromeBrunner later revised Freud's list to emphasize elimination of discontinuities; thatis, the establishment of a belief in a continuum of nature. According to Brunner,the Greek physicist-philosophers of the sixth century B.C., rather than Copernicus,established the first continuity for they conceived of the common laws of matter.Darwin was second for creating the continuity between man and the animal kingdom,and Freud third for the \"continuity of organic lawfulness.\" This view is that ac-cidents in human affairs can be seen as the continuity of the primitive, infantile,and archaic with the civilized and evolved. Mazlisch argued that computers wouldeliminate the fourth discontinuity, between man and machine. Perhaps. But surelya major discontinuity is our sense of ourselves as having qualities that are not sub-ject to human manipulation. Genetic engineering opens the possibility that qualitieswe have considered personal, if not unique-intelligence, beauty, physical stamina-may in the future be for sale on the open market.There is a strong consensus that somatic cell therapy is not different from manyother types of medical intervention (organ transplants, bone marrow injections,etc.).' There is a danger, however, that this consensus will push us unwittinglydown a slippery slope to germ line cell therapy or even to eugenic genetic engineer-ing. In vitro fertilization, which has spread rapidly in the last several years, is only'9 Anderson, supra note 31, at 23.60 Mazlisch, The Fourth Discontinuity, TECH. & CULTURE, (Jan. 1967), at 1.See, e.g., CONGRESS OF THE UNITED STATES, OFFICE OF TECHNOLOGY ASSESSMENT, HUMAN GENETHERAPY-A BACKGROUND PAPER (1984); 50 Fed. Reg. 33,464 (1985).1985]WEST VIRGINIA LA W REVIEWthe most recent in a long list of technologies that have altered our world withoutmuch public oversight.6\" Although the possibility of moving closer to germ lineor even eugenic genetic engineering should not by itself stop any somatic cell therapy,it does impose an obligation on all of us, I believe, to be aware of the risks offuture abuse. We must also use the time we have now to determine the appropriatesteps to take to control the risks that we will face once we have the technologicalcapacity to perform germ-line or enhancement genetic engineering.V. WHo SHOULD REGULATE?Because so many important societal values must be weighed in deciding which,if any, of the first protocols for human gene therapy should be approved, it isobviously important to look closely at who will make the decision to approve ordisapprove the protocols. In the United States, for the moment, at least three, andpossibly four different committees are required to approve any protocol for humangene therapy performed with any public funds.First, approval is needed from the IRB of the institution where the researchwill be conducted. Second, approval is needed from the Institutional Biosafety Com-mittee (IBC), which is essentially a local RAC mandated by the rDNA guidelines.\"Third, the RAC itself must approve the protocol.Recognizing that it was not constituted with clinical studies in mind, the RACin 1984 created a \"Working Group on Human Gene Therapy,\" consisting of fif-teen people, to advise it on these issues. 6' The Working Group includes four physi-cians, two microbiologists, three lawyers, three ethicists, two public policy experts,and one public member.6 5 Four of the fifteen are also members of the RAC itself.Any human gene therapy protocol will now have to be reviewed by this fourthgroup as well. While the approval of the Working Group is not required as a matterof law, in practice it is unlikely that a rejection by it would be overturned by thefull RAC.Although the RAC should be commended for reaching out to broaden the baseof available expertise in establishing the Working Group, unfortunately, the membersof the Working Group were chosen without public consultation. Consequently, theRAC and the Working Group should proceed only after consulting as widely aspossible with interested experts and lay groups alike.For the moment, the Working Group has restricted itself to preparing for thearrival of the first protocols by issuing a set of \"guidelines\" to researchers. Theguidelines outline information that the Working Group anticipates it will need to61 And this spread has occurred despite a ban on federal funding.61 See supra note 22.6' 44 Fed. Reg. 17,844 (1984).\"' 50 Fed. Reg. 2940 (1985).[Vol. 88GENE THERAPYmake a recommendation to the RAC on whether to approve a particular protocol.66Although much of the information identified is needed anyway for the reviews bythe local IRB and IBC, some requirements are new.Researchers are directed, for example, to report any serious adverse effectsdirectly to NIH. This requirement reflects the federal involvement any such experi-ment will acquire by virtue of the approval process described above. 7 A secondnew requirement is that researchers report what steps will be taken to protect theprivacy of any patients and families involved in the gene therapy. 8 Protection ofprivacy has become a major concern in light of the enormous public attention paidto the patients and families in recent cases involving new therapies, such as thetransplant of a baboon heart to Baby Fae and the artificial heart transplants.69Significantly, even this modest step in the direction of broadening the baseof decision-makers on human gene therapy was almost killed by bureaucraticinfighting this past summer. NIH was about to publish a revised version of theinitial points, which had been prepared by the Working Group, when NIH DirectorJames B. Wyngaarden was asked by the Commissioner of FDA, Frank Young,to delay publication of the revised document until a Biotechnology Science Board(BSB) comes into existence.7\"The BSB was the product of the Cabinet Council on Natural Resources andthe Environment Working Group on Biotechnology. 7' The Council consists ofrepresentatives of the Departments of Interior, State, Justice, Agriculture, Com-merce, Energy, Health and Human Services, and Labor, the Environmental Pro-tection Agency, the Council on Environmental Quality, the Council of EconomicAdvisors, the Office of Management and Budget, the Office of Policy Develop-ment, the Office of Science and Technology Policy, and the National Science Foun-dation.\" Formed in April of 1984, the Council is reviewing federal regulatory rulesand procedures relating to biotechnology, including the RAC. 3The BSB was proposed December 31, 1984. It appears to have been designedprimarily as a way to resolve conflicts among the five agencies in the federal govern-ment that have jurisdiction over some aspects of genetic engineering: EPA, FDA,the Department of Agriculture (USDA), NIH, and the National Science Founda-tion (NSF). 4 As envisioned by the Council, each of the five agencies would form66 50 Fed. Reg. 2940 (1985) (revised 50 Fed. Reg. 33,464 (1985)).67 Id.68 Id.\" See, e.g., Altman, Learning from Baby Fae, N.Y. Times, Nov. 18, 1984, at 1, col. 1; Russell,Heart Implant Problems Stir Doubts, Wash. Post, June 7, 1985, at Al, col. 4.70 Culliton, New Biotech Review Board Planned, 229 SCIENcE 736 (1985).\" 49 Fed. Reg. 50,856 (1984).2 See Talbot, supra note 23, at 41.Id.49 Fed. Reg. 50,856 (1984).1985]WEST VIRGINIA LA W REVIEWa \"scientific advisory committee\" that would be composed \"principally of membersof the scientific community who possess demonstrated, recognized expertises [sic]in disciplines related to biotechnology.\"\"7 The five committees would in turn reportto the BSB, which would be chartered under the Department of Heath and HumanServices and would report to the Assistant Secretary for Health.7 1The initial proposal indicated that ten of the members of the BSB would bemembers of one of the five advisory committees.\" Presumably, each would be ascientist. Yet the proposal, in addition to listing an number of scientific reviewtasks, identified one function of the BSB as \"provid[ing] a forum for public con-cerns.\"7 8 It appears it would have been a forum with few, if any, members fromoutside the scientific community.By November, 1985, the White House retreated from its original proposal. Therewill be a coordinating panel called the Biotechnology Science Coordinating Com-mittee (BSCC), but it will be a \"consensus\" body without authority to overturnthe actions of constitutent agencies.7 9For the time being, approval has been given to the Working Group of the RACto proceed. The revised points to consider were published in the Federal Registeron August 19, 1985.80 But the internal fight over the composition of the reviewingbodies is clearly not over. In its September 13, 1985 submission of comments onthe proposed points to consider, the FDA commented:Since ... most of the critical decisions on individual investigators' submis-sions are likely to be scientific and medical ones, we suggest reconsideration ofthe membership of the RAC Working Group on Human Gene Therapy ... whichcurrently includes a large proportion of attorneys, ethicists, and public policyspecialists. Arguably, the Working Group should be supplemented with moremembers with expertise in molecular biology, pharmacology, medicinal chemistry,and medicine.\"\" 49 Fed. Reg. 50,905 (1984).76 Id.77 Id.7, 49 Fed. Reg. 50,904 (1984).P. Hilts, Panel Created to Coordinate Biotechnology, Wash. Post, Nov. 12, 1985, at A 6 col.1. Reportedly, the change was prompted by industry pressure. Id.\" 50 Fed. Reg. 33,464 (1985).\" Letter to Dr. William Gartland, Director, Office of Recombinant DNA Activities, NIAID,NIH, Bethesda, Md. 20205 (Sept. 13, 1985).It is interesting to compare the criticism of the composition of the working group submitted byJeremy Rifkin and the Foundation on Economic Trends:A given proposal may raise value-laden social and ethical issues that require more thanthe application of technical or scientific disciplines by the working group as well as by thosegroups that propose specific studies. There may be need for qualified representatives of thesocial sciences, including theologians, ethicists, social philosophers, anthropologists, andeconomists, as well as micro-biologists and various medical experts as voting members ofthe working group. The existence of only one or two representatives of such other disciplines[Vol. 88GENE THERAPYVI. RECOMMENDATIONSIt will not be easy to decide what limits, if any, to place on the developmentof human gene therapy. At a minimum, we must remain vigilant about the dangersof false cures. The temptation to help the victims of SCID or even of Lesch-Nyhandisease, which currently has no available cure, is understandably strong. But surelyit should not lead to premature efforts that are scientifically unsupportable. Con-sider the cautionary language of United States v. Rutherford,82 in which the SupremeCourt confronted the claim that the Federal Food Drug and Cosmetic Act should notbe applied to terminally ill patients who wished to try Laetrile:To accept the proposition that the safety and efficacy standards of the acthave no relevance for terminal patients is to deny the Commissioner's authorityover all drugs, however toxic or ineffectual, for such individuals. If history is anyguide, this new market would not be long overlooked. Since the turn of the cen-tury, resourceful entrepreneurs have advertised a wide variety of reportedly simpleand painless cures for cancer, including liniments of turpentine, mustard oil, eggsand ammonia; peat moss; arrangements of colored floodlamps, pastes made fromglycerin and limburger cheese; mineral tablets; and \"Fountain of Youth\" mixturesof spices, oil and suet .... [T]his historical experience does suggest why Congresscould reasonably have determined to protect the terminally ill, not less than otherpatients, from the vast range of self-styled panaceas that inventive minds can devise.83The reaction of the scientific community to the one known abuse of the rele-vant guidelines is encouraging. In 1980, Dr. Martin Cline, Chief of Hematologyand Oncology at UCLA, attempted gene therapy on two patients suffering froma hereditary blood disorder. NIH found that Cline had violated both scientific andethical research standards for human subjects. His own research data revealed littlescientific basis to believe his effort would succeed.\"' Worse, he failed to discloseto the IRB or to the patients that they would receive recombinant DNA materialdespite the fact that the IRB went to considerable length to verify that the pro-cedure would not involve recombinant DNA. Ultimately, his resignation as Chiefof Hematology and Oncology was accepted; NIH withdrew his current grants andrequired a report of this matter to accompany grant applications for the next fiveyears. 5As the Cline affair suggests, we should also guard against what Judge DavidBazelon has termed the \"republic of science.\" 86 The idea of nonscientists havingmay not be sufficient to assure that the group will recognize the potential issues or resolvethem satisfactorily.Letter from Edward Lee Rodgers, Counsel for Foundation of Economic Trends and Jeremy Rifkinto Director, Office of Recombinant DNA Activities, NIH (Sept. 18, 1985).'2 United States v. Rutherford, 442 U.S. 544 (1979).88 Id. at 557-58.4 Williamson, Gene Therapy, 298 NATURE 416, 418 (1982).'8 PRESIDENT'S COMISSION, Protecting Human Subjects, (Appendix E) 177, 182-85 (1981).16 Bazelon, Coping with Technology Through the Legal Process, 62 CORNELL L. REV. 817 (1977).19851WEST VIRGINIA LA W REVIEWanything to do with science is a relatively recent one. Scientists have at times likenedtheir profession to an autonomous, self-governing republic. To qualify for citizen-ship, one's scientific credentials must be in order. Only scientists, according to thisview, should have a voice in the way science is governed. But these are not theprinciples on which a democratic society rests. Tracy Sonnenborn, speaking at thefirst conference on Genetic Intervention in Man in 1965, posed the issue this way:The human problems raised by these new possibilities ... are problems of morals,ethics, religion and politics. They are problems of how knowledge and the powerthat knowledge confers can be used. They could be used for good or ill, for theenslavement or the liberation of man. How they will be used obviously will notbe decided by scientists alone. Nor should this be decided alone by professionalpoliticians or theologians or by philosophers or by moralists. It should be decidedon an enlightened and broadly based public opinion.\"To a large extent, money has altered the tradition. Since World War II, thefederal government in this country has largely paid for broad areas of scientificresearch, including the Manhattan project, the space program, and biomedicalresearch in general. With the influx of so many government dollars, some govern-ment supervision became inevitable. But as the spread of in vitro fertilizationdemonstrates, denial of federal support is not always an effective sanction, at leastin the late stages of the development of a new technology.The difficulties of designing effective public controls should not obscure theneed for such controls. Just as we have learned not to leave war solely to the generals,scientists alone should not control human gene therapy. It no doubt will be dif-ficult to achieve appropriate control of gene therapy, or of any technology of com-parable power for that matter, as the continuing debate on nuclear weapons suggests.The last analogy may be particularly apt, it turns out, for both nuclear weaponsand gene therapy raise at least the possibility of ending the human race as we knowit.\" That potential, in turn, underscores the need to establish suitable public controls.The Working Group on Human Gene Therapy and the RAC are a good firsteffort. At least as long as they consult a broad group of both scientific and layadvisors, they are likely to be good bodies for reviewing the risks and benefits of\" IMPORTANT TECHNOLOGICAL TRENDS/BIOTECHNOLOGY, II PROCEEDINGS OF THE FOURTH CON-VOCATION OF ENGINEERING ACADEMICS, IV-A RAPPAPORT 224, May 29 - June 1, 1983 (quoted in Hear-ing on Biotechnology Regulation of the Subcommittee on Oversight and Investigations of the HouseCommittee on Energy and Commerce, 98th Cong., 2d Sess., Dec. 11, 1984 (statement by Frank E.Young, Commissioner, Food and Drug Administration)).11 In 1974 in explaining why a moratorium had been proposed on DNA research, Nobel laureateDavid Baltimore commented:[A]lthough our dilemma ... may differ from that of the atomic scientists in many details.... we all grew up with a question of the correctness of using the atomic bomb as oneof the great moral dilemmas of the second part of the twentieth century .... I think youcan see . . . a direct line of thinking.Risks and Benefits, supra note 13, at 1024.[Vol. 88GENE THERAPYparticular research protocols involving somatic cell gene therapy. Assessment ofthe risks of germ cell therapy, or of enhancement genetic engineering, by contrast,is beyond the present charge or resources of the Working Group.Legislation that establishes a permanent advisory body charged with reviewinglonger term risks has now been passed by the Congress over a veto by PresidentReagan.8 9 The new law establishes a Biomedical Ethics Board modeled on the Officeof Technology Assessment. The Board is to have twelve members, six from theSenate and six from the House. The Board is directed to:study and report to the Congress on a continuing basis on the ethical issues arisingfrom the delivery of health care and biomedical and behavioral research, includingthe protection of human subjects of such research and developments in geneticengineering (including activities in recombinant DNA technology) which haveimplications for human genetic engineering.To conduct the studies and to make the reports, the Board is to appoint aBiomedical Ethics Advisory Committee of fourteen members: four distinguishedin biomedical or behavioral research, three distinguished in medicine or the provi-sion of health care, five distinguished in ethics, theology, law, the natural sciences,the social sciences, health administration, government, and/or public affairs, andtwo citizens with an interest in biomedical ethics. Each member is to serve for aterm of four years, with the terms staggered to establish continuity in membership.The structure of a Board plus a Committee holds out much promise. Themembers of the Board are to represent both parties in equal numbers, and thusshould provide more consistent political direction than if it were yet another Presiden-tial commission. The Committee, in turn, will be able to draw upon the experienceof two previous Presidential commissions9\" as well as the RAC using scientificand ethical experts and lay members to tackle in a public forum both ethicaland policy problems posed by new technologies. Congress may at last have founda structure that brings to bear the expertise of the relevant scientific communitiesin an open, democratic setting with the resources to tackle the enormous ethicaland political problems posed for our society by future developments in geneticengineering. Now it should also find the funds to bring the Board to life.S9 The Health Research Extension Act, H.R. 2409, Cong. Rec. 515925 (Nov. 20, 2985).1 The National Commission for the Protection of Human Subjects of Biomedical and BehavioralResearch was established in 1974 by Pub. L. No. 93-348, 88 Stat. 352. The President's Commissionfor the Study of Ethical Problems in Medicine and Biomedical and Behavioral Research was establishedin 1978 by Pub. L. 95-622, later amended by Pub. L. 97-377 (1982).The National Commission was composed of eleven members appointed for the life of the com-mission by the Secretary of Health, Education and Welfare.The President's Commission was also made up of eleven members. They were presidential appointeesappointed for two, three, or four years, and thus the membership could, and in fact, did change overtime to reflect the change from Carter to Reagan.1985]",
    "Link": "https://core.ac.uk/download/70375313.pdf"
}