{
    "Title": "Anticancer Gene Transfer for Cancer Gene Therapy",
    "Authors": "A Aiuti, A Aiuti, A Biffi, A Winkeler, AD Bucheit, AW Tong, B Everts, B Kaur, B Moss, B Vogelstein, BR Dix, C Alvarez-Breckenridge, C Heise, C Schliemann, C Springfeld, CC O’Shea, CE Gomez, CE Thomas, CJ Sherr, CM Lai, D Hanahan, D Meirow, D Moroziewicz, D Piwnica-Worms, DF Stojdl, DR Koehler, DR Koehler, E Kelly, EJ Boviatsis, F Simonelli, FJ Morling, GD Trobridge, HA Hoster, HD Klenk, HH Wong, I Friedrich, J Ansari, J Chou, J Cinatl Jr, J Clarke, J Foloppe, J Fueyo, J Hardcastle, J Jin, J Sinkovics, J Veerapong, JA Noser, JC Deutekom van, JM Bergelson, JM Markert, JN Harada, JR Bischoff, JW Bainbridge, K Boztug, K Hamada, K Iguchi, K Nakano, KD Smith, KW Peng, KW Peng, KW Peng, KW Reichard, KX Zhang, L Chen, L Yuan, M Ahonen, M Bergmann, M Chase, M Egeblad, M Kinali, M Sauane, MA Kay, MA Passini, MA Stoff-Khalili, ML Lamfers, MS Ferguson, N Cartier, N Cartier, N Natarajan, N Nayerossadat, NK Green, NL Fox, O Hallgren, O Meier, OG Donnelly, P Msaouel, P Msaouel, PA Lewitt, PG Spear, Q Wu, R Cattaneo, R Cattaneo, R Stripecke, R Waehler, RM Lorence, S Aggarwal, S Chalikonda, S Cirak, S Goverdhana, S Grimm, S Inoue, S Jones, S Kumar, S Nagano, S Suzuki, SA Vorburger, SK Pal, T Flotte, T Gianni, T Kuroda, T Mineta, T Muster, T Sasaki, T Todo, T Todo, T Todo, TC Doyle, TG Huang, WW Spurbeck, X Wang, Y Yi, YY Mahller, Z Peng, Z Zhang, ZS Guo, ZS Guo",
    "Year": "No year available",
    "Abstract": "Gene therapy vectors are among the treatments currently used to treat malignant tumors. Gene therapy vectors use a specific therapeutic transgene that causes death in cancer cells. In early attempts at gene therapy, therapeutic transgenes were driven by non-specific vectors which induced toxicity to normal cells in addition to the cancer cells. Recently, novel cancer specific viral vectors have been developed that target cancer cells leaving normal cells unharmed. Here we review such cancer specific gene therapy systems currently used in the treatment of cancer and discuss the major challenges and future directions in this field",
    "Keywords": "No keywords available",
    "Publisher": "'Springer Science and Business Media LLC'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "1  Anticancer Gene Transfer for Cancer Gene Therapy  Evangelos Pazarentzos, Ph.D1, & Nicholas D. Mazarakis Ph.D2 1 Postoctoral Fellow, University of California-San Francisco (UCSF) 600 16th st, Genentech Hall, San Francisco CA, 94158, USA 2 Lucas-Lee Chair of Molecular BioMedicine & Head of Gene Therapy, Centre for Neuroinflammation & Neurodegeneration, Division of Brain Sciences, Faculty of Medicine, Imperial College London, Hammersmith Hospital Campus, E402 Burlington Danes Building, Du Cane Road, London W12 0NN  ABSTRACT  Gene therapy vectors are among the treatments currently used to treat malignant tumors. Gene therapy vectors use a specific therapeutic transgene that causes death in cancer cells. In early attempts at gene therapy, therapeutic transgenes were driven by non-specific vectors which induced toxicity to normal cells in addition to the cancer cells. Recently, novel cancer specific viral vectors have been developed that target cancer cells leaving normal cells unharmed. Here we review such cancer specific gene therapy systems currently used in the treatment of cancer and discuss the major challenges and future directions in this field.   INTRODUCTION  CANCER GENE THERAPY – ONCOLYSIS  Viruses were discovered more than a century ago but from early times diseases like cancer and especially leukemia were attempted to be treated with viruses. Throughout the recorded history of diseases, there have been observations of cancer regression upon natural co-infection with viruses (Sinkovics and Horvath, 1993; Kelly and Russell, 2007). During the early twentieth century, based on these observations, several clinical trials were conducted via fluid transfer from animal or human bodies that were infected with viruses to infect patients with cancer (Hoster et al., 1949). The immune responses of those infected patients were most of the times active and so limited efficacy was observed but in immune-compromised individuals in many occasions the tumor regressed. However, even after obtaining positive results from the tumor shrinkage the morbidity from the infection was unacceptable. During those desperate times for science and patients, ethical issues were of lower importance, but nowadays those techniques would not have met the current ethical standards.  Initially introduced as a revolutionary biomolecular technology with an unlimited potential for curing almost any disease, gene therapy has passed three initial decades of turbulence. Its initial concept of using genetic material and introducing it into cell to correct defective genes has broadened significantly but in contrast to the large number of 2  clinical trials (more than 1000) that have been conducted or are in process right now, the efficacy of gene therapy for cancer therapy has been limited. The lack of alternative treatment options in some terminal cancers gave gene therapy the opportunity to prove its efficacy and in combination with its lower cost compared to conventional therapies sometimes appears as the sole option for some patients. The advances in tissue culture in the second half of the twentieth century allowed the production and amplification of viruses in a more controlled environment compared to the usage of bodily fluids. Also the development of rodent-based models of cancers allowed pre-clinical experimentation using a variety of viruses. It was only then when the opportunity to influence the development of viruses presented. The possibility to force viruses to grow only in specific cancer cells in vitro and subsequently use these viruses in the equivalent human tumors was early on utilized, but did not yield in significant advances in virotherapy since the tools that were available to improve efficacy, safety and potency were very limited.  Oncolytic virotherapy is a very promising treatment option that uses the replication inclination of some viruses in specific cancer cells only. By definition, oncolytic viral replication leads to intratumoral viral amplification which ultimately leads to tumor destruction with minimal or non-existent damage to nearby non-tumor tissue. Many efforts concentrated to the viral tropism and constituted the first generation of oncolytics which was based on engineering the virus in such way that genes responsible for its replication in normal tissue were removed but were dispensable for the replication in tumors (Kaur et al., 2009). Generating viruses that were more specific for cancer cells was the ultimate goal since the “lysis” of the infected cell was a native characteristic of the virus. It was postulated and later proven that tumor cell environment was more suitable than the normal cell environment for viral replication. The latter finding was the core of later efforts towards reprogramming viruses to become cancer specific and thus safer. These efforts resulted in the first generation of the viruses that has been used extensively that utilized the native ability of the virus to enter a lytic cycle and also to be targeted to cancer cells specifically using advanced molecular engineering. We are now able to visualize the spread of the viruses using reporter genes and evaluate the efficacy of each virus in a specific biological system (Doyle et al., 2004; Piwnica-Worms et al., 2004; Peng et al., 2006; Cattaneo et al., 2008).   VIRAL TROPISM – VIRAL ARMING In recent years the demand for specificity for any aspect of cancer therapy to avoid any type of toxicity, resulted in the advancement of another approach. Genes that can specifically induce a programmed cell death (apoptosis) only in cancer cells but not in normal tissue appeared to be very promising approach for cancer therapy since apoptosis evasion is a characteristic of cancer cells and the anticancer genes were able to induce it. However, significant pitfalls appeared for this approach since the delivery of these genes 3  was an issue that could not be resolved with the means of delivery that were available. Our understanding of cancer has dramatically improved recently and allowed the generation of viruses encompassing highly sophisticated molecular characteristics that are specific for each cancer type. The first generation of viruses is currently being tested in patients for efficacy and concurrently new approaches are being explored for the enhancement of their therapeutic potency (Msaouel et al., 2009). Currently clinical and pre-clinical studies are testing combination of viruses with pharmacological drugs in order to enhance the efficacy of treatment (Alvarez-Breckenridge et al., 2009; Kumar et al., 2008). These new studies utilized tumor-specific promoters in order to increase efficacy and specificity since the viruses are only able to replicate and lyse specifically in a tumor environment. Tumor epitopes are currently being used as targets of newly engineered viruses that initiated a revolution in tumor tropism (Hardcastle et al., 2007; Waehler et al., 2007). A new era for the virotherapy research begun when scientists realized that apart from the lytic potential, viruses could be used as gene delivery vehicles. Those viruses were named “armed” since they have the ability to lyse the transduced cells and express proteins that would enhance the tumor killing efficiency. The genes that are commonly arm oncolytic viruses full under four categories: 1) Pro-drug activating enzymes which transform a non-toxic chemotherapeutic to an extremely toxic agent which kills tumor and non-tumor nearby cells, 2) Reporter genes that are normally used for in vivo monitoring of viral distribution, 3) Tumor-microenvironment modulating genes that alter significantly the tumor microenvironment so after the lysis of the initial tumor the microenvironment would become inappropriate for tumor regrowth and 4) Apoptosis inducing genes that can potentially directly enhance the oncolysis by inducing a self- suicidal program (Kaur et al., 2009).  Over the years advances in the field of apoptosis and cell death allowed the identification of specific pathways and genes that cancer cells use to escape apoptosis. This book deals with the exciting finding that some genes can induce apoptosis specifically in tumors cells without affecting nearby or normal tissue (Grimm and Noteborn, 2010). The findings are of great importance since specificity is attributed at the gene itself and not in the delivery system. One can realize the potential of combining the knowledge of viral tropism and specificity with the potency and specificity of the anticancer genes. Arming an oncolytic virus that is engineered in a way that can transduce a certain tumor type with a tumor specific apoptosis gene is the direction that all the current efforts in the field of anticancer genes are focused on.   GENE DELIVERY – VIRAL AND NON-VIRAL SYTEMS  There are many ways of delivering genetic material to a tissue but in general there are two approaches that include viral and non-viral means. Both ways have advantages and disadvantages and the majority are developed specifically for a narrow application 4  system. Briefly non-viral gene delivery can be achieved with physical methods which include naked DNA, gene gun particle bombardment, electroporation, ultrasound, magnetofection and the highly efficient in rodents (so far) hydrodynamic (Nayerossadat et al., 2012). Generally while the non-viral physical methods are cost effective and less invasive than a viral approach the efficiency of delivery is extremely low and so far there only few examples of clinical use of these methods. Most significantly exon skipping approaches using oligonucleotides have been used successfully in the clinic for Duchenne Muscular Dystrophy (van Deutekom et al., 2007; Kinali et al., 2009; Cirak et al., 2011) and antisense oligonucleotides for Spinal Muscular Atrophy are in clinical development at present (Passini et al., 2011). Another method of non-viral gene delivery utilizes advanced nano-chemistry and nanoparticles that are analyzed extensively in another chapter of this book and constitute an attractive approach when compared only with the more efficient viral systems. The delivery of the genes for cancer gene therapy is of extreme importance since the advances in the anticancer genes identification cannot be realized if they cannot be designed into a translational approach for patients. There are some key steps that the field has to take in order to improve or perfect the current viral or non-viral systems. Targeting and delivery are important determinants of the success of cancer gene therapy as is the enhancement of the intracellular delivery, the duration of the transgene expression and the local or systemic toxicity. Clinical successes the last 5 years have breathed new air in the field of gene therapy like i.e. the treatment of X-linked SCID, ADA-SCID (Cartier and Aubourg, 2010; Aiuti et al., 2002), X-adrenoleukodystrophy (Cartier et al., 2009) and Wiskott-Aldrich Syndrome (WAS) (Boztug et al., 2010; Aiuti et al., 2013) metachromatic leukodystrophy (Biffi et al., 2013) by using ex vivo gene transfer into bone marrow hematopoietic stem cells and autologous transplantation or by direct gene transfer in vivo as in the cases of Leber congenital amaurosis (Bainbridge et al., 2008; Simonelli et al., 2010) and Parkinson’s disease (LeWitt et al., 2011; Palfi et al., 2013)  ONCOLYTIC VIRUSES AND VECTOR SYSTEMS FOR GENE DELIVERY There are several virus families and representatives of each family that are currently engaged in the battle with cancer. Oncolytic viruses have a native capacity of cell lysis and so innate ability of killing. Other viruses do not have the ability of lysing the infected cells but have great other characteristics such as transgene capacity and ability to express high amounts of the transgene. Viral vectors with backbones from arming-able oncolytics or other viruses are of particular interest for this chapter since anticancer genes can be used as arming agents for these vectors. Figure 1 shows the oncolytic viruses that are currently under clinical trials and viral vectors that are commonly used in gene therapy.  5    Figure 1. Currently ongoing clinical trials utilising oncolytic viral vectors.  Successful delivery systems today include retroviruses, adenoviruses (types 2 and 5), adeno-associated viruses (AAV), herpes simplex viruses (HSV), pox viruses, lentiviruses and human foamy viruses (HFV). Adenoviruses, AAVs and HSVs have innate oncolytic capacity and constitute the most widely used oncolytics. Moreover, the can be efficiently armed and used as delivery systems. The engineering of viral vectors include the removal of some areas of their genome to manipulate the replication ability, the tropism and safety.   VIRAL TROPISM MANIPULATION Many types of viruses that contain a high oncolytic potential with low toxicity but with no tropism can be manipulated with precise molecular engineering to infect only a tumor derived from a specific tissue. Some viruses have natural tropism for a specific cell type and this property is extensively used after re-programing the tropism only to cancer cells but maintaining the oncolytic efficacy. An example for this class of viruses is the Herpes Simplex Virus (HSV) which has natural tropism for neuronal cells but is engineered in a way that will only infect neuronal cancer cells but leaving healthy neurons unharmed.     6  CANCER SPECIFIC PROTEASES AND ONCOLYTIC ACTIVATION  Cancer cells have deregulated proteome profile and events of protein overexpression are very common. Identification of such proteins that are overexpressed only in cancer cells and have minimal or no expression in normal cells has attracted the interest of many cancer biologists because each of these proteins could be a potential target for cancer therapy. However, virologists effectively used this characteristic of cancer cells in order to manipulate viral tropism. They exploited the innate need of viruses to use proteases of the host cells in order to be activated and exert any effect in the target cell. In detail, viral attachment and activation requires cleavage of viral proteins. Viral proteins contain specific sequences that are cleavable by proteases that are ubiquitously expressed in cancer cells. Viruses with envelopes such as HIV-1, influenza and paramyxoviruses recognize the receptor on a target cell but require the cleavage of their viral glycoproteins to allow entry and activation (Klenk and Garten, 1994). Insertion of a cleavage site in the virus genome and disruption of the native recognition site for ubiquitously expressed peptidase is the strategy that is followed to manipulate viral tropism.  Among proteins that are highly overexpressed in most types of cancers cells are the Matrix Metalloproteinase Proteins (MMPs). They have been associated with high metastatic potential, and enhanced cell invasion. Rationale-based therapies targeting those proteases with specific inhibitors were developed but with disappointing results due to the wide range of substrates and unknown mechanisms of actions of the MMP superfamily (Egeblad and Werb, 2002). Additional functions are now attributed to MMPs that could explain the failure of MMP inhibitors to provided beneficial outcome for cancer patients. However, in cancer gene therapy MMPs’ overexpression is utilized for viral tropism reprogramming without the need of pharmacological inhibition. Essentially a harmful cancer-cell characteristic is used to destroy the tumor itself. Retroviruses and Measles viruses have been recently used in cancer-specific retargeting through the use of MMPs (Yi et al., 2011; Cattaneo, 2010). Viral DNA or RNA was manipulated so genes that contained protease recognition sequences were disrupted and fused with linkers containing sequences that are recognized by MMPs. Surprisingly, the modified viruses could only be activated and exert oncolysis preferentially in cells that express MMPs. Similar results were obtained from experiments in mice in which modified viruses were injected in a background of MMP absence and so no damage (cell death) or infection were observed after viral distribution (Morling et al., 1997; Peng et al., 1999; Springfeld et al., 2006). Importantly the safety of the viruses was greatly enhanced compared with the wild type counterparts through viral tropism re-targeting so the manipulation was at the level of particle activation.   CANCER SPECIFIC TRANCRIPTION AND REPLICATION Human cancers stem and evolve through mutations on several genes controlling cell cycle control, cell death, metabolism, adaptation to extreme environmental conditions, 7  cessation of the DNA repair machinery or tumor suppressors and oncogenes. A widely accepted overview of cancer cells characterizes the hallmarks of cancer that are separated in at least six categories (Hanahan and Weinberg, 2011). Manifestation of changes occurring by detrimental alterations on cell homeostasis, orchestrates the malignant transformation of these cells. Self-sufficiency in growth signals, insensitivity to growth-inhibitory signals, evasion of apoptosis, sustained angiogenesis, limitless replication potential and tissue invasion and metastasis are the hallmarks of cancer cells (Hanahan and Weinberg, 2011). Interestingly, an alignment in the biological dependence of tumor cells on those altered pathways was found with viruses. Essentially viruses align their replication utilizing pathways of target cells. The recent findings about those similarities or dependences of viruses on biological pathways of cancer cells were utilized by scientists to alter the viral tropism and manipulate their replication into a cancer specific way. Two main approaches have been taken in order to create advanced oncolytic viruses with specific tropism. The first approach includes deletion of viral genes that are critical for replication of viruses into normal or cancer cells. Essentially specific pathways are required for the activation of replication cycle and due to extensive de-regulation of such pathways in cancer cells. These attempts to alter the viral tropism using pathway dependencies for viral replication have been utilized in the first generation of pre-clinical or clinically approved oncolytic viruses like Adenovirus (Ad): ONYX-015, dl922-947, Herpes Simplex Virus (HSV): G207, R3616, R1716, bM24-TE, Newcastle Disease Virus (NDV), Influenza Virus (IFA), Vesicular Stomatitis Virus (VSV) (Bischoff et al., 1996; O'Shea et al., 2004; Heise et al., 2000; Fueyo et al., 2000; Mineta et al., 1995; Cinatl et al., 2004; Reichard et al., 1992; Kuroda et al., 2006; Stojdl et al., 2003; Muster et al., 2004). The second approach for manipulating viral tropism and selective replication is to engineer viruses with genes responsible for replication controlled by tumor or tissue specific promoters.  The retinoblastoma tumor suppressor protein (pRB) is significantly altered in many human cancers (Sherr, 1996). The same protein is the target of the Conserved Region 2 (CR2) of the Adenovirus protein E1A. Adenoviruses express early genes that inhibit apoptosis and confer limitless replication potential to quiescent cells. Oncolytics based on adenoviruses have been carefully manipulated for these genes with advanced molecular engineering. Mutations on the E1A genes conferred tumor specificity. Dl922-947 is an example of a mutated E1A gene that causes adenoviral based lysis of cells with deregulated cell cycle control while other mutants of adenoviruses target specifically the pRB pathway that is altered in many cancers.   After infection, the early gene products of the virus progeny are extremely important for the viral replication and oncolysis. Another example for tumor specific replication comes from adenoviruses with deleted E1B-55kDa gene. The latter binds to p53 protein and induces its degradation, which essentially leads to apoptosis inhibition that would allow viral replication. Deletion of E1B would allow the virus to enter the cell but since there is 8  no inhibitory effect on p53 since E1B is deleted, the p53 will induce apoptosis and kill the target cell not allowing viral replication. In that scenario tumor specific replication is achieved using those specific oncolytics in tumors with defective p53 pathway that is a very common genetic abnormality in a wide range of human cancers. The idea was ingenious and the first oncolytic to utilize that strategy was ONYX-015 (Bischoff et al., 1996). However, such simple rational biology was not able to generate what was thought to be a tumor specific replication-able oncolytic. It was noted later that the biology of viruses is more complex than initially anticipated and ONYX-015 could also replicate in cells with wild type p53 (Harada and Berk, 1999; O'Shea et al., 2004; Dix et al., 2000). As findings in tumor biology advance, so does the utilization of tumor defects for selective replication of the viruses. Defective interferon response pathway that is normally responsible to initiate apoptosis due to viral infection is commonly attenuated in cancer. Extensive activation of Ras/Raf1/MEK/ERK pathway is also another common genetic abnormality. VSV or NDV oncolytics are usually sensitive to interferon cytokines. However due to the attenuation of this antiviral response in host cells the viruses are able to replicate selectively in tumors (Stojdl et al., 2003; Noser et al., 2007; Lorence et al., 1988; Reichard et al., 1992). Activation of the Ras/MEK pathway in human cancers results in the inhibition of the protein kinase R (PKR) pathway. The latter is a host defense pathway, which halts protein synthesis of virally-infected cells and induces their death. Since activated Ras leads to inactivation of PKR, oncolytics like HSV-1 or Influenza virus A (IFA) are able to conditionally replicate only in cancer cells using this common defect of protein synthesis inhibition in tumors (Smith et al., 2006; Veerapong et al., 2007; Bergmann et al., 2001; Muster et al., 2004). Ras pathway has a central role in tumor initiation, progression and sensitivity to treatment. Being so central in the biological processes that govern tumor cells makes it prone to activation by many different signals stemming from upstream tyrosine kinase receptors or regulatory oncoproteins. Examples of such proteins that potently activate Ras are the Epidermal Growth Factor Receptor (EGFR), or BRAF or many other tyrosine kinases that require Ras activation to signal downstream. In that context Ras can potentially have additional abilities that are utilized by oncolytics for conditional replication in tumors.  Cancer specific replication is a central component of oncolytic virotherapy. Although is a major field of research constitutes an autonomous level for improving viral safety and specificity. This chapter is aiming to determine the methods for tumor specific destruction that can be integrated into a new generation of viruses that would have several levels of controls from virus targeting, replication and induction of apoptosis. The latter is essential   CANCER SPECIFIC PROMOTERS The generation of disease models through transgenic animals was made possible by the identification and use of tissue or organ specific promoters. Specificity of protein 9  expression allows controlling of toxicity and off target effects to non-target cells. The ability to direct the level of gene expression at a specific site was utilized by virologists in order to generate oncolytics that contained genes responsible for viral replication under the control of a tissue specific promoter. Although the approach could not be applied to all the available oncolytic viruses due to restrictions in their biology (i.e. RNA viruses), it could potentially lead to effective agents for directed oncolysis. There are two ways for utilizing promoter specific expression of viral genes. The first is to use promoter sequences from genes that are tumor specific. A representative example of such promoters is the hTERT gene promoter (Huang et al., 2003). Human Telomerase Reverse Transcriptase promoter is highly expressed in tumors with minimal or no expression in normal tissues. The high tumors expression makes it an attractive tool for cancer specific replication of viral genes. An alternative method of using a promoter to confer replication specificity is to use tissue-specific promoters. Characteristic examples of such cases are the PSA (prostate specific antigen) gene promoter for prostate cancers replication the tyrosinase gene promoter for skin cancers or alpha-fetoprotein for liver cancers (Everts and van der Poel, 2005). Although the second approach is rationale-driven and could potentially revolutionize tumor selective replication of viruses, the strength of each promoter system needs to be investigated extensively since a weak promoter would probably diminish the oncolytic potential of a virus. In turn combinatorial approaches could be employed in order to achieve high specificity and increased potency (Nagano et al., 2005).  VIRAL BINDING THROUGH TUMOR-SPECIFIC RECEPTORS The binding and the entry of an oncolytic virus onto and into a cancer cell is a pivotal step for successful tumor destruction. There are many factors that can determine the specificity of each oncolytic to bind to a specific receptor and the complexity that governs the specificity of binding determines the feasibility of molecular engineering of recombinant viruses to target cancer-specific receptors. Adenoviruses enters the cells through endocytosis (Meier and Greber, 2003) after the binding of the fiber knob of the proteins on the viral capsid to the Coxsackie-Adenovirus-Receptor (CAR) on the cell surface. Subsequently it gets internalized through clathrin pits via interaction of integrins on the host cell with the RGD motif on the virus (Hardcastle et al., 2007). HSV based oncolytics use a different set of receptors (Spear, 2004) for viral entry. The tumor necrosis factor family members, proteoglycans and nectin-1 (Gianni et al., 2004) as well as nectin-2 are the host-cell surface receptors that are preferred by HSV without being the only ones. Multiple ligands are also available on the surface of the HSV like glycoproteins gB, gC or gD. In contrast to adenoviruses, HSVs are enveloped viruses which adds an additional step to the entry of the virus into the host cell or another level of complexity. Endocytosis like the adenovirus or fusion with the plasma membrane are the two different routes required for viral entry. However, the choice of the route that the 10  infection is going to follow is not determined by the receptor rather on which cells this receptor is expressed on. Some viruses such as vaccinia have a very broad spectrum of cells that could infect and so far there are no exclusive receptors that these viruses utilize for viral entry (Guo and Bartlett, 2004). CCR5 receptor has been recently shown to allow viral entry to previously not permissive cells but there is limited specificity by this family of viruses in comparison to adenoviruses or HSVs.  The hypothesis is that if the viruses are engineered in a way that can express ligands for specific receptors on the host cell membrane that would allow specific entry to the cell of interest. Researchers are now utilizing bispecific ligands (bind both the receptor on the host cell and receptors on the virus) that are expressed through engineered adenoviruses in order to allow entry through a cancer cell receptor. Likewise there have been attempts to specifically target HSV to EGFR expressing cancer cells through a gD-specific bridging molecule (Nakano et al., 2005) however since HSVs require an additional step namely fusion with the plasma membrane or endocytosis, efforts are now shifted to the separation of those two events in order to generate a more specific strategy for viral entry.   Latest advancements in receptor targeting report the use of domains that present antibody-like characteristics and specificity. However, antibodies are extremely difficult to be engineered in to viral proteins due to their size and their tetrameric form. Also the contain disulphide bonds which increases the complexity and makes it extremely difficult to be utilized for vector retargeting. In order to fill this gap in this technical conundrum single-chain Fragment variables (scFv) were developed which contain the variable region of the heavy and light chains. Proof of principle was obtained using enveloped viruses such as the Measles Virus (MV) for CD20 binding in Hodgkin’s lymphoma (Bucheit et al., 2003) or CD38 in myeloma (Peng et al., 2003). HSVs were also engineered to express scFvs as well as in other enveloped viruses that are generally easier to be genetically manipulated.   VIRAL VECTORS FOR TRANSGENE DELIVERY  There are multiple RNA and DNA viruses that have been or are being used in cancer gene therapy. However, several of them are being used as tools for gene therapy in other diseases like neurodegenerative diseases or diseases with known gene defects. As it was previously mentioned in this chapter Figure 1 shows a virus classification according to their fundamental characteristics. Below the main classes of viruses that are used as a gene delivery methods are described. Anticancer gene transfer can be utilized with any of the vectors described below but with some restrictions in size of the cancer specific apoptosis genes. Since apoptosis is induced in a tumor-cell-specific manner vectors with low oncolytic activity can also be used. Arming oncolytics with cancer-specific apoptosis genes might prove a better approach combining all the levels of specificity that we described above with the potency of an apoptosis-inducing gene.   11  ADENOVIRUSES More than 100 types of adenoviral serotypes have been described so far and have been derived from a wide range of species. Types 2 or 5 are common adenoviruses that most humans have been exposed to. Although natural infection by an adenovirus or gene therapy application would probably be acute and limited adenoviruses have been used in gene therapy applications mostly due to their capacity for gene of interest (~36kb), because of the high expression level of the transgene and because of their safety profile (Vorburger and Hunt, 2002). Adenoviruses do not integrate into the host’s genome and can transduce dividing and non-dividing cells. Having all these advantageous attributes, adenoviruses became one of the most widely used vectors for cancer gene therapy (Thomas et al., 2003). Although superior in many characteristics than other vectors, adenoviruses initiate a rapid and strong immune response, which limits the level of transgene expression while being completely eliminated from the host cells (Green and Seymour, 2002). Strong immunogenic response might benefit tumor destruction but is at the same time extremely dangerous for the patient (Wu et al., 2001). A common drawback for using adenoviruses as gene therapy vectors is the availability of CAR which varies in expression on the membrane of cancer cells (Bergelson et al., 1997). In that sense efforts have been focused on the reduction of the immunogenic response by removing nearly the complete viral genome coding sequences. The latter acquired the name “gutless adenovirus” and requires the help of a helper virus in order to produce viral particles (Koehler et al., 2005; Koehler et al., 2006). Although deficient in the ability of replication as standalone vector, it maintains high infectivity rates and wide tropism. This new generation of adenovirus has been tested in preclinical and clinical models of cancer with promising results but the toxicity of the helper virus remains too high and at a level that is not acceptable for use in human clinical trials. There are many examples of use of adenoviruses for cancer gene therapy mainly serotypes 2 and 5 which were engineered (“armed”) to express suicidal genes, tumor suppressors, immune boosters, oncogenic inhibitors, antigens for tumor vaccines, antiangiogenic factors, prodrug activating genes and many others. Further details will be discussed later about “armed” oncolytics.   ADENO-ASSOCIATED VECTORS (AAVs) As their name imply, AAVs are similar to adenoviruses in many extends, however, they contain a few but fundamental differences which differentiate them from the common adenoviruses. They have a deficiency in replication and pathogenicity that enhances their safety profile and show superiority against adenoviral vectors (Lai et al., 2002). Moreover, AAV infection in humans does not associate with any diseases or specific immunogenic responses. Another fundamental difference but in favor of the adenoviruses this time, is the capacity of AAVs. Gene inserts bigger than 4.8kb cannot be inserted into an AAV vector. Examples of successful use for AAVs in the clinic include hemophilia B, 12  Leber congenital amaurosis, PD and alpha-1 antitrypsin deficiency (Flotte et al., 1996; Kay et al., 2000; Bainbridge et al., 2008; Simonelli et al., 2010). The use of AAVs was extended to cancer with many successful pre-clinical models of many types of cancers using AAV vectors and recently an AAV vector expressing the anticancer genes IL-24 and apoptin was used in a pre-clinical model of hepatocellular carcinoma (Yuan et al., 2013). AAV vestors are currently under pre-clinical development for use in clinical trials while oncolytic Adeno-associated viruses currying the CEA gene are currently being tested for efficacy and safety in stage IV gastric cancer (www.clinicaltrials.gov).   HERPES SIMPLEX VIRUSES  Herpes simplex virus can cause severe lethal encephalitis and it occurs naturally as a pathogen as an enveloped virus. HSV has been extensively used as a viral vector for virotherapy as an oncolytic or as a carrier vector to induce cytotoxic effects. HSV-1 in comparison with other viral vectors especially compared to adenoviral vectors have superior characteristics for cancer virotherapy (Todo, 2008b). It contains a large genome that allows deletion of non-essential genes and insertion of therapeutic genes of interest (153kb is the genome while around 30kb can be entirely deleted). Only minimal infectious virions are needed for a large scale and effective cell killing since it is exceptionally cytolytic. HSV is not an integrating virus so it does not affect the host genome stability and it has itself a very stable DNA genome. It can infect most tumor types and has been extensively investigated in neuronal cells which are normally difficult to transduce and so brain tumor therapy can prove specifically effective using HSV (Todo, 2008a; Mineta et al., 1995). In case of adverse effects in a patient, there are many available anti-virals for HSV that can prevent or calm negative effects of infection.  HSV delivery systems include the DISC system that is name as such from Disable Infectious Single Copy virus. DISC viruses contain a mutant glycoprotein H and are replication defective (Trobridge, 2009). HSV-G207 was the first HSV-1 based virus that was used in a clinical trial in the United States (Markert et al., 2000) and the results have proved the efficacy and potency of the virus. So far the third generation of HSV oncolytics is being developed to improve specificity, tropism and safety. To accomplish that scientists are identifying non-essential genes and delete (alpha47 gene – to create the HSV-G47delta 3rd generation) (Chou et al., 1990; Todo et al., 2001) them in order to induce further an immune response to attack the tumor and better cytotoxic effects (Nayerossadat et al., 2012).  Epstein-Bar viruses (EBVs) are a class of herpes viruses that retain some of the attractive characteristics of the HSVs. EBVs can accommodate large DNA fragments and when inserted into the nucleus they stay as circular episomes allowing long term, non-invasive gene expression. EBVs have natural tropism for B-cells and have been used before to treat B-cell lymphoma and immunotherapy for cancer.  13  POX VIRUSES Vectors derived from poxviruses are used for extremely high cytoplasmic expression of the engineered transgene. The capacity of that vector is relatively big being able to accommodate fragments of 25kb. The high expression and the high capacity are the two major characteristics of the poxviridae family vectors (Moroziewicz and Kaufman, 2005). Gene delivery with Poxviruses has not advanced so far as expected. The complexity of the viruses and the complicated molecular engineering that is required to achieve cloning, production and expression presents as a major barrier for the advancement of this vector as an effective gene delivery option (Gomez et al., 2008; Moss, 1996). For transgene insertion a step of homologous recombination or in vitro ligation is required in order to produce recombinant vaccinia virus (Moss, 1996). There have been some successful attempts to use poxviruses in cancer gene therapy and especially in breast, prostate, colorectal and lung cancer.  RETROVIRUSES-LENTIVIRUSES  Transduction of dividing cells and stable integration of the virus into the host genome are the main characteristics of retroviruses. They are one of the most frequently used delivery vectors for somatic or germline gene therapies. Retroviruses can pass through the nuclear pores of mitotic cells and so they are ideal for in situ treatment. The capacity of retroviruses is relatively restricted (~8kb) after the removal of all the viral genes. They have been used as gene therapy options of X-SCID with great success but with a major fatal disadvantage. They specifically integrated upstream of the lymphoproliferative LMO2 gene and activated this gene so leukemia was the clinical outcome in some patients. This has now been bypassed by use of SIN LTRs or by using lentiviral vectors. Familiar hyperlipidemia was another example of use for the retroviruses however their uses remain extremely restricted in the clinic. Their ability to integrate into the host genome raises safety issues since they can potentially inactivate tumor suppressors or cause oncogene activation.  Lentiviruses are a subclass of retroviruses. They possess the characteristic of the integration into the host genome but they have the superior ability to transduce non-dividing cells making them ideal for gene therapy of neurological diseases. They can accommodate transgenes up to 8kb and can transduce a large number of cells without immunological responses or toxic side effects. Their natural tropism is for neuronal stem cells and they have been extensively used for ex vivo gene delivery in the central nervous system. The integrated transgenes are stably expressed for long periods without having any immunogenicity. Successful use of these vectors has been achieved in PD, metachromatic leukodystrophy, X-Adrenoleukodysrtophy and several immunodefienciencies (WAS, ADA-X SCID). Lentiviruses have also been used for cancer immunotherapy (through enhancement of dendritic cell antigen presentation) of T-cell leukemia or prostate cancer when bound to trastuzumab (Stripecke et al., 2003; 14  Zhang et al., 2009a).   ARMING VIRUSES FOR CYTOTOXIC VIROTHERAPY Per definition, cancer, is the irregular and unrestrained proliferation and multiplication of cells that are able to invade adjacent tissues and are able to metastasize to proxy regions of the body through the bloodstream (Vogelstein and Kinzler, 2004). While chemotherapy and cytotoxic therapy has brought tremendous progress to cancer therapeutics it presents with detrimental side effects that hamper the benefits of the tumor shrinkage or destruction. Common practice so far has been the systemic administration of cytotoxic therapies that instead of affecting the tumor specifically they affect all the human tissues non-specifically and uncontrollably (Meirow and Nugent, 2001). A new era for cancer therapeutics has emerged through the use of targeted and rationale-based therapies using small molecular inhibitors of proteins or pathways that are specifically deregulated in certain cancers. Such examples are the use of tyrosine kinase inhibitors for Epidermal Growth Factor Receptor (EGFR) mutations or amplifications, for Anaplastic lymphoma kinase (ALK) and many other common genetic alterations in cancers. Although initially effective these therapies are not long-lasting since resistance almost always occurs and tumors re-grow and they require more effective treatments like chemotherapy or radiation (Schliemann and Neri, 2007; Friedrich et al., 2004; Ansari et al., 2009; Sasaki et al., 2010). Distinguished among these research endeavors is the concept of oncolytic virotherapy that utilizes wild-type or recombinant viruses to selectively infect and kill cancer cells while leaving normal tissues viable or not affected. There has been an era of rapid development of oncolytics that changed the way we thought of cancer therapy. Specificity and effectiveness are the main challenges that scientists face in order to generate new recombinant viruses but tremendous progress has been achieved through the strategies that were discussed before for viral tropism and specificity. In addition to targeting, strategies are often employed to amplify the cytolytic capabilities of oncolytic viruses to increase their efficacy. This process was named “oncolytic arming” since a transgene is helping the innate cytotoxic ability of a virus (Cattaneo et al., 2008). Arming of a virus requires a careful selection of a viral vector that will be used as oncolytic agent and can be achieved through three major strategies that are discussed below and are: pro-drug oncolytic arming, pro-apoptotic gene arming and microenvironment-regulation-able gene arming.   PRO-DRUG ARMING  Expression of so-called prodrug convertases by the virus is an approach where an non-harmful enzyme is engineered to be expressed as the oncolytic infects specifically the cancer cell. Subsequently, systemic delivery of a pro-drug follows and in cancer cells that are infected with the oncolytic expressing the enzyme, a chain reaction of cell suicide is initiated. This strategy is named gene-directed pro-drug activation therapy and has many 15  examples where it was used with very promising results. One characteristic class of pro-drug arming is the expression of the thymidine kinase gene in HSV vector that is able to monophosphorylate ganciclovir, which in turn is converted to triphosphorylated forms that induce cell death by blocking DNA synthesis (Boviatsis et al., 1994; Chase et al., 1998). Several other systems have been described such as the nitroreductase in combination with the pro-drug CB1954 or the cytosine deaminase (CD) with the pro-drug 5-fluorocytosine, which is forming the chemotherapeutic 5-fluorouracil (5-FU) (Chalikonda et al., 2008; Foloppe et al., 2008). Moreover, fusion of two different enzymes has been employed for increased killing efficacy, in difficult to target cancers. The majority of the viruses that have been used to deliver these genes were non-replicative but recently replication-able oncolytics have been employed for pro-drug suicidal strategy (Wong et al., 2010).  MICROENVIRONMENT GENE MANIPULATION ARMING The microenvironment of tumors is a very complex intercommunicating cell network that supports the solid tumor for its growth and expansion. It consists of host fibroblasts, immune cells, endothelial cells, immune cells and pericyte cells. The tumor is supported by a vast amount of signals that constitute the extracellular matrix (ECM), which dominantly controls tumor vascularization, tumor growth and expansion, invasion and metastasis. The network of signals is a complicated network of secreted proteins that provide structural support for the tumor and its stroma but also is a biological barrier that prevents administration of therapies to the tumor core. The barrier is not only effective against chemical therapeutics. It is preventing the host’s immune cells to attack the tumor protecting it from the most clever and efficacious defense system in nature (immune system). Therefore, the need for agents that would manipulate the tumor microenvironment and convert it to a more permissive barrier became imperative. To this end oncolytics armed with genes that can modify or destroy the tumor microenvironment were generated. The viruses that were employed to carry the microenvironment disseminating genes were armed with anti-angiogenic factors, with chemokine/cytokine that mediate tumor microenvironment or proteases or glycosidases that have a direct effect on stroma stability and structure. Adenoviruses or HSV were armed with inactivating Vascular Endothelial Growth Factor Ligands (VEGF) which stopped the intracellular signaling and reduced the rate of angiogenesis (reviewed in Kaur et al., 2009). Inhibitors of matrix metalloproteinases also achieved modification of angiogenesis where oncolytics carrying the gene Tissue Inhibitor of Metalloproteinase 3, was expressed (Spurbeck et al., 2003; Ahonen et al., 2002; Lamfers et al., 2005; Mahller et al., 2008). Numerous examples of viruses armed with anti-angiogenic peptides, with shRNAs that downregulate fibroblast growth factor receptor (FGFR) signaling, antibodies that would affect interleukin 8 signaling were used with satisfactory results in preclinical and clinical models of many cancers. The network of the proteins that 16  comprise the tumor microenvironment is so complicated that requires extensive knowledge of the signaling networks that are activated due to their expression. The main approach is to identify a way to disseminate the tumor microenvironment and allow the immune system or the oncolytic virus to attack the tumor. For a detailed and a comprehensive review about the tumor microenvironment modulating oncolysis please refer to the work of Chiocca and colleagues (Kaur et al., 2009).    PRO-APOPTOTIC GENES ARMING  One of the cancer hallmarks, as discussed in a previous paragraph, is the inhibition of programmed cell death (apoptosis) whereby tumor cells are unable to commit to their innate suicidal program even in the presence of extensive deregulation of their homeostasis. Research in the apoptosis field has revealed a well-defined network of genes that can induce apoptosis and are inactivated in cancer or genes that can inhibit apoptosis and they are aberrantly expressed in human malignancies. Viral vectors as powerful delivery systems were employed to deliver pro-apototic genes or gene such as tumor suppressors that can deploy the apoptotic response. An early example of the use of viral vectors to deliver pro-apoptotic genes in cancer gene therapy was the use of an adenoviral vector for the expression of the TP53 gene. The China State Drug and Food Administration approved this vector (Gendicine) for the treatment of head and neck cancer but its efficacy was limited due to the non-replicative phenotype (E1A gene deletion) (Peng, 2005). On the other hand oncolytics, which are replication-competent appear as more effective delivery systems especially when armed with apoptosis-inducing genes. One example of an effective oncolytic armed with a tumor suppressor is the generation of an oncolytic adenovirus with E1A under the hTERT and hypoxia response element promoter and the TP53 gene under a cytomegalovirus promoter. This virus combined tumor selectivity, p53 tumor suppressor expression and oncolysis (Wang et al., 2008). Cancer is a multifactorial disease and many signaling pathways are altered during its initiation and progression. An effective strategy would target pathways and avoid single genes in order to induce the apoptosis cascade (Jones et al., 2008). A good example of such approach is the use of TNF-Related Apoptosis-Inducing Ligand  (TRAIL). TRAIL oncolytic gene therapy utilized the chimeric Adenovirus AD5/35 which is able to transduce cancer cells without the use of a receptor, replicate in cancer cells and allow TRAIL expression which lead to apoptosis induction (Chen et al., 2009). Efficacy of this vector was shown in leukemia, gastric cancer and pancreatic cancer in vivo (Zhang et al., 2009b, Jin et al., 2009). TRAIL has been extensively analyzed in a previous chapter of this book since it is one of the “anticancer genes” which are able to promote tumor-specific apoptosis initiation when overexpressed without being toxic in normal cells. MDA7 or NOXA also utilized an adenoviral delivery system to be delivered intratumorally and induced apoptosis in xenograft models of cancers (Suzuki et al., 2009; Sauane et al., 2008). The use of adenoviruses to deliver anticancer genes is based on an 17  obvious scientific rationale. Adenoviruses (as described before) are able to stay as episomes around the host DNA and drive really high expression of the gene of interest. This is particularly important since anticancer genes are able to induce their tumor-killing effects only when they are overexpressed and the level of expression correlates with the apoptotic phenotype. However, extremely high expression of apoptotic gene can impede the advantageous effects of a combinatorial strategy with oncolytics. Premature apoptosis in the infected cells can reduce the virus progeny yields and counteract the oncolytic activity of the virus. An efficacious approach would be to induce apoptosis in a delayed manner in order to allow viral replication, apoptosis induction and lysis of the cells. The principle of these types of genes is that they can be overexpressed but their effect on cell viability is only exerted in cancer cells and not normal cells due to extensive deregulation of pathways that control these genes in human cancers. Most of the “anticancer genes” have been used to arm viruses and have proven their efficacy both in vitro and in vivo. Some of them (HAMLET, TRAIL or MDA7) entered or are entering clinical trials (Hallgren et al., 2008; Inoue et al., 2006; Tong et al., 2005; Fox et al., 2010). A novel approach using the unique characteristics of oncolytic viruses and tumor-specific apoptosis genes can open a new window in cancer therapeutics since the use of anticancer genes introduce an additional step in specificity and efficacy.  HURDLES FOR THE USE OF VIRUSES AS DELIVERY VECTORS While oncolytic virotherapy has emerged rapidly as a treatment option and distinguished itself from cytotoxic therapies, it has not yet reached its full potential due to several limitations or further research that is needed in certain areas. As discussed earlier in this chapter the level of expression of each gene plays an important role for the determination of the therapeutic window. There is an urgent need for the regulation of transgene expression which can be achieved either with the use of specific promoters or with the utilization of regulatory elements that can be controlled exogenously through systemic drug administration (Goverdhana et al., 2005). The expression of the transgene can be coupled with advance in vivo monitoring of expression levels in order to be able to detect signaling pathway alteration after viral administration and in combination with a controllable expression system to manipulate the course of the tumor progression (Winkeler et al., 2007).  There is currently an emerging field of research that is focusing on the use of carrier cells for viral delivery to tumor sites. The reason that this approach is particularly significant is the possibility of pre-existing immunity (Guo et al., 2008). The idea stems from the fact that certain cell types have natural tropism for tumor cells so in principle a cell infected with an oncolytic ex vivo can be injected in order to reach the tumor site and so the oncolytic will lyse this cell and infect the main tumor site. Circumventing pre-existing immunity is a major hurdle that oncolytic virotherapy faces. The majority of human population has previously been exposed to viruses that are used as oncolytics and so the 18  administration of a viral population will be effective only in one round of injection (Guo et al., 2008). Part of the immune response that is initiated after viral infection is the complement activation. Some viruses like the vaccinia or the HSV produce specific proteins that can neutralize the complement activation (Ferguson et al., 2012). However, almost certainly a viral infection will lead to an immune reaction that needs to be suppressed or bypassed for effective oncolytic virotherapy. The process of protecting the viruses from pre-existing immunity or acute immune response is called viral shielding and has the same principle as the “Trojan horse”. Briefly, the immune system is by passed by viruses that are camouflaged under a different capsid or shielded with chemical compounds like polyethylene glycol in order to “trick” the immune system and be deliver to the tumor site. Stem cells, cancer stem cells, endothelial cells and progenitors, immune cells and even cancer cells as carriers have been, or are being tested for their efficacy and proof of principle (Iguchi et al., 2012; Hamada et al., 2007; Stoff-Khalili et al., 2007). Another approach to overcome the pre-existing immunity is the temporal immunosuppression using pharmacologic interference to bypass the adaptive and innate immune response. The latter would allow opening of the therapeutic window till the virus reach the tumor site and start the destruction of tumor cells.  Another obstacle for effective oncolytic virotherapy is the unspecific uptake of the virus by some organs or tissues like lungs, blood or spleen. Vaccinia or adenoviral vectors have been extensively studied for identifying ways to reduce viral uptake by the organs. These ways include pharmacological inhibition of virus-organ interaction or molecular ways by mutating molecules on the surface of the virus to prevent crosstalk with unspecific tissue (Ferguson et al., 2012).  While scientists have taken large steps in understanding the viral biology there are significant gaps in the mosaic of viridae family. One of the major limitations that scientists face is the partial or incomplete knowledge of viruses and that became apparent with the use of ONYX-015 which was found that it can replicate in cells that also had wild type p53 protein. Furthermore, understanding the viral biology is only part of the story. Our detailed knowledge should also be applied to the cancer itself. Current comprehensive approaches to characterize the genetic profile of all the tumors (i.e. The Cancer Genome Atlas-TCGA) provide invaluable information about the molecular basis of each cancer. This information can be used in order to generate new strategies that target several other molecular pathways that are affected in the tumor milieu.  CONCLUSIONS-FUTURE OF THE FIELD  Oncolytic virotherapy with viruses armed with anticancer genes is inevitably going to be a new big player in the field of virotherapy. The ultimate goal for each medical filed is to be able to apply the scientific finding and the years of research in pre-clinical and clinical models to human patients. To achieve that, three major milestones need to be accomplished: increased safety, enhanced efficiency and improved knowledge of the 19  tumors. Infectious agents as are the viruses need to be carefully handled and primarily tightly controlled since apart from only being cleverly engineered to be immunoinvasive for the tumors they have to be carefully control to protect the patient and the patient environment. Arming oncolytics should be the future directions of the field. Above discussed are the advantages of oncolytic arming. However, careful consideration should be given to the choice of transgenes that will be used for arming. Pro-apoptotic genes that have no other control features are obviously dangerous and unacceptable. Fortunately, oncolytics have their own control systems as they were discussed in previous paragraphs so arming them with genes that when overexpressed can induce apoptosis only in cancer cells can be a clever strategy to move forward. A fundamental paradigm of cancer treatment is that there is no unique and stand-alone therapeutic regiment that will cure cancer. The aforementioned relative de-motivating statement stems from the fact that is from its nature a multifactorial disease. Combinatorial approaches that have already been taken proved more efficient that mono-therapies and when oncolytics where combined with cytotoxic therapies the disease progression was the majority of the times improved. Cancer therapeutics were recently improved by the utilization of rationale-based therapies using small molecule inhibitors targeted against specific molecular pathways that are deregulated in cancer cells (Aggarwal, 2010). Non-small cell lung adenocarcinomas are great examples of a lung cancer types that have benefited from the use of targeted therapies with unprecedented initial responses and limited side effects (Pal et al., 2010). However, acquired resistance to the drug almost always occurs, so oncolytics armed with anticancer genes should be utilized to enhance the effects of small molecule inhibitors and to prevent development of drug resistance which will ultimately lead to disease improvement and amended clinical outcome. Research is already directed towards the use of combinatorial approaches of targeted therapies and oncolytics as clinical successes in melanoma and glioblastoma multiforme (Msaouel et al., 2013; Clarke et al., 2010; Donnelly et al., 2012; Natarajan et al., 2011) denote. We are entering an era where we possess the tools, we are able to use new technologies and the time has come to use them in our favor.  Bibliography AGGARWAL, S. 2010. Targeted cancer therapies. Nat Rev Drug Discov, 9, 427-8. AHONEN, M., ALA-AHO, R., BAKER, A. H., GEORGE, S. J., GRENMAN, R., SAARIALHO-KERE, U. & KAHARI, V. M. 2002. Antitumor activity and bystander effect of adenovirally delivered tissue inhibitor of metalloproteinases-3. Mol Ther, 5, 705-15. AIUTI, A., BIASCO, L., SCARAMUZZA, S., FERRUA, F., CICALESE, M. P., BARICORDI, C., DIONISIO, F., CALABRIA, A., GIANNELLI, S., CASTIELLO, M. C., BOSTICARDO, M., EVANGELIO, C., ASSANELLI, A., CASIRAGHI, M., DI NUNZIO, S., CALLEGARO, L., BENATI, C., RIZZARDI, 20  P., PELLIN, D., DI SERIO, C., SCHMIDT, M., VON KALLE, C., GARDNER, J., MEHTA, N., NEDUVA, V., DOW, D. J., GALY, A., MINIERO, R., FINOCCHI, A., METIN, A., BANERJEE, P. P., ORANGE, J. S., GALIMBERTI, S., VALSECCHI, M. G., BIFFI, A., MONTINI, E., VILLA, A., CICERI, F., RONCAROLO, M. G. & NALDINI, L. 2013. Lentiviral hematopoietic stem cell gene therapy in patients with Wiskott-Aldrich syndrome. Science, 341, 1233151. AIUTI, A., SLAVIN, S., AKER, M., FICARA, F., DEOLA, S., MORTELLARO, A., MORECKI, S., ANDOLFI, G., TABUCCHI, A., CARLUCCI, F., MARINELLO, E., CATTANEO, F., VAI, S., SERVIDA, P., MINIERO, R., RONCAROLO, M. G. & BORDIGNON, C. 2002. Correction of ADA-SCID by stem cell gene therapy combined with nonmyeloablative conditioning. Science, 296, 2410-3. ALVAREZ-BRECKENRIDGE, C., KAUR, B. & CHIOCCA, E. A. 2009. Pharmacologic and chemical adjuvants in tumor virotherapy. Chem Rev, 109, 3125-40. ANSARI, J., PALMER, D. H., REA, D. W. & HUSSAIN, S. A. 2009. Role of tyrosine kinase inhibitors in lung cancer. Anticancer Agents Med Chem, 9, 569-75. BAINBRIDGE, J.W., SMITH, A.J., BARKER, S.S., ROBBIE, S., HENDERSON, R, BALAGGAN, K., VISWANATHAN, A., HOLDER, G.E., STOCKMAN, A., TYLER, N., PETERSEN-JONES, S., BHATTACHARYA, S.S., THRASHER, A.J., FITZKE, F.W., CARTER, B.J., RUBIN, G.S., MOORE, A.T., ALI, R.R. 2008. Effect of gene therapy on visual function in Leber's congenital amaurosis. N Engl J Med., 358(21), 2231-9. BERGELSON, J. M., CUNNINGHAM, J. A., DROGUETT, G., KURT-JONES, E. A., KRITHIVAS, A., HONG, J. S., HORWITZ, M. S., CROWELL, R. L. & FINBERG, R. W. 1997. Isolation of a common receptor for Coxsackie B viruses and adenoviruses 2 and 5. Science, 275, 1320-3. BERGMANN, M., ROMIRER, I., SACHET, M., FLEISCHHACKER, R., GARCIA-SASTRE, A., PALESE, P., WOLFF, K., PEHAMBERGER, H., JAKESZ, R. & MUSTER, T. 2001. A genetically engineered influenza A virus with ras-dependent oncolytic properties. Cancer Res, 61, 8188-93. BIFFI, A., MONTINI, E., LORIOLI, L., CESANI, M., FUMAGALLI, F., PLATI, T., BALDOLI, C., MARTINO, S., CALABRIA, A., CANALE, S., BENEDICENTI, F., VALLANTI, G., BIASCO, L., LEO, S., KABBARA, N., ZANETTI, G., RIZZO, W. B., MEHTA, N. A., CICALESE, M. P., CASIRAGHI, M., BOELENS, J. J., DEL CARRO, U., DOW, D. J., SCHMIDT, M., ASSANELLI, A., NEDUVA, V., DI SERIO, C., STUPKA, E., GARDNER, J., VON KALLE, C., BORDIGNON, C., CICERI, F., ROVELLI, A., RONCAROLO, M. G., AIUTI, A., SESSA, M. & NALDINI, L. 2013. Lentiviral hematopoietic stem cell gene therapy benefits metachromatic leukodystrophy. Science, 341, 1233158. BISCHOFF, J. R., KIRN, D. H., WILLIAMS, A., HEISE, C., HORN, S., MUNA, M., NG, L., NYE, J. A., SAMPSON-JOHANNES, A., FATTAEY, A. & 21  MCCORMICK, F. 1996. An adenovirus mutant that replicates selectively in p53-deficient human tumor cells. Science, 274, 373-6. BOVIATSIS, E. J., PARK, J. S., SENA-ESTEVES, M., KRAMM, C. M., CHASE, M., EFIRD, J. T., WEI, M. X., BREAKEFIELD, X. O. & CHIOCCA, E. A. 1994. Long-term survival of rats harboring brain neoplasms treated with ganciclovir and a herpes simplex virus vector that retains an intact thymidine kinase gene. Cancer Res, 54, 5745-51. BOZTUG, K., SCHMIDT, M., SCHWARZER, A., BANERJEE, P. P., DIEZ, I. A., DEWEY, R. A., BOHM, M., NOWROUZI, A., BALL, C. R., GLIMM, H., NAUNDORF, S., KUHLCKE, K., BLASCZYK, R., KONDRATENKO, I., MARODI, L., ORANGE, J. S., VON KALLE, C. & KLEIN, C. 2010. Stem-cell gene therapy for the Wiskott-Aldrich syndrome. N Engl J Med, 363, 1918-27. BUCHEIT, A. D., KUMAR, S., GROTE, D. M., LIN, Y., VON MESSLING, V., CATTANEO, R. B. & FIELDING, A. K. 2003. An oncolytic measles virus engineered to enter cells through the CD20 antigen. Mol Ther, 7, 62-72. CARTIER, N. & AUBOURG, P. 2010. Hematopoietic stem cell transplantation and hematopoietic stem cell gene therapy in X-linked adrenoleukodystrophy. Brain Pathol, 20, 857-62. CARTIER, N., HACEIN-BEY-ABINA, S., BARTHOLOMAE, C. C., VERES, G., SCHMIDT, M., KUTSCHERA, I., VIDAUD, M., ABEL, U., DAL-CORTIVO, L., CACCAVELLI, L., MAHLAOUI, N., KIERMER, V., MITTELSTAEDT, D., BELLESME, C., LAHLOU, N., LEFRERE, F., BLANCHE, S., AUDIT, M., PAYEN, E., LEBOULCH, P., L'HOMME, B., BOUGNERES, P., VON KALLE, C., FISCHER, A., CAVAZZANA-CALVO, M. & AUBOURG, P. 2009. Hematopoietic stem cell gene therapy with a lentiviral vector in X-linked adrenoleukodystrophy. Science, 326, 818-23. CATTANEO, R. 2010. Paramyxovirus entry and targeted vectors for cancer therapy. PLoS Pathog, 6, e1000973. CATTANEO, R., MIEST, T., SHASHKOVA, E. V. & BARRY, M. A. 2008. Reprogrammed viruses as cancer therapeutics: targeted, armed and shielded. Nat Rev Microbiol, 6, 529-40. CHALIKONDA, S., KIVLEN, M. H., O'MALLEY, M. E., ERIC DONG, X. D., MCCART, J. A., GORRY, M. C., YIN, X. Y., BROWN, C. K., ZEH, H. J., 3RD, GUO, Z. S. & BARTLETT, D. L. 2008. Oncolytic virotherapy for ovarian carcinomatosis using a replication-selective vaccinia virus armed with a yeast cytosine deaminase gene. Cancer Gene Ther, 15, 115-25. CHASE, M., CHUNG, R. Y. & CHIOCCA, E. A. 1998. An oncolytic viral mutant that delivers the CYP2B1 transgene and augments cyclophosphamide chemotherapy. Nat Biotechnol, 16, 444-8. 22  CHEN, L., CHEN, D., GONG, M., NA, M., LI, L., WU, H., JIANG, L., QIAN, Y., FANG, G. & XUE, X. 2009. Concomitant use of Ad5/35 chimeric oncolytic adenovirus with TRAIL gene and taxol produces synergistic cytotoxicity in gastric cancer cells. Cancer Lett, 284, 141-8. CHOU, J., KERN, E. R., WHITLEY, R. J. & ROIZMAN, B. 1990. Mapping of herpes simplex virus-1 neurovirulence to gamma 134.5, a gene nonessential for growth in culture. Science, 250, 1262-6. CINATL, J., JR., MICHAELIS, M., DRIEVER, P. H., CINATL, J., HRABETA, J., SUHAN, T., DOERR, H. W. & VOGEL, J. U. 2004. Multimutated herpes simplex virus g207 is a potent inhibitor of angiogenesis. Neoplasia, 6, 725-35. CIRAK, S., ARECHAVALA-GOMEZA, V., GUGLIERI, M., FENG, L., TORELLI, S., ANTHONY, K., ABBS, S., GARRALDA, M. E., BOURKE, J., WELLS, D. J., DICKSON, G., WOOD, M. J., WILTON, S. D., STRAUB, V., KOLE, R., SHREWSBURY, S. B., SEWRY, C., MORGAN, J. E., BUSHBY, K. & MUNTONI, F. 2011. Exon skipping and dystrophin restoration in patients with Duchenne muscular dystrophy after systemic phosphorodiamidate morpholino oligomer treatment: an open-label, phase 2, dose-escalation study. Lancet, 378, 595-605. CLARKE, J., BUTOWSKI, N. & CHANG, S. 2010. Recent advances in therapy for glioblastoma. Arch Neurol, 67, 279-83. DIX, B. R., O'CARROLL, S. J., MYERS, C. J., EDWARDS, S. J. & BRAITHWAITE, A. W. 2000. Efficient induction of cell death by adenoviruses requires binding of E1B55k and p53. Cancer Res, 60, 2666-72. DONNELLY, O. G., MELCHER, A. A., VILE, R. G. & PULIDO, J. 2012. What new immunotherapeutic techniques are currently being investigated for the treatment of melanoma? Immunotherapy, 4, 749-51. DOYLE, T. C., BURNS, S. M. & CONTAG, C. H. 2004. In vivo bioluminescence imaging for integrated studies of infection. Cell Microbiol, 6, 303-17. EGEBLAD, M. & WERB, Z. 2002. New functions for the matrix metalloproteinases in cancer progression. Nat Rev Cancer, 2, 161-74. EVERTS, B. & VAN DER POEL, H. G. 2005. Replication-selective oncolytic viruses in the treatment of cancer. Cancer Gene Ther, 12, 141-61. FERGUSON, M. S., LEMOINE, N. R. & WANG, Y. 2012. Systemic delivery of oncolytic viruses: hopes and hurdles. Adv Virol, 2012, 805629. FLOTTE, T., CARTER, B., CONRAD, C., GUGGINO, W., REYNOLDS, T., ROSENSTEIN, B., TAYLOR, G., WALDEN, S. & WETZEL, R. 1996. A phase I 23  study of an adeno-associated virus-CFTR gene vector in adult CF patients with mild lung disease. Hum Gene Ther, 7, 1145-59. FOLOPPE, J., KINTZ, J., FUTIN, N., FINDELI, A., CORDIER, P., SCHLESINGER, Y., HOFFMANN, C., TOSCH, C., BALLOUL, J. M. & ERBS, P. 2008. Targeted delivery of a suicide gene to human colorectal tumors by a conditionally replicating vaccinia virus. Gene Ther, 15, 1361-71. FOX, N. L., HUMPHREYS, R., LUSTER, T. A., KLEIN, J. & GALLANT, G. 2010. Tumor Necrosis Factor-related apoptosis-inducing ligand (TRAIL) Receptor-1 and Receptor-2 agonists for cancer therapy. Expert Opin Biol Ther, 10, 1-18. FRIEDRICH, I., SHIR, A., KLEIN, S. & LEVITZKI, A. 2004. RNA molecules as anti-cancer agents. Semin Cancer Biol, 14, 223-30. FUEYO, J., GOMEZ-MANZANO, C., ALEMANY, R., LEE, P. S., MCDONNELL, T. J., MITLIANGA, P., SHI, Y. X., LEVIN, V. A., YUNG, W. K. & KYRITSIS, A. P. 2000. A mutant oncolytic adenovirus targeting the Rb pathway produces anti-glioma effect in vivo. Oncogene, 19, 2-12. GIANNI, T., CAMPADELLI-FIUME, G. & MENOTTI, L. 2004. Entry of herpes simplex virus mediated by chimeric forms of nectin1 retargeted to endosomes or to lipid rafts occurs through acidic endosomes. J Virol, 78, 12268-76. GOMEZ, C. E., NAJERA, J. L., KRUPA, M. & ESTEBAN, M. 2008. The poxvirus vectors MVA and NYVAC as gene delivery systems for vaccination against infectious diseases and cancer. Curr Gene Ther, 8, 97-120. GOVERDHANA, S., PUNTEL, M., XIONG, W., ZIRGER, J. M., BARCIA, C., CURTIN, J. F., SOFFER, E. B., MONDKAR, S., KING, G. D., HU, J., SCIASCIA, S. A., CANDOLFI, M., GREENGOLD, D. S., LOWENSTEIN, P. R. & CASTRO, M. G. 2005. Regulatable gene expression systems for gene therapy applications: progress and future challenges. Mol Ther, 12, 189-211. GREEN, N. K. & SEYMOUR, L. W. 2002. Adenoviral vectors: systemic delivery and tumor targeting. Cancer Gene Ther, 9, 1036-42. GRIMM, S. & NOTEBORN, M. 2010. Anticancer genes: inducers of tumour-specific cell death signalling. Trends Mol Med, 16, 88-96. GUO, Z. S. & BARTLETT, D. L. 2004. Vaccinia as a vector for gene delivery. Expert Opin Biol Ther, 4, 901-17. GUO, Z. S., THORNE, S. H. & BARTLETT, D. L. 2008. Oncolytic virotherapy: molecular targets in tumor-selective replication and carrier cell-mediated delivery of oncolytic viruses. Biochim Biophys Acta, 1785, 217-31. 24  HALLGREN, O., AITS, S., BREST, P., GUSTAFSSON, L., MOSSBERG, A. K., WULLT, B. & SVANBORG, C. 2008. Apoptosis and tumor cell death in response to HAMLET (human alpha-lactalbumin made lethal to tumor cells). Adv Exp Med Biol, 606, 217-40. HAMADA, K., DESAKI, J., NAKAGAWA, K., ZHANG, T., SHIRAKAWA, T., GOTOH, A. & TAGAWA, M. 2007. Carrier cell-mediated delivery of a replication-competent adenovirus for cancer gene therapy. Mol Ther, 15, 1121-8. HANAHAN, D. & WEINBERG, R. A. 2011. Hallmarks of cancer: the next generation. Cell, 144, 646-74. HARADA, J. N. & BERK, A. J. 1999. p53-Independent and -dependent requirements for E1B-55K in adenovirus type 5 replication. J Virol, 73, 5333-44. HARDCASTLE, J., KUROZUMI, K., CHIOCCA, E. A. & KAUR, B. 2007. Oncolytic viruses driven by tumor-specific promoters. Curr Cancer Drug Targets, 7, 181-9. HEISE, C., HERMISTON, T., JOHNSON, L., BROOKS, G., SAMPSON-JOHANNES, A., WILLIAMS, A., HAWKINS, L. & KIRN, D. 2000. An adenovirus E1A mutant that demonstrates potent and selective systemic anti-tumoral efficacy. Nat Med, 6, 1134-9. HOSTER, H. A., ZANES, R. P., JR. & VON HAAM, E. 1949. Studies in Hodgkin's syndrome; the association of viral hepatitis and Hodgkin's disease; a preliminary report. Cancer Res, 9, 473-80. HUANG, T. G., SAVONTAUS, M. J., SHINOZAKI, K., SAUTER, B. V. & WOO, S. L. 2003. Telomerase-dependent oncolytic adenovirus for cancer treatment. Gene Ther, 10, 1241-7. IGUCHI, K., SAKURAI, F., TOMITA, K., KATAYAMA, K., YAMAGUCHI, T., KAWABATA, K., TAGAWA, M., KAWABATA, M., SHIRAKAWA, T. & MIZUGUCHI, H. 2012. Efficient antitumor effects of carrier cells loaded with a fiber-substituted conditionally replicating adenovirus on CAR-negative tumor cells. Cancer Gene Ther, 19, 118-25. INOUE, S., SHANKER, M., MIYAHARA, R., GOPALAN, B., PATEL, S., OIDA, Y., BRANCH, C. D., MUNSHI, A., MEYN, R. E., ANDREEFF, M., TANAKA, F., MHASHILKAR, A. M., CHADA, S. & RAMESH, R. 2006. MDA-7/IL-24-based cancer gene therapy: translation from the laboratory to the clinic. Curr Gene Ther, 6, 73-91. JIN, J., LIU, H., YANG, C., LI, G., LIU, X., QIAN, Q. & QIAN, W. 2009. Effective gene-viral therapy of leukemia by a new fiber chimeric oncolytic adenovirus expressing TRAIL: in vitro and in vivo evaluation. Mol Cancer Ther, 8, 1387-97. 25  JONES, S., ZHANG, X., PARSONS, D. W., LIN, J. C., LEARY, R. J., ANGENENDT, P., MANKOO, P., CARTER, H., KAMIYAMA, H., JIMENO, A., HONG, S. M., FU, B., LIN, M. T., CALHOUN, E. S., KAMIYAMA, M., WALTER, K., NIKOLSKAYA, T., NIKOLSKY, Y., HARTIGAN, J., SMITH, D. R., HIDALGO, M., LEACH, S. D., KLEIN, A. P., JAFFEE, E. M., GOGGINS, M., MAITRA, A., IACOBUZIO-DONAHUE, C., ESHLEMAN, J. R., KERN, S. E., HRUBAN, R. H., KARCHIN, R., PAPADOPOULOS, N., PARMIGIANI, G., VOGELSTEIN, B., VELCULESCU, V. E. & KINZLER, K. W. 2008. Core signaling pathways in human pancreatic cancers revealed by global genomic analyses. Science, 321, 1801-6. KAUR, B., CRIPE, T. P. & CHIOCCA, E. A. 2009. \"Buy one get one free\": armed viruses for the treatment of cancer cells and their microenvironment. Curr Gene Ther, 9, 341-55. KAY, M. A., MANNO, C. S., RAGNI, M. V., LARSON, P. J., COUTO, L. B., MCCLELLAND, A., GLADER, B., CHEW, A. J., TAI, S. J., HERZOG, R. W., ARRUDA, V., JOHNSON, F., SCALLAN, C., SKARSGARD, E., FLAKE, A. W. & HIGH, K. A. 2000. Evidence for gene transfer and expression of factor IX in haemophilia B patients treated with an AAV vector. Nat Genet, 24, 257-61. KELLY, E. & RUSSELL, S. J. 2007. History of oncolytic viruses: genesis to genetic engineering. Mol Ther, 15, 651-9. KINALI, M., ARECHAVALA-GOMEZA, V., FENG, L., CIRAK, S., HUNT, D., ADKIN, C., GUGLIERI, M., ASHTON, E., ABBS, S., NIHOYANNOPOULOS, P., GARRALDA, M. E., RUTHERFORD, M., MCCULLEY, C., POPPLEWELL, L., GRAHAM, I. R., DICKSON, G., WOOD, M. J., WELLS, D. J., WILTON, S. D., KOLE, R., STRAUB, V., BUSHBY, K., SEWRY, C., MORGAN, J. E. & MUNTONI, F. 2009. Local restoration of dystrophin expression with the morpholino oligomer AVI-4658 in Duchenne muscular dystrophy: a single-blind, placebo-controlled, dose-escalation, proof-of-concept study. Lancet Neurol, 8, 918-28. KLENK, H. D. & GARTEN, W. 1994. Host cell proteases controlling virus pathogenicity. Trends Microbiol, 2, 39-43. KOEHLER, D. R., FRNDOVA, H., LEUNG, K., LOUCA, E., PALMER, D., NG, P., MCKERLIE, C., COX, P., COATES, A. L. & HU, J. 2005. Aerosol delivery of an enhanced helper-dependent adenovirus formulation to rabbit lung using an intratracheal catheter. J Gene Med, 7, 1409-20. KOEHLER, D. R., MARTIN, B., COREY, M., PALMER, D., NG, P., TANSWELL, A. K. & HU, J. 2006. Readministration of helper-dependent adenovirus to mouse lung. Gene Ther, 13, 773-80. 26  KUMAR, S., GAO, L., YEAGY, B. & REID, T. 2008. Virus combinations and chemotherapy for the treatment of human cancers. Curr Opin Mol Ther, 10, 371-9. KURODA, T., RABKIN, S. D. & MARTUZA, R. L. 2006. Effective treatment of tumors with strong beta-catenin/T-cell factor activity by transcriptionally targeted oncolytic herpes simplex virus vector. Cancer Res, 66, 10127-35. LAI, C. M., LAI, Y. K. & RAKOCZY, P. E. 2002. Adenovirus and adeno-associated virus vectors. DNA Cell Biol, 21, 895-913. LAMFERS, M. L., GIANNI, D., TUNG, C. H., IDEMA, S., SCHAGEN, F. H., CARETTE, J. E., QUAX, P. H., VAN BEUSECHEM, V. W., VANDERTOP, W. P., DIRVEN, C. M., CHIOCCA, E. A. & GERRITSEN, W. R. 2005. Tissue inhibitor of metalloproteinase-3 expression from an oncolytic adenovirus inhibits matrix metalloproteinase activity in vivo without affecting antitumor efficacy in malignant glioma. Cancer Res, 65, 9398-405. LEWITT, P. A., REZAI, A. R., LEEHEY, M. A., OJEMANN, S. G., FLAHERTY, A. W., ESKANDAR, E. N., KOSTYK, S. K., THOMAS, K., SARKAR, A., SIDDIQUI, M. S., TATTER, S. B., SCHWALB, J. M., POSTON, K. L., HENDERSON, J. M., KURLAN, R. M., RICHARD, I. H., VAN METER, L., SAPAN, C. V., DURING, M. J., KAPLITT, M. G. & FEIGIN, A. 2011. AAV2-GAD gene therapy for advanced Parkinson's disease: a double-blind, sham-surgery controlled, randomised trial. Lancet Neurol, 10, 309-19. LORENCE, R. M., ROOD, P. A. & KELLEY, K. W. 1988. Newcastle disease virus as an antineoplastic agent: induction of tumor necrosis factor-alpha and augmentation of its cytotoxicity. J Natl Cancer Inst, 80, 1305-12. MAHLLER, Y. Y., VAIKUNTH, S. S., RIPBERGER, M. C., BAIRD, W. H., SAEKI, Y., CANCELAS, J. A., CROMBLEHOLME, T. M. & CRIPE, T. P. 2008. Tissue inhibitor of metalloproteinase-3 via oncolytic herpesvirus inhibits tumor growth and vascular progenitors. Cancer Res, 68, 1170-9. MARKERT, J. M., MEDLOCK, M. D., RABKIN, S. D., GILLESPIE, G. Y., TODO, T., HUNTER, W. D., PALMER, C. A., FEIGENBAUM, F., TORNATORE, C., TUFARO, F. & MARTUZA, R. L. 2000. Conditionally replicating herpes simplex virus mutant, G207 for the treatment of malignant glioma: results of a phase I trial. Gene Ther, 7, 867-74. MEIER, O. & GREBER, U. F. 2003. Adenovirus endocytosis. J Gene Med, 5, 451-62. MEIROW, D. & NUGENT, D. 2001. The effects of radiotherapy and chemotherapy on female reproduction. Hum Reprod Update, 7, 535-43. 27  MINETA, T., RABKIN, S. D., YAZAKI, T., HUNTER, W. D. & MARTUZA, R. L. 1995. Attenuated multi-mutated herpes simplex virus-1 for the treatment of malignant gliomas. Nat Med, 1, 938-43. MORLING, F. J., PENG, K. W., COSSET, F. L. & RUSSELL, S. J. 1997. Masking of retroviral envelope functions by oligomerizing polypeptide adaptors. Virology, 234, 51-61. MOROZIEWICZ, D. & KAUFMAN, H. L. 2005. Gene therapy with poxvirus vectors. Curr Opin Mol Ther, 7, 317-25. MOSS, B. 1996. Genetically engineered poxviruses for recombinant gene expression, vaccination, and safety. Proc Natl Acad Sci U S A, 93, 11341-8. MSAOUEL, P., DISPENZIERI, A. & GALANIS, E. 2009. Clinical testing of engineered oncolytic measles virus strains in the treatment of cancer: an overview. Curr Opin Mol Ther, 11, 43-53. MSAOUEL, P., OPYRCHAL, M., DOMINGO MUSIBAY, E. & GALANIS, E. 2013. Oncolytic measles virus strains as novel anticancer agents. Expert Opin Biol Ther, 13, 483-502. MUSTER, T., RAJTAROVA, J., SACHET, M., UNGER, H., FLEISCHHACKER, R., ROMIRER, I., GRASSAUER, A., URL, A., GARCIA-SASTRE, A., WOLFF, K., PEHAMBERGER, H. & BERGMANN, M. 2004. Interferon resistance promotes oncolysis by influenza virus NS1-deletion mutants. Int J Cancer, 110, 15-21. NAGANO, S., OSHIKA, H., FUJIWARA, H., KOMIYA, S. & KOSAI, K. 2005. An efficient construction of conditionally replicating adenoviruses that target tumor cells with multiple factors. Gene Ther, 12, 1385-93. NAKANO, K., ASANO, R., TSUMOTO, K., KWON, H., GOINS, W. F., KUMAGAI, I., COHEN, J. B. & GLORIOSO, J. C. 2005. Herpes simplex virus targeting to the EGF receptor by a gD-specific soluble bridging molecule. Mol Ther, 11, 617-26. NATARAJAN, N., TELANG, S., MILLER, D. & CHESNEY, J. 2011. Novel immunotherapeutic agents and small molecule antagonists of signalling kinases for the treatment of metastatic melanoma. Drugs, 71, 1233-50. NAYEROSSADAT, N., MAEDEH, T. & ALI, P. A. 2012. Viral and nonviral delivery systems for gene delivery. Adv Biomed Res, 1, 27. NOSER, J. A., MAEL, A. A., SAKUMA, R., OHMINE, S., MARCATO, P., LEE, P. W. & IKEDA, Y. 2007. The RAS/Raf1/MEK/ERK signaling pathway facilitates VSV-mediated oncolysis: implication for the defective interferon response in cancer cells. Mol Ther, 15, 1531-6. 28  O'SHEA, C. C., JOHNSON, L., BAGUS, B., CHOI, S., NICHOLAS, C., SHEN, A., BOYLE, L., PANDEY, K., SORIA, C., KUNICH, J., SHEN, Y., HABETS, G., GINZINGER, D. & MCCORMICK, F. 2004. Late viral RNA export, rather than p53 inactivation, determines ONYX-015 tumor selectivity. Cancer Cell, 6, 611-23. PAL, S. K., FIGLIN, R. A. & RECKAMP, K. 2010. Targeted therapies for non-small cell lung cancer: an evolving landscape. Mol Cancer Ther, 9, 1931-44. PALFI, S., GURRUCHAGA, J.M.,, RALPH, S.G., LEPETIT, H., LAVISSE, S., BUTTERY, P. C., WATTS C., MISKIN, J., KELLEHER, M., DEELEY, S., IWAMURO, H, LEFAUCHEUR, J. P., THIRIEZ, C., FENELON, G., LUCAS, C., BRUGIÈRES, P., GABRIEL, I., ABHAY, K., DROUOT, X., TANI, N., KAS, A., GHALEH, B., CORVOISIER, P.L., DOLPHIN, P., BREEN, D. P., MASON, S., GUZMAN, N. V., MAZARAKIS N.D., RADCLIFFE P.A., HARROP R., KINGSMAN, S.M., RASCO,L O., NAYLOR S., BARKER, R. A., HANTRAYE, P., REMY, P., CESARO, P., MITROPHANOUS K.A.2013. Long-term safety and tolerability of ProSavin, a lentiviral vector-based gene therapy for Parkinson’s disease: a dose escalation, open-label, phase 1/2 trial Lancet, 382  PASSINI, M. A., BU, J., RICHARDS, A. M., KINNECOM, C., SARDI, S. P., STANEK, L. M., HUA, Y., RIGO, F., MATSON, J., HUNG, G., KAYE, E. M., SHIHABUDDIN, L. S., KRAINER, A. R., BENNETT, C. F. & CHENG, S. H. 2011. Antisense oligonucleotides delivered to the mouse CNS ameliorate symptoms of severe spinal muscular atrophy. Sci Transl Med, 3, 72ra18. PENG, K. W., DONOVAN, K. A., SCHNEIDER, U., CATTANEO, R., LUST, J. A. & RUSSELL, S. J. 2003. Oncolytic measles viruses displaying a single-chain antibody against CD38, a myeloma cell marker. Blood, 101, 2557-62. PENG, K. W., HADAC, E. M., ANDERSON, B. D., MYERS, R., HARVEY, M., GREINER, S. M., SOEFFKER, D., FEDERSPIEL, M. J. & RUSSELL, S. J. 2006. Pharmacokinetics of oncolytic measles virotherapy: eventual equilibrium between virus and tumor in an ovarian cancer xenograft model. Cancer Gene Ther, 13, 732-8. PENG, K. W., VILE, R., COSSET, F. L. & RUSSELL, S. 1999. Selective transduction of protease-rich tumors by matrix-metalloproteinase-targeted retroviral vectors. Gene Ther, 6, 1552-7. PENG, Z. 2005. Current status of gendicine in China: recombinant human Ad-p53 agent for treatment of cancers. Hum Gene Ther, 16, 1016-27. PIWNICA-WORMS, D., SCHUSTER, D. P. & GARBOW, J. R. 2004. Molecular imaging of host-pathogen interactions in intact small animals. Cell Microbiol, 6, 319-31. 29  REICHARD, K. W., LORENCE, R. M., CASCINO, C. J., PEEPLES, M. E., WALTER, R. J., FERNANDO, M. B., REYES, H. M. & GREAGER, J. A. 1992. Newcastle disease virus selectively kills human tumor cells. J Surg Res, 52, 448-53. SASAKI, T., RODIG, S. J., CHIRIEAC, L. R. & JANNE, P. A. 2010. The biology and treatment of EML4-ALK non-small cell lung cancer. Eur J Cancer, 46, 1773-80. SAUANE, M., SU, Z. Z., GUPTA, P., LEBEDEVA, I. V., DENT, P., SARKAR, D. & FISHER, P. B. 2008. Autocrine regulation of mda-7/IL-24 mediates cancer-specific apoptosis. Proc Natl Acad Sci U S A, 105, 9763-8. SCHLIEMANN, C. & NERI, D. 2007. Antibody-based targeting of the tumor vasculature. Biochim Biophys Acta, 1776, 175-92. SHERR, C. J. 1996. Cancer cell cycles. Science, 274, 1672-7. SIMONELLI, F., MAGUIRE, A. M., TESTA, F., PIERCE, E. A., MINGOZZI, F., BENNICELLI, J. L., ROSSI, S., MARSHALL, K., BANFI, S., SURACE, E. M., SUN, J., REDMOND, T. M., ZHU, X., SHINDLER, K. S., YING, G. S., ZIVIELLO, C., ACERRA, C., WRIGHT, J. F., MCDONNELL, J. W., HIGH, K. A., BENNETT, J. & AURICCHIO, A. 2010. Gene therapy for Leber's congenital amaurosis is safe and effective through 1.5 years after vector administration. Mol Ther, 18, 643-50. SINKOVICS, J. & HORVATH, J. 1993. New developments in the virus therapy of cancer: a historical review. Intervirology, 36, 193-214. SMITH, K. D., MEZHIR, J. J., BICKENBACH, K., VEERAPONG, J., CHARRON, J., POSNER, M. C., ROIZMAN, B. & WEICHSELBAUM, R. R. 2006. Activated MEK suppresses activation of PKR and enables efficient replication and in vivo oncolysis by Deltagamma(1)34.5 mutants of herpes simplex virus 1. J Virol, 80, 1110-20. SPEAR, P. G. 2004. Herpes simplex virus: receptors and ligands for cell entry. Cell Microbiol, 6, 401-10. SPRINGFELD, C., VON MESSLING, V., FRENZKE, M., UNGERECHTS, G., BUCHHOLZ, C. J. & CATTANEO, R. 2006. Oncolytic efficacy and enhanced safety of measles virus activated by tumor-secreted matrix metalloproteinases. Cancer Res, 66, 7694-700. SPURBECK, W. W., NG, C. Y., VANIN, E. F. & DAVIDOFF, A. M. 2003. Retroviral vector-producer cell-mediated in vivo gene transfer of TIMP-3 restricts angiogenesis and neuroblastoma growth in mice. Cancer Gene Ther, 10, 161-7. STOFF-KHALILI, M. A., RIVERA, A. A., MATHIS, J. M., BANERJEE, N. S., MOON, A. S., HESS, A., ROCCONI, R. P., NUMNUM, T. M., EVERTS, M., CHOW, L. T., DOUGLAS, J. T., SIEGAL, G. P., ZHU, Z. B., BENDER, H. G., DALL, P., 30  STOFF, A., PEREBOEVA, L. & CURIEL, D. T. 2007. Mesenchymal stem cells as a vehicle for targeted delivery of CRAds to lung metastases of breast carcinoma. Breast Cancer Res Treat, 105, 157-67. STOJDL, D. F., LICHTY, B. D., TENOEVER, B. R., PATERSON, J. M., POWER, A. T., KNOWLES, S., MARIUS, R., REYNARD, J., POLIQUIN, L., ATKINS, H., BROWN, E. G., DURBIN, R. K., DURBIN, J. E., HISCOTT, J. & BELL, J. C. 2003. VSV strains with defects in their ability to shutdown innate immunity are potent systemic anti-cancer agents. Cancer Cell, 4, 263-75. STRIPECKE, R., KOYA, R. C., TA, H. Q., KASAHARA, N. & LEVINE, A. M. 2003. The use of lentiviral vectors in gene therapy of leukemia: combinatorial gene delivery of immunomodulators into leukemia cells by state-of-the-art vectors. Blood Cells Mol Dis, 31, 28-37. SUZUKI, S., NAKASATO, M., SHIBUE, T., KOSHIMA, I. & TANIGUCHI, T. 2009. Therapeutic potential of proapoptotic molecule Noxa in the selective elimination of tumor cells. Cancer Sci, 100, 759-69. THOMAS, C. E., EHRHARDT, A. & KAY, M. A. 2003. Progress and problems with the use of viral vectors for gene therapy. Nat Rev Genet, 4, 346-58. TODO, T. 2008a. \"Armed\" oncolytic herpes simplex viruses for brain tumor therapy. Cell Adh Migr, 2, 208-13. TODO, T. 2008b. Oncolytic virus therapy using genetically engineered herpes simplex viruses. Front Biosci, 13, 2060-4. TODO, T., MARTUZA, R. L., RABKIN, S. D. & JOHNSON, P. A. 2001. Oncolytic herpes simplex virus vector with enhanced MHC class I presentation and tumor cell killing. Proc Natl Acad Sci U S A, 98, 6396-401. TONG, A. W., NEMUNAITIS, J., SU, D., ZHANG, Y., CUNNINGHAM, C., SENZER, N., NETTO, G., RICH, D., MHASHILKAR, A., PARKER, K., COFFEE, K., RAMESH, R., EKMEKCIOGLU, S., GRIMM, E. A., VAN WART HOOD, J., MERRITT, J. & CHADA, S. 2005. Intratumoral injection of INGN 241, a nonreplicating adenovector expressing the melanoma-differentiation associated gene-7 (mda-7/IL24): biologic outcome in advanced cancer patients. Mol Ther, 11, 160-72. TROBRIDGE, G. D. 2009. Foamy virus vectors for gene transfer. Expert Opin Biol Ther, 9, 1427-36. VAN DEUTEKOM, J. C., JANSON, A. A., GINJAAR, I. B., FRANKHUIZEN, W. S., AARTSMA-RUS, A., BREMMER-BOUT, M., DEN DUNNEN, J. T., KOOP, K., VAN DER KOOI, A. J., GOEMANS, N. M., DE KIMPE, S. J., EKHART, P. F., VENNEKER, E. H., PLATENBURG, G. J., VERSCHUUREN, J. J. & VAN 31  OMMEN, G. J. 2007. Local dystrophin restoration with antisense oligonucleotide PRO051. N Engl J Med, 357, 2677-86. VEERAPONG, J., BICKENBACH, K. A., SHAO, M. Y., SMITH, K. D., POSNER, M. C., ROIZMAN, B. & WEICHSELBAUM, R. R. 2007. Systemic delivery of (gamma1)34.5-deleted herpes simplex virus-1 selectively targets and treats distant human xenograft tumors that express high MEK activity. Cancer Res, 67, 8301-6. VOGELSTEIN, B. & KINZLER, K. W. 2004. Cancer genes and the pathways they control. Nat Med, 10, 789-99. VORBURGER, S. A. & HUNT, K. K. 2002. Adenoviral gene therapy. Oncologist, 7, 46-59. WAEHLER, R., RUSSELL, S. J. & CURIEL, D. T. 2007. Engineering targeted viral vectors for gene therapy. Nat Rev Genet, 8, 573-87. WANG, X., SU, C., CAO, H., LI, K., CHEN, J., JIANG, L., ZHANG, Q., WU, X., JIA, X., LIU, Y., WANG, W., LIU, X., WU, M. & QIAN, Q. 2008. A novel triple-regulated oncolytic adenovirus carrying p53 gene exerts potent antitumor efficacy on common human solid cancers. Mol Cancer Ther, 7, 1598-603. WINKELER, A., SENA-ESTEVES, M., PAULIS, L. E., LI, H., WAERZEGGERS, Y., RUCKRIEM, B., HIMMELREICH, U., KLEIN, M., MONFARED, P., RUEGER, M. A., HENEKA, M., VOLLMAR, S., HOEHN, M., FRAEFEL, C., GRAF, R., WIENHARD, K., HEISS, W. D. & JACOBS, A. H. 2007. Switching on the lights for gene therapy. PLoS One, 2, e528. WONG, H. H., LEMOINE, N. R. & WANG, Y. 2010. Oncolytic Viruses for Cancer Therapy: Overcoming the Obstacles. Viruses, 2, 78-106. WU, Q., MOYANA, T. & XIANG, J. 2001. Cancer gene therapy by adenovirus-mediated gene transfer. Curr Gene Ther, 1, 101-22. YI, Y., NOH, M. J. & LEE, K. H. 2011. Current advances in retroviral gene therapy. Curr Gene Ther, 11, 218-28. YUAN, L., ZHAO, H., ZHANG, L. & LIU, X. 2013. The efficacy of combination therapy using adeno-associated virus-mediated co-expression of apoptin and interleukin-24 on hepatocellular carcinoma. Tumour Biol, 34, 3027-34. ZHANG, K. X., MOUSSAVI, M., KIM, C., CHOW, E., CHEN, I. S., FAZLI, L., JIA, W. & RENNIE, P. S. 2009a. Lentiviruses with trastuzumab bound to their envelopes can target and kill prostate cancer cells. Cancer Gene Ther, 16, 820-31. ZHANG, Z., HUANG, Y., NEWMAN, K., GU, J., ZHANG, X., WU, H., ZHAO, M., XIANYU, Z. & LIU, X. 2009b. Reexpression of human somatostatin receptor gene 2 gene mediated by oncolytic adenovirus increases antitumor activity of 32  tumor necrosis factor-related apoptosis-inducing ligand against pancreatic cancer. Clin Cancer Res, 15, 5154-60.   ",
    "Link": "https://core.ac.uk/download/77020742.pdf"
}