{
    "Title": "Recovery approaches in mental health : A qualitative evaluation of the Whole Life Therapy programme for persons with schizophrenia",
    "Authors": "Gale, Tim, Hawley, Chris, Littlechild, Brian, Lloyd, Michele, Meredith-Windle, Glynis, Smith, Andrew",
    "Year": "No year available",
    "Abstract": "This work and the related PDF file are licensed under a Creative Commons Attribution 4.0 International LicenseThe recovery approach within mental health services has in recent years been influential in promoting more active participation from service users concerning their treatment and progress, within a move towards models of interventions based on social models and ideas of service user empowerment. Although mental health recovery models are often heralded as ideological goals, comparatively little has been documented about the means of achieving these. This article sets out the nature and content of the Whole Life Programme, used within the Hertfordshire NHS Partnership Foundation Trust, and the results of qualitative research into the programme that set out to analyse the impact of its delivery from the perspectives of service users. The research examined the experiences and views of participants receiving treatment several months after the completion of the programme, and also of those who withdrew prematurely, in order to learn from these experiences, adding to our understanding of how one recovery based approach, the Whole Life Manual, can be applied in practiceNon peer reviewedFinal Published versio",
    "Keywords": "No keywords available",
    "Publisher": "'Scientific Research Publishing, Inc.'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Vol.5, No.3A, 582-587 (2013)                                                                          Health http://dx.doi.org/10.4236/health.2013.53A077  Recovery approaches in mental health: A qualitative evaluation of the Whole Life Therapy programme for persons with schizophrenia Brian Littlechild1*, Andrew Henry Smith1, Glynis Meredith-Windle2, Tim Gale3, Michele Lloyd1,  Christopher Hawley3  1School of Health and Social Work, University of Hertfordshire, Hatfield, UK; *Corresponding Author: b.littlechild@herts.ac.uk  2ArcHealth, Bedfordshire, UK 3Hertfordshire Partnership NHS Foundation Mental Health Trust, Hertfordshire, UK  Received 25 December 2012; revised 3 February 2013; accepted 16 February 2013 ABSTRACT The recovery approach within mental health ser- vices has in recent years been influential in pro- moting more active participation from service users concerning their treatment and progress, within a move towards models of interventions based on social models and ideas of service user empowerment. Although mental health re- covery models are often heralded as ideological goals, comparatively little has been documented about the means of achieving these. This article sets out the nature and content of the Whole Life Programme, used within the Hertfordshire NHS Partnership Foundation Trust, and the results of qualitative research into the programme that set out to analyse the impact of its delivery from the perspectives of service users. The research exa- mined the experiences and views of participants receiving treatment several months after the com- pletion of the programme, and also of those who withdrew prematurely, in order to learn from these experiences, adding to our understanding of how one recovery based approach, the Whole Life Manual, can be applied in practice.  Keywords: Mental Health Recovery; Whole Life Programme; Evaluation; Service User Perspectives 1. INTRODUCTION This article sets out the nature and contents of a thera- peutic programme designed from principles of the re- covery based approach in mental health work, and the results of research into the programme.  Studies documenting the potential for ongoing or full  recovery of function and well-being in the advent of schizophrenia diagnosis [1] have been influential in the development of recovery-based models, which promote more active participation and higher expectations among service users concerning the planning of, and involve- ment in and control of, their treatment [2].  The research upon which this article is based had the goal of adding to our understanding of how one recovery based approach, the Whole Life Programme (WLP), can be applied in practice, and to review and analyse the im- pact of its delivery from the perspectives of service users. Although mental health recovery models are often her- alded as ideological goals, comparatively little has been documented about the means of achieving these. 2. RECOVERY: RESEARCH FINDINGS Based on current thinking about the Recovery orien- tation in Mental Health practice the research team con- structed a Whole Life Manual (WLM) that would act as a therapeutic instrument to be used between a coach (professional), and a participant (patient/client). To know whether the WLP and WLM was effective it was tested in an interventional comparative trial in which the pri- mary quantitative outcome was the score on the Social Adaptation Self-assessment scale. A subsidiary qualita- tive study was conducted in order to understand the views and opinions the participants might have about the programme. Understanding the participants’ views fur- thers our understanding of which aspects of the pro- gramme were successful and which were unsuccessful or require modification or development. This article ad- dresses the findings from the qualitative study. Longitudinal research into schizophrenia has demon- strated that a return to normal functioning, based on common understandings, is possible [3]. Evidence also shows that a process of personal recovery, facilitated by  hope, agency and opportunity, can be entered into while Copyright © 2013 SciRes.                                                                    OPEN ACCESS B. Littlechild et al. / Health 5 (2013) 582-587 583co-existing with ongoing symptoms [4]. 3. THE WHOLE LIFE PROGRAMME The Whole Life Programme (WLP) provides a holistic, recovery-based approach to the wide variety of needs of people with mental health problems. The main aims of the WLP are to guide service users through a holistic, cumulative process of mental health recovery, to develop increased competency to engage in self-realization and self-determination, and enable service users to take steps towards more independent living. The programme aims to re-asset service users as a way of enhancing their abil- ity for agency. During the WLP service users attend one-to-one therapy sessions with Whole Life therapists, normally for one hour per week, drawing on resources and materials in the WLP Manual. The Whole Life Manual The Whole Life Manual is a document of approxi- mately 250 pages. It is not manualized psychotherapy or social therapy but is better thought of as a resource pack and coaching programme to be used jointly between the coach (professional) and participant (patient, service user or client). It comprises 15 modules (see below) each of which examines a particular area of life function that may be problematic for a person with chronically poor mental health. Each module has three sets of documents. First, there are briefing notes for the coach summarising the therapeutic approach for the module in question; then, the participant’s self-perception is explored using ques- tionnaires or graphical materials: lastly there are resource pages, used by the coach and participant to provide a basis for their work. A Whole Life Programme has no fixed duration or pace of work; duration and intensity is adapted to, and by, the individual participant. But typically the work lasts a year with the coach and participant meeting weekly or two-weekly. In the programme the professional (com- monly a nurse, social worker or support worker) stands aside from the usual position of knowledge or authority and at all steps aims to facilitate the participant towards solutions or improvements rather than delivering or pre- scribing them.  Work in the programme is labour-intensive for both the coach and the participant. Potential participants who are indifferent to their functional, social and relationship problems are unlikely to make progress. However, for adequately motivated participants significant life gains can be made and social adaptation much improved even if psychiatric symptomatology has not changed. For more description of the Programme, see  http://www.wholelifemanual.info  The modules are discrete, and include Creating New Horizons; Your Journey; Physical Environment; Com- munication Skills; Assertiveness; Self Esteem; Action Planning, and Managing Time; Change, and Disap-pointment. There are in addition modules on Anxiety and Stress; Physical Health; Understanding and Managing Money; Beliefs and Values; Pathways to education and work; Leisure and Recreation, and Personal Relation-ships. Whilst the research was both quantitative and qualita- tive, this article sets out the qualitative findings from the research. The quantitative results are reported in other articles. The aims of the qualitative research into the Pro- gramme reported here were threefold. Firstly, it exam- ines the views of participants receiving treatment several months after the completion of the WLP in order to achi- eve understanding of their experiences of the programme and how it has or has not aided them. Secondly, it elicits the views of service users who withdrew prematurely from the programme so as to understand their experi- ences of the process and reasons for their early exit. Thirdly, it explores service users’ subjective experiences of therapy in order to develop empirically based evi- dence of the complex processes of mental health recov- ery with a view to embedding aspects of good practice. 4. METHODOLOGY In order to gain insight into how recovery-based ther- apy is applied to the treatment of schizophrenia, a quali- tative methodology was adopted to elicit service users’ lived experiences of receiving treatment. Such qualitative interviewing can be an effective vehicle for articulating service users’ unique perspective in their own words, and for seeing and understanding the world from the position of those being researched [5].  The qualitative approach employed engaged services users’ voices through semi-structured, in-depth inter- views, which allowed for exploration of themes as they emerged during the course in the interview. The inter- view guide covered participant expectation prior to the programme, what they found as the most helpful and not so helpful aspects of the programme, the use of the physical materials (i.e. the Manual); the most valuable aspects of therapist’s approach; participants’ experiences of translating therapy into practice, and their views for the future programme development. Interviews took the form of WLP therapists introduc- ing researchers to their service users, although they were not subsequently present when service users were inter- viewed. The venue for all interviews was either the resi- dential unit where the service user lived or the centre attended by the service user for Whole Life therapy ses- sions. Thirteen of the 32 participants who successfully com- pleted the WLP were interviewed, giving a response rate  Copyright © 2013 SciRes.                                                                    OPEN ACCESS B. Littlechild et al. / Health 5 (2013) 582-587 584 of 41%. The premature discontinuation rate for the WLP occurred at the lower end of the predicted range of 20% - 30%, n = 6 and all these prematurely discontinuing par- ticipants were interviewed. In addition, consultations with WLP therapists allowed the process of data triangulation whereby data generated at interview with service users could be cross-referenced during consultations with therapists. Interviews and consultations were carried out with a total of 26 respon- dents. Of the 19 service user interviewees—both completers and non-completers—16 (84%) were male and three (16%) were female. In terms of ethnicity, two service users and one therapist were of minority ethnic back- ground; researchers, comprised of two females and one male, were of white ethnicity.  Data Capture and Analysis Interview responses were recorded manually, to avoid any service user concerns at the use of tape recorders, and were later coded according to themes generated pre- dominantly inductively during the process of analysing empirical data, and also deductively through being theo- retically informed by existing literature [6]. A thematic analysis of the data was then undertaken. The qualitative evaluation of the WLP was carried out by a team of university based and service user research- ers. The study Sponsor was the Hertfordshire Partnership Foundation Trust and ethical approval was granted by the National Research Ethics Service (NRES) for Eng- land. 5. SUMMARY OF MAIN FINDINGS The following points represent the key themes identi- fied in this piece of work. 5.1. Findings Common to both Completing and Non-Completing Service Users All interviewed service users perceived they had de- veloped good relationships with their Whole Life Thera- pists. In addition, participants’ progress towards mental health recovery was commonly viewed as on going, and had continued after the actual programme had been com- pleted. 5.2. Findings from Service Users  Completing the WLP The most significant area of reported change in service users’ lives which they attributed to undertaking the WLP concerned an increase in confidence and self-es- teem. Nearly all of the service users experienced a posi- tive effect on their subjective well-being and reported  progress on the “Tree of Life” model used during therapy sessions. Employment, and what his means to them, was seen by some participants as key to unlocking barriers to more independent living. 5.3. Findings from Service Users Not  Completing the WLP Service users did not always experience that they had had sufficient discussion about the nature and demands of Programme. The aims and content of the WLP could have been made clearer to all service users prior to em- barking on the programme, particularly about whether it can be seen as a course and/or therapy, and the implica- tions for the individual of this. A brief introductory pack/ leaflet could be utilised prior to starting WLP to aid with this, as several respondents spoke of the daunting task of initially approaching the WLP and materials.  There was evidence of the Whole Life Manual being experienced as overwhelming by some service users. It may therefore be valuable to assess literacy levels with service users in order to enhance engagement with work- book-based therapy. In addition, visual metaphors are powerful tools for developing patient insight, and could be an area to consider expanding for any future develop- ment. Service users were not always aware of the progress they had made when rehabilitative milestones were rea- ched in tangential ways. A structured “recovery & well-being journal” could be included as another option for charting and reviewing progress, recording thoughts and aiding reflection. 6. THE VIEWS AND EXPERIENCES OF  SERVICE USERS AND THEIR  THERAPISTS 6.1. Views and Experiences of Early  Withdrawal Service Users and Their  Therapists Interviews with service users who did not complete therapy sessions revealed some experiential parallels with programme completers, the main area of congru- ence being their perception of good relationships with their therapists. An area of divergence between the two interview populations emerged in relation to a lack of appreciation among non-completing service users of the objectives of the WLP; the content, process of, and “buying into” or commitment to, the programme appear to have been the overriding factors influencing service users’ withdrawal from therapy rather than relationship with their therapist.  However, even amongst those who withdrew, some Copyright © 2013 SciRes.                                                                    OPEN ACCESS B. Littlechild et al. / Health 5 (2013) 582-587 585had found some elements helpful. One service user noted that the WLP therapy sessions had helped him with com- munication and that he had become more talkative, in- cluding with his grown-up children: “I communicate with people a lot easier, I’ve become more communicative. [...] I think it was a helpful course.”  6.2. Views of Service Users and Their  Therapists Who Completed the  Programme Individual service users were at different stages in their knowledge, skills and stages in their recovery tra- jectories, and their assessment of the WLP modules var- ied accordingly. A small minority of service users who, for example, were already accustomed to budgeting, did not have anger management issues, or were currently in education or employment, consequently found that cor- responding modules were of less relevance to them. However, they were not advocating the WLP Programme be changed in this regards. Rather, they could see the purpose of certain modules which could rise in signifi- cance for them at a later stage in life, and how modules of less immediate relevance to them could benefit others undertaking the WLP. With regards to less useful aspects of the WLP, one service user expressed a dislike for the programme con- tent concerning spiritual or philosophical beliefs ex- plaining that he did not believe in religion. Although the module on examining beliefs and values did not focus on religion per se, its remit appears to have been interpreted by some to have religious connotations, and this may need clarification in future work. While some service users conscientiously completed tasks set by their therapists, others expressed displeasure at being given work to do at home in their own time, akin to being set “homework”. In a related area of criticism the amount of charts for service users to fill in was deem- ed too numerous by some service users and in some cases overwhelming (as was the case among some who withdrew early from the programme). According to two research participants who completed the therapy sessions, the aims and content of the WLP had not been made clear to them prior to starting the programme, with one of them noting: “It was sold to me as therapy but was a course; I felt cheated”. The quote reveals how this client conceptualized “therapy” and “a course” in dichotomous terms. In view of the Whole Life Manual being in book form, and the associated “home- work” tasks set each week, it is possible, and perhaps to be expected, that some service users might align the pro- gramme with being a course rather than therapy.  Conversely, some service users noted that other forms of psychological treatment, such as cognitive behavioural therapy, did not clash with the WLP but rather comple- mented it, again indicative of the variability across ser- vice users. 6.3. Valuable Aspects of the  Programme-General Issues The most prevalent theme emerging from service us- ers’ narratives was the feeling of having grown in confi- dence and self-esteem as a result of their participation in the WLP. More than two-thirds of programme complet- ers (nine out of 13) explained that they had gained con- fidence and better social functioning: “I was withdrawn and bored sitting at home, scared to go out. I’m back to normal, I’ve gained confidence, made friends and I have been helped a great deal.”  Another became more optimistic about her future as a result of undertaking the WLP: “I was inspired which in turn built up my confidence. I was given encouragement and support to continue and shown that things are possible.”  6.4. Relationships with Therapists All the service users in the sample had experienced positive one-to-one contact with their Whole Life thera- pists. To gain a flavour of what they valued in their good working relationships, self-generated adjectives were re- quested from participants to describe their therapists. 2 used the term “Supportive”. One each used the terms “Brilliant”, “Great”, “Helpful”, “Friendly”, “Empathetic”, “Kind”, “Patient”, “Flexible”, and “Polite”.  Similarly, therapist qualities identified by service users as being important were requested from them. 4 stated that this constituted “Easy to talk to, providing opportu- nity to talk”; 2 each offered “Good at using illustrative examples” and “Good at explaining/skilled at asking questions and drawing out information”. One each men- tioned “A good listener”, “Positive approach”, “Able to build up trust”, Sharing feelings, and “Humour”.  Reflecting on his expectations of the WLP, one inter- viewee with long-standing mental health needs described the sessions with his therapist as a welcome change to some of the previous mental health provision he had en- countered: “It’s been a positive experience from the start...seeing someone regularly and following a well written and well structured guide was good”. Pathways to employment on the WLP and job inter- viewing sessions were seen by several as useful in real- ising and sustaining independent living. 7. USE OF PHYSICAL MATERIALS On the question of physical materials used on the  Copyright © 2013 SciRes.                                                                    OPEN ACCESS B. Littlechild et al. / Health 5 (2013) 582-587 586 WLP some service users were receptive to these, finding them informative and easy to understand. The WLP Ma- nual was generally described as well structured, accessi- ble, and with clear sections and explanations. Activities around self-assessment had been engaging for some, and filling in charts and graphs had added variety to the pro-gramme. The Tree of Life is a part of the programme that is used to help service users and therapists to gauge by vis- ualisation and verbal considerations their progress over a period of time. In relation to where they saw themselves on the tree, nine out of 13 service users (69%) perceived they had progressed up the tree as a result of undertaking whole life therapy sessions. Representative comments include:  “I was at the bottom of the tree when I started, now I’m half way up.”   “I think I’m somewhere near the top now. I’ve made progress.”   “Further up but hopefully still climbing”.  Similarly, tables in the manual sometimes proved help- ful in evaluating on-going development:  “It was good to refer to the tables at the end of each topic. We used (these) to look at where you are now and would like to be in the future and how to change.”  This interviewee explained how the practical applica- tion of her learning was being facilitated by the use of small laminated cards from her therapist she carried with her: “… they have positive practical advice and affirma- tions written on them.”  However, some who might struggle with literacy could find the emphasis on the written workbook daunt- ing. 8. VALUABLE ASPECTS OF THE  MODULES Four interviewees stated that the WLP had equipped them to be more assertive when getting their views across, and not just within informal settings but on occa- sion within formal contact with agencies. According to these four interviewees, the exploration of ideas during the first module on Dreams and Aspira- tions had been inspiring. In the words of one of them: “From the very first module I learnt it was okay to have dreams and anything was possible. I had dreams before I was ill, I remembered them and connected with them. The inspirational quotes lifted me.”  The module on understanding and managing money was cited by seven service users as being especially val- ued; being able to save up and buy items which they had been unable to do hitherto, and making budgetary deci- sions previously the remit of significant others:  “Electric bills and the like, I wouldn’t have thought of this stuff much before I did the WLP.”  The personal relationships module was cited as fa- vourable in helping service users address their own rela- tionships such as being more relaxed. Guidance on dif- ferent ways to make and keep friends was also found to be productive and applicable to some service users’ so- cial life. 9. PROGRAMME DEVELOPMENT AND ADDITIONAL AREAS FOR INCLUSION Additional areas a small minority of service users would like to see incorporated in the programme in- cluded issues of drugs and alcohol; sexual relationships; panic attacks; hyperventilation; and lethargy.  Using examples of people with mental health issues and their achievements, as an exemplar of practice was another suggested addition to the programme manual. Ten of the 13 who successfully completed the Pro- gramme expressed an interest in having a follow-up ses- sion some six months after completing the WLP. One respondent was unsure about the merits of a follow-up whole life session explaining that he would not wish to “drag up the same issues again”. There was also a keen- ness to recommend the WLP to others. 10. STUDY LIMITATIONS As with all small-scale studies, our findings may lack generalisability beyond the NHS treating institution, yet they are instructive of the lived experiences of service- users and the forms of therapy they deem most effective for recovery from schizophrenia. Due to the cross-sec- tional design of our study, we recognise the importance of exercising caution when inferring causal relationships and our findings draw associations, rather than causali-ties, between mental health recovery and WLP service users’ experience.  11. CONCLUSIONS Consulting individuals with schizophrenia through qualitative interviews enables a more holistic articulation of service user recovery narratives. Indeed, a number of service users, programme completers and non-complet- ers alike, commented that they valued the opportunity to partake in an interview in which they could communicate their experiences, both positive and negative, of the WLP. This may actually help service users reflect on what works for them, and their own particular issues. Our findings support the data in studies that show that increasing confidence, hope and optimism are key fea- tures of the process and outcomes of recovery based ap- proaches, and in particular in the Whole Life Programme. Respectful and flexible approaches within the relation-  Copyright © 2013 SciRes.                                                                    OPEN ACCESS B. Littlechild et al. / Health 5 (2013) 582-587 Copyright © 2013 SciRes.                                                                    587ship with the therapist; an increase in knowledge about other resources and how to use them themselves; and improved relationships and having greater control over their lives were also important. One key feature in the current research was the mixture of optimism and sup- portive relationship with therapists within the Program- me; so, whilst the methods and Programme contents were important, so was the attitude and approach of the therapist; findings commensurate with the review of findings from 35 research studies on recovery between 2000 and 2009 [7]. This review found that one of the most important features for patients/clients was the posi- tive nature of the therapeutic relationship with the thera- pist within an approach where the latter focused on the service user over and beyond their diagnosis and “ill- ness”. Staff attributes most highly prized were attitudes and approaches that were respectful of the service user, and optimism [7]. OPEN ACCESS The ambivalence, at times, of service users about some elements of, and the progress at times within, the Programme resonates with other findings; recovery jour- neys are often nonlinear; there are inevitably bumps and impediments along the way [8]. As Davidson et al. [9] note: “...this form of recovery refers to a unique and personal process rather than to a uniform end state or outcome”. This seems to have been facilitated in the WLP by the nature of the relationship set up and main- tained between respondents and their therapists. As interview data show, service users did not always take on board how well they had progressed and there may thus be benefits (in any therapy) making rehabilita- tive milestones more explicit as and when they are reached. This may aid service user reflection on the cu- mulative small steps of progress they have made rather than viewing progress in terms of great stridency. The Tree of Life was particularly important in this regard.  Data gathered for this evaluation indicate that the WLP had a primarily positive effect on the mental health of interviewees who completed therapy sessions, and some positive effects in embryonic form among several service users who withdrew from the programme. This is perhaps a more remarkable achievement in the context of the programme engaging with some service users with long-standing mental health needs, who had at times ex- perienced challenging encounters with other areas of service provision. Service users who had successfully completed the WLP, and some who had not, commonly reflected on the progress they had made to date, the in- creased resilience they had developed, and the ongoing nature of recovery journeys. 12. ACKNOWLEDGEMENTS The authors would like to thank all research participants, and to ex- press gratitude to the Research for Patient Benefit (RfPB) Programme UK for the funding that made this research possible under award PB-PG-0407-13096.  REFERENCES [1] National Institute for Health and Clinical Excellence (2009) Understanding NICE guidance, information for people who use NHS services, Schizophrenia. National Institute for Health and Clinical Excellence, London.  http://www.nice.org.uk/nicemedia/live/11786/43611/43611.pdf [2] Williams, C.C. and Collins, A.A. (2002) The social con-struction of disability in Schizophrenia. Qualitative Health Research, 12, 297-309. doi:10.1177/104973202129119900 [3] Andresen, R., Oades, L. and Caputi, P. (2003) The ex- perience of recovery from schizophrenia: Towards an em- pirically validated stage model. Australian and New Zea- land Journal of Psychiatry, 37, 586-594 doi:10.1046/j.1440-1614.2003.01234.x [4] South London and Maudsley NHS Foundation Trust and South West London and St George’s Mental Health NHS Trust (2010) Recovery is for all. Hope, Agency and Op-portunity in Psychiatry. A Position Statement by Con-sultant Psychiatrists, SLAM/SWLSTG, London. [5] Heath, S., Brooks, R., Cleaver, E. and Ireland, E. (2009) Researching young people’s lives. Sage, London.  [6] Hodkinson, P. (2008) Grounded theory and inductive re- search. In: Gilbert, N., Ed., Researching Social Life, 3rd Edition, Sage, London.  [7] Ramon (2010) Recovery research update: A systematic review 2000-2009. University of Hertfordshire, Hatfield [8] Bellack, A.S. (2006) Scientific and consumer models of recovery in schizophrenia: Concordance, contrasts, and implications. Schizophrenia Bulletin, 32, 432-442.  http://schizophreniabulletin.oxfordjournals.org/content/32/3/432.full.pdf+html [9] Davidson, L., Schmutte, T., Dinzeo, T. and Andres-Hy- man, A. (2008) Remission and recovery in schizophrenia: practitioner and patient perspectives. Schizophrenia Bul-letin, 34, 5-8.  http://schizophreniabulletin.oxfordjournals.org/content/34/1/5.full.pdf+html  ",
    "Link": "https://core.ac.uk/download/29840782.pdf"
}