{
    "Title": "10 Key Policies and Practices for Teaching English Language Learners",
    "Authors": "The Meadows Center for Preventing Educational Risk",
    "Year": "No year available",
    "Abstract": "The ninth installment of MCPER's \"10 Key\" series, this document distills the latest research findings into 10 easy-to-follow recommendations that states, school districts, and schools can use to improve instruction for English language learners. Also included is a list of research evidence supporting the recommendations.\r\n\r\nNote: This file has been formatted for online viewing and is not a print file.Educatio",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "© 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International10 Key Policies and Practices —for—Teaching English Language Learnerswith strong evidence of effectiveness from high-quality research© 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International10 Key Policies and Practices for Teaching English Language Learners—with strong evidence of effectiveness from high-quality research—Having an asset-based perspective, rather than being deficit-focused, is the underlying foundation for effectively teaching English language learners (ELLs). Educators must hold an inherent belief that all stu-dents bring a richness of cultural and linguistic backgrounds and experiences to the learning environment. Teaching ELLs is the responsibility of all teachers. With some adaptations to regular teaching routines, as described in the recommendations below, all teachers are capable of providing high-quality instruction that leads to ELLs achieving rigorous standards. 1. Educators understand that there is wide variability in the ELL population and con-sider individual students’ linguistic abilities, literacy skills, and cultural and linguistic backgrounds when planning instruction. ELLs vary considerably in factors that significantly affect learning. These factors include language and literacy proficiency in students’ native languages and in English. Educators should learn about individual students’ development of first and second languages. Cultural and experiential factors also influence learning. For example, educators may notice differences between ELLs whose parents are U.S. born and those whose parents are recent immigrants. Family routines and communication practices shape the knowledge and experience that students bring to the classroom. Such differences are not deficits. Despite difficulties with learning in a nonnative language, ELLs are not struggling thinkers. Rather than treating all ELLs the same, educators must understand that no one strategy or adaptation will work for all students because they do not all have the same strengths and needs. It is important for teachers to consider each student’s language development, background knowledge, and literacy skills in planning instruction that is rich in content with ample opportunities for language development. © 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International2. Teachers analyze the language demands of the lessons they teach and provide support for ELLs to understand both the language and the content of the lesson. To make content accessible to ELLs, teachers must carefully assess the vocabulary and language skills that students need to fully engage in instruction. Across kindergarten to grade 12, teachers must be able to recognize high-demand situations and provide appropriate supports for ELLs. The following table shows how teachers can support ELLs when language demands are high. Language Demand Instructional Support StrategiesThe lesson requires students to understand multiple complex vocabulary terms.Preteach and reteach vocabulary.Post charts or posters in the room with defini-tions and examples.Use a vocabulary journal or class log for keep-ing track of terminology.Help students “unpack” difficult words by examining prefixes, suffixes, and base words.The text is conceptually dense—packed with important pieces of information. ORThe reading passage is long and has few visual aids, such as graphs, pictures, and annotations.Chunk the text into segments of one or two paragraphs, stopping to summarize along the way.Use video clips and supplemental reading ma-terials to enhance understanding.Use highlighters to color-code key ideas.Teach students to annotate text or take reading notes.The text has complex sentence structures. Model how to unpack complex sentences and parse the sentence structure.Use repeated-reading techniques so that stu-dents work through the text more than once.Ask students to paraphrase key ideas in their own words; provide support as needed.The text requires students to make extensive inferences.ORThe lesson requires students to make con-nections to previously learned concepts or tie together multiple sources.Use graphic organizers to help students identi-fy and connect key ideas.Model the inferencing process.Use highlighters to identify key ideas.Engage students in interactive discussion of possible interpretations.© 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International3. Teachers build on students’ background knowledge by making clear connections be-tween current learning and students’ prior experiences. Making connections between students’ prior knowledge and current learning is good teach-ing for all students. For ELLs, however, teachers need to learn what background knowledge and student experiences are relevant to the topic. Asking open-ended questions to probe for back-ground knowledge is important. When students do not have sufficient background knowledge to anchor instruction, teachers may need to provide experiences and explanations to build the requisite foundational knowledge. ScenarioMs. Corcoran, a social studies teacher in a diverse middle school, has several ELLs in her class. She regularly checks for relevant background knowledge of her students and fills in gaps to make her instruction relevant. She knows that Juan Carlos has linguistic and literacy skills in his first language, Spanish, and can use his knowledge of Spanish to help him understand concepts in English. For example, when they discussed the concept of democracy in class, he related it to the Spanish word “democracia,” a familiar concept. Ms. Corcoran checked his understanding and asked him to give an example. In contrast, Alina came from a country with a dictatorship. When they discussed this concept in class, Ms. Corcoran knew that Alina might not have background knowledge of democracy, having no personal experience with this type of government. Ms. Corcoran provided additional explanation and examples for the whole class, following up later with Alina individually in a brief discussion to practice reading and pronouncing the word and to explore its meaning. Activity: Making Connections to TextIn this activity, teachers select an excerpt from a reading passage that is likely to evoke personal con-nections. Students relate an experience from their own lives to the excerpt. Students can share their connections in writing or oral discussion. The teacher reads aloud the excerpt, first modeling how it connects to her life. Then, with scaffolding and support, students describe their own experiences and how they relate to the text. 1. Select a brief excerpt from a text that holds personal significance. 2. When reading aloud, stop and reread the excerpt. 3. Think aloud or model the process of making a connection. For example, “This makes me think of…” (an event from your past, an event in another book, or a world event). Explain how making this connection helps us to better understand what we read. 4. Scaffold students’ personal connections. Using the same excerpt, or another one that students may relate to, ask students to tell a partner or the class a personal experience related to the excerpt. Discuss how making connections helps us to understand what we read. Emphasize that different readers make different connections. Repeat often until students are accustomed to the process. © 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International4. Teachers provide explicit instruction that includes clear directions, teacher and peer modeling, practice with detailed feedback, and ongoing review.Explicit instruction is important for all students across grades and subject areas; for ELLs, explicit instruction is crucial. Explicit in-struction should occur in three phases: modeling, guided practice, and independent practice. These phases are often referred to as “I do it,” to indicate that students should watch and listen carefully as the teacher explains and demonstrates; “We do it,” to indicate that students will try it together as the teacher watches and provides feed-back; and “You do it,” to indicate individual student practice. In the modeling phase, effective teachers of ELLs use language that is com-prehensible. This means choosing words carefully, avoiding complex sentences, and breaking down processes into simple steps. During the guided practice phase, teachers provide immediate feedback for discrete tasks, such as spelling a word or calculating in mathemat-ics, but may briefly delay feedback for complex tasks to allow ELLs additional time to think through the process. Explicit instruction also moves systematically through the steps of a process and maxi-mizes engagement in the task. ELLs may need more read-alouds and interactive discussions of concepts. Phases of Explicit Instruction“I do it”The teacher provides explicit verbal instruction while demonstrating the process and using simple, comprehensible language.ExampleMs. West explains the concept and steps of two-digit multiplication while calculating a problem on the board.“We do it”The teacher walks the group through the steps of the process, giving the same verbal instruc-tions while students perform the task. The teacher watches students carefully and offers praise and feedback. This step may be repeat-ed several times until the teacher feels the students are ready to perform the task inde-pendently.ExampleAfter a thorough explanation, Ms. West asks students to perform the two-digit multiplica-tion task step-by-step while she guides them with verbal instructions. Ms. West watches carefully, giving feedback and offering sugges-tions as needed. She asks students to verbalize the process to check for understanding.“You do it”Students perform the task several times on their own, asking questions if needed. The teacher walks around, checking students’ accu-racy and understanding and giving praise and feedback to individuals. ExampleMs. West gives students a worksheet with 10 problems to complete, rotating around the room to check in with students, give feedback, and offer suggestions. Ms. West checks on ELLs to offer additional support. © 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International5. Teachers strategically use ELLs’ native language when possible to support their con-ceptual understanding.Effective teachers of ELLs are resourceful in drawing on students’ native language to help them understand a concept or process. For example, teachers may find that pulling in words, concepts, and examples from a native language aids comprehension. Even if teachers do not speak a student’s native language, it is helpful to know how concepts and ideas are expressed in the native language. Latin-based languages such as Spanish have cognates, or words derived from the same Latin roots with similar word parts in English and Spanish (e.g., “acceleration” and “acceleración”). A study of textbooks and science standards showed that 85.5% of biology terms were Spanish-English cognates, though many words occur with low frequency in conversation. Using cognates in instruction will help ELLs to grasp key words, as long as they are familiar to students in their native language. Concepts that are unfamiliar in both the native language and English need elaboration. Some ELLs speak languages that are not similar to English. Teachers can look up native language equivalents to target words to help these ELLs understand terminology in English. It is easy to find translations for words using online resources. However, it is important for teachers to do a little re-search to make sure the translations are accurate. Consulting more than one source, including native speakers in the community, may aid teachers in finding appropriate key word equivalents.ScenarioMr. Eaves teaches social studies in middle school. In one class, he has three ELLs whose native lan-guage is Spanish and one ELL whose native language is Somali. In today’s lesson, he is explaining “product,” a key vocabulary term in the current unit of study about international commerce. For his three Spanish-speaking students, Mr. Eaves says aloud, “A product is something that is offered for sale. This word, ‘product,’ is similar in Spanish. Can someone think of a similar word in your native language?” (If no response, he would add a prompt: “Some of you know the word ‘el producto’ in Spanish, which means the same thing.”)Mr. Eaves then gives Asad, a Somali refugee who is learning English, a tablet with the word “product” called up in an online translator. He points to the translated word, “taran,” and asks Asad whether he understands. Mr. Eaves has learned that “taran” literally means “the result of multiplying” but can also mean “a commodity offered for sale.” To the class, Mr. Eaves gives several examples of products that countries offer for sale. He includes the sale of livestock, a primary industry in Somalia. After the examples, he invites students to share what they know of products from various countries.6. Teachers provide instruction that integrates listening, reading, writing, and speaking about content, resulting in a language-rich classroom.Understanding of academic content is anchored by oral and written language that focuses on con-tent. A content-rich classroom is also a language-rich classroom. Talking, reading, and writing about content enhance all students’ conceptual understanding but are critical for ELLs, and these activities may need to be enhanced to ensure that ELLs can participate. Effective teachers often use short video clips, visual demonstrations, and hands-on activities to establish a shared experience among students as a basis for launching deeper into discussion of content. ELLs benefit from listening, discussing, reading, and writing about key concepts. Increasing ELLs’ oral and written language improves their understanding of key concepts. © 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 InternationalScenarioMr. Walker is planning a lesson on persuasive writing for his fifth-grade class. He has a wide range of students, including four ELLs of varying language and literacy levels. He wants to include opportuni-ties for students to listen, read, speak, and write. The lesson has the following four stages:1. Listen: Introduce the concept of persuasion. Give a definition and short examples of the base word, “persuade.” Then show a video clip depicting a scenario of one student trying to persuade another to play a trick on the teacher. 2. Speak: In a “turn-and-talk” peer discussion, ask partners to briefly discuss their response to a prompt: “In this video, what reasons are presented for playing the trick? Do you agree? Why?”3. Read: Conduct a whole-class read-aloud of a persuasive essay, stopping to summarize key points along the way. 4. Write: Ask students to write one or two paragraphs to make a persuasive argument for some-thing, giving at least four reasons to support the argument. Ways to Support ELLs in Listening, Speaking, Reading, and Writing Listening• Use audiovisual aids to engage students in active listening.• Use gestures or visual demonstrations when giving directions.• Use predictable language patterns when giving oral instructions.• Provide “turn-and-talk” opportunities that require active listening (e.g., ask students to paraphrase what their partner said).Speaking• Set clear expectations when structuring peer discussions.• Ask students to retell or paraphrase.• Use sentence frames to prompt discussion (e.g., The most important thing about _________ is _________ because _________.)• Use graphic prompts to help students organize an oral discussion (e.g., write “topic sentence,” “three reasons,” and “conclusion” on the board).Reading• Use strategies and prompts to help students extract main ideas and supporting details.• Annotate text during whole-class read-alouds.• Provide an outline or graphic organizer to help students grasp key ideas.• Use prereading strategies such as predicting and preteaching key vocabulary.Writing• Use graphic organizers to help students structure their writing.• Use model text to demonstrate and discuss writing techniques.• Model the writing process.• Provide opportunities for peer feedback.• Give positive and specific feedback.© 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International7. Teachers provide intentional, explicit, and extended vocabulary instruction that sup-ports content learning.The volume and complexity of vocabulary associated with academic instruction increases exponen-tially through the grades, making learning especially difficult for ELLs, who often find the vocabulary load to be overwhelming. Typically, only 5% to 10% of instructional time is devoted to vocabulary instruction, but students, including ELLs, need between 12 and 14 exposures to words and their meanings to fully understand them. But exposure to words alone is insufficient; students need to use words within and across subjects. Explicit instruction of key words anchored to text can accelerate stu-dents’ acquisition of vocabulary, especially when students have extended opportunities to use words in meaningful contexts. For ELLs to understand words at more than a surface level, instruction must be extended over time with opportunities to hear, speak, read, and write words across varied contexts. Ex-tended exposure to words and how they are used builds breadth and depth of vocabulary knowledge. Steps of Explicit Vocabulary Instruction1. State the word and give a comprehensible definition that uses language your ELLs will understand.2. Give two or more examples, briefly explaining why they are examples of the target word.3. Give two or more nonexamples, briefly explaining why they are not examples of the target word.4. Discuss, pulling in students’ background knowledge of the word. 5. Check for understanding with questions and prompts.6. Have students use target words in speaking and writing.7. Use systematic review to provide opportunities over time for students to read, write, hear, and say the target words. 8. Use “intentional noticing” to discuss target words and how they are used as you encounter the words across contexts.8. Teachers provide structured opportunities for ELLs to engage in peer discussion about content.Peer discussion about content enhances learning for all stu-dents, but for ELLs, it provides the essential component of additional oral language practice. Peer discussion about text connects oral language to the reading process. For all students, whether learning English as a first or an additional language, language development is not a passive process. It is facilitated through language production and interaction, developing from kindergarten to grade 12. Increasing the time that ELLs engage in academic talk in English accelerates second-lan-guage development. However, teachers must understand that students may be uncertain or lack confidence in interacting in their second language. It is necessary to build supports and scaffolding into peer discussion activities to help ELLs contribute. Teachers should have a few simple routines or protocols that they follow for peer discussion. Discussion activities should go beyond simply asking and answering surface-level questions to a more thoughtful explora-tion of the text. Through exploration, students learn how to argue for or against points raised in the discussion, resolve ambiguities in the text, and draw conclusions or inferences about the text.© 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 InternationalTips for Structuring Peer Group Discussion• Set clear expectations for group participation that encourage all students to contribute via turn-tak-ing routines. Teachers may choose to assign roles, such as question reader, note-taker, and time-keeper. • Select passages that are compelling enough to spark a discussion.• Use a discussion protocol or routine that includes the following: • A prompt that clearly states the expected outcome of the group discussion—the task should address a higher-order question to prompt deep thinking, problem-solving, or differences of opinion• Additional probing questions to use as scaffolds to guide the discussion and provide support for challenging tasks • Establish and provide clear directions for feedback routines. Feedback should focus on the task, state positive aspects, make suggestions for improvement, or ask a question. For example, “I like your idea about _________. One question I have is _________.”Tips for Structuring Partner Discussion• Provide a prompt for a brief “turn-and-talk” discussion.• Give clear directions for Partner 1 and Partner 2. (Optional: Establish Partner 1 as the peer with slightly more developed language proficiency to serve as a model for Partner 2.)• Ask Partner 1 to go first most of the time. Partner 2 should listen and respond.• Structure Partner 2 responses, such as in the following:• Repeat: “My partner, Alex, said that _________.”• Agree or disagree: “I [agree/disagree] with Alex that _________ because _________.” • Provide examples: Partner 1 states the concept and Partner 2 provides examples from the text or from experience. • Elaborate on the idea: Partner 2 provides more detail to what Partner 1 said. • Establish peer feedback routines. Give clear directions regarding feedback so that it focuses on the task, states positive aspects, and makes suggestions. Sample Discussion Prompt 1(Vocabulary word to preteach: “mention”) With your group, find in the story where Alex mentions to his father that he signed up for the bas-ketball team. Read it aloud and write the page number. Then, find where Alex’s father plans a family trip on the date of the big game. Read it aloud and write the page number. Then, discuss these ques-tions and be ready to talk about your answer with the class: • Why is Alex’s place on the basketball team in danger? • What could Alex have done differently to avoid the problem?Sample Discussion Prompt 2 (Vocabulary word to preteach: “approach”) Will Alex approach his father about the basketball team? Answer in a complete sentence and use our focus word, “approach.” Give three pieces of evidence from the text to support your answer. © 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International9. Teachers use visual aids to scaffold instruction for ELLs.Using visual representations of key concepts and processes is generally an effective teaching strategy. Tools such as graphic organizers, video clips, timelines, process charts, story maps, and diagrams are visual representations that illustrate learning. Such visual tools make concepts and processes compre-hensible for ELLs who may have difficulty due to the language demands of reading text or listening to explanations. For ELLs, who often have conceptual knowledge but not always the language skills to express it, visual representations provide a bridge between concepts and language. However, teachers should be aware of cultural and linguistic factors that may affect the usefulness of the visual aids for ELLs. A graphic organizer is one type of visual representation that is widely used in K–12 classrooms. With additional language support, graphic organizers provide a means for ELLs to engage in class discussion. It is important for teachers to consider the language supports needed for ELLs to grasp visually represented content and to check for understanding along the way.10. Teachers use formative assessment to understand ELLs’ progress and guide follow-up instruction.Formative assessment provides teachers with data to fine tune instruction to address students’ learn-ing needs. This cyclical process includes establishing learning goals, gathering student performance data, and using the evidence to adjust instruction. Ongoing formative assessment provides teachers, students, and parents with information about students’ progress. Teachers need to know how ELLs are progressing with content acquisition and language development. Most teachers collect formative assessment regarding students’ mastery of content through quizzes, homework, projects, or in-class performance. However, teachers must also understand the process of second-language development. Knowing how effectively ELLs listen, speak, read, and write is just as important as knowing how they perform on learning tasks. Understanding students’ language development helps teachers to discern whether learning difficulties are due to a breakdown in understanding of the content or difficulty with the language used in class. As teachers observe students and evaluate their classwork, it is important to note their understanding and use of language at the word, sentence, and discourse levels. © 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 InternationalObserving Students’ Language Performance in the ClassroomFeatures of Language CompetenceWhat to Observe ExamplesUnderstanding  of Words Students understand and use the words used in instruction.How ELLs under-stand general academ-ic vocabulary, disci-pline-specific words, and multiple-meaning wordsGeneral academic vocabulary words oc-cur frequently across subject areas, such as “compare,” “analyze,” and “result.”Discipline-specific words occur within subject areas, such as “hypotenuse” in math, “longitude” in geography, and “alkaline” in chemistry.One must rely on the context to understand multiple-meaning words, such as “solution” in math and “solution” in chemistry.Understanding  of SentencesStudents understand various aspects of sen-tence structure, includ-ing syntax, verb tenses and forms, punctua-tion, and grammatical structure. How ELLs under-stand verb tense; forms of words; sim-ple, compound, and complex sentences; and punctuation The teacher explains…The teacher explained…The teacher will explain…“Glaciers are frozen water. Glaciers melted. Glaciers moved and changed the land.”“Glaciers, frozen masses of water, melted and, as they moved, changed the land.” Understanding  of DiscourseStudents understand how language func-tions as a form of communication. This includes being able to understand and produce language in context. ELLs’ coherence, including the use of pronouns; connect-ing words; temporal words; pragmatics (conventions of dialogue); and text features (main idea, supporting details, headings) Pronoun referents:The scientists in Antarctica studied the ecosystem. They measured daily tempera-tures and wind speed. They tracked various elements.Temporal words:First, the students gathered information on China. Then, they compared their notes. Later, they wrote a report.© 2018 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0 International—www.meadowscenter.org—For a list of research evidence supporting the recommendations in this document, visit  www.meadowscenter.org/library/resource/10-key-policies-and-practices-for-teaching-ells",
    "Link": "https://core.ac.uk/download/211345795.pdf"
}