{
    "Title": "Australia’s future emissions reduction targets",
    "Authors": "Climate Change Authority",
    "Year": "No year available",
    "Abstract": "Presents the Climate Change Authority\\u27s recommendations on Australia\\u27s future emissions reduction targets, and constitutes the first part of the Authority\\u27s response to the Special Review requested by the Minister for the Environment in December 2014.\n\nBackground\n\nThis report builds on the work in the Authority\\u27s recent report, Reducing Australia’s Greenhouse Gas Emissions—Targets and Progress Review , which was provided to the Minister (and released publicly) on 27 February 2014. That report, which reflected extensive public consultation, presented the Authority’s comprehensive assessment of the evidence coming from climate scientists, the efforts being made by other countries to reduce their emissions, and the targets judged to be in Australia’s best interests. The Authority recommended a target for&nbsp; 2020 and a trajectory range for emissions out to 2030. It also recommended a long-term emissions budget to guide Australia’s planning over the period to 2050.\n\n&nbsp;\n\n\nWeighing up all the relevant factors, the Authority recommended a 2020 target for Australia of 19 per cent below 2000 levels. By way of guidance for the period beyond 2020, the Authority recommended a trajectory range to 2030 of emissions reductions of between 40 and 60 per cent below 2000 levels. Under the Clean Energy Act 2011 (Cth) the Government was obliged to respond to these recommendations by the end of August 2014 but, with the repeal of that Act, this obligation lapsed.\n\n&nbsp;\n\nIn preparing this current report, the Authority has revisited the material underpinning its February 2014 report and updated its analysis in the light of new information that has emerged since that time, particularly in regard to the science of climate change and the recent efforts of many countries to reduce their greenhouse gas emissions.\n\n&nbsp;\n\n\nThe Authority believes this new information supports its previous assessment that Australia\\u27s conditions for moving some way beyond its unconditional target have been met. These conditions included increased clarity around the level and credibility of international action and agreement on emissions accounting and reporting. Australia\\u27s commitment under the UNFCCC includes an unconditional emissions reduction target of 5 per cent below 2000 levels by 2020, and conditional targets of up to 15 or 25 per cent.\n\n&nbsp;\n\n\nThe present Government has shown no inclination to move beyond the unconditional 2020 target. The consequences of limiting Australia\\u27s emissions reductions to this minimum 5 per cent target have been factored into the Authority’s consideration of appropriate post-2020 targets.\n\n&nbsp",
    "Keywords": "No keywords available",
    "Publisher": "Climate Change Authority",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " \n  \n \nemissions\nSPEC\nDRA\nA\nAustral\n reducti\nIAL R\nFT R\nPRIL 20\nia's futu\non targe\nEVIEW\nEPOR\n15\nre \nts\n \nT\n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPublished b\nwww.climat\nThis work is\nthis license\nThe Climat\nfollowing m\n© Common\n \nIMPORTAN\nThis docum\npolicy of the\nCommonwe\nmaterial co\ninterpretatio\ny the Clima\nechangeau\n licensed u\n, visit http://\ne Change A\nanner: \n or \nwealth of A\nT NOTICE \nent is produ\n Commonw\nalth prepar\nntained in th\nns, deduct\nte Change \nthority.gov.a\nnder the Cr\ncreativecom\nuthority ass\n \nustralia (Cli\n– PLEASE \nced for gen\nealth of Au\ning this repo\nis publicatio\nions, conclu\nAuthority \nu \neative Comm\nmons.org/li\nerts the righ\nmate Chang\nREAD \neral informa\nstralia. The \nrt accept n\nn, or for an\nsions or act\n \nons Attribu\ncenses/by/3\nt to be reco\ne Authority)\ntion only an\nCommonwe\no liability for\ny action as \nions in relyi\ntion 3.0 Au\n.0/au \ngnised as a\n 2015. \nd does not\nalth of Aus\n the accura\na result of a\nng on this m\nstralia Licen\nuthor of the\n represent a\ntralia and al\ncy of or infe\nny person’s\naterial. \nce. To view\n original ma\n statement \nl persons ac\nrences from\n or group’s \n a copy of \nterial in the \nof the \nting for the \n the \n   | i \nDRAFT REPORT \nThis draft report presents the Climate Change Authority's recommendations on Australia's future \nemissions reduction targets, and constitutes the first part of the Authority's response to the Special \nReview requested by the Minister for the Environment in December 2014. The Authority will consult \nfurther with stakeholders on this report, and is inviting further submissions from interested parties; it will, \nif deemed appropriate, review its recommendations in the light of those consultations and submissions. \nKey dates \nMinister requests a \nspecial review on \nemissions trading and \nrelated matters \nDecember 2014 \n› Draft report on Australia’s future \nemissions reduction \ntargets \nApril 2015 \n› Draft report on emissions trading and \nother policies to reduce \nemissions \nNovember 2015 \n› Final report recommending \nAustralia’s climate \naction \nJune 2016 \n \nHow to make a submission \nDetails on how to lodge your submission can be found at: \nwww.climatechangeauthority.gov.au/submissions.  \nSubmissions can be lodged: \nvia email \nsubmissions@climatechangeauthority.gov.au   \nvia post \nSubmissions  \nClimate Change Authority \nGPO Box 1944 \nMelbourne VIC 3001  \nContacts \nFor further information about the Review or making a submission, contact the Climate Change Authority \non freecall 1800 475 869 or via email at enquiries@climatechangeauthority.gov.au. \nWeb site \nwww.climatechangeauthority.gov.au \n \n \n \n \n  \n ii | Australia's future emissions reduction targets: Special Review Draft Report      \n \n  \n   | iii \nCONTENTS \nIntroduction  ....................................................................................................................................... 1 \nBackground  ....................................................................................................................................... 2 \nPreliminary recommendations .............................................................................................................. 3 \nSupporting arguments ........................................................................................................................... 4 \n1.  Climate science confirms the problem ......................................................................................... 4 \n2.  The problem is long term ............................................................................................................... 7 \n3.  The problem is global ..................................................................................................................... 8 \n4.  International action and Australia’s fair contribution .................................................................. 9 \n5.  How Australia’s and global efforts contribute to climate goals ................................................ 19 \n6.  Why the recommended targets are in Australia's best interests .............................................. 23 \n7.  Are the recommended targets achievable? ................................................................................ 25 \nAppendix A  Terms of Reference .................................................................................................... 27 \nAppendix B  Public consultation .................................................................................................... 28 \nGlossary  ..................................................................................................................................... 29 \nAbbreviations and Acronyms .............................................................................................................. 32 \nReferences  ..................................................................................................................................... 34 \nFIGURES \nFigure 1 Country performance in first commitment period of the Kyoto Protocol .................................... 12 \nFigure 2 Comparing countries’ capacity ................................................................................................. 14 \nFigure 3 Comparing countries’ targets, 2005 to 2025 ............................................................................. 15 \nFigure 4 Recommended 2025 target for Australia: alternative base years ............................................. 16 \nFigure 5 EU and Australia emissions pathways, 1990 and 2005 base years ......................................... 16 \nFigure 6 Emissions reductions: 1990 to 2012, and to 2025 targets ........................................................ 17 \nFigure 7 Countries' emissions trajectories to the 2 degree goal ............................................................. 19 \nFigure 8 Relationship between targets, trajectories and national emissions budget .............................. 21 \nFigure 9 UNEP Emissions Gap Report: outlook to 2030 ........................................................................ 22 \nTABLES \nTable 1 Advances in scientific understanding of climate change .............................................................. 5 \nTable 2 Projected climate change impacts on Australia under different global warming scenarios .......... 6 \nTable 3 Top 15 greenhouse gas emitters, 2011 ....................................................................................... 9 \nTable 4 Announced post-2020 targets ................................................................................................... 11 \nTable 5 Rate of emissions reduction and budget use for 2020 and 2025 targets ................................... 22 \nTable 6 Submissions to the call for comment on targets ........................................................................ 28 \n \n\n  \n Introduction | 1 \nINTRODUCTION \nThe Minister for the Environment has requested the Authority to conduct a Special Review under \nsection 59 of the Climate Change Authority Act 2011 (Cth). The Authority received the Terms of \nReference for this three-part review on 15 December 2014; a copy is at Appendix A. \nThe first part of this Special Review requires the Authority to provide advice on Australia’s future \nemissions reduction targets, particularly for the period beyond 2020. The Minister has asked that this \npart of the Authority’s report be available for public consultation by 30 June 2015.  \nThe Government has also established a taskforce in the Department of the Prime Minister and Cabinet. \nThe taskforce will propose possible post-2020 targets for Australia to take to the Paris Conference of \nthe United Nations Framework Convention on Climate Change (UNFCCC) in December 2015, when all \ncountries will be expected to sign off on their post-2020 contributions. The taskforce has released an \nissues paper and called for public comments by 24 April 2015. \nPreparations for the Paris Conference are well underway. Although no firm deadline has been set, \ncountries have been invited to announce their post-2020 targets well in advance of the Paris meeting. \nSome have done so already and several more, including Australia, are working towards mid-year \nannouncements.  \nThis report is intended primarily as an input into the Government’s deliberations and to the Parliament \nmore broadly. Given the Government’s intention to announce Australia’s targets by mid-2015, the \nAuthority is releasing its draft recommendations now to provide time for public consultations with \ninterested parties before the Government makes its decision.  \nThe second and third parts of the Special Review will analyse possible policy instruments (including an \nemissions trading scheme) to help meet whatever targets might be determined for Australia in the \ncontext of the Paris negotiations. These policy options will be the subject of subsequent reports and \nconsultations. \n  \n 2 | Australia's future emissions reduction targets: Special Review Draft Report \nBACKGROUND \nThis report builds on the work in the Authority's recent report, Reducing Australia’s Greenhouse Gas \nEmissions—Targets and Progress Review, which was provided to the Minister (and released publicly) \non 27 February 2014. That report, which reflected extensive public consultation, presented the \nAuthority’s comprehensive assessment of the evidence coming from climate scientists, the efforts being \nmade by other countries to reduce their emissions, and the targets judged to be in Australia’s best \ninterests. The Authority recommended a target for 2020 and a trajectory range for emissions out to \n2030. It also recommended a long-term emissions budget to guide Australia’s planning over the period \nto 2050.  \nWeighing up all the relevant factors, the Authority recommended a 2020 target for Australia of \n19 per cent below 2000 levels. By way of guidance for the period beyond 2020, the Authority \nrecommended a trajectory range to 2030 of emissions reductions of between 40 and 60 per cent below \n2000 levels. Under the Clean Energy Act 2011 (Cth) the Government was obliged to respond to these \nrecommendations by the end of August 2014 but, with the repeal of that Act, this obligation lapsed.  \nIn preparing this current report, the Authority has revisited the material underpinning its February 2014 \nreport and updated its analysis in the light of new information that has emerged since that time, \nparticularly in regard to the science of climate change and the recent efforts of many countries to \nreduce their greenhouse gas emissions.  \nThe Authority believes this new information supports its previous assessment that Australia's conditions \nfor moving some way beyond its unconditional target have been met (CCA 2014d, p. 67). These \nconditions included increased clarity around the level and credibility of international action and \nagreement on emissions accounting and reporting. Australia's commitment under the UNFCCC \nincludes an unconditional emissions reduction target of 5 per cent below 2000 levels by 2020, and \nconditional targets of up to 15 or 25 per cent (UNFCCC Secretariat 2013).  \nThe present Government has shown no inclination to move beyond the unconditional 2020 target. The \nconsequences of limiting Australia's emissions reductions to this minimum 5 per cent target have been \nfactored into the Authority’s consideration of appropriate post-2020 targets. \nFor reasons elaborated below, the Authority considers that:  \n Australia's targets should be expressed in ‘net’ terms. That is, they should include both domestic \nemissions reductions and purchases of international emissions reduction units, net of any sales of \ndomestic units overseas.  \n The Government should set a single 2025 target and adopt a trajectory range to 2030. While no \nspecific time horizon for post-2020 targets has been prescribed internationally, with some countries \nchoosing 2025 and others 2030, the recommended approach would retain a degree of flexibility to \nrespond to changing circumstances.  \n  \n  \n Preliminary recommendations | 3 \nPRELIMINARY RECOMMENDATIONS \n2020 TARGETS \nThe Authority remains of the view that Australia should go beyond the minimum 2020 target of a \n5 per cent reduction in emissions compared with 2000 levels. \nThe Authority has previously recommended a 2020 target of 19 per cent below 2000 levels (a minimum \nreduction of 15 per cent, plus 4 percentage points from Australia's carryover under the Kyoto Protocol). \nIt also recommended Australia use international emissions reductions to complement domestic \nmeasures in meeting this target (CCA 2014d).  \nThe Authority believes these recommendations remain appropriate if Australia is to make a fair \ncontribution to global action in the period to 2020 and help to limit warming to less than 2 degrees. In \nthe absence of more concerted efforts to reduce emissions over the years immediately ahead, the task \nof achieving credible 2020 and subsequent targets will become progressively more challenging.  \nPOST-2020 TARGETS \nIn considering targets for the post-2020 period, the Authority has taken account of the uncertainty \nregarding Australia's action to 2020, and how quickly Australia might reasonably ‘catch up’ with global \nefforts. It has also continued to attach most weight to the science of climate change, the efforts of \ncomparable countries to reduce their emissions, and Australia's own long term interests. \nIf Australia does not better the minimum target of a 5 per cent reduction in emissions by 2020, but is \nprepared to match what comparable countries are planning to do by 2025—a reasonable and \nachievable objective in the Authority's judgment—the Authority recommends a 2025 target of \n30 per cent below 2000 levels. \nIn the event that Australia is able to reduce emissions by more than 5 per cent by 2020, this would \nallow a more gradual acceleration of the effort required beyond 2020, but would not change the \nAuthority’s recommended target for 2025.  \nThe Authority also recommends the Government set a limit on total emissions for the period 2021-25, in \nline with current practice under the Kyoto Protocol.  \nLooking beyond 2025, the Authority recommends a range of 40 to 60 per cent reductions from 2000 \nlevels by 2030. Such a range is consistent with Australia playing its fair part in global action, while \nproviding flexibility to adjust policy in the light of new information.  \nIn the Authority's view, these targets are consistent with climate science, with what comparable \ncountries are doing, and with Australia's best interests. The evidence to support this view is set out in \nthe remainder of this paper; the Authority will discuss its recommendations—and the reasoning behind \nthem—with stakeholders. \n 4 | Australia's future emissions reduction targets: Special Review Draft Report \nSUPPORTING ARGUMENTS  \n1. CLIMATE SCIENCE CONFIRMS THE \nPROBLEM \nThe Authority's recommendations in this report, as in its earlier reports, are founded on the \ncomprehensive scientific evidence that human activities are the major contributor to global warming. \nBurning fossil fuels, many industrial processes, and land clearing activities (among others) produce \ngreenhouse gases that trap heat radiated from the earth within the atmosphere, like a greenhouse. As \nconcentrations of greenhouse gases increase, more heat is retained and the climate warms. We are \nalready experiencing the early impacts of the problem: globally, extreme weather events have become \nmore frequent and sea levels have risen; in Australia, there are already more days of extreme heat, \nmore frequent and intense heatwaves, and increased coral bleaching on the Great Barrier Reef (CSIRO \n& BOM 2014; Australian Academy of Science 2015). \nSince the beginning of the Industrial Revolution (about 1750), the concentration of carbon dioxide in the \natmosphere has grown by 40 per cent, methane by 150 per cent and nitrous oxide by 20 per cent. Ice \ncore records, which show the atmosphere’s historical composition, suggest that the current \nconcentrations of these three gases substantially exceed those at any other time over the past \n800,000 years (IPCC 2013b). The Earth has warmed in response to the rapid increase in greenhouse \ngas concentrations; between 1880 and 2012, average global surface temperatures over land and the \nocean warmed by 0.85 degrees. Each of the last three decades was successively warmer, and each \nwas warmer than any preceding decade since 1850 when instrumental records began. The world’s \noceans are also warming. Since the 1970s, oceans have absorbed about 90 per cent of the additional \nheat within the Earth’s system (IPCC 2013b).  \nWhile the climate is clearly warming, uncertainties exist regarding the extent of future climate changes. \nFuture levels of greenhouse gas concentrations in the atmosphere will depend largely on the \neffectiveness of policies to reduce emissions, and on changes in population and technology. The \nprecise temperature response to future greenhouse gas concentrations is also uncertain; climate \nmodels project future temperature changes associated with different concentration scenarios, but can \nonly do so within ranges of probability.  \nThese uncertainties, however, have been diminishing over time, as understanding of the climate system \nimproves and climate models become more sophisticated. Since the first comprehensive assessment of \nclimate change science by the IPCC in 1990, these improvements have resulted in greater confidence \nin the connection between human activities and climate change, and in the projected climate impacts \n(Table 1).  \nThe impacts of climate change over the 21st century will depend upon the limits the global community \nplaces on global greenhouse gas emissions. The global community has agreed to limit greenhouse gas \nemissions so that the increase in warming is limited to less than 2 degrees above pre-industrial levels \n(UNFCCC 2010). This is a level that is expected to avoid the worst of the projected impacts of climate \nchange; achieving this level will require deep, urgent and sustained emissions reductions.  \n  \n Climate science confirms the problem | 5 \nTable 1 Advances in scientific understanding of climate change \nIPCC report First Assessment Report \n(1990) \nFourth Assessment \nReport (2007) \nFifth Assessment Report \n(2013) \nTemperature \nlevels \nWarming over the last 100 \nyears is estimated at \n0.3-0.6 degrees \nBetween 1906 and 2005, global \naverage temperatures warmed \n0.74 degrees  \n11 of the 12 years between \n1995 and 2006 were the \nwarmest since instrumental \nrecords began in 1850 \nBetween 1880 and 2012, \naverage global surface \ntemperatures increased \n0.85 degrees \nThe last three decades in the \nNorthern Hemisphere were \n‘likely’ (over 66 per cent \ncertainty) the warmest in 1,400 \nyears \nHuman \ninvolvement in \nthe climate \nsystem \nIt is certain that greenhouse \ngases have a natural warming \neffect and emissions from \nhuman activities are \nsubstantially increasing the \natmospheric concentrations of \nsome greenhouse gases \n‘Very likely’ (over 90 per cent \ncertainty) that humans have \ncaused most of the warming \nobserved since the mid-20th \ncentury \n‘Extremely likely’ \n(95-100 per cent certainty) that \nhumans are the dominant \ncause of warming since the \nmid-20th century \nExtreme events \n \n \n \n \n \n \n \nNo firm evidence of increased \nweather variability to date \n‘Most likely’ that with an \nincrease in mean temperature, \nepisodes of high temperatures \nwill become more frequent, and \ncold episodes less frequent \n‘Very likely’ that cold days \nbecame less frequent and \nwarm days became more \nfrequent in the late 20th century \n(from about 1960) \n‘Very likely’ that warm spells, \nheatwaves and heavy rainfall \nevents will continue to become \nmore frequent over the 21st \ncentury \n‘Likely’ that the area affected by \ndrought will increase over the \n21st century \n‘Likely’ increased incidence of \nextreme high sea level events \nover the 21st century \n‘Very likely’ that cold days \nbecame less frequent and \nwarm days became more \nfrequent since 1950 \n‘Very likely’ that frequency and \nduration of heatwaves and high \nrainfall events will increase by \nthe late 21st century \n‘Likely’ that drought intensity or \nduration will increase on a \nregional to global scale by the \nlate 21st century \n‘Very likely’ that incidence and \nmagnitude of extreme high sea \nlevel events will increase by the \nlate 21st century \nSource: IPCC 1990; IPCC 2007c; IPCC 2014c. \nEven if the world made the required emissions reductions, significant risks to the environment and \nquality of life would remain. By the end of this century, dry regions of the globe are projected to \nexperience more frequent droughts, while wet regions are projected to experience higher rainfall. Risks \nfrom extreme weather events, including heatwaves, floods and storm surges, are projected to become \nmore frequent and more intense for some locations. Human health would be affected, including by \nincreased likelihood of injury, disease and deaths from more intense heat waves and fires, diminished \nfood production and water scarcity (IPCC 2014c). \nSea levels are projected to continue to rise. Global average sea levels rose 0.19 metres between 1901 \nand 2010, driven by a combination of thermal expansion (water expanding as it warms), glaciers \nmelting, and Greenland and Antarctic ice sheets melting. Greenhouse gases emitted during this century \nwill continue to affect the atmosphere and have an additional long-term impact on sea levels (see \nTable 2). Rising sea levels increase the risks of flooding, coastal erosion and salt contamination of fresh \nwater, with significant damage to human settlements, infrastructure and coastal ecosystems.  \nAs a comparatively hot and dry country, Australia is highly exposed to the adverse impacts of climate \nchange. Australia’s climate has already warmed by 0.9 degrees since 1910, with every decade in \nAustralia warmer than the previous one since the 1940s; 2013 was Australia’s hottest year on record \n(CSIRO & BOM 2014). The frequency and intensity of fires, droughts, floods and storm surges are all \n 6 | Australia's future emissions reduction targets: Special Review Draft Report \nprojected to increase, particularly for current high-risk areas. Snow depth and area are projected to \ndecline. The Great Barrier Reef is expected to experience more frequent and severe episodes of coral \nbleaching, disease and mortality as a result of ocean warming and acidification (IPCC 2014c).  \nTemperature increases beyond 2 degrees would see progressively more serious climate impacts, with \nmore extreme weather events and associated human deaths, species extinction and risks to global and \nregional food security. Higher temperatures and humidity would compromise growing food or working \noutdoors in some regions of the globe for parts of the year (IPCC 2014c). The combination of rising sea \nlevels and more frequent extreme weather could contribute to large scale migration of populations in \naffected regions, and increased risk of insecurity and conflict in fragile states (Department of \nDefence 2013, p. 18). \nTable 2 Projected climate change impacts on Australia under different global \nwarming scenarios \n 2 degrees 3 degrees 4 degrees \nHot days-Number of days over 40 degrees \neach year by 2090 in Perth (1995 = 4 days)1; \nmedian \n \n7 days \n \n10 days \n \n20 days \nLess rain-Percentage change in median \nspring rainfall in southern Australia by 20902; \nmedian  \n-5% \n \n-10% \n \n-18% \n \nSea level rise-by 2090; median  \n \nCommitment by 2100 to sea level rise in 2300, \neven with no further anthropogenic emissions; \nspread of model scenarios \n0.4m \n \n0.2 to 0.7m \n0.5m \n \n 0.3 to 1.5m \n0.6m \n \n0.9 to 3.6m \nVirus spread-Additional Australians exposed \nto dengue fever in 2100 compared with 2000 \n(scenario medians quoted)  \n0.7 million NR \n \n5 to 8 million \n \nCoral reefs including Great Barrier Reef by \n2050-2100 \nDensity and diversity of \ncorals on reefs likely to \ndecline; vastly reduced \nhabitat complexity and \nloss of biodiversity. \nFew reef-building corals remaining. \nSnow depth in 2040-59  Reference (1980-99) \n Falls Creek                           1.5m \n Mt Hotham                            1.3m \n Mt Buller                                1.0m \n Mt Buffalo                              0.6m \n \nNR \n \n \n0.5 to 1.1m \n0.4 to 0.9m \n0.2 to 0.6m \n0.1 to 0.3m \n \n0.2 to 0.8m \n0.2 to 0.7m \n0.1 to 0.5m \n0.0 to 0.2m \nNotes: In the text, and for ‘Hot days,’ ‘Less rain’ and ‘Sea rise’, the 2, 3 and 4 degree impacts are respectively based on \nIPCC Representative Concentration Pathway (RCP) 2.6, RCP 4.5 and RCP 8.5. For ‘Virus spread,’ ‘Coral reefs including \nGreat Barrier Reef’ and ‘Snow depth in 2040-59, 2, 3 and 4 degree impacts are based on analogous scenarios described \nin the source texts. NR: not reported. \n1 Impacts on the number of hot days vary across Australia; Perth illustrates the effect. \n2 Rainfall is projected to be most affected in southern Australia in spring. \nSources: ‘Hot days,’ ‘Less rain’ and ‘Snow depth in 2040-59’ are adapted from (CSIRO & BOM 2014); ‘Sea level rise’ is \nadapted from IPCC (2013a); ‘Virus spread’ is adapted from Bambrick et al. (2008); ‘Coral reefs including Great Barrier \nReef’ is adapted from Hoegh-Guldberg et al. (2007). \n \nWarming of more than 2 degrees also increases the risks of triggering permanent changes in some \nphysical systems. These changes could take a very long time to be fully realised, but once the ‘tipping \npoint’ is crossed, they would be irreversible. The Greenland Ice Sheet is one such example: warming \nabove a certain threshold—estimated to be somewhere between one and four degrees—could trigger a \nnear-complete melting of the Sheet, raising global sea levels irreversibly by several metres over a \nmillennium or more (IPCC 2013b).  \n  \n The problem is long term | 7 \nScenarios of greater than 2 degrees warming would make adaptation increasingly challenging for all \ncountries: with warming of 4 degrees or more, Australia (along with other countries) would be hard \npressed to manage its exposure to many severe impacts (Table 1) (CSIRO 2010, p. 60).  \nOn a more positive note, many countries are now moving towards stronger climate policy actions, and \nsetting goals to continue reducing emissions beyond 2020. These actions, discussed further in \nSection 4, are indicative not only of a widespread re-awakening of the need to avoid dangerous climate \nchange but also of an appreciation that effective policy measures are available and can be \nimplemented without undermining economic prosperity. \n2. THE PROBLEM IS LONG TERM \nClimate change is a long-term problem, and avoiding dangerous climate change requires a long-term \nresponse, including sustained reductions of emissions over very long time periods.  \nUnlike some pollutants, carbon dioxide emissions have impacts that unfold over hundreds, even \nthousands, of years. There are three main reasons for this: \n Emissions can cause atmospheric concentrations to be elevated for a long time. About one-third of \nthe carbon dioxide increase due to emissions this year will remain in the atmosphere in 100 years \nand about 20 per cent will still be present in 1,000 years (IPCC 2007b). \n It takes several decades for the effects of any given concentration of greenhouse gases to have its \nfull influence on atmospheric temperatures. If, for example, greenhouse gas concentrations and \nother human influences on the climate stayed constant at 2000 levels, further warming of about \n0.6 degrees would occur by 2100 (in addition to the 0.8 degrees of warming observed to 2000) \n(IPCC 2013b). \n Elevated temperatures can cause impacts to gradually become more severe over centuries or \nmillennia—even when temperatures stabilise, ice sheets would continue to melt over many \ncenturies, adding to rises in sea levels. \nThe long term nature of the problem means that countries cannot wait to see how bad the impacts of \nclimate change are before deciding whether to take decisive action—by then it could be too late. It also \nmeans that the cumulative emissions from human activity over many decades matter much more than \nthe quantity of emissions in any one year. For this reason, the Authority attaches considerable \nsignificance to long term emissions budgets in the process of determining appropriate emissions \nreduction targets, as explained in Section 5.  \nThe long term nature and likely severity of climate change highlights the desirability of substantial and \nsustained action. Many studies show that this approach can be expected to have lower costs than \ndelaying substantial action now, and then ramping up emissions reductions later to compensate \n(IPCC 2014b; Treasury 2008).  \nThe greatest effects of climate change will be experienced by today’s children and those that come \nafter, even if they do not themselves contribute additional emissions. Climate change, therefore, tests \nthe willingness of the present generation to act in the interests of future generations—to have proper \n 8 | Australia's future emissions reduction targets: Special Review Draft Report \nregard, for example, to the health and other hazards associated with climate change, and the higher \ncosts of reducing emissions that would accrue the longer effective action is delayed. \nThese problems are skipped over in the recently released Intergenerational Report, which focuses \nprimarily on the consequences of projected demographic changes out to 2055 for future \nCommonwealth spending and debt. Spending on the environment and climate change is passed over \nbecause it ‘...is not directly linked with demographic factors’ (Australian Government 2015, p. 40). How \ndebt burdens are shared among different generations does raise important issues for policymakers, but \nthe wellbeing of present and future generations of Australians will be affected by many other factors \nbesides demographic changes. In a number of respects, climate change poses even more \nchallenging—and more intractable—policy issues, in part because of its global dimension.  \n3. THE PROBLEM IS GLOBAL \nNo country can solve the problem of climate change alone. No matter where greenhouse gases are \nemitted, in rich countries or poor, they contribute to warming the global climate system. Strong \ninternational cooperation is essential to reduce the risks of climate change, with all countries playing \ntheir part.  \nInternational negotiations have often involved substantial debate about who is responsible for the \nproblem and who should take the strongest actions to reduce their emissions. Countries have \nsometimes sought to promote their own short-term national interest by negotiating special or favourable \nconditions for themselves. Once one country receives recognition for its special circumstances, \nhowever, other countries inevitably seek similar treatment and put effective cooperation at risk. \nIn Australia, it is often argued that there is no point taking action on climate change because its \nemissions constitute such a small proportion of global emissions. Australia is a small emitter in global \nterms (1.3 per cent) but it is still the 13th largest emitter in the world (Table 3). Australia also has only \n0.3 per cent of the world’s population; on a per capita basis, the latest data show Australia’s emissions \nare the highest of all developed countries. On these numbers alone, Australia's emissions reduction \nefforts should be comparable with those of other wealthy developed countries and free of any special \npleading.  \nMoreover, while Australia may be responsible for ‘only’ 1.3 per cent of global emissions, it is \nsignificantly exposed to climate change resulting from the impacts of the other 98.7 per cent. From this \nperspective, it is in Australia’s interest to play its part in encouraging all major emitters to reduce their \nemissions.  \nAs discussed in Section 4, more and more countries are stepping up to the challenge. Under the Kyoto \nProtocol, emissions reduction targets applied only to a select list of ‘developed’ countries, but by 2010 \nalmost 100 developed and developing countries had pledged action to reduce their emissions. As the \nParis meeting approaches, all countries have been invited to put forward their Intended Nationally \nDetermined Contributions (INDCs), and many are expected to set absolute emissions reduction targets. \nSome developing countries will still need help (and time) to reduce their emissions and grow their \neconomies in less emissions-intensive ways. Climate finance, technology cooperation and capacity \n  \n International action and Australia’s fair contribution | 9 \nbuilding programs exist to help poorer countries on to a cleaner development path so that they too can \ncontribute to the global emissions reduction task. \nTable 3 Top 15 greenhouse gas emitters, 2011 \nRank Country Emissions \n(MtCO2e) \nPer cent of global \nemissions \nEmissions per \ncapita (tCO2e) \n1 China 10,260 22.3 7.6\n2 United States 6,135 13.4 19.7\n3 India 2,358 5.1 1.9\n4 Russian Federation 2,217 4.8 15.5\n5 Indonesia 2,053 4.5 8.4\n6 Brazil 1,419 3.1 7.2\n7 Japan 1,170 2.5 9.2\n8 Canada 847 1.8 24.7\n9 Germany 806 1.8 9.9\n10 Mexico 723 1.6 6.1\n11 Iran 712 1.6 9.4\n12 Republic of Korea 656 1.4 13.2\n13 Australia 595 1.3 26.6\n14 United Kingdom 541 1.2 8.5\n15 Saudi Arabia 533 1.2 19.2\nNote: WRI 2011 data is the most recent consistent set of emissions data available for these countries. Different sources \nof data for Annex I countries have been used elsewhere in this report for methodological reasons; for example, WRI data \nfor Australia differs significantly from official Department of the Environment data. \nSource: WRI (2014); emissions include those from land use, land use changes and forestry.  \n4. INTERNATIONAL ACTION AND AUSTRALIA’S \nFAIR CONTRIBUTION \nInternational action \nAustralia’s future emissions reduction targets should be set against the background of the science of \nclimate change (discussed in Section 1) and have regard to the efforts of other countries (elaborated in \nthis section). As indicated earlier, the Authority is recommending that Australia’s 2025 target should be \ncomparable with that of other relevant countries.  \nThe negotiations now underway on a new international climate agreement will build on the existing UN \nFramework Convention on Climate Change (UNFCCC) and lay the foundations for global action beyond \n2020. In December 2014, at the annual UNFCCC conference in Lima, countries agreed the key \nelements of the new international agreement. Negotiations will continue through 2015, with the aim of \nconcluding the agreement in December 2015 in Paris.  \nAll countries have been invited to announce their emissions reduction goals well before the Paris \nconference. These ‘Intended Nationally Determined Contributions’ (INDCs) will be lodged with the \n 10 | Australia's future emissions reduction targets: Special Review Draft Report \nUNFCCC and scrutinised by other countries in the course of the negotiations. Countries have agreed \nINDCs will be a “progression” beyond (that is, an improvement on) current pledges, and have been \ninvited to explain how their individual pledges are fair, ambitious and contribute toward the overarching \ngoal of avoiding dangerous climate change (UNFCCC 2014).  \nSince the Authority last assessed global efforts in its Targets and Progress Review (CCA 2014d), global \nattention and action in relation to climate change have gained momentum amongst political and \nbusiness leaders, and within community groups generally. \nOne manifestation of this is the Climate Change Summit hosted by the UN Secretary General in \nSeptember 2014 in New York. The Summit was attended by the largest ever delegation of country \nleaders to a climate conference, and also attracted strong support from business leaders. Participants \nannounced a range of new initiatives to improve energy efficiency, reduce deforestation, support carbon \nmarkets and mobilise climate finance (Ban Ki-moon 2015).  \nThe Green Climate Fund is also making progress. The Fund was established in 2010 under the \nUNFCCC to provide large-scale financial assistance to developing countries; pledges to the Fund \ntotalled US$10.2 billion by the end of 2014 (UNFCCC Secretariat 2015). Australia announced in \nDecember 2014 it would contribute A$200 million over a four year period. Other major contributors \ninclude the United States, Japan, the UK, Germany, France and Canada.  \nThe major emitting countries are stepping up their collaboration on climate change. On the eve of the \nG20 Leaders’ meeting in November 2014, China’s President Xi and the United States’ President \nObama announced several joint initiatives focused on research, development, commercialisation and \ntrade in low-carbon technologies, energy efficiency and green infrastructure (The White House 2014). \nMore recently, the United States and India strengthened their cooperation on climate change and clean \nenergy, including through a five-year memorandum of understanding on energy security, clean energy \nand climate change (The White House 2015).  \nGlobal attention and action is starting to have a material impact on emissions. The International Energy \nAgency reported that, in 2014, for the first time in 40 years of data collection there was no increase in \nglobal energy emissions (outside periods of global recession) (IEA 2015). IEA analysts attributed this \nlargely to a reduction in coal use by China, and shifts to cleaner energy by OECD countries.  \nPost-2020 pledges and policies \nSome countries have already announced post-2020 targets (Table 4). Seven of these—the United \nStates, the EU, Russia, Switzerland, Norway, Mexico and Gabon—have formalised their \nannouncements by lodging an INDC. More INDCs from both developed and developing countries are \nexpected to be announced ahead of the Paris conference. Some projections suggest that the post-2020 \npledges made in 2014 by the EU, United States and China could, if fulfilled, reduce warming by around \n0.3 degrees by 2100 (ECOFYS et al. 2014). \n  \n International action and Australia’s fair contribution | 11 \nTable 4 Announced post-2020 targets \n Country Announced Target Longer-Term Target\nChina peak CO2 emissions around 2030 not specified \nUS 26 to 28 per cent below 2005 levels by 2025 80 per cent below 2005 levels by 2050 \nEU at least 40 per cent below 1990 levels by 2030 80 to 95 per cent below 1990 levels by \n2050 \nRussia 25 to 30 per cent below 1990 levels by 2030 not specified \nSwitzerland 50 per cent below 1990 levels by 2030 80 to 95 per cent below 1990 levels by \n2050 \nNorway at least 40 per cent below 1990 levels by 2030 carbon neutral by 2050 \nGermany 55 per cent below 1990 levels by 2030 80 to 95 per cent below 1990 levels by \n2050 \nUK 50 per cent below 1990 levels over the period 2023-27 80 to 95 per cent below 1990 levels by \n2050 \nMexico 25 per cent reduction in greenhouse gases and short \nlived climate pollutants from BAU in 2030 \n50 per cent below 2000 levels by 2050 \nSouth Africa 42 per cent below BAU by 2025 not specified \nGabon 50 per cent below BAU in 2025 not specified \nNote: BAU: business-as-usual.  \nSource: US, EU, Russia, Norway, Switzerland, Mexico and Gabon: UNFCCC INDC submissions (2015). China: Joint \nUS-China announcement (The White House 2014). Germany: Energy Concept 2010 (Germany 2010). UK: (Committee \non Climate Change 2015). South Africa: (Department of Environmental Affairs 2010). \nThe announced INDCs represent a progression on previous pledges—that is, each country’s INDC is \nmore ambitious than its 2020 target—and countries are implementing new policies to meet these \nstronger targets. \nThe United States 2025 target, for example, requires roughly double the rate of emissions reductions \nunderlying its 2020 target of 17 per cent below 2005 levels (Podesta, J & Holdren, J 2014). The INDC \nidentifies some of the main policies the US proposes to use to meet its targets, including regulations \nand standards issued under the national Clean Air Act 1970. A wide range of state-based schemes, \nincluding emissions trading and renewable energy mandates, are planned to run in parallel with the \nnational measures.  \nChina’s commitments to halt growth in its carbon dioxide emissions around 2030 (or earlier if possible), \nand to increase its share of non-fossil fuels in primary energy consumption to around 20 per cent by \n2030, are crucial undertakings from the world’s biggest emitter. To meet these commitments, China \nplans to install 800 to 1,000 GW of new zero emissions capacity by 2030—more than ten times \nAustralia’s current total electricity-generating capacity (Podesta, J & Holdren, J 2014). China has seven \npilot emissions trading schemes (ETS) in operation; it is set to launch a national ETS in 2016 which will \ncover around 3 to 4 billion tonnes of emissions—around twice the size of the EU ETS (Reuters 2015). \nChina has set a cap on total energy consumption for 2015, and a cap on coal use for 2017. It is also \ncontinuing to close small inefficient coal plants; by 2011 it had closed 85 GW of capacity (IEA 2013, \np. 48). \nIndia has indicated it is preparing an INDC that will be based on its National Action Plan on Climate \nChange, with some new initiatives. India has ambitious plans to increase renewable energy capacity to \n175 GW by 2022 (BNEF 2015; MNRE 2015). Current installed renewable capacity in India is 27 GW, \nthe sixth highest in the world (REN21 2014). India also has an energy efficiency target supported by a \n12 | Australia\ntrading sch\ncent of Indi\nExchange 2\nCountry ple\nExperience\ndeveloped \ntheir emiss\nexpect that\nThe Kyoto \nemissions t\nin-transition\nnot particip\nwhich toget\ncent below \ntarget of a 4\nfinalised, in\n(Figure 1). \nFigure 1 C\n Source: Clim\nMany coun\nProtocol ru\ncommitmen\nChange 20\nAustralia’s \n2020 (DoE \n's future emissio\neme, which \na’s primary \n015). \ndges are cr\n indicates c\nand develop\nions and mo\n most count\nProtocol, ag\nargets. The\n) for the firs\nate, while C\nher accoun\n1990 levels\n per cent re\nitial evaluat\nountry p\nate Change \ntries, includ\nles allow the\nt period. Th\n09), while th\ncarryover, e\n2015). \nns reduction ta\ncovers com\nenergy cons\nedible \nountries ove\ning countrie\nst have me\nries will also\nreed in 199\n Protocol se\nt commitme\nanada initia\nted for 20 p\n on average\nduction (M\nions sugges\nerforman\nAuthority, usin\ning Australia\nse countrie\ne UK has v\ne EU is yet\nstimated at \nrgets: Special \npanies repr\numption (B\nrwhelmingl\ns have imp\nt (or surpas\n meet the f\n7, was the f\nt out targets\nnt period of\nlly participa\ner cent of gl\n over the fiv\norel & Shish\nt all particip\nce in first \ng data from (\n, surpassed\ns to ‘carryov\noluntarily ca\n to formalise\n129 Mt CO2\n \nReview Draft Re\nesenting ar\nureau of En\ny take their \nlemented a \nsed) their pr\nuture target\nirst internati\n for 38 cou\n 2008-12. O\nted but later\nobal emissi\ne year com\nlov 2014). W\nating count\ncommitm\nMorel & Shish\n their first c\ner’ the unu\nncelled its c\n its position\n-e, to help \nport \nound 25 per\nergy Efficie\nemissions r\nrange of po\nevious targ\ns they comm\nonal agreem\nntries (deve\nf those 38 c\n withdrew. A\nons in 2010\nmitment pe\nhile compl\nries have m\nent perio\nlov 2014) (EE\nommitment\nsed emissio\narryover (D\n. The Austr\nmeet its unc\n cent of GD\nncy 2012; In\neduction tar\nlicies and m\nets. It is the\nit to.  \nent with bi\nloped econo\nountries, th\nll of the rem\n–reduced th\nriod, far sur\niance proce\net their indiv\nd of the K\nA 2014). \n period targe\nns allowanc\nepartment o\nalian Gover\nonditional 5\nP and abou\ndian Energ\ngets serious\neasures to \nrefore reaso\nnding nation\nmies and e\ne United St\naining 36 c\neir emission\npassing the \nsses are no\nidual target\nyoto Prot\nts. The Kyo\nes to the se\nf Energy an\nnment inten\n per cent ta\nt 45 per \ny \nly. Most \nreduce \nnable to \nal \nconomies-\nates did \nountries—\ns to 24 per\naggregate \nt yet \ns \nocol \nto \ncond \nd Climate \nds to use \nrget for \n \n  \n International action and Australia’s fair contribution | 13 \nAlmost 100 developed and developing countries have made emissions reduction pledges for 2020. \nMost have made non-binding pledges under the UNFCCC (2014b); a few have committed to binding \ntargets under the second commitment period of the Kyoto Protocol (UNFCCC 2012). \nNearly all developed countries and some major developing countries have set quantifiable emissions \nreduction targets as part of their pledge. The UN Environment Programme (UNEP) has undertaken an \nindependent, comprehensive assessment of how countries are progressing; it found that the majority of \ncountries are expected to meet their 2020 targets. Four countries—Australia, the United States, \nCanada and Mexico—are assessed as not currently on track. To meet their targets, UNEP considers \nthat they will need to either strengthen policies to reduce domestic emissions or buy emissions \nreductions from other countries. Four countries could not be assessed, either because the country had \nmade major policy revisions (for example, Japan) or because emissions data are uncertain (for \nexample, Indonesia) (UNEP 2014).  \nThe legal status of the pledge (that is, whether it is legally binding or not) does not appear to have \naffected countries’ performance, suggesting that the precise legal status of Paris pledges is unlikely to \nbear heavily on the extent to which they are met. \nHow Australia compares \nIn assessing Australia’s fair contribution to global efforts, the Authority has considered how its \nrecommended 2025 target compares with those of other countries. It has considered evidence across \nfour key criteria—capacity to reduce emissions, adequacy relative to global climate goals, responsibility \nfor climate change, and effort required to meet the target—to help make its comparisons robust and \nrelevant (CCA 2015). Adequacy is discussed in Section 5. \nAs to Australia’s 2020 targets, the Authority concluded in its earlier review that the conditions for doing \nsomewhat better than the minimum 5 per cent target had been met and that its recommended target of \na 19 per cent reduction would be more in line with the 2020 targets of many other countries \n(CCA 2014d). The present Government, as noted earlier, has not been persuaded by this advice.  \nProjections of Australia’s emissions have been revised downwards over the years and the latest \nprojections show that the emissions reduction effort required to meet the 5 per cent unconditional target \nis now much less than previously thought; for the period 2013-20 the task has been revised down from \n1,335 Mt CO2-e in 2008 to 236 Mt CO2-e in 2014-15 (DoE 2015). This reflects a range of factors that \nare mostly unrelated to climate change policy, including the aftermath of the global financial crisis, \nindustrial closures and declining electricity demand.  \nComparability of the recommended 2025 target  \nThe Authority believes the recommended 2025 target of 30 per cent below 2000 levels is comparable \nwith the targets announced by other countries, taking account of Australia’s relative capacity and \nresponsibility to reduce emissions, and the effort required to meet the announced targets.  \nIn broad terms, as a wealthy, developed country Australia has more capacity to act on climate change \nthan developing countries (including South Africa, China and India) and similar capacity to other \ndeveloped countries (including the United States, Norway, United Kingdom and Germany). Figure 2 \nillustrates Australia’s relatively high capacity as measured by Gross Domestic Product (GDP) per \nperson and the UN Development Program’s Human Development Index (HDI).  \n \n14 | Australia\nFigure 2 C\nNote: Data a\nSource: GDP\nbased on OE\n(Australian G\nAustralia al\nand uranium\nThese endo\nemissions b\nAs noted ea\nhighest per\nintensive ec\nOn these m\ntargets of c\nGiven the p\nemissions, \ntarget. Bas\nthat the rec\nemissions p\nAustralia w\ndeveloped \nTargets are\nlevels but r\ninclude the \nlook less am\n(CCA 2015\nand in emis\n's future emissio\nomparin\nre for 2010. E\n: measured i\nCD EU21 dat\novernment 20\nso has exte\n reserves \nwments re\ny switching\nrlier, in 201\n person em\nonomy. Fig\netrics alone\nomparable \nresent struc\nAustralia wo\ned on variou\nommended\ner person a\nith measure\ncountries.  \n often comp\nesults based\neffects of e\nbitious), a\n). For these\nsions per p\nns reduction ta\ng countrie\nU estimate re\nn terms of Pu\na with scaling\n15); other co\nnsive lower\nand extensi\ninforce Aust\n to zero and\n1 Australia \nissions of al\nure 3 show\n, it could be\ndeveloped c\nture of Aus\nuld have to\ns projection\n 30 per cent\nnd emissio\ns of emissio\nared in term\n on this me\nxisting polic\nnd countries\n reasons, m\nerson—are \nrgets: Special \ns’ capac\npresents EU2\nrchasing Pow\n factor from IM\nuntries: (Unite\n-emissions n\nve renewab\nralia’s capa\n lower emis\nwas the 13t\nl developed\ns Australia’s\n argued tha\nountries. \ntralia’s econ\n make grea\ns and assu\n target wou\nns intensity\nns per pers\ns of reduct\nasure need\nies (so can \n apply diffe\nore robust m\npresented h\n \nReview Draft Re\nity \n8.  \ner Parity, 200\nF (IMF 2014\nd Nations 201\natural reso\nle energy re\ncity, as they\nsions energ\nh largest gre\n countries. A\n emissions \nt Australia h\nomy, its en\nter efforts th\nmptions, Fig\nld require re\n; it also sugg\non and emi\nions of emis\n to be interp\nmake count\nrent econom\neasures of\nere.  \nport \n5 US dollars (\n). HDI: UNDP\n3).  \nurce endow\nsources (IR\n provide op\ny sources. \nenhouse ga\nustralia als\nper person \nas a moral \nergy intensi\nan many ot\nure 3 show\nlatively stro\nests that m\nssions inten\nsions relati\nreted caref\nries that hav\nic and othe\n effort—cha\nOECD 2013);\n (2014). Popu\nments, inclu\nENA 2012; \nportunities t\n \ns emitter in\no has a rela\nand emissio\nresponsibili\nty and its sta\nher countrie\ns, for sever\nng reductio\neeting this t\nsity among \nve to busine\nully. BAU pr\ne already t\nr assumptio\nnge in emis\n EU28 estima\nlation: Austra\nding large n\nOECD & IA\no reduce Au\n the world, \ntively emiss\nns intensity\nty to at leas\nrting level o\ns to meet a\nal measures\nns in total e\narget would\nthe highest \nss-as-usua\nojections ge\naken substa\nns in their p\nsions intens\nted by CCA \nlia: \natural gas \nEA 2014). \nstralia’s \nwith the \nions-\n in 2010. \nt match the \nf \n given \n of effort, \nmissions, \n still leave \nof \nl (BAU) \nnerally \nntial action \nrojections \nity of GDP \n \n  \n International action and Australia’s fair contribution | 15 \nFigure 3 Comparing countries’ targets, 2005 to 2025  \n \n \n \nNote: Top panel: reductions are based on announced targets. The numbers below the bars are the percentage \nreductions from 2005 levels. Middle and lower panels: these show levels in 2005 and 2025; the numbers above the bars \nshow the percentage change from 2005 levels. US figure is midpoint of its 2025 target range. EU, Norway, Switzerland \nand Germany figures are midpoints between their 2020 and 2030 targets. This figure uses UNFCCC emissions data \n(including land sector). This may not match countries’ Kyoto Protocol emissions accounts (particularly for Norway). \nSource: Historical Emissions—Australia: 2014-15 Projections (DoE 2015); Remaining countries: (UNFCCC \nSecretariat 2014a). Emissions targets—See Table 4. GDP and Population—See Figure 2. \nCosts are obviously relevant to assessing relative effort. Australia’s current economic structure and \ndependence on fossil fuels (particularly coal) for energy mean it must make a relatively greater effort \nthan many other developed countries. The costs (and benefits) of the Authority’s recommended target \nare considered further in Sections 6 and 7. The main point to note here is that costs depend heavily on \nthe policies adopted to pursue targets, not just the strength of the targets themselves. A weak target \ncould impose high costs if inefficient policies are used; conversely a strong target could be achieved at \nrelatively modest cost if efficient policies are adopted. \nReference years and time frames are also relevant when comparing effort. The Government has sought \nviews on what base year should be used for Australia’s post-2020 target (PM&C 2015). Figure 4 shows \nhow the recommended 2025 target of 30 per cent below 2000 levels compares with other possible \n-11%\n-23%\n-27%\n-36% -36% -37%\n-42%-45%\n-30%\n-15%\n0%\nNorway EU US Australia Germany Switzerland UK\nC\nha\nng\ne \nin\n to\nta\nl \nem\nis\nsi\non\ns:\n 2\n00\n5 \nto\n 2\n02\n5\n-48% -27%\n-48% -26%\n-34%\n-38%\n-54%\n0\n10\n20\n30\nSwitzerland Norway UK EU Germany US Australia\nEm\nis\nsi\non\ns \npe\nr p\ner\nso\nn \n(t/\npe\nrs\non\n)\n-43% -59%\n-60% -50% -45%\n-50%\n-66%\n0\n250\n500\n750\n1000\nNorway Switzerland UK Germany EU US Australia\nEm\nis\nsi\non\ns \nin\nte\nns\nity\n \n(t/\n$m\n G\nD\nP \nPP\nP)\n 2005 level         2025 target projection \n16 | Australia\nreference o\nrequired to \ncircumstan\nFigure 4 \nSource: Hist\nAustralia’s \nbase year t\nbase year m\nhighlights t\nreductions \nFigure 5 \nNote: To illus\nAustralia’s em\nThe EU trajec\n40 per cent). \nSource: As p\n300\n350\n400\n450\n500\n550\n600\n650\n199\nEm\nis\nsi\non\ns \n(M\ntC\nO\n2-\ne)\n60\n80\n100\n120\n1990\nPe\nr c\nen\nt o\nf 1\n99\n0 \nle\nve\nls\n's future emissio\nr ‘base’ yea\nmeet it, but\nces surroun\nRecomme\norical greenho\ntargets are \nhe recomm\nakes Aust\nhe reduction\nstill to come\nEU and Au\ntrate the effe\nissions trajec\ntory is to 20 \n \ner Figure 3. \n0 1995\n31% \nbelow \n1990\nHistori\n1995 200\nns reduction ta\nrs. Using a \n can make t\nding the cho\nnded 202\nuse gas emis\nusually pres\nended 2025\nralia’s targe\ns the EU ha\n.  \nstralia em\nct of using diff\ntory is to 5 pe\nper cent in 20\n2000\n30%\nbelow \n2000\ncal emissions\n0 2005 2\nEU Historical\nAustralia Hist\nAustralia -30%\nrgets: Special \ndifferent ref\nhe target ap\nsen base y\n5 target fo\nsions: (DoE 2\nented again\n target for A\nts appear m\ns already a\nissions \nerent base ye\nr cent in 202\n20, and 30 pe\n2005 20\n3\nb\n2\n36% \nbelow \n2005\n and trajectory\n010 2015\n \norical\n at 2030 \n \nReview Draft Re\nerence year\npear strong\near.  \nr Austral\n015).  \nst a 2000 b\nustralia app\nuch more a\nchieved, wh\npathways\nars, the two p\n0, then to the\nr cent in 2025\n10 2015\n2% \nelow \n010\nCCA \ntarget\n to recomme\n2020 202\n \n \nport \n for a target\ner or weake\nia: alterna\nase year. W\nears essen\nmbitious (Fi\nile the later\n, 1990 and\nanels index e\nAuthority’s re\n (the mid-poin\n2020\n2025\n level\nnded target\n5\n60\n80\n100\n120\n200\nPe\nr c\nen\nt o\nf 2\n00\n5 \nle\nve\nls\nEU anno\nAustralia\n does not c\nr dependin\ntive base\nhen consid\ntially the sa\ngure 5). The\n base year \n 2005 bas\nmissions at 1\ncommended 3\nt to the EU’s \n2025\n30%\nbelow \n2000\n5 2010 2\nunced targets\n -5% at 2020 \nhange the e\ng on the par\n years \n \nered agains\nme as the E\n earlier bas\nhighlights th\ne years \n990 and 2005\n0 per cent ta\n2030 target o\n015 2020\n \nffort \nticular \nt a 1990 \nU; a 2005 \ne year \ne \n  \n levels. \nrget in 2025. \nf at least \n2025\n  \n International action and Australia’s fair contribution | 17 \nFigure 6 illustrates trends over time for a wider set of countries that have indicated targets for 2025, \nusing three measures: changes in total national emissions, emissions per person and the emissions \nintensity of the economy. It distinguishes the reductions that have already occurred (1990-2012) from \nthe reductions yet to come (2012-2025). Countries are ordered according to the reductions required to \n2025 to meet announced targets: countries requiring the smallest future reductions are on the left; \ncountries requiring the largest future reductions on the right. \nFigure 6 Emissions reductions: 1990 to 2012, and to 2025 targets  \nTotal emissions \n \n \nEmissions per person \n \nEmissions intensity \n \nNote: Numbers in light green bars show change 1990-2012 and numbers below bars show total change 1990-2025. This \nfigure uses UNFCCC emissions data (including land sector). This may not match countries’ Kyoto Protocol emissions \naccounts (particularly for Norway). \nSource: See Figure 3. \nMost of these countries have reduced their total emissions, and all have reduced their emissions per \nperson and emissions intensity since 1990. All countries’ targets imply further improvements. In \ngeneral, the countries that have achieved the least reductions to date are proposing to lift their efforts in \nthe post-2020 period. The Authority’s recommended 30 per cent target for Australia would require \nrelatively large reductions, but this should be seen against comparatively small reductions—particularly \n-21%\n+3%\n-26% -24%\n-1% -1%\n-35%\n-30%\n-16%\n-50% -48%\n-31%\n-35%\n-60\n-40\n-20\n0\n20\nNorway EU US UK Germany Australia Switzerland\nC\nha\nng\ne \nfr\nom\n 1\n99\n0 \n(%\n) \n-35%\n-45%\n-26%\n-18% -26%\n-33%\n-26%\n-18%\n-51%\n-35% -39%\n-48%\n-57% -58%\n-52%\n-80\n-60\n-40\n-20\n0\nNorway EU US Germany UK Australia Switzerland\nC\nha\nng\ne \nfr\nom\n 1\n99\n0 \n(%\n) \n-63%\n-48% -46%\n-56%\n-42%\n-52%\n-32%\n-74%\n-64% -67%\n-77%\n-63%\n-78%\n-64%\n-100\n-80\n-60\n-40\n-20\n0\nNorway EU Germany UK US Australia Switzerland\nReduction 1990-2012 Required reduction 2012-2025\nC\nha\nng\ne \nfr\nom\n 1\n99\n0 \n(%\n) \n 18 | Australia's future emissions reduction targets: Special Review Draft Report \nin total emissions—over the past two decades. Larger reductions are inevitable if Australia is to \n‘catch-up’ and match the efforts of other comparable countries. \nIn the Authority’s judgment, based on the preceding discussion, an Australian emissions reduction \ntarget of 30 per cent below 2000 levels by 2025 would be broadly comparable to the targets announced \nby other relevant countries. It would mean that, by 2025, Australia would have narrowed (but not \nclosed) the gap between its per person emissions and emissions intensity levels and those of other \nsimilar, comparable developed countries. \nA trajectory range to 2030  \nAs noted earlier, while there is no prescribed time horizon for post-2020 targets the Authority \nrecommends the Government set a single target for 2025, and a trajectory range to 2030. This provides \nreasonable flexibility to adjust and respond to new information, including on climate science and \ninternational action, rather than being locked into a single target more than a decade into the future.  \nA 30 per cent target by 2025 is consistent with the medium-term emissions reduction goals \nrecommended in the Authority’s Targets and Progress Review (CCA 2014d). That Review \nrecommended that Australia reduce emissions by between 40 and 60 per cent below 2000 levels by \n2030. A 30 per cent target by 2025 lies at the lower (weaker) edge of that trajectory range. Beyond \n2025, the Authority considers its previously recommended trajectory range remains appropriate. \nThe recommended 2030 range appears consistent with international benchmarks of the action required \nto limit warming to 2 degrees. Höhne et al. (Höhne et al. 2014), for example, reviewed over 40 studies \nof global emissions reduction pathways. They found that OECD nations in aggregate would need to \ncontribute about a 50 per cent reduction in emissions from 2010 levels by 2030 (within a range of 37 to \n75 per cent) for the world to have a roughly even chance of staying below 2 degrees. Non-OECD \ncountries would also have to take significant action. \nFigure 7 compares the recommended 30 per cent target by 2025 and 40 to 60 per cent trajectory to \n2030 for Australia with the EU and United States targets. These targets are also compared with the \nOECD range from Höhne et al. The weaker bound of the Authority’s recommended 2030 trajectory \nrange for Australia and the EU’s 2030 target compare well on this measure. The United States would \nneed to accelerate its emissions reductions beyond 2025 to fall within the identified range. The stronger \nbound of the recommended 2030 trajectory range provides scope for Australia to remain in line with \nothers if global action continues to strengthen.  \n  \n How Australia’s and global efforts contribute to climate goals | 19 \nFigure 7 Countries' emissions trajectories to the 2 degree goal \n \nNote: Australia: trajectory shows historical emissions, a 5 per cent 2020 target, a 30 per cent 2025 target, and the \ntrajectory range to 2030. Höhne: Illustrated range at 2030 of 33-74 per cent reductions from 1990 levels corresponds to \npublished estimate of 37-75 per cent reductions from 2010 levels. IPCC: Illustrated range at 2030 is a straight line \ninterpolation between IPCC estimates of required reductions of 25-40 per cent from 1990 levels by 2020, and 80-95 per \ncent by 2050, for Annex I (developed) countries, as part of global action to give an even chance of stabilising \ntemperatures at two degrees.  \nSource: See Figure 3. Höhne range: (Höhne et al. 2014). IPCC range: (IPCC 2007a). \n5. HOW AUSTRALIA’S AND GLOBAL EFFORTS \nCONTRIBUTE TO CLIMATE GOALS \nIn setting its targets, Australia needs to look not only at other countries' current pledges to reduce \nemissions in the decade or so ahead but also at the overall goal of limiting global warming to less than \n2 degrees. Science can determine, for different probabilities, the maximum level of global emissions \nthat can be emitted before warming exceeds 2 degrees (that is, the global budget). What constitutes \nAustralia's fair share of that budget, however, is a matter of judgment. \nA global budget for 2 degrees  \nEmissions budgets serve to define overall limits for global and national emissions. As discussed in \nSection 1, global warming results from an increased concentration of greenhouse gases in the \natmosphere, rather than emissions in any one year. These concentrations are determined by \ncumulative emissions over an extended period, given greenhouse gases stay in the atmosphere for a \nlong time. Emissions budgets link cumulative emissions of greenhouse gases to prospective \ntemperature increases and thereby help to communicate the ongoing scale of the challenge to limit \nglobal warming, as explained by climate science. \n20\n40\n60\n80\n100\n120\n1990 1995 2000 2005 2010 2015 2020 2025 2030\nPe\nr c\nen\nt o\nf 1\n99\n0 \nle\nve\nls\nUS - historical US - to 2025 target\nEU - historical EU - to 2030 target\nAustralia - historical Australia - CCA Recommendations\nAustralia - 5% target\n2030 Höhne\n2030 IPCC\n 20 | Australia's future emissions reduction targets: Special Review Draft Report \nBox 1 Selecting a global emissions budget \nBudgets are expressed as cumulative greenhouse gas emissions over a period of time and defined in \nterms of their probability of restricting global warming to a specified level. In its Targets and Progress \nReview, the Authority used a global emissions budget that provides a likely chance (67 per cent \nprobability) of limiting warming to 2 degrees or less to help determine a long term emissions budget for \nAustralia. This budget corresponds to around a 90 per cent chance of staying below 3 degrees and \nmore than 95 per cent chance of staying below 4 degrees. \nTighter global budgets (that is, lower total emissions) provide a higher probability of keeping global \nwarming below 2 degrees and help minimise the chance of greater warming. \nThe Authority used a multi-gas budget covering gases regulated by the Kyoto Protocol, rather than only \ncarbon dioxide, to better recognise the range of activities and gases contributing to global warming. The \nglobal emissions budget used by the Authority is approximately 1,700 gigatonnes of carbon dioxide \nequivalent (Gt CO2-e) over 2000-2050 (Meinshausen et al. 2009, p. 1161; CCA 2014d, p. 47; \nIPCC 2007b). About 36 per cent of this global budget had already been used up between 2000 and \n2012 (CCA 2014d, p. 117).  \nFrom global to national budgets \nAnother way of assessing whether Australia is making its fair contribution to global action to keep \nwarming below 2 degrees (separate from the comparability approach discussed in Section 4), is to \nconsider Australia’s utilisation of its 'fair share' of the global emissions budget. Through the UN \nFramework Convention, countries have agreed to make equitable contributions to avoiding dangerous \nclimate change, taking account of differences in national capacity and responsibility. Determining how \nto balance these different aspects involves value judgments; these judgments lie at the heart of \ndifferent approaches to determining what constitutes ‘fair’ shares. \nIn its Targets and Progress Review, the Authority concluded that, in the long term, it is fair that all \ncountries have equal rights per person to emit. It went on to calculate a fair share of the global \nemissions budget for Australia, according to a ‘modified contraction and convergence’ approach, in \nwhich countries contract from their current emissions per person and converge to equal rights by 2050 \n(CCA 2014d, p. 117). The approach used was developed by Professor Garnaut (2008, pp. 206–208) \nand allows fast-growing developing countries a transitional period of additional growth before they \ndecline to the global average level. Many submissions to the Targets and Progress Review supported \nthis approach. The Authority considers this approach to be conceptually fair and consistent with the \nequity principles embodied in the UNFCCC and the Authority's statutory guidance. While some \napproaches would result in a larger share for Australia, many others would result in a smaller share—\nfor example, approaches based on immediate convergence to equal emissions per person and \napproaches that take account of historical emissions. \nApplying the modified contraction and convergence approach, the Authority calculated a long term \nnational emissions budget for Australia of 10.1 Gt CO2-e for the period 2013 to 2050. This represents \nAustralia's fair share of global action that is estimated to provide a likely chance (67 per cent probability) \nof achieving the 2 degree goal and provides a relevant long-term backdrop to setting short- and \nmedium-term targets.  \n From natio\nLong-term \ndifferent pa\nlong-term n\nand those m\nrequired m\nAustralia to\naction.  \nFigure 8 illu\ntarget for th\neach time p\nFigure 8 \nNote: The tra\nthe first Kyoto\nrecommende\nSource: Hist\nTable 5 illu\nyears imme\nmatch the e\nAustralia is\nnal budgets \nbudgets do \nthways for n\national bud\nade neces\nitigation effo\n scale up (o\nstrates the \ne distributio\neriod and h\nRelations\njectory is calc\n commitment\nd trajectory ra\norical greenho\nstrates the g\ndiately ahe\nfforts of co\n to make its\nto targets \nnot tightly p\national emi\nget. Budget\nsary later. W\nrt to Austra\nr down) its f\nimplications\nn of effort o\now quickly A\nhip betwe\nulated from A\n period. Leve\nnge to 2030 r\nuse gas emis\neneral poin\nad will nece\nmparable co\n fair contribu\nrescribe the\nssions coul\ns do, howev\neaker targ\nlians in the f\nuture action\n of a 5 per c\nver time. Ta\nustralia’s d\nen targets\nustralia’s first\nls are based o\neflects the 30\nsions: (DoE 2\nt that mode\nssitate muc\nuntries by 2\ntion to achi\n  \nHow Aust\n timing or p\nd limit Austr\ner, make cl\nets use up m\nuture. Stron\n to respond\nent 2020 ta\nble 5 show\nerived long\n, trajecto\n Kyoto target \nn emissions f\n per cent targ\n015). All othe\nst efforts by\nh more inte\n025—and w\neving the gl\nralia’s and glo\nace of emis\nalia’s cumu\near the trad\nore of the \nger near te\n to changes\nrget and th\ns the corres\n-term budge\nries and n\n(108 per cent\nigures and pr\net in 2025. \nr data: Climat\n Australia to\nnsive efforts\nill need to \nobal 2 degr\nbal efforts con\nsions reduc\nlative emiss\ne-off betwee\nbudget now\nrm targets p\n in the scie\ne recommen\nponding rat\nt is exhaus\national em\n of 1990 level\nojections upd\ne Change Au\n reduce its \n in the year\nbe sustaine\nee goal. \ntribute to clim\ntions; a num\nions to its ‘fa\nn actions ta\n and leave m\nreserve opt\nnce or level \nded 30 per\nes of reduct\nted. \nissions \ns) in 2010, the\nated in 2015. \nthority. \nemissions o\ns beyond 20\nd long there\nate goals | 21\nber of \nir share’ \nken earlier \nore of the \nions for \nof global \n cent 2025 \nion for \nbudget \n mid-point of \nThe \nver the \n20 just to \nafter if \n \n \n22 | Australia\nTable 5 R\n \nTarget points\n(2020/2025) \n5/30  \nNote: The ye\nbudget is exh\nThe global \nefforts to re\ndespite sig\nglobal redu\ngoal. Looki\nemissions r\nannual glob\nless than 2\nFigure 9 \nNote: This ch\nafter about 2\nwarming. The\n—the median\nthe IPCC dat\nSource: UNE\n's future emissio\nate of em\nAver\n 2010\n-1.3 \nar the budget\nausted. \nbudget app\nduce emiss\nns of growin\nctions still fa\nng out to 20\neduction ple\nal emission\n degrees.  \nUNEP Em\nart is adapted\n008—the med\n blue band sh\n and 20-80th \nabase, source\nP (2014) with\nns reduction ta\nissions re\nage percen\n-20 20\n-4\n is exhausted\nroach highli\nions. Despit\ng momentu\nll short of w\n30, UNEP e\ndges and p\ns (Figure 9)\nissions G\n from UNEP \nian and 20-80\nows pathway\npercentile ran\nd from multip\n scenarios fro\nrgets: Special \nduction a\ntage chang\n20-25 \n.6 \n is based on a\nghts the nee\ne global ag\nm, the UN E\nhat is requi\nstimates th\nathways to \n. UNEP bel\nap Report\nGap report. B\nth percentile r\ns consistent w\nge are shown\nle models. \nm IPCC (201\n \nReview Draft Re\nnd budge\ne \nPost 2025 \n-3.6 \n straight line t\nd for all cou\nreement to \nnvironment\nred to put th\ne difference\n2 degrees i\nieves, howe\n: outlook\nusiness-as-us\nange are sho\nith a likely ch\n. These projec\n4a). \nport \nt use for \nShare of lo\nremaining a\nexhausted \n34 per cent\nrajectory pos\nntries—not\nlimit warmin\n Programm\ne world on \n between pr\ns equivalen\nver, that it is\n to 2030 \nual scenarios\nwn. These sc\nance of limitin\ntions are bas\n2020 and \nBu\nng-term budg\nfter 2025, ye\n \n, 2044 \nt-2025 that ru\n just Austra\ng to less tha\ne (UNEP) p\na clear path\nojections ba\nt to about on\n still feasib\n exclude coun\nenarios are co\ng global warm\ned on the larg\n2025 targ\ndget \net \nar \n2021-25 \n(Mt CO2-\n2,235 \nns until the lon\nlia—to inten\nn 2 degree\nrojects aggr\nway to the 2\nsed on cur\ne third of c\nle to limit wa\ntry pledges a\nnsistent with \ning by 2100 \ne range of sc\nets \nbudget \ne) \ng-term \nsify their \ns, and \negate \n degree \nrent \nurrent \nrming to \nnd action \n4 degrees of \nto 2 degrees \nenarios in \n  \n Why the recommended targets are in Australia's best interests | 23 \n6. WHY THE RECOMMENDED TARGETS ARE \nIN AUSTRALIA'S BEST INTERESTS \nThe Authority believes it is unarguably in Australia's interests that an effective international agreement \nto reduce greenhouse gases be reached in Paris. As noted earlier, as the driest inhabited continent, \nAustralia is particularly exposed to the adverse impacts of climate change. Sustained global \ncooperation and action are essential to properly manage these risks, and Australia needs to \ndemonstrate it is up to carrying its share of the load. \nIn setting targets that are in Australia's best interests, all relevant costs, benefits and risks should be \nassessed. This is not an easy task. The main benefits, for example, come from effective global action to \nreduce the adverse effects of climate change, which depends among other things on the emissions \nreduction targets to be adopted by Australia and other countries in Paris. On the other side of the \nequation, the costs to Australia will depend heavily on the particular suite of measures implemented to \npursue Australia's target—another area of some uncertainty at this time. \nA better assessment of the net benefits (or costs) to Australia will become possible as these current \nuncertainties are resolved. The Authority's judgment, however, is that its recommended targets—\nbacked by appropriate policy measures—are very much in Australia's best interests. \nCosts of recommended targets \nSome opportunities to reduce emissions, especially those that improve energy efficiency, can provide \nnet benefits, even without factoring in the climate-related benefits. The Authority has argued, for \nexample, that introducing light vehicle emissions standards would reduce emissions while also reducing \ncosts to consumers. While such actions can deliver useful emissions reductions, further measures \nrequired to achieve substantial additional reductions would come at some cost.  \nCosts can impact in a variety of ways, depending on the policies used. Consumers may have to pay \nmore for goods and services that are emissions intensive to produce. Some firms may experience \ndeclining sales (and profits) as their customers switch to less emissions-intensive products. Other firms \nmay lose market share to competitors in countries that are not affected (or less affected) by emissions \nreduction policies. More generally, the transformation to a lower emissions economy is likely to affect \nindustry sectors and regions unevenly, which can lead to transition costs. \nSome means of reducing emissions produce benefits that are not related to climate change. These \nco-benefits can, to some extent, offset the costs of reducing emissions; for example: \n shifting to renewable energy can reduce local air pollution, which can have significant health \nbenefits (Doctors for the Environment Australia 2015, Submission) \n planting forests to sequester carbon (that is, remove carbon dioxide from the atmosphere) can also \nprovide biodiversity and other benefits (CCA 2014a). \nIt is the sum of all relevant costs (net of co-benefits) that is most relevant in assessing the costs of \npossible targets, rather than any one particular type of cost or impact on any particular sector or group. \nConcerns are often raised, for example, about the potential for emissions reduction efforts to harm the \ninternational competitiveness of Australian firms (Minerals Council of Australia 2015, Submission; \nAustralian Industry Greenhouse Network 2015, Submission); this issue is also raised specifically in the \n 24 | Australia's future emissions reduction targets: Special Review Draft Report \nterms of reference for the Special Review. Such concerns are understandable, but are best addressed \nthrough the design of policies so as to (for example) assist particular activities—such as those of trade-\nexposed industries—to better withstand competition from industries in countries that are not taking \ncomparable action. Compensation might also be appropriate to protect low-income households and \nother disadvantaged groups. These issues will be considered in Reports 2 and 3 of the Special Review. \nAs noted earlier, the Authority is not in a position to prepare meaningful estimates of the costs of \nmeeting its recommended target, primarily because many of these costs will depend on the policies \nadopted. (For this and other reasons, it is also not possible to make meaningful comparisons of the \ncosts Australia and other countries might incur in pursuing their respective targets.) Using inefficient \npolicies to achieve a weak target could well have higher costs than pursuing a strong target through \nefficient policies. The Authority will examine Australia’s policy options and their associated costs in the \nlater stages of the Special Review. \nIn its 2014 report on targets, the Authority calculated—based on modelling by the Treasury, and \nassuming a set of efficient policies— that the overall cost of strengthening Australia's 2020 target (from \nminus 5 per cent to minus 19 per cent) would be quite modest, equivalent to slowing average annual \ngrowth in income per person by 0.02 percentage points over the period to 2020 (CCA 2014d). \nAssuming similarly efficient policies were used, the Authority believes it would be reasonable to \nanticipate that the costs of meeting its recommended 2025 target would also be modest (relative to the \noutcome under a weaker target).  \nBenefits of recommended targets \nThe introduction to the 2015 Intergenerational Report mentioned earlier noted that ‘It is difficult for \nindividual governments to control or affect the collective and cumulative impact of human activity \nglobally’ (Australian Government 2015, p. xii). This view probably downplays the influence that some \ncountries, through strong leadership, can have on the actions of some other countries but it does \nunderline the need for all countries to do their fair share of the work required to combat global problems \nlike climate change.  \nBy making its fair contribution to reducing greenhouse gas emissions, Australia will demonstrate that it \nis behaving as a good global citizen and has a legitimate right to expect other countries to behave \nsimilarly. For the reasons detailed in this report, the Authority believes the Government's adoption of the \nrecommended 2025 target of a 30 per cent reduction in emissions from 2000 levels would deliver this \nrecognition and right. \nThe targets recommended in this report would also assist Australia’s transition to a low-emission \neconomy. This transition will take time and require sustained endeavours in a number of areas. \nPerhaps most of all it will require the Australian Government to clearly articulate to the whole \ncommunity that this transition is necessary and will be supported. A credible 2025 target that matched \nthose of comparable countries would be a significant step in that direction. \nIt would, moreover, send clear signals to investors, encouraging increased attention to new areas and \ndiscouraging further investments in long-lived assets that lock-in high emissions (which might later need \nto be prematurely retired, at considerable expense). These same signals would also encourage \nAustralians to develop expertise and a comparative advantage in using low-emission technologies and \npractices. \n  \n Are the recommended targets achievable? | 25 \nThis latter benefit is not inconsistent with the Authority’s earlier advocacy of the benefits of purchasing \ninternational emissions reductions to complement policies to reduce domestic emissions. Rather, it \npoints to the need for a balance between achieving emissions reductions in Australia and purchasing \nthem from overseas. Using international purchases to complement domestic action potentially lowers \nthe cost of achieving particular targets and assists Australia to continue to exploit its comparative \nadvantage in some emissions-intensive activities, without compromising its contribution to international \naction. The ‘right’ balance of domestic and international reductions is likely to change over time; again it \ncan best be achieved through careful policy design, rather than through targets which prescribe the \nsource of reductions. These issues will be taken up in the subsequent stages of the Special Review.  \n7. ARE THE RECOMMENDED TARGETS \nACHIEVABLE? \nThe Authority has consistently argued that Australia should build a comprehensive suite (or 'toolbox') of \nmarket and non-market policies to deliver necessary emissions reductions at least cost. Such a toolbox \ndoes not exist at present. While the Emissions Reduction Fund (ERF), the central plank of the \ngovernment's Direct Action Plan, does operate across all sectors, there are low-cost emissions \nreduction opportunities that it is not able to access (CCA 2014a). The planned ERF Safeguard \nMechanism, which will impose penalties for major emitters who exceed a baseline level, could also \nassist, but this will depend crucially on the baselines that are set. \nThe Authority’s analysis, and experience from overseas, suggests that it is feasible to implement \npolicies to meet the recommended 2025 target while still maintaining strong economic growth \n(CCA 2014d). A range of possible measures is available. The European Union has introduced a \nregion wide emissions trading scheme (ETS), while the Republic of Korea, China, the United States, \nJapan and some other countries have ETSs, either at the national or sub-national level. China, for \nexample, has pilot ETSs in seven regions and cities; the coverage of these schemes is approaching \none quarter of China’s total emissions. Several other countries, including Chile and Mexico, have opted \nfor an emissions tax. Targets and other incentives for renewable energy, and regulated energy \nefficiency standards for appliances, buildings and vehicles, have been adopted in many countries. \nThe second and third parts of this Special Review will examine and recommend policies to achieve \npost-2020 targets. The Review’s terms of reference require the Authority to consider the case for an \nETS specifically, but provides scope to consider other policies, either to complement an ETS or as \nalternatives.  \nIn previous reports, the Authority has examined a number of policy options.  \n The Authority's most recent review of the Renewable Energy Target found that it was effective in \nreducing emissions at reasonable cost in the centrally important electricity sector (CCA 2014b). The \nreview made the case for urgent action to end the policy uncertainty that has hampered the \nscheme's recent operation. The Authority recommended the existing Large-scale Renewable \nEnergy Target not be scaled back but, given the sharp decline in investor confidence and the need \nfor incumbent generators to adjust to falls in projected electricity demand, that it be deferred by up \n 26 | Australia's future emissions reduction targets: Special Review Draft Report \nto three years. The review also proposed that consideration be given to whether targets should be \nincreased and extended and whether coverage should be expanded to a wider set of technologies, \nafter 2020.  \n The Authority also reported that introducing light vehicle emissions standards could significantly \nreduce Australia’s greenhouse gas emissions. This policy could increase the average cost of a new \ncar, but any additional costs would be offset several times over by fuel savings, leaving motorists \n(and the community more generally) better off. Customer choice could be preserved by setting the \nstandard as an average across the fleet, rather than applying it to individual vehicles. Many other \ncountries, including the United States, Canada, Korea, China, India and the European Union \nalready have light vehicle emissions (or fuel economy) standards. As the fuel efficiency of light \nvehicles in Australia lags behind that in many other countries, the introduction of emissions \nstandards appeals as a relatively straight-forward and cost effective opportunity to help reduce the \ncarbon intensity of the economy. \n The Authority considered the role that international emissions reductions could play in helping to \nmeet Australia's emissions reduction targets in its Targets and Progress Review (CCA 2014d). It \nhas also examined the practicalities of accessing international emissions markets (CCA 2014c). \nThis work shows that international purchases can be an environmentally sound and cost-effective \ncomplement to domestic measures to reduce emissions. The purchase of international units \nremains a particularly attractive option at present because prices are low.  \nThe Authority will be reporting on possible policies to reduce emissions, including those mentioned \nbriefly above, in the subsequent stages of this Special Review. \n APPENDIX A TERMS \n \nOF REFERENCE\nSupporting a\n \nrguments | 27 \n  \n28 | Australia's future emissions reduction targets: Special Review Draft Report \nAPPENDIX B PUBLIC CONSULTATION \nThe Authority is required to conduct public consultation for all of its reviews. On 9 February 2015, the \nAuthority called for submissions on Australia’s post-2020 targets. The Authority received \n24 submissions from a wide range of interested parties, including the public, business, and environment \nand community groups (Table 6). These submissions are available on the Authority’s website: \nhttp://www.climatechangeauthority.gov.au/submissions/submissions-received. \nThe Authority also reviewed submissions to its 2014 Targets and Progress Review that were relevant to \nthe Special Review. \nThere will be further opportunities through the Special Review for stakeholders to provide their thoughts \non other matters, including the relative merits of different emissions reduction policies and the right \npolicy mix for Australia. \nTable 6 Submissions to the call for comment on targets \n   \nAcciona Energy  Gillian Pechey \nAustralian Academy of Science  Green Building Council of Australia \nAustralian Industry Greenhouse Network  Hydro Tasmania \nAustralian Medical Students Association  Joint submission ‐ Climate and Health Alliance and Public \nHealth Association of Australia  \nAustralian Petroleum Producers & \nExploration Association \nMinerals Council of Australia \nBarbara Fraser  National Farmers Federation \nBusiness Council of Australia  Origin Energy \nChris Nunn JLL   Sustainable Business Australia \nDoctors for the Environment Australia  The Climate Institute \nEnergy Supply Association of Australia  Tim Kelly \nEnhar Sustainable Energy Solutions  U3A Climate Conversation Group \nEva Nilsson  WWF Australia \n  \n  Glossary | 29 \nGLOSSARY \n2 degree goal The global goal to limit global average warming to less than 2 degrees above pre-\nindustrial levels. This goal has been agreed by the 196 signatories to the United Nations \nFramework Convention on Climate Change (UNFCCC). \nAnnex I countries/Parties Industrialised countries and economies in transition listed in Annex I to the UNFCCC.  \nAssessment Report Comprehensive assessment of the state of climate change science published by the \nIntergovernmental Panel on Climate Change.  \nbusiness-as-usual \nemissions trend \nEmissions that would occur without any policy intervention (or without additional policy \nintervention). \ncarbon dioxide equivalent A measure that quantifies different greenhouse gases in terms of the amount of carbon \ndioxide that would deliver the same global warming. \ncarryover  An emissions allowance that can be ‘carried over’ to the next commitment period of the \nKyoto Protocol. This allowance arises when a country has performed better than its \nKyoto target. \nclimate change A long-term change in global or regional climate patterns. In this report, ‘climate change’ \nrefers to changes resulting from human activity. \nclimate system A highly complex global system consisting of five major components—the atmosphere, \nthe land surface, the biosphere, frozen and liquid water, and the interactions between \nthem. \ncommitment period A timeframe of binding national goals under the Kyoto Protocol. The first commitment \nperiod was five years from 2008–2012. The second commitment period is eight years \nfrom 2013–2020. \nDirect Action Plan The Commonwealth Government’s policy to reduce greenhouse gas emissions and \nestablish a clean-up and environment conservation program. A central element of the \nplan is the Emissions Reduction Fund. \nelectricity emissions Emissions released when fuels, such as coal and natural gas, are combusted to generate \nelectricity. \nemissions budget A cumulative emissions allowance over a period of time. \nemissions intensity A measure of the amount of emissions associated with a unit of output; for example, \nemissions per unit of gross domestic product. \nemissions reduction The act or process of limiting or restricting greenhouse gas emissions. \nEmissions Reduction \nFund \nA $2.55 billion fund to allocate money through a reverse auction to eligible projects and \nactivities that reduce emissions. \n  \n30 | Australia's future emissions reduction targets: Special Review Draft Report \nemissions reduction goal Any emissions reduction objective, such as an emissions reduction target or target range, \nan emissions budget or an emissions trajectory. Includes a pledge to reduce or limit \nemissions made under the UNFCCC.   \nemissions reduction \ntarget \nA goal for national emissions in a specific year.  \nemissions rights The rights of individuals or countries to emit greenhouse gases. \nemissions trading \nscheme \nA market-based approach to reducing emissions that places a limit on emissions allowed \nfrom all sources covered by the scheme. Emissions trading allows entities to trade \nemissions units with other entities.  \nemissions unit One metric tonne of carbon dioxide equivalent that is emitted, reduced or removed from \nthe atmosphere.  \nglobal emissions budget  The total amount of emissions projected to result in a given rise in global temperature. \nBudgets are expressed in terms of probabilities to reflect uncertainties about the exact \ntemperature effect of a given amount of emissions. The Authority has used a budget \ngiving a 67 per cent chance of causing warming of less than 2 degrees as a reference for \nAustralia’s goals.  \nglobal warming A warming of the Earth's average temperature caused by increased atmospheric \nconcentrations of greenhouse gases. This warming results in changes to the climate \nsystem. \ngreenhouse gas  Any gas (natural or produced by human activities) that absorbs infrared radiation in the \natmosphere. Key greenhouse gases include carbon dioxide, water vapour, nitrous oxide, \nmethane and ozone. \ngross domestic product A measure of the value of economic production in the economy. \ngross national income  An economic measure that reflects gross domestic product, the terms of trade and \ninternational income transfers.  \nIndustrial period The period after 1750. \nIntergovernmental Panel \non Climate Change \nAn international scientific body operating under the auspices of the United Nations. Its \nrole is to review, assess and synthesise the latest information on climate change. \ninternational emissions \nreduction units \nAn emissions unit from an international source that is accepted for compliance with a \ntarget set nationally, under the Kyoto Protocol, or as part of the new international \nagreement. \nland use, land use change \nand forestry (emissions) \nChanges in emissions associated with human-induced changes in land use, such as \ndeforestation, afforestation and forest management.  \nKyoto Protocol An international agreement adopted under the UNFCCC in 1997. It includes binding \nnational targets for developed countries and flexible mechanisms including the Clean \nDevelopment Mechanism (CDM). \nnational emissions \nbudget \nA country’s cumulative emissions allowance over a period of time. \n  Glossary | 31 \nnet targets  The recommended emissions reduction goals are net of trade. This means Australia \ncould buy international emissions reductions units to help meet its target and that any \nemissions reductions generated in Australia and sold overseas would not be counted. \nEmissions in Australia could be higher than the target if offset by sufficient purchases of \ninternational emissions reductions. \nparts per million  A measure of the concentration of greenhouse gases in the atmosphere. One part per \nmillion is equivalent to one cubic centimetre of gas per cubic metre of air. \npre-industrial period The period before 1750.  \nRenewable Energy Target A Commonwealth Government scheme that places a legal obligation on electricity \nretailers and large electricity users to buy a certain proportion of their electricity from \neligible renewables-based generation. \ntrajectory An indicative year-by-year emissions pathway to an emissions goal. \ntrajectory range A range within which future targets and trajectories may be set. \nunconditional target A target that stands irrespective of the actions of other countries. The Commonwealth \nGovernment has specified a set of conditions for strengthening Australia’s 2020 \nemissions reduction target from an unconditional 5 per cent up to 15 per cent or \n25 per cent reductions. \nUnited Nations \nFramework Convention \non Climate Change \nAn international treaty that commits signatory countries (Parties) to stabilise greenhouse \ngas concentrations in the atmosphere at a level that would prevent dangerous, human-\ninduced interference with the climate system.  \n  \n  \n32 | Australia's future emissions reduction targets: Special Review Draft Report \nABBREVIATIONS AND ACRONYMS \nAR4 Fourth Assessment Report of the Intergovernmental Panel on Climate Change \nAR5 Fifth Assessment Report of the Intergovernmental Panel on Climate Change \nBAU business-as-usual \nCO2 carbon dioxide, a greenhouse gas  \nCO2-e carbon dioxide equivalent \nCFI Carbon Farming Initiative \nCH4 methane, a greenhouse gas \nCSIRO Commonwealth Scientific and Industrial Research Organisation \nDIICCSRTE (former) Department of Industry, Innovation, Climate Change, Science, Research and Tertiary Education \nDoE Department of the Environment \nERF Emissions Reduction Fund \nETS Emissions Trading Scheme \nEU European Union \nEU ETS European Union Emissions Trading System \nGCF Green Climate Fund \nGDP gross domestic product \nGNI gross national income \nGJ gigajoule (energy, one billion (109) Joules) \nGt  gigatonne (mass, one billion (109) metric tonnes) \nGW gigawatt (power, one billion (109) watts) \nHDI Human Development Index \nIEA International Energy Agency \nINDC Intended Nationally Determined Contribution \nIPCC Intergovernmental Panel on Climate Change \nMt  megatonne (mass, one million metric tonnes)  \nOECD Organisation for Economic Co-operation and Development \nppm parts per million \nPPP purchasing power parity \n  Abbreviations and Acronyms | 33 \nt tonne (mass, one metric tonne) \nUK United Kingdom \nUN United Nations \nUNEP United Nations Environment Programme \nUNFCCC United Nations Framework Convention on Climate Change \nUS  United States of America \n  \n  \n34 | Australia's future emissions reduction targets: Special Review Draft Report \nREFERENCES \nAustralian Academy of Science 2015, The science of climate change: Questions and answers, \nviewed 17 Apr. 2015, https://www.science.org.au/climatechange. \nAustralian Government 2015, 2015 Intergenerational Report: Australia in 2055. \nBambrick H, Dear K, Woodruff R, Hanigan I, McMichael A 2008, The impacts of climate change on \nthree health outcomes: temperature-related mortality and hospitalisations, salmonellosis and other \nbacterial gastroenteritis, and population at risk from dengue, prepared for the Garnaut Climate \nChange Review, viewed 17 Apr. 2015, Canberra, \nhttp://garnautreview.org.au/CA25734E0016A131/WebObj/03-AThreehealthoutcomes/$File/03-\nA%20Three%20health%20outcomes.pdf. \nBan Ki-moon 2015, 2014 Climate Change Summary – Chair’s Summary, viewed 19 Mar. 2015, New \nYork, http://www.un.org/climatechange/summit/2014/09/2014-climate-change-summary-chairs-\nsummary/. \nBloomberg New Energy Finance (BNEF) 2015, Commentary: India, viewed 20 Apr. 2015, \nhttps://www.bnef.com/core/country-profiles/IND/commentary. \nBureau of Energy Efficiency 2012, PAT: Perform, Achieve and Trade, Ministry of Power, Government \nof India, India. \nClimate Change Authority (CCA) 2014a, Carbon Farming Initiative Review, Melbourne. \nCCA 2014b, Renewable Energy Target Review, Melbourne. \nCCA 2014c, Using International Units to Help Meet Australia's Emissions Reduction Targets, \nMelbourne. \nCCA 2014d, Reducing Australia's Greenhouse Gas Emissions: Targets and Progress Review, \nMelbourne, http://www.climatechangeauthority.gov.au/reviews/targets-and-progress-review-3. \nCCA 2015, Comparing Countries Emissions Targets: A Practical Guide, Melbourne. \nCommittee on Climate Change 2015, Carbon budgets and targets, viewed 08 Apr. 2015, \nhttp://www.theccc.org.uk/tackling-climate-change/reducing-carbon-emissions/carbon-budgets-and-\ntargets/. \nCommonwealth Scientific and Industrial Research Organisation (CSIRO) 2010, Climate change - \nscience and solutions for Australia, CSIRO Publishing, Melbourne. \nCommonwealth Scientific and Industrial Research Organisation (CSIRO) Bureau of Meteorology \n(BOM) 2014, State of the Climate, viewed 17 Apr. 2015, http://www.bom.gov.au/state-of-the-\nclimate/. \nDepartment of Defence 2013, Defence White Paper, viewed 17 Apr. 2015, \nhttp://www.defence.gov.au/whitepaper/2013/. \nDepartment of Energy and Climate Change 2009, Carbon Accounting Regulations 2009, No. 1257, \nviewed 01 Apr. 2015, http://www.legislation.gov.uk/uksi/2009/1257/pdfs/uksi_20091257_en.pdf. \nDepartment of Environmental Affairs 2010, South Africa Communication to Executive Secretary of \nthe UNFCCC, viewed 02 Apr. 2015, Republic of South Africa, \nhttps://unfccc.int/files/meetings/cop_15/copenhagen_accord/application/pdf/southafricacphaccord_a\npp2.pdf. \nDepartment of the Environment (DoE) 2015, Australia's emissions projections 2014-15, Canberra. \nDepartment of the Prime Minister and Cabinet (PM&C) 2015, Setting Australia's post-2020 target for \ngreenhouse gas emissions: Issues paper, viewed 09 Apr. 2015, \n  References | 35 \nhttp://www.dpmc.gov.au/pmc/publication/setting-australias-post-2020-target-greenhouse-gas-\nemissions-issues-paper. \nECOFYS Climate Analytics PIK New Climate Institute 2014, China, US and EU post-2020 plans \nreduce projected warming, viewed 05 Jan. 2015, http://climateactiontracker.org/news/178/China-\nUS-and-EU-post-2020-plans-reduce-projected-warming.html. \nEuropean Environment Agency (EEA) 2014, Trends and projections in Europe 2014 — Tracking \nprogress towards Europe's climate and energy targets for 2020, viewed 30 Mar. 2015, Luxembourg. \nFederal Ministry for the Environment, Nature Conservation and Nuclear Safety (Germany) 2010. \nEnergy Concept: for an Environmentally Sound, Reliable and Affordable Energy Supply. \nGarnaut R 2008, The Garnaut Climate Change Review: Final Report, Cambridge University Press, \nMelbourne. \nHoegh-Guldberg O, Mumby PJ, Hooten AJ et al. 2007. Coral reefs under rapid climate change and \nocean acidification, Science 318, pp.1737–42. \nHöhne N, den Elzen M, Escalante D 2014. Regional GHG reduction targets based on effort sharing: a \ncomparison of studies, Climate Policy 14, pp.122–47. \nIndian Energy Exchange 2015, Energy Saving Certificates, viewed 09 Apr. 2015, \nhttp://www.iexindia.com/pdf/products/PAT.pdf. \nIntergovernmental Panel on Climate Change (IPCC) 1990, Climate Change: The IPCC Scientific \nAssessment: Report prepared for IPCC by Working Group 1, Houghton, J. T., Jenkins, G. J., \nEphraums, J. J. (eds.), Cambridge University Press, Cambridge and New York. \nIPCC 2007a, Climate Change 2007: Mitigation of Climate Change: Contribution of Working Group III to \nthe Fourth Assessment Report of the Intergovernmental Panel on Climate Change, Cambridge \nUniversity Press, Cambridge, United Kingdom, New York, NY, USA. \nIPCC 2007b, Climate Change 2007: The Physical Science Basis.: Contribution of Working Group I to \nthe Fourth Assessment Report of the Intergovernmental Panel on Climate Change, Cambridge and \nNew York. \nIPCC 2007c, Summary for Policymakers in Climate Change 2007: Impacts, Adaptation and \nVulnerability.: Contribution of Working Group II to the Fourth Assessment Report of the \nIntergovernmental Panel on Climate Change, Cambridge and New York. \nIPCC 2013a, Climate Change 2013: The Physical Science Basis,: Contribution of Working Group I to \nthe Fifth Assessment Report of the Intergovernmental Panel on Climate Change, Cambridge \nUniversity Press, Cambridge and New York. \nIPCC 2013b, Summary for Policy Makers. In Climate Change 2013: The Physical Science Basis: \nWorking Group I Contribution to the IPCC Fifth Assessment Report,, Cambridge and New York. \nIPCC 2014a, Scenarios database for the Fifth Assessment Report, viewed 17 Apr. 2015, \nhttps://secure.iiasa.ac.at/web-apps/ene/AR5DB/. \nIPCC 2014b, Summary for Policy Makers. In Climate Change 2014: Synthesis Report: Contribution of \nWorking Groups I, II and III to the Fifth Assessment Report of the Intergovernmental Panel on \nClimate Change, IPCC, Geneva, Switzerland. \nIPCC 2014c, Working Group II Contribution to AR5: Impacts, Adaptation, and Vulnerability, Cambridge \nand New York. \nInternational Energy Agency (IEA) 2013, Tracking Clean Energy Progress 2013: IEA Input to the \nClean Energy Ministerial, viewed 20 Apr. 2015, Paris, http://www.iea.org/publications/tcep_web.pdf. \nIEA 2015, Global energy-related emissions of carbon dioxide stalled in 2014, viewed 07 Apr. 2015, \nhttp://www.iea.org/newsroomandevents/news/2015/march/global-energy-related-emissions-of-\ncarbon-dioxide-stalled-in-2014.html. \n  \n36 | Australia's future emissions reduction targets: Special Review Draft Report \nInternational Monetary Fund (IMF) 2014, World economic outlook database, viewed 31 Dec. 2014, \nWashington D.C, http://www.imf.org/external/pubs/ft/weo/2014/02/weodata/index.aspx. \nInternational Renewable Energy Agency (IRENA) 2012, Renewable Energy Country Profiles: Pacific: \nSeptember 2012 Edition, viewed 17 Apr. 2015, United Arab Emirates, \nhttp://www.irena.org/documentdownloads/publications/_pacificcomplete.pdf. \nMeinshausen M, Meinshausen N, Hare W et al. 2009. Greenhouse-gas emission targets for limiting \nglobal warming to 2C, Nature 458, pp.1158–63. \nMinistry of New and Renewable Energy (MNRE) 2015, Renewable Energy Manufacturing Sector, \nviewed 08 Apr. 2015, http://pib.nic.in/newsite/PrintRelease.aspx?relid=117383. \nMorel R, Shishlov I 2014. Ex-post evaluation of the Kyoto Protocol: Four key lessons for the 2015 \nParis Agreement, Climate Report 44. \nOrganisation for Economic Cooperation and Development (OECD) 2013, Economic outlook \ndatabase, viewed 31 Dec. 2014, http://stats.oecd.org. \nOrganisation for Economic Cooperation and Development (OECD) International Atomic Energy \nAgency (IAEA) 2014, Uranium 2014: Resources, Production and Demand, viewed 17 Apr. 2015, \nhttp://www.oecd-nea.org/ndd/pubs/2014/7209-uranium-2014.pdf. \nPodesta, J & Holdren, J 2014, The U.S. and China just announced important new actions to reduce \ncarbon pollution, viewed 14 Apr. 2015, https://www.whitehouse.gov/blog/2014/11/12/us-and-china-\njust-announced-important-new-actions-reduce-carbon-\npollution?utm_source=email&utm_medium=email&utm_content=email390-\ngraphic&utm_campaign=climate. \nRenewable Energy Policy Network for the 21st Century (REN21) 2014, Renewables 2014 Global \nStatus Report, Paris. \nReuters 2015, China plans CO2 caps for 6 industrial sectors initially under national scheme: NDRC, \nviewed 08 Apr. 2015, http://economictimes.indiatimes.com/news/international/world-news/china-\nplans-co2-caps-for-6-industrial-sectors-initially-under-national-scheme-\nndrc/articleshow/46117462.cms. \nThe White House 2014, U.S.-China Joint Announcement on Climate Change and Clean Energy \nCooperation: Press Release, https://www.whitehouse.gov/the-press-office/2014/11/11/us-china-\njoint-announcement-climate-change. \nThe White House 2015, Fact Sheet: U.S. and India Climate and Clean Energy Cooperation, January \n25, 2015, viewed 18 Mar. 2015, https://www.whitehouse.gov/the-press-office/2015/01/25/fact-sheet-\nus-and-india-climate-and-clean-energy-cooperation. \nTreasury 2008, Australia's Low Pollution Future: The Economics of Climate Change Mitigation, \nTreasury, Canberra. \nUnited Nations 2013, World Population Prospects—the 2012 revision, viewed December 2014, New \nYork, http://esa.un.org/wpp/Excel-Data/population.htm. \nUnited Nations Development Programme (UNDP) 2014, Human Development Index: 2013 rankings, \nviewed 23 Jan. 2015, http://hdr.undp.org/en/data. \nUnited Nations Environment Programme (UNEP) 2014, The Emissions Gap Report 2014: A UNEP \nSynthesis Report, United Nations Environment Programme (UNEP), Nairobi, Kenya. \nUnited Nations Framework Convention on Climate Change Secretariat (UNFCCC Secretariat) \n2013, Quantified economy-wide emission reduction targets by developed country Parties to the \nConvention: assumptions, conditions, commonalities and differences in approaches and \ncomparison of the level of emission reduction efforts: Technical paper FCCC/TP/2013/7. \n  References | 37 \nUNFCCC Secretariat 2014a, Greenhouse Gas Inventory Data, viewed 08 Dec. 2014, \nhttp://unfccc.int/ghg_data/ghg_data_unfccc/items/4146.php. \nUNFCCC Secretariat 2014b, Compilation of economy wide emissions reduction targets to be \nimplemented by Parties included in Annex I to the Convention: FCCC/SBSTA/2014/INF.6. \nUNFCCC Secretariat 2015, Green Climate Fund, viewed 08 Apr. 2015, \nhttp://unfccc.int/cooperation_and_support/financial_mechanism/green_climate_fund/items/5869.php\n. \nUnited Nations Framework Convention on Climate Change (UNFCCC) 2010, Copenhagen Accord: \nFCCC/CP/2009/11/Add.1. \nUNFCCC 2012, Doha amendment to the Kyoto Protocol: Decision 1/CMP.8. \nUNFCCC 2014, Lima call for climate action: Decision -/CP .20, Lima. \nUNFCCC 2015, Intended Nationally Determined Contributions (INDCs), viewed 07 Apr. 2015, \nhttp://unfccc.int/focus/indc_portal/items/8766.php. \nUnited States 1970, Clean Air Act, viewed 17 Apr. 2015, https://www.whitehouse.gov/the-press-\noffice/2014/11/11/us-china-joint-announcement-climate-change. \nWorld Resources Institute (WRI) 2014, CAIT 2.0: Climate Analysis Indicators Tool, WRI’s Climate \nData Explorer, viewed 10 Apr. 2015, http://cait.wri.org. \n",
    "Link": "https://core.ac.uk/download/pdf/30672268.pdf"
}