{
    "Title": "Expression of Green Fluorescence Protein (GFP) in Zebrafish Muscle through Injection: A Gene Therapy Model",
    "Authors": "C. H.  Hsu, C. S.  Lin, Chiranjib  Chakraborty, Jhen Ru  Shih, Z.H.  Wen",
    "Year": "No year available",
    "Abstract": "Expression of the target gene is important for gene therapy. Presently, localized transgenesis is used for gene therapy which can be achieved by a target gene expression. Here, we have reported the plasmid mediated gene therapy to zebrafish model. For this purpose, we have chosen green fluorescent protein (GFP) as a target gene because the expression can be detected easily.  GFP was inserted in a plasmid vector, pQE30 to develop the vector pQE30GFP.  The plasmid pQE30GFP was constructed form plasmid, pQE30 and pEGFPC2. pQE30GFP injected directly in one group of fish into the muscle where luciferase expression was noted. In another group, after injection electroporation was performed where we have also noted luciferase expression; but, electroporation cause muscle injury to the zebrafish. In our case, the expression was very strong at the site of injection in first group in compare to electroporation group and in both the cases expression was stable more than two weeks",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "EXPRESSION OF GREEN FLUORESCENCE PROTEIN (GFP) \nIN ZEBRAFISH MUSCLE THROUGH INJECTION: A GENE \nTHERAPY MODEL\nC. S. Lin*1 Jhen Ru Shih*, C. H. Hsu, , Z.H. Wen, and Chiranjib Chakraborty**\nDepartment of Marine Biotechnology and Resources, College of Marine Science and Division of Marine  \nBiotechnology, Asia-Pacific Ocean Research Center, National Sun Yat-sen University, Kaohisung, Taiwan\nAbstract: Expression of the target gene is important for gene therapy. Presently, localized transgenesis is \nused for gene therapy which can be achieved by a target gene expression. Here, we have reported the \nplasmid mediated gene therapy to zebrafish model. For  this purpose, we have chosen  green fluorescent \nprotein (GFP) as a target gene because the expression can be detected easily.  GFP was inserted in a \nplasmid vector, pQE30 to develop the vector pQE30GFP.  The plasmid pQE30GFP was constructed form \nplasmid, pQE30 and pEGFPC2. pQE30GFP injected directly in one group of fish into the muscle where \nluciferase expression was noted. In another group, after injection electroporation was performed where we \nhave also noted luciferase expression; but, electroporation  cause  muscle injury to the zebrafish. In our \ncase, the expression was very strong at the site of injection in first group in compare to electroporation \ngroup and in both the cases expression was stable more than two weeks.\nKeywords:\n Green fluorescent protein (GFP), Zebrafish, GFP Expression, Gene therapy model \nINTRODUCTION \nAdvancements and achievements in gene therapy continue to have a significant importance on gene \nmedicine since 1995.  Presently, the potential  for new therapeutics is  unlimited and there have been a \nnumber of tremendous technological up gradation that have allowed for clinical trials of gene therapy [1] . \n*Both have same contribution\n1\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\n**Visiting professor & Correspondence author (Primary) E-mail: drchiranjib@yahoo.com Fax: +886-07-5252011\n1\n Secondary correspondence Author: E-mail: shinlin@mail.nsysu.edu.tw\nIn recent years, in vivo gene delivery by direct injection is a convenient method to express proteins \ninto  skeletal  or  cardiac  muscle  [2,3]  . Over  viral  and other  delivery  systems, plasmid-mediated  gene \ndelivery offers several advantages and it has also shown very good promise in preclinical studies [4]. The \nplasmid has the ability to accommodate large  genes. However, skeletal muscle appears to be extremely \ncapable to take up and express plasmids in contrast to other tissues. Direct injection of naked DNA leads to \npatchy expression of delivered  genes  among fibers  in  a  given muscle,  which is  a  disadvantage [4,5]. \nFurthermore, plasmid-mediated gene therapy will become a feasible approach for humans along with viral \nvectors, when systemic delivery is achieved. The major hurdles for  plasmid-mediated  gene therapy are \nactive exploration [6,7]. However, some degrees of studies in zebrafish gene therapy are currently under \nway [8].\nDue to their transparent embryos and rapid organogenesis, zebrafish were established as a tool for \nacademic  developmental  biologists  till  date.  Zebrafish  was  used  as  first  vertebrate  large  for  scale \nmutagenesis screen in the 1990s that produced several of mutations, some of which was used as model for \nhuman diseases. Currently, similar to the mouse, zebrafish has proven to be a useful vertebrate for research \n[9].  Embryogenesis is rapid and large numbers of embryos are generated due to the high fecundity of \nzebrafish. Under ideal conditions, the females spawn up to 300 eggs per week. The eggs also hatch rapidly. \nEggs and larvae are transparent; early stages of development make zebrafish a suitable model organism to \nstudy  vertebrate  development  [10,11]  .  To understand  the  gene  function  and  its  expression  in  cells, \ntransgenic zebrafish have been consistently produced [12].  Large-scale transgenic zebrafish generation \nmethod was developed by Powers et al.\n \n[13].  Electroporation method was successfully established on \ndifferent fish species eggs [14]. To investigate gene regulation in later stages of zebrafish development, \nelectroporation was demonstrated where DNA delivery was done into the neural tube of the embryo[15]. \nRecently, expression methods  of  transgenes in adult fish  have also  investigated. Particle bombardment \nusing gene gun, muscular injections of naked DNA and electroporation have been reported [16, 17] . \nThe green fluorescent protein (GFP) has a major impact on many areas of sciences, especially on cell \nbiology and molecular biology. GFP can be detected in living cells without selection or staining which is \nthe greatest advantage of GFP [18]. The potentiality of GFP has also been documented by gene therapy \nresearchers through which one can determine the expression level, site and time course of the therapeutic \ngene, or the correlation between gene transfer rate and therapeutic outcome [19, 20]. \nWe have explored the possibility of gene transfer using GFP to the level of plasmid-mediated gene \nexpression by injection method in skeletal muscle in zebrafish. For that, we have constructed pQE30GFP \n2\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\nand have injected this plasmid into the muscle to develop localize transgenic zebrafish (>5 months old). \nThese results have significant implications for the blueprint of plasmid-mediated gene therapy by injection \nmethod into skeletal or cardiac muscle.\nMATERIALS AND METHODS\nZebrafish\nAdult zebra fish, purchased from a local aqua shop, was maintained as per the guiding principle given \nin  the  zebrafish  book  [21]. The  fish  used  in  these  experiments  were  about  4-6  months  old  and \napproximately 3 cm in length which were kept in 5-10 lit glass aquariums. The aquaria had a continuous \nre-circulating system, consisting of biological filters. Additional oxygen was provided by placing air-stones \nin  the water  and 1/3 of  water  was replaced weekly. Aquariums water  temperature  was maintained at \n28.5°C-32°C and a constant 14/10-h light/dark cycle.\nPlasmids\nThe vector, plasmid pQE30GFP was constructed from two original plasmids pQE30 and pEGFPC2. \nWe have digested pEGFP-C2 with the HindIII and KpnI  to isolate enhance-GFP (EGFP). Then we have \ndigested pQE30  with\n HindIII  and  KpnI  and  inserted  EGFP  to  obtain  pQE30GFP.  Details  of  the \nconstruction of plasmids and the composition of pQE30GFP are included in the Fig.1 (A and B).\nIntramuscular Injections of GFP Plasmid \nAll zebrafish were injected at the age of 4-6 months old.  BD ultra-fine II insulin syringe (1-2 cc \ncapacity) was used for injection (Becton Dickinson). The volume of injection was maintained constant at \n10 µl, and the amount of plasmid DNA was 10 µg per construct. The fishes were taken out of the water and \nprovided  anesthesia  with  MS-222  for  5-10  minutes  and  then  an  intra-muscular  injection  was  given \napproximately in the end region of the dorsal fin on one flank of the fish. \nIntramuscular Injections of GFP Plasmid and Electroporation \nWe have  used  another  group  of  fish  where  inter  muscular  injection  was  given  and  after  that \nelectroporation of DNA was performed. In this zebrafish group, we have performed electroporation of the \nmuscle with a two-needle electrode to set at a voltage of 100 V. \nExpression of GFP in Zebrafish \nTo observe  the  GFP expression after  two-three  days, anesthesia  provided  with  MS-222 and  the \nzebrafish were placed on petri-dish and were examined under blue light (490 nm) using an  Olympus \nfluorescent microscope, and photomicrographs were taken with a Olympus camera (C5050). \nRESULTS AND DISCUSSION\nExpression of GFP in Only Injection Group\nLuciferase expression was noted in anesthetized zebrafish at different days after plasmid injection by \nusing a fluorescent microscope (Fig. 2A). The levels of luciferase gene expression were achieved after 24 \nhours after injection which was stable for more than two weeks (Fig. 2C). We have documented 2-4 sports \n3\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\nin muscle in different fish after  plasmid administration. The expression was very strong in the site of \ninjection in compare to electroporation group and the expression was very stable from the very beginning. \nExpression of GFP in Electroporation Group\nIn electroporation group, level of plasmid expression was more compared to injection group which \ndeclines within 3-4 days and then expression was stable (Fig.3A).  But, electroporation results  muscle \ninjury. Recovery was noted which was very slow. Others workers has reported about muscle injury after \nelectroporation in zebrafish model or in other animal model [5,19] . The expression was less strong in the \nsite of injection in compare to first  group and the levels of luciferase gene expression was stable after \nmore than two weeks same as above group (Fig. 3C).\nInjection of plasmid with target DNA (in our case target gene was GFP gene) into the fish muscle was \nsufficient for expression of transgene into muscle cells that has also shown by some other workers [22, \n23]. To improve the effectiveness of transgene expression more, we have attempted electroporation after \nmuscle injection of plasmid. Transfection efficiency is interconnected with electroporation parameters like \nnumber  of  pulses,  pulse duration and voltage strength.  As the  biochemical  and  physical  character  of \ntissues different, so, electroporation parameters are known to be different for each tissue. Each of these \nparameters is required to be optimized for each tissue [24].\nThe GFP gene expression suggests that there is a major influence of these parameters on cell entry of \nplasmid like number of pulses and voltage applied. At 10 µg of plasmid DNA per fish, we have noted \nmajor increase in GFP gene expression. (Fig. 1C). Below 10 µg of plasmid DNA, we could not detect \nluciferase activity. A previous report  on muscle injection of plasmid without electroporation recorded \nmaximum expression at 5 µg of DNA into adult zebrafish [22].\nOur studies demonstrate that plasmid incorporation offers several advantages over standard plasmid-\nmediated gene therapy in which gene expression is mediated by extrachromosomal plasmids. High levels \nof  gene  expression  were  observed  in  muscles  in  the  place  of  plasmid  integration,  and  the  level  was \nconsiderably higher. We observed decline the number of spots (transgene expression )  in fish body in \nsome fish which is due to loss of plasmid after injection. To get a stable and more expression, further work \nis necessary to address this issue.\nIn the near future, technologies to boost plasmid-mediated gene delivery by injection are likely to be \nat  the  front  position  as  nonviral  gene  therapy  approach.  It  is  apparent  from  human  clinical  trials \nconcerning retroviral vectors that integration of exogenous elements into the human genome carries real \nrisks [25]. For skeletal muscle and cardiac muscle gene therapy, the technology of ‘injection method’ for \nplasmid delivery is vital. It will be vital to identify the integration sites that would be considered for use in \nhumans. For the gene therapy strategy where integration is probable, remains a safety concern. However, \nthe results presented here demonstrate that the possibility of enhancing plasmid-mediated gene therapy is \nvery promising and that needs further study.\nACKNOWLEDGEMENTS\nThis work is particularly supported by \"Aim for the Top University Plan\" of the National Sun Yat-sen \nUniversity and Ministry of Education, Taiwan. \n4\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\nREFERENCES\n[1] Kay, M.A., Liu, D. and Hoogerbrugge, P.M.(1997) Proc. Natl. Acad. Sci. USA, 94, 12744-12746.\n[2] Swartz, M., Eberhart, J., Mastick, G.S. and Krull, C.E. (2001) Dev. Biol., 233, 13-21.\n[3]  Herweijer, H. and Wolff, J.A. (2003) Gene Ther., 10,453-458.\n[4] Sebestyen, M.G., Ludtke, J.J., Bassik, M.C., Zhang, G., Budker, V., Lukhtanov, E.A., Hagstrom, \nJ.E.  and Wolff, J.A. (1998) Nat. Biotechnol ,16, 80-85.\n[5]  McMahon, J.M., Signori, E., Wells, K.E., Fazio, V.M. and Wells, D.J.  (2001) Gene Ther.,  8, 1264-\n1270.\n[6] Mir, L.M., Bureau, M.F., Gehl, J., Rangara, R., Rouy, D., Caillaud, J.M., Delaere, P., Branellec, D., \nSchwartz, B. and Scherman, D. (1999) Proc. Natl. Acad. Sci. USA., 96, 4262-4267. \n[7] Zhang, G., Ludtke, J.J.,  Thioudellet, C.,  Kleinpeter, P., Antoniou, M., Herweijer, H, Braun, S. and \nWolff, J.A. (2004) Hum. Gene. Ther.,15, 770-782.\n[8] Rambabu, K.M., Rao, S.H.N. and Rao, N.M. (2005) BMC Biotechnology ,5, 29.\n[9] Neumann, C.J. (2002) Semin. Cell Dev. Biol., 13,469.\n[10] Eisen, J.S. (1996) Cell, 87, 969-977. \n[11] Fishman, M.C. (1999) Proc. Natl. Acad. Sci .USA, 96,10554-10556.\n[12] Lin, S. (2000) Methods Mol. Biol.,136,375-383.\n[13] Powers, D.A., Hereford, L., Cole, T., Chen, T.T., Lin, C.M., Kight, K., Creech, K. and Dunham, \nR. (1992) Mol. Mar. Biol. Biotechnol., 1,301-308.\n[14] Muller, F., Lele, Z., Varadi, L., Menczel, L. and Orban, L. (1993) FEBS Lett., 324,27-32.\n[15] Teh, C., Chong, S.W. and Korzh, V. (2003) Biotechniques, 35,950-954.\n[16] Sudha, P.M., Low, S., Kwang, J. and Gong, Z. (2001) Mar. Biotechnol. (NY), 3,119-125.\n[17] Tawk, M., Tuil, D., Torrente, Y., Vriz, S. and Paulin, D (2002) Genesis, 32,27-31. \n[18] Li, Y.X., Li, G., Dong, W.P., Lu, D.R. and Tan, J.M. (2006) Chin. Med. J. (Engl), 119,1639-1645.\n[19]  Bertoni, C., Jarrahian, S., Wheeler, T.M., Li, Y., Olivares, E.C., Calos, M.P. and Rando, T.A. (2006) \nProc. Natl. Acad. Sci. USA, 103, 419-424.\n[20] Wahlfors, J., Loimas, S., Pasanen, T. and Hakkarainen,  T. (2001) Cell Biol., 115,59–65.\n[21] Westerfield, M. (1995) Univ. of Oregon Press, Eugene, OR. \n[22] Tan, J.H. and Chan, W.K. (1997) Mol. Mar. Biol. Biotechnol., 6,98-109.\n[23] Xu, Y., He, J., Tian, H.L., Chan, C.H., Liao, J., Yan, T., Lam, T.J. and Gong, Z.  (1999)  DNA Cell  \nBiol., 18,85-95.\n[24] Somiari,  S.,  Glasspool-Malone,  J.,  Drabick,  J.J.,  Gilbert,  R.A.,  Heller,  R.,  Jaroszeski,  M.J.  and \nMalone, R.W. (2000) Mol. Ther., 2,178-187.\n[25] Yi, Y., Hahm, S.H. and Lee, K.H. (2005) Curr.Gene Ther., 5, 25–35. \n5\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\nAB\n6\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\nFigure 1.\n Schematic representation of  construction and composition of plasmid, pQE30GFP, which was \nused  for  injection  into  zebrafish  mussel.  (A)  For  production  of  pQE30GFP, we  have  inserted  GFP \nexpression cassette into pQE30. GFP expression cassette was isolated from pEGFPC2 digested by Hind III \nand  KpnI\n.  \n(B)  Electrophoresis  of\n \nplasmid  pQE30GFP treated  with  or  without  restriction  enzyme.  M: \nMolecular marker ; Lane 1: pQE30-EGFP; Lane 2：pQE30-EGFP treat with  HindIII; Lane 3:pQE30-\nEGFP treat with Hind III  and Nde I\nA B\n  \nC\n7\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\nFigure 2.\n GFP expression into muscle after  injection in zebrafish.  (A) An image taken at  the site of \ninjection. (B) An image represents GFP expression other site of the body. (C) The number of sport for \nluciferase gene expression in respect to days (present data is from two fish).\nA B\n    \nC\n8\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\nFigure 3.\n GFP expression  into  electroporation  group in  zebrafish.  (A) an  image taken at  the  site  of \ninjection. (B) An image represents GFP expression other site of the body; (C) The number of sport for \nluciferase gene expression in respect to days (present data is from two fish; in one fish fluorescence sports \nare countable, but in case of other fish, sports are every much scattered which can not be countable ).\n9\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \ndo\ni:1\n0.\n10\n38\n/n\npr\ne.\n20\n08\n.2\n71\n8.\n1 \n: P\nos\nte\nd \n25\n D\nec\n 2\n00\n8\n",
    "Link": "https://core.ac.uk/download/pdf/288235.pdf"
}