{
    "Title": "Defining And Measuring Green FDI: An Exploratory Review Of Existing Work And Evidence",
    "Authors": "Golub, Stephen S., Kauffmann, C., Yeres, P.",
    "Year": "No year available",
    "Abstract": "This paper was developed at the request of the OECD Working Party of the Investment Committee to document efforts to date to define and measure green FDI and to investigate the practicability of various possible definitions, as well as to identify investment policy restrictions to green FDI. It does so by reviewing the literature and existing work on the contributions of FDI to the environment; by providing a two-part definition of green FDI; and by discussing various assumptions necessary to estimate the magnitude of \\u27green\\u27 FDI",
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Swarthmore College Works Economics Faculty Works Economics 2-1-2011 Defining And Measuring Green FDI: An Exploratory Review Of Existing Work And Evidence Stephen S. Golub Swarthmore College, sgolub1@swarthmore.edu C. Kauffmann P. Yeres This work is brought to you for free and open access by . It has been accepted for inclusion in Economics Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. Follow this and additional works at: https://works.swarthmore.edu/fac-economics  Part of the Economics Commons Let us know how access to these works benefits you  Recommended Citation Stephen S. Golub, C. Kauffmann, and P. Yeres. (2011). \"Defining And Measuring Green FDI: An Exploratory Review Of Existing Work And Evidence\". OECD Working Papers On International Investment. DOI: 10.1787/5kg58j1cvcvk-en https://works.swarthmore.edu/fac-economics/434 Please cite this paper as:Golub, S., C. Kauffmann and P. Yeres (2011), “Defining andMeasuring Green FDI: An Exploratory Review of ExistingWork and Evidence”, OECD Working Papers on InternationalInvestment, 2011/02, OECD Publishing, Paris.http://dx.doi.org/10.1787/5kg58j1cvcvk-enOECD Working Papers on InternationalInvestment 2011/02Defining and MeasuringGreen FDIAN EXPLORATORY REVIEW OF EXISTING WORKAND EVIDENCEStephen S. Golub, Céline Kauffmann,Philip YeresJEL Classification: E01, F21, F23, Q01, Q56 2 OECD WORKING PAPERS ON INTERNATIONAL INVESTMENT  The international investment working paper series – including policies and trends and the broader implications of multinational enterprise – is designed to make available to a wide readership selected studies by the OECD Investment Committee, OECD Investment Division staff, or by outside consultants working on OECD Investment Committee projects.   The papers are generally available only in their original language English or French with a summary in the other if available.  The opinions expressed in these papers are the sole responsibility of the author(s) and do not necessarily reflect those of the OECD or the governments of its member countries.  Comment on the series is welcome, and should be sent to either investment@oecd.org or the Investment Division, OECD, 2, rue André Pascal, 75775 PARIS CEDEX 16, France.   OECD WORKING PAPERS ON INTERNATIONAL INVESTMENT  are published on www.oecd.org/daf/investment/workingpapers   © OECD 2011 Applications for permission to reproduce or translate all or part of this material should be made to: OECD Publishing, rights@oecd.org or by fax 33 1 45 24 99 30.     Abstract  DEFINING AND MEASURING GREEN FDI:  AN EXPLORATORY REVIEW OF EXISTING WORK AND EVIDENCE   by Stephen S. Golub, Céline Kauffmann and Philip Yeres*  This paper was developed at the request of the OECD Working Party of the Investment Committee to document efforts to date to define and measure green FDI and to investigate the practicability of various possible definitions, as well as to identify investment policy restrictions to green FDI. It does so by reviewing the literature and existing work on the contributions of FDI to the environment; by providing a two-part definition of green FDI; and by discussing various assumptions necessary to estimate the magnitude of ―green‖ FDI.   JEL Classification: E01, F21, F23, Q01, Q56 Keywords:foreign investment; international investment; green FDI; green growth; FDI measurement; environmental goods and services; technology transfer.            *The paper was developed by Céline Kauffmann of the OECD Investment Division and Stephen S. Golub and Philip Yeres of Swarthmore College. It was submitted and received important inputs from delegates of the Working Party of the Investment Committee, of the Working Group on International Investment Statistics and of the Working Party on Climate, Investment and Development. It also received useful suggestions from colleagues from the OECD Investment Division, the Environment Directorate and the Development Cooperation Directorate, in particular Pierre Poret, Cristina Tébar-Less, Ayse Bertrand, Jan Corfee Morlot, Virginie Marchal, Valérie Gaveau and Julia Benn, as well as from external experts: Jessica Brown, Brad Gentry, Erik Haites and Bry Levine Further information on investment for green growth work at the OECD may be found at www.oecd.org/daf/investment/green    4     TABLE OF CONTENTS Executive Summary....................................................................................................................................... 3 I.  Introduction............................................................................................................................................ 7 II. Understanding the contributions of fdi to the environment ............................................................ 10 II.1  The potential for green FDI is large but ignored so far ............................................................... 11 II.2.  FDI and the Environment: what does the literature say? ............................................................. 13 III.  Defining green FDI ........................................................................................................................... 16 III.1.  Learning from other efforts to define ―green‖ ............................................................................. 16 III.2. Defining green FDI...................................................................................................................... 21 IV. Estimating the magnitude of green FDI and related restrictions ................................................. 25 IV.1 Existing efforts to measure green FDI ......................................................................................... 25 IV.2  Estimating the two-part definition of green FDI ......................................................................... 27 IV.3.  Restrictions .................................................................................................................................. 29 V. Conclusion ............................................................................................................................................... 33 Appendix. Empirical evidence on the greening effect of FDI .................................................................. 35 References .................................................................................................................................................... 44     6     EXECUTIVE SUMMARY Recognition of the serious threats posed by global warming and environmental degradation has elevated the issue of how to promote ―green growth‖ to the top of the policy agenda at OECD and elsewhere. In particular, a key issue is how to scale up the financing and foster the dissemination of environmentally-sound technology and practices in countries (mainly developing but not only), which host vital ecosystems and account for a rising share of global emissions of greenhouse gases (GHG) and other pollutants, yet may have limited means for financing environment preservation and pollution mitigation. Foreign direct investment (FDI) is generally recognized as an important source of financing and of transfer of technology and know-how between countries. Yet, little is known about the magnitude of FDI‘s contribution to green growth. The limited understanding of the role of FDI in promoting green growth objectives is largely due to the lack of an internationally agreed definition of and relevant data on  ―green FDI‖. This contrasts with efforts made in other areas, such as the tracking of aid in support of the Rio conventions by the OECD Development Assistance Committee (DAC) and the OECD and APEC (Asia-Pacific Economic Cooperation) work to define and measure international trade in environmental goods and services (EGS). Against this backdrop, this paper investigates the practicability of various definitions of green FDI, building on a review of the available evidence on the effects of FDI on the environment, and briefly surveys the barriers and determinants to such flows.  Drawing on other efforts to identify green industries and processes, including those of UNCTAD (the United Nations Conference on Trade and Development) and Eurostat (the statistical office of the European Union), the paper proposes a two-part definition of ―green‖ FDI:  1) FDI in EGS sectors, and  2) FDI in environmental-damage mitigation processes, i.e. use of cleaner and/or more energy-efficient technologies.  Along with a few previous studies, notably UNCTAD (2010), the paper argues that the first part of the definition can be captured by FDI in a few environmental industries. These industries typically include renewable energy production and distribution and some environmental services such as waste management and recycling. But, despite the apparent simplicity of this approach, FDI data are not readily available at a level of detail required to develop robust estimates over time. Estimating the second part of the definition appears even more difficult. A useful starting point is to use the concept of environmentally-relevant FDI to frame the areas where green efforts may occur. Environmentally-relevant FDI is defined as occurring in sectors where the scope for environmental spillovers (energy efficiency and pollution reduction and control) is greatest, i.e. in agriculture, manufacturing, mining, forestry, transport, construction, energy and water.  The two parts of the definition are quite different in nature. The first part is in line with various efforts, including by the trade community and Eurostat, to identify the limited number of industries that directly contribute to pollution remediation or to environmental resource management. The second part aims to capture the potential of FDI to foster environmentally-preferable technology and know-how in a much broader range of sectors. There can be some partial overlap in the inclusion of industries in the two definitions: a few ―environmental‖ sectors included in definition 1 (e.g., water) may make use of environmentally-preferable technology and know-how and thus also fall under definition 2.    8 Limiting the definition of green FDI to narrowly-defined EGS is likely to underestimate the environmental effects of FDI, as it leaves out transfer of green technologies and practices to a much wider group of industries, including those which inflict the greatest environmental damage. On the other hand, estimates of environmentally-relevant FDI provide an indication of the ―potential‖ or domain of ―green‖ FDI rather than its actual incidence, as it also includes FDI that does not have positive environmental impact. This paper explores several options for narrowing down the magnitude of potentially-green FDI, i.e. by identifying the proportion of environmentally-relevant FDI which:  a) flows from countries with stricter regulations to those with less stringent regulations and/or b) flows from countries with higher energy efficiency to those with lower energy efficiency.  Based on these categories of FDI, restrictiveness indicators are computed, using the methodology developed by OECD (2010a). For most countries discriminatory restrictions are relatively low, suggesting that overt barriers to green FDI are limited. Implicit barriers to FDI, such as state ownership, are likely to be more significant.       I.  INTRODUCTION Recognition of the serious threats posed by global warming and environmental degradation has elevated the issue of how to promote ―green growth‖ to the top of the policy agenda at OECD and elsewhere (OECD 2009a, OECD 2010d). Green growth is defined by the OECD as the pursuit of economic growth and development, while preventing costly environmental degradation, climate change, biodiversity loss and unsustainable natural resource use.1 In particular, a key issue is how to scale up the financing and foster the dissemination of environmentally-sound technology and practices in developing countries, which host vital ecosystems and account for a rising share of global emissions of greenhouse gases (GHG) and other pollutants, yet may have limited means for financing environmental preservation and pollution mitigation. The Clean Development Mechanism (CDM)2 that grew out of the Kyoto Protocol is an example of a global initiative to promote green growth that involves developing countries. Much attention has also been focused on how trade liberalization in ―green goods‖ can contribute to green growth (OECD 2005a). Liberalization of trade in environmental goods and services (EGS) has been accepted as a goal of the Doha round of trade negotiations and highlighted in the Interim Report of the OECD Green Growth Strategy (OECD, 2010d) as important.  Until recently, however, relatively little attention has been paid to the role of FDI as a contributor to green growth.3 FDI can nevertheless potentially play a very important role for two reasons. First, the scale of FDI and its significant growth over the last decades make it a crucial source of financing. Looking at climate-change relevant financial flows from developed to developing countries, Buchner, Brown, Corfee-Morlot (2011) note that ―FDI is the largest source of financing across all public and private sources‖. Also, whereas trade has largely indirect effects, FDI has the potential to transfer environmentally-friendly industries, technology and practices that directly contribute to environmental progress. Although green technology transfer can occur between any two countries, it is of particular relevance for dissemination of technology to developing countries. The technical know-how for controlling pollution resides primarily in firms in more developed countries, and this knowledge can be disseminated to less-developed countries through FDI (Popp 2009) – both to affiliates and to domestic suppliers and customers of the multinational enterprises.  One explanation for the limited attention to the possible contribution of FDI is the lack of an operational definition of green FDI. This paper identifies a number of issues that make the task of defining green FDI difficult. Many goods and services have multiple uses – some of which are green and others not –, and firms may also produce a variety of products, only some of which are green. Most importantly, green economic activity is often not associated so much with a particular good or service, but rather with a process or technology, which is very difficult to apprehend statistically. Finally, the current industry-level reporting of national FDI statistics does not match up with existing efforts to define and classify ―green‖.                                                       1  Interim Report of the Green Growth Strategy: www.oecd.org/greengrowth  2  http://unfccc.int/kyoto_protocol/mechanisms/clean_development_mechanism/items/2718.php  3   Among the small body of literature on the subject, the 2010 UNCTAD World Investment Report focuses on the role of FDI in mitigating climate change. The role of FDI in financing climate change mitigation has also received some consideration recently at the OECD (Corfee-Morlot, Guay and Larsen, 2009 and Buchner, Brown, Corfee-Morlot, 2011).   10 4. The need to better define and measure the scale of FDI in support of green policy goals is nevertheless steadily growing. The growing interest among countries in assessing the contributions of green activities to output, employment, and trade and in quantifying and monitoring countries‘ efforts to promote green growth is illustrated by recent efforts by OECD countries to develop a green growth strategy, with corresponding monitoring indicators as a key pillar. More specifically, tracking trends and enhancing accountability and transparency of financial flows have been the focus of recent Conferences of the Parties of the United Nations Framework Convention on Climate Change (UNFCCC), as necessary complements to the ambitious emission reduction targets, actions and financial commitments taken by countries as part of the Copenhagen Accord and Cancun Decisions. Discussions within the climate change policy community increasingly focus on the system to measure, report and verify (MRV) the financial flows that can help developed countries meet their collective commitment to provide new and additional funding to developing countries, including the potential contribution of private finance (see the recent work of the Climate Change Expert Group4). Similarly, among the decisions taken by the Conference of the Parties to the Convention on Biological Diversity to achieve the \"Aichi Biodiversity Targets\", one relates to a strategy for resource mobilization which relies on various funding sources, including from the private sector.  In this general context, improving the understanding of what can be defined as a green investment and strengthening the statistical foundation for measurement would help policy makers to better track the scale and trends of financial flows in support of green growth policy goals. Short of directly controlling the allocation of private investment flows, governments would then be in a better position to assess the adequacy and effectiveness of their policies in providing a conducive framework for green investment and to evaluate the leverage effect of public funds to incentivize this type of investment.   Against this backdrop, this paper was developed at the request of the Working Party of the OECD Investment Committee at its meeting of March 2010 to initiate work on defining and measuring green FDI. It is an exploratory study summarizing existing work by OECD and others, investigating the practicability of various possible definitions of green FDI, and identifying associated investment policy restrictions. It is meant to review the limited existing evidence on green FDI in order to trigger discussions and further work on this issue. In this perspective, Part II of the paper provides a brief overview of the state of knowledge of the environmental effects of FDI in the context of the broader international efforts to promote green growth. Part III addresses the definition of green FDI and proposes a two-part definition: 1) FDI in environmental goods and services (EGS); and 2) FDI in environmental-damage mitigation processes, i.e. use of cleaner and/or more energy-efficient technologies. Part IV reviews the existing data on green FDI and attempts to evaluate the magnitude of the two parts of the proposed definition and associated restrictions. The Appendix reviews the literature on the statistical and qualitative evidence of the impact of FDI on the environment.  II. UNDERSTANDING THE CONTRIBUTIONS OF FDI TO THE ENVIRONMENT   As a category of investment that reflects the objective of establishing a lasting interest by a resident enterprise in one economy in an enterprise in another country, FDI provides a means for creating direct, stable and long-lasting links between economies. In particular, international investment constitutes a vital source of private financing and a vector of know-how transfer between economies. In the absence of systematic data on the level and trends of FDI that contributes to green growth objectives, analysis of the                                                      4  www.oecd.org/env/cc/ccxg      environmental effects of FDI have mainly been based on case studies. Part II provides a brief overview of this available evidence (more detailed discussions of the literature review can be found in the Appendix) and draws parallels with other international flows – aid and trade. This context is important to understand the potential for ―green‖ investment. It also provides useful information that serves as a basis for some of the assumptions made later in the paper to develop rough estimates of ―green‖ FDI. II.1  The potential for green FDI is large but ignored so far The scale of FDI‘s contribution to financing EGS sectors investment and transferring environmentally-friendly technology and practices has so far received less attention than, for example, ODA or trade. Yet, levels of FDI greatly outstrip the level of ODA in many countries. FDI also has the potential to contribute directly to transfer of know-how, whereas trade does so indirectly through embedded technologies.  The contribution of aid flows (ODA) to environmental objectives Figure 1.  FDI and ODA in billion USD (1990-2009)  0500100015002000250019901991199219931994199519961997199819992000200120022003200420052006200720082009FDI, net inflows, Developing countriesFDI, net inflows, WorldTotal Net ODA    Source: World Bank World Development Indicators, based on OECD DAC for ODA data  The Rio Earth Summit of 1992 asked that industrialized nations make an additional USD 125 billion available to developing nations to assist them on a path to sustainable development (Dauvergne 2008). While ODA is an important avenue for promoting development in general, and environmental sustainability in particular, its magnitude is limited by pressures on government budgets in donor nations and absorptive capacity in host countries. OECD estimates that ODA in support of climate change mitigation from members of the Development Assistance Committee (DAC) rose from USD 3.8 billion in 2007 - i.e. some 4% of their ODA (OECD 2009a) – to USD 8.5 billion in 2008 (8% of ODA) and above USD 9 billion in 2009.5 In 2007-2008, ODA from DAC member countries focused on environmental sustainability in general averaged USD 13 billion.6  In the last two decades, global FDI has increased dramatically relative to ODA (Figure 1). Although developing countries‘ share of global inward FDI has not grown7, absolute levels of FDI going to                                                      5  www.oecd.org/dac/stats/rioconventions  6  www.oecd.org/dac/environment  7  OECD (2010f) shows that the share of developing countries in global FDI flows from 1970 to 2008 has stayed within a range of about 25% to 33% of global inflows with no clear trend.   12 developing countries have increased from USD 43 billion in 1990 to USD 621 billion in 2008 (OECD, 2010f). According to Corfee-Morlot et al (2009), considering ―mitigation-relevant‖ industries that contribute most to global warming and other pollution (agriculture, forestry, mining, manufacturing, energy, transport and construction), FDI flows greatly exceed ODA and export credits specifically targeted at these industries. Nevertheless, ODA remains an important source of development capital and is a complement rather than a substitute for FDI, for 3 reasons. ODA was greater than FDI for 55 of the world‘s 70 poorest nations in the late 1990s; for 42 of those countries, ODA flows were double FDI flows (Zarksy and Gallagher, 2003). Foreign aid serves to develop local infrastructure, a pre-requisite for future FDI (Blaise, 2005). FDI performs at higher environmental standards in developing countries with strong environmental institutions, and ODA is an important funding source for strengthening environmental enforcement capability (OECD, 2002).   Trade of environmental goods and services In 2004, trade in EGS was estimated at USD 580 billion worldwide (Blazejczak, Braun, and Edler, 2009). The environmental industry can be divided into two categories: goods (mainly equipment) and services. Services account for about 65% of the environmental sector‘s value-added.8 Substantial attention has focused on liberalizing trade in environmental goods and services. Trade liberalization for EGS fosters environmental gains because it both opens export markets for producers of green products and gives importers access to environmentally superior products.   Tariff barriers to trade in environmental goods are generally low in developed countries, as they are on most manufactured products. Tariffs applied to most environmental goods in developing nations average about 10%, 5 times greater than the MFN rate of USA, Japan, Canada and the EU (OECD, 2005a), but even so these rates are generally not so high as to present major obstacles to environmental investment. Therefore, reducing tariffs on goods associated with solar, wind, biomass, and other renewable energy sources is unlikely to cause a substantial increase in demand (Jha, 2009). Non-tariff barriers are in some cases more constraining, again particularly in developing countries. In an analysis of a few GHG emissions intensive sectors (energy, construction, manufacturing), Steenblik and Kim (2009) found that the most constraining non-tariff barriers were related to lack of harmonization of technical standards. Inadequate intellectual property rights protection and enforcement, restrictions on visas for expatriate technical staff and customs procedures were also often cited by firms.  According to OECD (2005a), market opening and liberalization of trade in environmental services has the potential to yield important economic and environmental benefits.9 Trade in environmental services has been growing especially in developing countries such as China and India, in response to greater private provision of these services. This discussion is of particular relevance to the work on green FDI because environmental services such as water treatment and delivery, sewage management and refuse disposal are capital-intensive and foreign participation usually requires local commercial presence. Consequently, cross-border trade in environmental services, more so than for most environmental goods, is likely to take the form of FDI.                                                       8  Differentiating between environmental goods and services can be difficult, since provision of environmental services may be embodied in another product (e.g. computer application – environmental service – stored on a disk). As Sawhney (2003) notes, technology, design and engineering of a water treatment plant, for example, are environmental services, but provision of these services is often bundled with the related equipment. 9  For a detailed analysis of the potential benefits from liberalizing trade in environmental services see (OECD 2005a).     II.2.  FDI and the Environment: what does the literature say? In the absence of a clear definition and of available data on green FDI, the discussion has mainly focused on specific case studies and on empirical analysis of the two main competing hypotheses: the pollution haven effect (FDI seeks locations with weak regulations, spurring a race to the bottom and weakening environmental standards around the world) and the pollution halo effect (FDI spreads best environmental management practices and technologies). A review of the case study evidence on the environmental effects of FDI is provided in Appendix. A general conclusion is that FDI is almost always at least as environmentally sensitive as domestic investment when specific case studies are considered. Cross-sectoral econometric studies also support the hypothesis that foreign firms are, on average, cleaner than domestic firms, although the existence of sporadic cases of pollution havens cannot be completely ruled out. In any case, there are national, sector- and industry-specific technological and regulatory characteristics that enhance or reduce the greening effects of FDI. They are briefly identified in this section. The empirical evidence on FDI and the environment According to Gallagher and Zarsky (2007), FDI has the potential to deliver three types of greening effects:  Transfer of clean technologies which are less polluting to affiliates (e.g. end-of-pipe abatement) and more input-efficient compared to domestic production (―cleaner‖ technology),  Technology leapfrogging, whereby FDI transfers state-of-the-art production and pollution-control technologies to affiliates (―cleanest‖ technology),  Spillovers to domestic firms, whereby best practices in environmental management are transferred to affiliates and diffused to domestic competitors and suppliers. There are a number of possible reasons for FDI to result in environmental improvements:  ―MNEs are more technologically dynamic than domestic firms‖.  ―Multinational enterprises are subject to higher environmental standards in their home countries‖.  Pressure may come from home country regulation, consumer preferences, and NGOs (Gentry 1999, OECD 2010e).  ―Multinational enterprises operate with company-wide environmental standards‖. They may do so because it is costly to design products and processes to different standards in host countries (Zarsky and Gallagher, 2008) or because they adhere to codes of conduct that prescribe this behaviour (such as the OECD Guidelines for Multinational Enterprises).  Large firms tend to pay greater attention to environmental effects, and multinationals tend to be large (Johnstone, 2007). Cross-sectoral econometric studies support the hypothesis that foreign firms are, on average, cleaner than domestic firms after controlling for age, size and productivity of plant (Eskelund and Harrison, 2003, Dardati and Tekin, 2010). A number of indirect assessments also confirm this hypothesis. Empirical evidence suggests for instance that, on the one hand, the presence of an Environmental Management System (EMS) is positively related to environmental performance and innovation (Johnstone 2007; Dasgupta, Hettige, and Wheeler 2000) and, on the other hand, that foreign firms are more likely to have EMSs than domestic firms. Based on a study of 98 countries between 1996 and 2002, Prakash and Potoski (2006) finds that inward FDI is associated with higher levels of ISO 14001 (the most widely adopted EMS)   14 adoption in host countries when FDI originates from countries with high level of ISO 14001 adoption. Using data on 1,200 Argentinean firms for the 1998-2001 period, Albornoz et al (2009) also show that foreign firms are twice as likely to have EMSs.  The majority of case-study research (reported in Appendix) also indicates that FDI generally results in greater attention to and mitigation of pollution. In cases where FDI is not superior to domestic firms, domestic firms have not been shown to be outperforming foreign firms. However, there is a number of national, sector- and industry-specific technological and regulatory characteristics that enhance or reduce the greening effects of FDI. The determinants of the greening effects of FDI Generally, strong environmental regulation and enforcement have been shown to be key drivers for firms to acquire environmental technologies and green their operations. Johnstone et al. (2007), for instance, finds that perceived stringency of the policy regime is the most significant influence on environmental performance of firms, based on a representative sample of 4000 manufacturing facilities. When it comes to foreign investment, the stringency of home country environmental regulation has also proved to have a significant influence on the greening capacity of FDI. In a context where multinationals serve markets with different environmental standards, it may be costly to design products to different standards across markets. Export-oriented FDI intended for markets with more stringent environmental regulations will tend to satisfy higher environmental standards. That way, standards tend to diffuse to countries with less stringent environmental regulation (Zarsky and Gallagher 2008). A number of statistical studies have examined the influence of environmental regulation on firm location choice, to test the significance of the pollution haven hypothesis (i.e. FDI seeks locations with weak regulations). While they cannot completely reject the hypothesis that increased regulation may, in some specific instances, shift the location of production, most studies have found little support for widespread, systematic pollution haven effects. For Neumayer (2001), the evidence for pollution havens is ―relatively weak at best and inconclusive or even negative at worst‖. Eskeland and Harrison (2003) found that foreign investment does not flow disproportionately into highly emitting industries. According to OECD (1999b), while there are site- and industry-specific examples of pollution haven effects, there ―does not appear to be evidence corroborating the pollution haven hypothesis‖.  However, Henna (2010) finds that the U.S. Clean Air Act Amendments have led to a small increase in U.S. multinationals foreign investment, consistent with the pollution-haven hypothesis. In an empirical re-examination of FDI flows between 27 source OECD countries and 99 host countries over the period 2001-2007, OECD (2011b) finds that relatively lax environmental standards in the host country has a statistically significant positive effect on incoming FDI flows. This effect tends to exhibit an inverse U-shape, meaning that below a certain level of environmental stringency, the country loses its attractiveness as an FDI location. Overall, even when some support for the pollution haven hypothesis is found, the effects are usually described as small (Levinson 2009, Henna 2010, OECD 2011). In addition to the impact of regulation, a number of governments have chosen to directly encourage green FDI by providing specific investment incentives, including subsidies. As an example, the German government both provides direct subsidies for the construction of renewable energy plants and requires power companies to pay a fixed rate to third parties which feed power back into the grid, making location in Germany attractive to foreign firms (Boston, 2009). Bakker (2009) identifies several major categories of tax incentives and provides a detailed compendium of policies for thirteen countries (see box).10                                                      10  Australia, Brazil, Canada, China, Germany, India, Japan, Netherlands, South Africa, Spain, Sweden, United Kingdom and United States.      Box 1. Example of green investment incentives, building on Bakker (2009) Reduced corporate income tax rates: Foreign-invested enterprises operating in “encouraged” industries in central and western China pay a reduced income tax rate of 15% from 2000 to 2010 (China Law Update 2009). Tax holidays: China reduces the “VAT on joint venture wind companies to encourage technology transfer” (Lewis and Wiser 2007). Investment allowances and tax credits: China has enacted a “credit against tax payable” for investment in environmental protection and resource management equipment. Accelerated or free depreciation: Environmentally friendly assets may be depreciated along an accelerated depreciation schedule. This means that companies may write off the costs of environmentally friendly assets, deferring corporate income taxes by reducing taxable income in the present year. This approach has been implemented in the Netherlands as “the Accelerated Depreciation of Environmental Investment Measure” (VAMIL). If companies replace less environmentally friendly technologies with preferred technologies from the VAMIL list of approved technologies, and the equipment is fully operational and paid for, VAMIL allows depreciation of the full price of the technology in the first year (Kim 2007). Exemption from import tariffs on inputs: Foreign investment into sectors the Chinese government deems “encouraged” receives an exemption from customs duty for imported equipment (China Law Update 2009). Export-processing zones: In one cross-sectional study Trinidad and Tobago’s EPZs found that firms located inside EPZ demonstrate better environmental performance than firms located outside EPZs (Shah and Rivera 2007). “There does not seem to be strong evidence that environmental protection differs between inside and outside an EPZ. To the contrary, there seem to be cases where environmental measures are taken more properly inside an EPZ perhaps because EPZs tend to have more foreign companies who worry about negative publicity. There are also cases where governments have put in place stronger environmental standards because of industry concentration.” (Engman, Onodera, and Pinali 2007). Beyond the stringency of regulation and the existence of specific green investment incentives, investors regard an unpredictable and opaque regulatory framework as an additional risk. OECD (2010b) highlights the cost associated with frequently changing policy conditions, including the decrease in innovation in environmental technologies associated with uncertain environmental policies. The evidence suggests that foreign investors (as investors in general) favour ―transparency, accountability and predictability in the design and implementation of investment and environmental policies and regulations‖ (OECD 1999b). The survey findings in OECD (2010e) support the view that foreign investors favour predictable and transparent regulations regarding GHG emissions rather than the current fragmentation of regulation, especially for those companies that are at the forefront of climate-change-related innovation. Reciprocally, lack of transparency or the perception of arbitrary administrative decisions (including in the application of environmental regulations) have deterred environmentally friendly FDI in a number of countries, including in Russia (OECD 2008a, OECD 2011a).  In conclusion, FDI has the potential to contribute to the green growth objectives of countries as a source of much needed financing and a vector of know-how transfer between economies. However, the magnitude of this contribution is largely unknown owing to the lack of a common understanding of how to define and measure ―green‖ FDI. There is nevertheless growing interest among countries in assessing the contributions of green activities to output, employment, and trade and in quantifying and monitoring countries‘ efforts to promote green growth, as notably recently illustrated by the OECD Green growth Strategy. Such analysis requires a definition of green activities and the development of related indicators.    16 III.  DEFINING GREEN FDI Defining ―green‖ is not a simple task. As OECD (2010b) notes, EGS defy a simple statistical categorization, and the available estimates differ greatly and are based on inconsistent concepts. Despite the difficulty, the environmental dimension has been part of policy discussions on ODA for decades, and statistics on aid to environment have been collected since the 1980s. Similarly, efforts to define trade in EGS also date back to the 1990‘s. Lessons can be learnt from this experience. The task is difficult for several reasons. First, many goods and services have multiple uses, some of which are green and other not (e.g. test tubes, pumps). In addition, one firm may produce a variety of products, only some of which are green. In assessing the U.S. green industry, Becker and Shadbegian (2009) defines environmental product manufacturers as firms that had produced an environmental good within the last year. Most importantly, particularly for FDI, green economic activity is often not associated so much with a particular good or service, but rather with a process or technology, which is very difficult to apprehend statistically. There is an important greening role for FDI in sectors and industries that are not environmental by nature but where the potential for pollution abatement is important. The latter dimension would not be captured if the definition was limited to investment in EGS. This leads below to a two-part definition of green FDI to cover both FDI in green industries and services and FDI in environmental processes. III.1.  Learning from other efforts to define “green”  Official Development Assistance: aid to the environment and Rio markers The OECD Development Assistance Committee (DAC) uses the ―Creditor Reporting System‖ to monitor aid targeting environmental sustainability in general and the objectives of the Rio Conventions in particular (the United Nations Convention on Biological Diversity, the United Nations Framework Convention on Climate Change, the United Nations Convention to Combat Desertification). The statistics produced by the DAC are based on reporting by donors, according to a standard template which allows countries to specify when environmental sustainability, climate change, biodiversity, or desertification is a principal or a significant objective of aid (in addition to specifying the sector).  Statistics on ―aid to environment‖ are derived from both policy marker and sectoral data. The environmental sustainability marker allows the donor countries to identify and highlight activities across all sectors that are ―intended to produce an improvement in the physical and/or biological environment of the recipient country, area or target group concerned‖ or ―include specific action to integrate environmental concerns with a range of development objectives through institution building and/or capacity development‖.11 ―Environment‖ is also identified as a sector of destination by donors. The sector classification includes a ―general environmental protection‖ category, which allows distinguishing multi-sectoral environmental conservation programmes and activities such as environmental policy and administration or environmental education, training and research.    A large majority of activities targeting the objectives of the Rio Conventions fall under the DAC definition of ―aid to environment‖. Four Rio markers permit their specific identification: biodiversity, climate change mitigation, climate change adaptation, and desertification. Standard definitions and eligibility criteria have been defined for these markers (Table 1). The DAC also monitors aid to a number of sectors related to environmental issues, including water and sanitation and renewable energy.                                                       11  www.oecd.org/dataoecd/4/6/38025362.pdf     Table 1. Definition of the Rio markers  Definition Typical activities Biodiversity-related aid Activities that promote at least one of the three objectives of the Convention on Biological Diversity: the conservation of biodiversity, sustainable use of its components (ecosystems, species or genetic resources), or fair and equitable sharing of the benefits of the utilisation of genetic resources.  In the sectors of water and sanitation, agriculture, forestry, fishing and tourism. Desertification-related aid Activities that combat desertification or mitigate the effects of drought in arid, semi arid and dry sub-humid areas through prevention and/or reduction of land degradation, rehabilitation of partly degraded land, or reclamation of desertified land. In the sectors of water and sanitation, agriculture and forestry. Climate change mitigation-related aid Activities that contribute to the objective of stabilisation of greenhouse gas (GHG) concentrations in the atmosphere at a level that would prevent dangerous anthropogenic interference with the climate system by promoting efforts to reduce or limit GHG emissions or to enhance GHG sequestration.  in the sectors of water and sanitation, agriculture, forestry, transport, energy and industry.  Climate change adaptation-related aid (approved in December 2009) Activities that intend to reduce the vulnerability of human or natural systems to the impacts of climate change and climate-related risks, by maintaining or increasing adaptive capacity and resilience.  In the sectors of water and sanitation, agriculture, forestry, fishing, flood and disaster prevention. Source: based on information collected from www.oecd.org/dac/stats/rioconventions   In addition, the DAC is considering expanding the marker system to cover non-ODA official flows with a view to obtain a comprehensive picture of all official flows targeted to climate change mitigation and adaptation. Non-export-credit other official flows (OOF), including investment by the official sector, are already reportable to the CRS at activity level in the same way as ODA. Several agencies extending such flows already apply the markers to their projects and some even report these to the CRS. Trade: definition of environmental goods and services The Doha Ministerial Declaration called for negotiations on ―environmental goods‖ but did not define the term. OECD and APEC have subsequently created lists of environmental goods for possible use in trade agreements. The OECD list was intended to illustrate the scope of the environmental industry and covers three areas:12  1. Pollution management: Air pollution control, Wastewater management, Solid waste management, Remediation and cleanup, Noise and vibration abatement, Environmental monitoring, analysis and assessment. 2. Cleaner technologies and products: Cleaner/resource efficient technologies and processes and Cleaner/resource efficient products.                                                       12  see: www.oecd.org/dataoecd/44/3/35837840.pdf    18 3. Resource management group: Indoor air pollution control, Water supply, Recycled materials, Renewable energy plant, Heat/energy savings and management, Sustainable agriculture and fisheries, Sustainable forestry, Natural risk management. The APEC list covers specific products in the environmental activities of air pollution control, heat/energy management, monitoring/analysis, noise/vibration abatement, other recycling systems, potable water treatment, remediation/cleanup, solid/hazardous waste and wastewater management to enable customs agents to easily distinguish and treat them differently for tariff purposes (OECD 2005a).   There are a number of difficulties with defining a set of environmental goods for trade purposes. First, there are environmental goods that have multiple purposes, some of which are non-environmental. Second, there are environmental goods that are sold as systems or whole plants, for which there is no established tariff nomenclature. Third, there are goods which have been produced using processes and methods deemed environmentally superior (e.g., eco-certified bananas).13 Finally, there are goods that may be considered environmental because they are an environmentally preferable substitute for an environmentally inferior good.  The already lengthy OECD and APEC lists do not consider goods produced by environmentally-friendly processes or that are environmentally preferable relative to others. According to these lists, ―green‖ is a matter of what you produce, not how you produce it or how use of the good affects the environment relative to substitutes for that good. These limitations are particularly problematic to define green FDI, because one important potential benefit from FDI is precisely the transfer of technology embedded in goods and services and the diffusion of green technologies and practices to local firms.  Eurostat Environmental Goods and Services Sector Classification System: the inclusion of technologies14 In 2009 Eurostat issued a comprehensive manual on data collection of EGS, although it does not present any statistics yet. Eurostat proposes a definition that includes both goods and services, and technologies divided into two categories: those which serve environmental protection (EP) purposes and those which serve resource management (RM) purposes (Table 2). The EGS sector is defined – following the definition of environment-related activities specified in OECD/Eurostat (1999)15 - as the activities of producers to ―measure, control, restore, prevent, treat, minimise, research and sensitise environmental damages to air, water and soil, resource depletion as well as problems related to waste, noise, biodiversity and landscapes. This includes ‗cleaner‘ technologies, goods and services that prevent or minimise pollution and results mainly in resource-efficient technologies, goods and services that minimise the use of natural resources‖. Table 3 summarizes the Eurostat classification system and provides some examples to illustrate the concepts.                                                            13  No countries at the WTO have proposed that goods be defined by the processes or production methods involved in their manufacture (OECD 2005a, 75). 14  http://epp.eurostat.ec.europa.eu/cache/ITY_OFFPUB/KS-RA-09-012/EN/KS-RA-09-012-EN.PDF  15  OECD/Eurostat, 1999, The environmental goods and services industry: manual for data collection and analysis     Table 2. List of Environmental Protection Activities (EP) and Resource Management Activities (RM) Environmental Protection Activities (EP) Resource Management Activities (RM) 1: Protection of ambient air and climate 2: Wastewater management 3: Waste management 4: Protection and remediation of soil, groundwater and surface water 5: Noise and vibration abatement 6: Protection of biodiversity and landscape 7: Protection against radiation 8: Research and development 9: Other environmental protection activities 1: Management of waters 2: Management of forest resources 3: Management of wild flora and fauna 4: Management of energy resources  5: Management of minerals 6: Research and development 7: Other natural resource management activities  Source: Eurostat (2009). Table 3.  The Eurostat EGS Sector Classification System     (EP) (RM) Examples Technologies Integrated Cleaner +   Mini-mill instead of dirtier blast furnaces e.g., Mexican steel industry (Zarsky and Gallagher 2008) Resource Efficient   + Technologies which allow re-use of water and energy e.g., Lucent’s zero effluent plant.  (Gallagher and Zarsky 2007)  End-of-pipe + + Filters, incinerators, equipment for recovery of materials e.g., Banana industry constructed a recycling plant in Costa Rica. (Gentry 1999)  Goods Adapted Cleaner +   Lead-free fuel (less polluting) e.g., study used fuel type as a proxy for environmental performance (Eskeland and Harrison 1997) Resource Efficient   + Renewable energy (less natural resource intensive) e.g., foreign firms in Chile are more likely to use electricity (hydropower) than domestic firms. (Dardati and Tekin 2010) Connected + + Installation of end-of-pipe or integrated technologies.   Services Environment Specific + + Waste management services (EP) e.g., US IT manufacturers use  (Zarksy and Gallagher 2003; Gallagher and Zarsky 2007) Source: Eurostat (2009).   20 The Eurostat classification is an important effort to define EGS, and can provide guidance on what sectors and activities to consider when assessing green FDI flows. There is however no direct correspondence between the Eurostat nomenclature and the classification of economic industries used to compile FDI statistics. In addition, the EGS sector as defined by Eurostat brings together enterprises that are engaged in producing environmental products or technologies, but, again, leaves out the more general greening of processes in any industrial activity.  Other efforts building on firm-level information: Financial Institutions Investment Indexes A number of other efforts exist to develop methodologies and rules to classify the environmental performance of companies. Dow Jones, Standard and Poor‘s (S&P), Deutsche Bank and other financial advisory services produce indexes of ―green‖, sustainable or low-carbon investment targeting socially-conscious investors, or companies whose business is in the development and deployment of green technologies. The limitation of these indicators for the purpose of this paper, however, is that they do not distinguish domestic from foreign investment. The objective of these indexes, based on information at firm level and aggregated, is to evaluate the performance of these companies and compare them across industries. Index methodologies vary widely, but usually assign weights based on exposure to green markets – involving typically a certain share of company revenue generated from business in environmental products and services - or reflecting the ―green‖ behaviour of the company. This is the case with the S&P and TSX Clean Technology Index described in Box 2.  Box 2. The S&P and TSX Clean Technology Index The S&P and TSX 2010 index methodologies assign weights based on exposure to green markets. Additionally, candidates for index inclusion must derive 50% or more of company revenue from products and services from one or more of the five environmental themes or 50% or more of a company’s net income must be generated by products or services from one or more of the five environmental theme categories (S&P and TSX 2010). The components of the S&P index include:   Renewable Energy – Production and Distribution (e.g. renewable energy developers and independent power producers);  Renewable Energy – Manufacturing and Technologies (e.g. equipment and components for the renewable energy);  Energy Efficiency (e.g. industrial automation and controls, and energy-efficient equipment);  Waste Reduction and Water Management (e.g. providing potable water, source reduction and in-process recycling);  Low Impact Materials and Products (e.g. organic foods). Source: S&P and TSX 2010       Concluding table Table 4.  defining “green” in other areas Areas  Objectives Scope of “green” Data collection Limitations for FDI ODA  (OECD DAC) Track donors’ commitments in the area of the environment, including under the Rio Conventions Aid to “environment”, “water & sanitation”, “renewable energy” Rio markers: biodiversity, desertification, climate change mitigation & adaptation Specific markers in standard reporting template of donors + sector classification Self assessment and declaration Trade  (OECD classification) Support trade liberalisation in EGS 3 groups of EGS: pollution management, cleaner technologies and products, resource management Trade registers are the main source for trade in EGS data. Follow a product classification The product approach leaves out the general greening of processes EGS Sector  (Eurostat) Support compliance with growing environmental objectives of EU countries and consistency of data collection efforts  Goods, services and technologies serving environmental protection & resource management purposes Builds on existing statistics and additional  questionnaires to enterprises Detailed classification of EGS, but no direct correspondence with FDI classification Investment indexes  (financial advisory services) Evaluate and inform markets on performance of green companies  Typically include activities in renewable energy, energy efficiency, waste reduction and water management, production of low impact material and products Computed by financial advisory services based on various methodologies using company level information Domestic & foreign investment are not distinguished  III.2. Defining Green FDI There have been few prior attempts to define green FDI. UNCTAD (2008) suggests a two-part definition: (i) that which goes beyond national environmental standards – i.e., which is ―compliant plus‖; (ii) that which is the direct production of EGS in host countries. It does however not provide any estimate of green FDI flows. UNCTAD (2010) focuses on low-carbon FDI, an important subset of green FDI, and defines it as ―the transfer of technologies, practices or products by TNCs to host countries – through equity FDI and non-equity forms of participation – such that their own and related operations, as well as use of their products and services, generate significantly lower GHG emissions than would otherwise prevail in the industry under business as usual circumstances. Low-carbon foreign investment also includes FDI undertaken to access low-carbon technologies, processes and products.‖ Again, the definition identifies two components: (i) low-carbon products and services and (ii) low-carbon processes.  FDI in EGS is conceptually easier to estimate than FDI in environmental processes, and can build on prior efforts to define EGS by the OECD for trade purposes or by Eurostat. However, FDI in EGS is likely to be of lesser significance than the role of FDI in fostering environmentally-favourable technology transfer in polluting and GHG-emitting sectors, i.e., energy, agriculture, mining, manufacturing, construction, transport. This underscores the importance of including investment embodying ―compliant plus‖ technologies in the definition of green FDI. Consequently and in line with previous efforts by UNCTAD, the paper proposes to follow a two-part definition of green FDI: 1) FDI in EGS sectors; and 2)   22 FDI in environmental-damage mitigation processes, i.e. use of cleaner and/or more energy-efficient technologies. The problem with including the second part of the definition, however, is the difficulty of identifying precisely which investments embody and transfer cleaner technologies and of measuring such investment flows. This definition assumes an improvement from a business-as-usual scenario, which is country- and industry- specific. Any attempt at operationalising a definition of green FDI based on the level of compliance of the investment with home and/or host country environmental regulations and/or with international standards16 requires reliable and consistent international, cross-sector, firm-level information on processes used and corporate environmental performance – which is not available. Alternatively, adopting the criterion that FDI can be considered green when it is more environmentally-friendly than domestic investment in those same sectors requires extensive information on the outcomes of foreign and domestic investment, i.e., energy-intensity, carbon footprint, waste management, air and water pollution, etc.  Given the methodological problems in estimating green FDI and the dearth of data, this paper proposes to proxy the first dimension of the definition and to provide an upper bound on the second. To proxy the first dimension of the proposed definition, this paper reviews the green industries and services for which FDI data can be made available in principle. Inclusion of all FDI potentially involving environmental-damage mitigation processes provides the upper bound for the second definition. The distinction between the two dimensions of green FDI becomes similar to the distinction between ―mitigation-specific‖ and ―mitigation-relevant‖ used by Corfee-Morlot et al (2009) in a discussion of financial support to fight climate change. This paper refers to ―environmentally-relevant‖ rather than ―mitigation-relevant‖ sectors to make it clear that the focus is not exclusively on climate-change mitigation but, more generally, on all environmental damage resulting from economic activities.  A major difficulty with including all environmentally-relevant FDI flows is that while these flows have the potential to transfer green technologies, the extent to which they actually do so is not known. On the other hand, limiting the definition of green FDI to narrowly-defined EGS clearly excludes much of the potential positive effect of FDI on the environment.  FDI in environmental goods and services It is in principle feasible to estimate a measure of FDI in EGS by identifying a number of green industries and collecting the corresponding FDI data for these sectors. In particular, as developed below, these industries could include renewable energy equipment, production and distribution, water and waste management, and potentially recycling (as in UNCTAD, 2010). In practice, however, as shown in the following section of the paper, limited data are available at present on FDI in EGS. This could, however, be the focus of an internationally-coordinated data collection effort. For the purpose of evaluating the scale of FDI in EGS, goods can be further narrowed to those that cannot be easily imported, and which therefore require foreign commercial presence.17 For example, wind turbines are very difficult to transport across borders and hence cross-border delivery may occur through                                                      16  Hansen (1999) considers four variants of corporate environmental practices: 1) Following or creating local practice; 2) Complying with host-country regulations; 3) Following home-country standards; and 4) Following higher standards set either by the firm or by some international agency. 17  Understanding the economic characteristics of FDI, in particular the roles of ―location‖ and ―internalization‖ of FDI decisions (e.g., Krugman and Obstfeld 2009), can help refine the definition of green FDI. As to location, FDI tends to occur when cross-border trade is not feasible. Also, foreign firms may have intangible assets (notably technology) that cannot be traded through arms-length markets, hence giving rise to FDI as opposed to licensing a local producer.     foreign commercial presence. A majority of the goods identified by OECD and APEC lack relevance for FDI because they are easily imported and commercial presence is not necessary (e.g., pumps and tubes). Thus, only a small subset of the OECD and APEC lists of green goods would appear to be relevant to FDI (OECD 2005a). This applies, most obviously and prominently, to clean energy, including production of equipment, generation, and distribution.  There is general agreement that the production of renewable energy is a green activity, including wind, solar, hydropower, biomass, geothermal and ocean energy (Table 5). These account for the bulk of the renewable energy sector. The major exception is nuclear power, which elicits controversy: it is a low-carbon source of energy but entails other risks related to waste treatment, national security and release of radiation. There is no consensus either regarding several other less important renewable sources such as co-generation, hydrogen and waste, as these are usually by-products of industries which themselves contribute substantially to GHG emissions. Cogeneration improves the energy efficiency of conventional power sources such as coal. Hydrogen is not renewable when the energy necessary for electrolysis comes from conventional energy sources like natural gas. Table 5.  Coverage of Green Energy in Green Investment Definitions, Various Sources  IEA UNFCCC  U.S. DOE India China S&P New Energy Finance  Renewable Energy Policies Database Special Report Renewable Energy Sources U.S. Recovery Act: Production Tax Credits Non-Conventional Energy New Energy Sourcesa Clean Energy Index / Alternative Energy Clean Energyb Biomass X X X X X X X Geothermal X X X X X X X Hydro X X X X X X X Solar X X X X X X X Wind X X X X X X X Ocean X X   X  X Waste   X X    Hydrogen Xc  Xd X    Co-gen Xe   X    Notes: a.The Chinese Investment Catalogue explicitly includes these sources but is not limited to them. b. Bloomberg’s New Energy Finance Database includes these energy sources as “clean energy.”  Their website claims to cover hydrogen as well, but as distinct from clean energy. c. Hydrogen when it is derived from renewable sources. d. Alternative fuel vehicle refuelling tax credit, as distinct from renewable energy production tax credits. e. Co-gen/CHP is not listed in the glossary definition of renewable energy, but appears in the policy database. Sources: IEA: www.iea.org/textbase/pm/glossary.asp; UNFCCC: http://srren.ipcc-wg3.de; India: www.mnre.gov.in/re-booklets.htm; U.S. DOE: www.eia.doe.gov/cneaf/solar.renewables/page/rea_data/table1_2.html; China: www.chinesewalker.cn/2009/06/01/catalogue-for-the-guidance-of-foreign-investment-industries; S&P: www2.standardandpoors.com/spf/pdf/index/SP_Global_Clean_Energy_Index_Methodology_Web.pdf; New Energy Finance: http://bnef.com/markets/clean-energy. Environmental services can be divided into infrastructure services and non-infrastructure services. Infrastructure environmental services represent 80% of the environmental services market and include water and wastewater treatment, solid waste management, and hazardous-waste management. Non-infrastructure services include air pollution control, soil and water remediation, and noise abatement. De facto, water and waste management account for an overwhelming share of environmental services, have relatively good data availability, and require foreign commercial presence, i.e., are best delivered through FDI rather than in arms-length trade, as mentioned earlier. As such, they can serve as the basis for an estimate of the environmental service dimension of green FDI. Note that ―environmental‖ here does not   24 necessarily mean ―clean‖, as the processes through which these environmental services are delivered could themselves be polluting or energy-intensive.  Environmentally-relevant FDI FDI in any ―environmentally-relevant‖ sector has the potential to transfer greener technologies and processes. Thus, following Corfee-Morlot et al (2009), the upper-bound to part 2 of the green FDI definition considered here encompasses all environmentally-relevant FDI, i.e. FDI in agriculture, energy, manufacturing, construction, mining, and transport. Other than transport, service industries are likely to contribute very little to environmental damage or to pollution remediation (Levinson 2008). There may be some exceptions, however, whereby service sector FDI contributes to environmental improvements. For example, in wholesale/retail trade, foreign supermarket chains may demand higher environmental standards from their suppliers. Walmart, Marks and Spencer and Carrefour have been cited as a source of environmental improvements (GreenBiz, 2008; OECD, 2010e). To the extent that FDI in wholesale/retail trade or other services contributes to dissemination of good environmental practices among suppliers, exclusion of these services from the definition could lead to under-estimate environmentally-relevant FDI. A key question is what part of environmentally-relevant FDI actually contributes to transfer of environmentally-sound technology in practice. Short of examining each individual investment in detail, how can a general measurement be made? In particular, how can the upper-bound definition of green FDI be further narrowed down? Some possible approaches to narrowing down the upper bound definition of green FDI are discussed below. Although preliminary and based on debatable premises, they are nevertheless presented to initiate discussions in this area, as a first step to developing better statistical divisions of FDI. Some estimates along these lines are presented in the following section. A possible refinement, building on Zarsky and Gallagher (2008)‘s assumption that multinational enterprises operate with company-wide environmental standards, would be to consider that FDI is green when it flows from a country with higher environmental standards to countries with lower environmental standards. This approach requires that countries are ranked by stringency of environmental regulations, which may raise important methodological issues and be difficult to agree upon. A number of indicators nevertheless exist, such as the environmental sustainability indexes (ESI) with a sub-indicator called the Environmental Regulatory Regime Index ERRI computed by the World Economic Forum (WEF). However, ESI was discontinued in 2005 and the last available date for ERRI is 2002, making it difficult to track the evolutions of indicators building on these indexes over time.18   A lesson from the case studies reported in the Appendix is that improved environmental performance is more likely to result from FDI in industries where pollution is a function of core technology, e.g. chemical and petroleum products, or iron and steel (Gallagher 2004), rather than when pollution is a function of end-of-pipe technologies (and environmental regulation is lacking). Gallagher‘s observations suggest that where energy is a significant cost in production and energy is inefficiently used, Greenfield investment delivers more efficient technologies. One way to operationalize an indicator along these lines would be to rank countries by their energy efficiency performance and assume that FDI flowing from more energy-efficient countries to less efficient ones will deliver environmentally superior technologies (because they are also cost minimizing).                                                       18  The WEF Global Competitiveness Report still reports indicators of environmental regulations, but these are based on surveys rather than objective data.     IV. ESTIMATING THE MAGNITUDE OF GREEN FDI AND RELATED RESTRICTIONS As noted by OECD (2010b), there is no generally-accepted and accessible data on EGS production, employment, or other aspects of the environmental sector. Estimates of trade in EGS are a little more advanced, but most work is still at the conceptual level with limited empirical evidence. Attempts at measurement of green FDI are even scarcer. This section discusses previous efforts to measure green FDI, before providing tentative measures of part 1 and 2 definitions of green FDI. IV.1 Existing efforts to measure green FDI  In principle, measuring FDI in EGS should be possible, particularly if the definition is limited to alternative energy industries and a few others which are clearly environmental in purpose. Nevertheless, most countries do not record and report data on FDI at such a disaggregated level (see box 3 on how FDI data are measured and collected, based on the OECD Benchmark Definition; OECD, 2008b).  Box 3. Measurement of FDI data, according to the OECD Benchmark definition Foreign direct investment is a category of investment that reflects the objective of establishing a lasting interest by a resident enterprise in one economy (direct investor) in an enterprise (direct investment enterprise) that is resident in an economy other than that of the direct investor. The lasting interest implies the existence of a long-term relationship between the direct investor and the direct investment enterprise and a significant degree of influence on the management of the enterprise. The direct or indirect ownership of 10% or more of the voting power of an enterprise resident in one economy by an investor resident in another economy is evidence of such a relationship.  FDI statistics encompass mainly four types of operations that qualify as FDI: i) purchase/sale of existing equity in the form of mergers and acquisitions (M&A); ii) greenfield investments; iii) extension of capital (additional new investments); and iv) financial restructuring. The Benchmark Definition, the world standard for direct investment statistics, recommends that countries compile and disseminate detailed FDI statistics broken down by i) geographical allocation (by country of source and destination); and ii) industry classification. Direct investment statistics are disaggregated by major industry sectors based on the International Standard Industrial Classification (ISIC) according to the principal activity of the direct investment enterprise (in the reporting economy for inward investments and in the host economy for outward investments). Main categories of the ISIC structure include Agriculture, forestry and fishing; Mining and quarrying; Manufacturing; Electricity, gas, steam and air conditioning supply; Water supply; sewerage, waste management and remediation activities; and various service industries. There is no correspondence between the ISIC classification and the classification of EGS as defined by Eurostat or by the OECD for trade purposes. The vast majority of the countries that compile FDI stocks data rely on enterprise surveys. They are based on reports from either a sample or a census of an economy’s enterprises and the results cover the full population of such enterprises. In addition, many countries maintain a business register which is updated on an ongoing basis from various sources. Several International organisations compile FDI data: OECD, Eurostat, European Central Bank, IMF and UNCTAD.  FDI statistics of the OECD and Eurostat are essentially based on a common framework for reporting detailed FDI statistics.  IMF and ECB compile and disseminate FDI as a functional category of the balance of payments.   Sources: www.oecd.org/daf/investment/statistics and www.unctad.org/fdistatistics An exception is India19, which has recently begun to record FDI inflows in ―non-conventional‖ energy, defined as ―Wind, Solar Photo-voltaic, Solar Thermal, Small Hydro, Biomass, Co-generation, Geothermal, Tidal and Urban & Industrial Wastes based power projects.‖ Monthly stock data for FDI in                                                      19  www.vigyanprasar.gov.in/comcom/develop67.htm   26 non-conventional energy generation exist from September 2007 to January 2010 (Figure 2). For most other countries, FDI data in renewable/alternative energy are not available. Figure 2 – Inward FDI in India’s Non-conventional Energy Sector (USD thousands)          Source: http://dipp.nic.in/fdi_statistics/india_fdi_index.htm  In the same vein, UNCTAD (2010a) provides some partial estimates of global flows of low-carbon FDI, identifying three sectors: alternative/renewable energy, recycling, and environmental technology manufacturing. However, in the current context of limited availability of FDI data at a level of detail required to develop these estimates, UNCTAD used project-level data from both the FDIIntelligence database and its own database. UNCTAD notes several major difficulties in tracking investment in low-carbon sectors: the number of cases to analyse, missing information on production processes and on specific outputs, and the fact that carbon-mitigating investment may occur in various sectors beyond those specifically defined as ―low carbon‖. Short of scrutinising the 22 000 FDI transactions to separate out those which are low-carbon, UNCTAD (2010) derives an estimate from the analysis of FDI in Greenfield projects and cross-border M&As collected regularly.  UNCTAD identifies 1 725 cases of Greenfield investment in renewable energy, recycling activities and environmental technology manufacturing (wind turbines, solar panels, biodiesel plants…) between 2003 and 2009 and 281 cases of cross-border M&A in renewable electricity generation. As shown in Table 6, over 2003-2009, global FDI flows in these three sectors amounted to USD 344 billion of which USD 90 billion occurred in 2009. Developing countries received a cumulative USD 149 billion over 2003-2009, of which two-thirds emanated from developed countries.      Table 6.  UNCTAD estimates of Low-Carbon FDI (Billion of USD), Cumulative over 2003-2009  Reporting (investing) regions Partner World Developed economies Developing economies World 344 304 39 Developed economies 195 189 6 Developing economies 149 115 34  Source: UNCTAD 2010, Table IV.2b. IV.2  Estimating the two-part definition of green FDI In the absence of detailed FDI data, part 1 of the definition of green FDI can be very roughly and unsatisfactorily proxied by FDI in Energy, Gas and Water (EGW) as defined by the ISIC classification. This category includes the most important environmental service by far (water management) and electricity. Given that it also includes electricity generated by conventional sources (e.g., coal, oil, nuclear) and excludes waste treatment and other environmental non-infrastructure services and manufacturing of environmental products, it is not clear whether it over- or under-estimates the first dimension of green FDI. In this context, EGW can be viewed as providing the order of magnitude rather than a precise estimate of part 1 of green FDI definition. Environmentally-relevant FDI (or potential for green FDI) includes EGW, manufacturing, mining, agriculture and forestry, construction, and transport. Table 7 presents estimates of the two dimensions of green FDI using global FDI stocks and flows reported by UNCTAD in the 2009 World Investment Report. The table shows total inflows of FDI by region, not distinguishing the origin of the flows. As shown by the tables, FDI in electricity, gas and water (EGW), a very rough and imperfect estimate of part 1 of the green FDI definition, is a very small albeit growing share of total FDI. It is also very small relative to the scale of FDI in ―environmentally relevant‖ sectors, as expected. Using these measures, world green FDI flows as approximated by global EGW FDI amounted to about USD 40 billion annually in 2005-2007 (2.8 % of total FDI flows), compared to a potential of ―environmentally-relevant‖ FDI of USD 600 billion (over 40 % of global FDI flows). EGW investments are of the same order of magnitude as UNCTAD‘s estimate of low-carbon FDI. Using stock rather than flow data yields similar proportions of green relative to total FDI. The corresponding flows to developing countries over 2005-2007 tell a similar story: the rough estimate of FDI in EGS averaged under USD 8 billion whereas  FDI flows in ―environmentally-relevant‖ sectors were close to USD 190 billion per year.    28 Table 7.  Lower and upper boundaries of Green FDI, Investment Flows and Stocks by Industry, USD  billion a. Flows, annual averages  1989-1991 2005-2007  Developed countries Developing countries World Developed countries Developing countries World Total 162 34.6 186.5 1 060.1 411.2 1 471.3 Environmentally relevant sectors (% of total FDI) 58.4 (36.1%) 22 (63.6%) 80.4 (43.1%) 305 (28.8%) 189.6 (46.1%) 603.6 (41%) Agriculture 0 0.6 0.6 0 3.3 0.3 Mining 9 3.2 12.2 12 43.6 167.6 Manufacturing 47.8 16.1 63.8 232.1 121 353.2 Construction 0.5 0.6 1 9.8 7.3 17.1 Transport 0.4 0.3 0.7 17.3 6.8 24.1 Energy, Gas & Water  (rough estimate of FDI in EGS) (% of total FDI) 0.8  (0.5%) 1.2  (3.4%) 2  (1.1%) 33.7  (3.2%) 7.6  (1.9%) 41.3  (2.8%) b. Stocks  1989-1991 2005-2007  Developed countries Developing countries World Developed countries Developing countries World Total 1 579.5 362.6 1 942.1 11 583.2 4 113.7 15 696.9 Environmentally relevant sectors (% of total FDI) 819.9 (51.9%) 199.2 (54.9%) 1 018.1 (52.4%) 4 642.1 (40.1%) 1 330.9 (32.4%) 6 129 (39%) Agriculture 3.5 4.6 8 11.8 20.2 32 Mining 148 23.8 171.8 851.8 288.6 1 140.4 Manufacturing 640.6 158 798.6 3 251.6 994.2 4 245.8 Construction 16.7 6.5 22.2 90.2 45.6 135.8 Transport 4.1 3.3 7.4 165.2 64.9 230.1 Energy, Gas & Water  (rough estimate of FDI in EGS) (% of total FDI) 7.1 (0.4%) 3 (0.8%) 10.1 (0.5%) 271.5 (2.3%) 71 (1.7%) 344.9 (2.2%) 1Estimated as ¼ of Transport, Post and Communications, based on OECD data. Developing countries include transition countries. Source: UNCTAD (2009) and author’s calculations Table 8 presents estimates of environmentally-relevant FDI, narrowed down to the share flowing from countries with higher environmental standards to those with lower standards, consistent with the evidence from the literature review that companies from countries with higher environmental requirements are in a position to transfer green technologies to countries with lower standards as discussed in III. Two measures of environmental standards from the 2005 ESI database are used: 1) the World Economic Forum survey response, indicating country environmental governance stringency, and 2) the U.S. Energy Information Administration indicators of national energy efficiency measured as energy consumption as a ratio of GDP.      Table 8 uses sectoral bilateral data from CEPII. CEPII's FDI database contains stock data for 2004 for 96 countries across 26 sectors. The data is sourced from IMF, UNCTAD, OECD and Eurostat. Missing values are estimated using a \"gravity-based regression\" and the database is balanced with a \"cross-entropy method\". CEPII's stock data are used for agriculture, construction, EGW, and mining sectors and aggregated from CEPII's manufacturing sub-sector data to create manufacturing FDI stock. CEPII FDI stock data are then paired with the measures of environmental standards from the ESI database for 2005.  The ESI data is available for both originating country and destination country for approximately 75% of total FDI stock value in CEPII. This partly explains the discrepancy in the value of environmentally-relevant FDI values listed in Tables 7 and 8. Table 8 indicates that slightly less than half of environmentally-relevant FDI is potentially green using the environmental regulatory stringency measure, and almost half when using the energy-efficiency measure, with some variation across sectors. Adopting these assumptions entails estimates of FDI in environmental-damage mitigation processes of 17% to 20% of total FDI stocks. However, even these scaled-down measures could overestimate the volume of green FDI to the extent that they reflect pollution-haven rather than pollution-halo effects.  Table 8. Estimates of the Potentially-Green Share of Environmentally-Relevant FDI, 2004  Stock of Environmentally-Relevant FDI in CEPII Database (USD  Billions) Green Share Based on Environment Regulatory Stingencya Green Share Based on Energy Efficiencyb Mining 276 45.7% 48.9% Manufacturing 1 883 44.6% 50.3% Electricity, Gas and Water 123 41.2% 42.6% Agriculture 6 51.9% 54.4% Construction 31 32.3% 41.6%     Total 2 319 44.4% 49.6% Notes: a. Share by sector where home country has more stringent environmental regulation than the host country as measured by the World Economic Forum survey of environmental governance. b. Share by sector where home country has higher energy efficiency than the host country as reported by the US EIA. Sources: CEPII FDI database (www.cepii.fr/anglaisgraph/bdd/fdi.htm);  2005 ESI database (http://sedac.ciesin.columbia.edu/es/esi/downloads.html).   IV.3.  Restrictions Restrictions on foreign firms are the most prominent impediments to FDI. Restrictions may be regulatory (de jure) or implicit (de facto). Regulatory restrictions on FDI include limits on foreign ownership, screening based on national interest considerations, operational limitations such as domestic content requirements, and nationality stipulations for board members or managers.    30 Figure 3.  Severity of Restrictions on the two dimensions of Green FDI and Economy-Wide Restrictions,  (0 = open, 1 = closed)  Source:  OECD and World Bank data, and authors’ computations Figure 3 presents computations of the severity of regulatory restrictions for 30 countries, conditional on data availability, with a score of 0 representing complete freedom of FDI and 1 representing a ban on foreign participation. Restrictions are shown for the economy-wide average for the first part of the green FDI definition (using FDI in EGS) and, for its second part (environmentally-relevant FDI), as determined in section IV. The restrictions indicators are based on those computed by the OECD Regulatory Restrictiveness Index (OECD, 2010a) and the World Bank (2010) Investing Across Borders indicators. As such, they may not take into account the latest developments in countries‘ openness to international investment. OECD (2010a) has computed restrictions indicators for 47 OECD and non-OECD countries and for 22 sectors. The sectors include agriculture/forestry, mining, manufacturing, construction, electricity and transport, enabling computation of an index of environmentally-relevant FDI restrictions as defined above.20 The World Bank (2010) reports equity limits on foreign holdings on renewable energy and waste management, which together can be considered to represent a fairly good approximation of the EGS sector.21                                                       20  The weights on the subsectors are based on global FDI stocks in these sectors over 2005-2007, using Table 7. Manufacturing (weight of about 0.7) and mining (0.2) account for the bulk of the weighting, with agriculture, construction, energy/water, and transport together sharing the remaining .1.  This differs from the OECD method which uses unweighted averages of sectoral restriction indicators in computing economy-wide restrictions. Using a weighted average for environmentally-relevant FDI seems necessary given the wide disparity in the shares of environmentally-relevant FDI components in total environmentally-relevant FDI, and the small number of industries included. 21  To obtain a measure of restrictions on FDI in environmental goods and services, calibrated using the OECD method, the World Bank equity restrictions were converted to a 0-1 scale. Other types of restrictions on FDI in environmental goods and services are not available, and were assumed to be equal to the average of sectors covered in the OECD computation. For example, the restrictions score for screening on renewable energy in India is assumed to equal the screening score for all sectors in India for which data are available in the OECD file. This assumption is defensible, because equity restrictions are almost always the most important restriction,     Table 9 reports permitted ownership levels for countries showing restrictions for renewable energy according to the World Bank Investing Across Border database and distinguishing between greenfield (GF) and mergers and acquisitions (M&A). In almost all cases (the only exception is Austria), there is no difference between restrictions on GF and M&A in green FDI sectors (renewable energy and waste management). Table 9.  FDI Restrictions in renewable energy (Percent Foreign Ownership Permitted), Greenfield (GF) and Mergers and Acquisitions (M&A) Region/Economy Biomass Hydro Solar Wind  GF M&A GF M&A GF M&A GF M&A Austria 100 49 100 49 100 49 100 49 Bolivia 49 49 49 49 49 49 49 49 Costa Rica 49 49 49 49 49 49 49 49 Ethiopia 50 50 50 50 50 50 50 50 Greece 0 0 0 0 0 0 0 0 Indonesia 95 95 95 95 95 95 95 95 Malaysia 30 30 30 30 30 30 30 30 Mexico 0 0 0 0 0 0 0 0 Morocco 0 0 0 0 0 0 0 0 Philippines 100 100 100 100 40 40 40 40 Sudan 50 50 50 50 50 50 50 50 Thailand 49 49 49 49 49 49 49 49 Venezuela, R.B. 100 100 0 0 100 100 100 100 Yemen, Rep. 100 100 100 100 100 100 49 49 Source: World Bank Investing Across Border database, 2010. Figure 3 and Table 9 indicate that for most countries regulatory restrictions are quite low for both measures of green FDI, and generally below the economy-wide average level of restrictiveness. Exceptions where FDI in EGS is highly restricted include countries where electricity generation, including that with renewable energy, is totally or partially restricted to foreign investors. For some countries, the World Bank measures may overstate restrictiveness.22 Some countries with high economy-wide restrictions also have high restrictions on ―environmentally-relevant‖ FDI. As found in Golub (2009), Asian countries have generally high levels of restriction on FDI while European and South American countries (at least until                                                                                                                                                                              and other restrictions do not vary as much by sector as equity restrictions. The weights on renewable energy and waste management are taken to be equal (0.5 each). 22  In Mexico, for instance, the Foreign Investment Law and to the National Foreign Investment Registry specify the activities with respect to the generation of electric energy that are open to foreign investment. They include: Generation of electric energy for self-supply, cogeneration and small-scale production; Generation of electric energy carried out by independent producers for sale to the Federal Electricity Commission; Generation of electric energy for exportation, derived from cogeneration, independent production and small-scale production; Importation of electric energy by individuals or legal entities, intended exclusively for self-supply for their own use; and Generation of electric energy intended for use in emergencies derived from interruptions in the public service of electric energy. Greece also embarked on electricity market liberalisation reforms following Law 2773/1999. Subsequently, the legal framework was revised in order to comply with the provisions of Directive 2003/54/EC and to incentivise private investment and competition. However, according to Ekaterini Iliadou (2007), it may not have led yet to a change in the market structure – hence the World Bank Investing Across Border classification.   32 recently) have low restrictions and this largely extends to green FDI sectors, whether defined narrowly or broadly. There are some exceptions here, too. For example, India has fairly high overall FDI restrictions, but low restrictions on both measures of green FDI.  Overt FDI restrictions, specifically limiting foreign equity participation, are relatively limited in the case of EGS. This corroborates results of UNCTAD (2006). Implicit barriers to foreign participation in environmental services may be much more important than overt restrictions in many countries however, notably in cases of state ownership of infrastructure environmental services (water provision and waste management).23 Privatisation and foreign ownership of infrastructure is indeed controversial for both economic and political reasons. Infrastructure is often regarded as a « strategic » sector to be controlled by government (OECD 2001).24 Implicit restrictions are not reflected in the computation of restrictions in Figure 3, but can be factored in if data on state participation and other de jure obstacles to foreign investment could be obtained.                                                      23  Reciprocally, the OECD policy monitoring undertaken under the Freedom of Investment Process suggests that ―to date investment protectionism associated with green growth policies is not a major problem. None of the 42 countries that report regularly to the OECD about investment measures have reported measures involving overt discrimination against non-resident or foreign investors in relation to environmental policy.‖ It also emphasizes the fact that ―Environmental policy measures that appear to be neutral may involve de facto discrimination‖ and that environment-related state aids used including as part of emergency investment measures may pose risks to competition. www.oecd.org/investment/foi  24  On trends of private sector participation in water infrastructure and conditions for a beneficial private participation, also see OECD (2009b).     V. CONCLUSION The contribution of FDI to the environment is potentially large but largely ignored so far: Better information and indicators on the scale and trends of private finance in support of green policy objectives are much needed. This is, for instance, highlighted in relation to climate change by the Cancun agreements that formalise commitments by countries to reduce emissions and mobilise additional funding while recognising the shortcomings of current climate finance systems. It is also present in the Nagoya decision to adopt a strategy for resource mobilization to achieve the \"Aichi Biodiversity Targets‖, which relies on various funding sources, including from the private sector. More generally, this need is illustrated by recent efforts by OECD countries to develop a Green Growth Strategy, with corresponding monitoring indicators as a key pillar.   While potentially large, the contribution of FDI to financing investment in environmental goods and services (EGS) sectors and transferring environmentally-friendly technology and practices has so far received less attention than, for example, ODA or trade. For instance, there has not been any systematic attempt at defining, estimating and tracking ―green‖ FDI or sub-categories thereof. The only important effort was carried out by UNCTAD in the 2010 World Investment Report in relation to low-carbon FDI, but did not rely on the currently available FDI data from the ISIC classification – rather, it relied on project-level information - and consequently, did not lead to a systematic tracking over time. Against this backdrop, this paper is an exploratory study summarizing existing work by OECD and others, investigating the practicability of various possible definitions of green FDI, and identifying associated investment policy restrictions. It is meant to review the existing evidence on green FDI in order to trigger discussions and further work on this issue. Drawing on previous studies, this paper argues that ―green‖ FDI can be defined along two dimensions: 1) FDI in EGS sectors; and 2) FDI in environmental-damage mitigation processes, i.e. use of cleaner and/or more energy-efficient technologies. Given the current paucity of data in this area, the paper proxies the first part of the definition and provides an upper bound for the second dimension, using the concept of environmentally-relevant FDI, i.e., all FDI in sectors that have significant environmental spillovers (agriculture, manufacturing, mining, forestry, transport, construction and energy). However, as shown repeatedly in the paper, formulating a useful metric to track green FDI is complex. In the absence of readily available data at a level of detail required to develop robust estimates, any proxy will be imperfect and this initial effort to define and measure green FDI should not be misconstrued as giving more precise metrics than they are. Further work by the OECD Working Group on International Investment Statistics on the definition and measurement of green FDI as part of its globalization research agenda will precisely seek to address the limits of sectoral financial data to provide relevant estimates. A number of preliminary conclusions can be derived from this exploratory study: It would be feasible in principle to identify FDI flows in a number of EGS industries, including renewable energy, water and wastewater treatment, waste management and remediation activities. Compilation of FDI data in such industries is contingent on countries making publically available more detailed information on sub-categories of the current FDI classification (ISIC), notably on the section dealing with Electricity, gas, steam and air conditioning supply and the section dealing with Water supply, sewerage, waste management and remediation activities. More detailed information on these sectors would enable computation of FDI in EGS.    34 In the absence of such detailed classification of FDI, this paper provides a very rough and unsatisfactory estimate of FDI in EGS sectors, using the current EGW category (Energy, Gas and Water) of the FDI classification. Because it also includes electricity generated by conventional sources (coal, oil, nuclear…) and excludes waste treatment and other environmental non-infrastructure services and manufacturing of environmental products, EGW can be viewed as providing the order of magnitude rather than a precise estimate of part 1 of the green FDI definition. The paper estimates at some USD 40 billion (2.8% of total FDI) the scale of this flow for the world in 2005-2007. In the absence of detailed information on the nature of the technology used and the outcomes of foreign investment on the environment, i.e., energy-intensity, carbon footprint, waste management, air and water pollution, etc., it is difficult to estimate the level of FDI that corresponds to the second part of the paper‘s green FDI definition (FDI in environmental-damage mitigation processes, i.e. use of cleaner and/or more energy-efficient technologies).  In order to better understand the extent to which FDI may contribute to the use of cleaner and/or more energy-efficient technologies, the paper provides a review of the literature on industry- and country-level case studies. While the results are not unanimous, the preponderance of the case-studies in the environmentally-relevant sectors of agriculture, manufacturing and mining indicate that FDI can be considered as at least as environmentally sensitive as domestic investment and result in greater attention to and mitigation of pollution. These case studies therefore tend to corroborate the hypothesis that FDI can transfer environmentally-sustainable technologies and practices when foreign firms operate at higher environmental standards than firms in host countries. Foreign firms may even drive increased environmental regulation in host countries to level the playing field with domestic companies that comply with lower environmental standards. The empirical evidence, however, suggests that broader spillover effects to domestic firms depend primarily on host countries‘ policies. The paper also attempts to provide some very rough measures of the magnitude of FDI in environmental-damage mitigation processes by making a number of strong assumptions based on the results of the literature review. First, the paper argues that green FDI can be bounded using the concept of environmentally-relevant FDI. Based on the assumption that agriculture, manufacturing, mining, forestry, transport, construction and energy are the preponderant environmentally-relevant sectors, the paper estimates that environmentally-relevant FDI flows reached some USD 600 billion (41% of total FDI) for the world in 2005-2007. The paper then seeks to narrow down the broad definition of environmentally-relevant FDI by making a number of assumptions related to the relative levels of environmental regulatory stringency and energy efficiency in home and host countries. Adopting these assumptions entails estimates of FDI in environmental-damage mitigation processes of 17% to 20% of total FDI stocks. Finally, using a methodology developed by OECD (2010a) and data from the World Bank, the paper shows that overt FDI restrictions on foreign equity participation in green industries are relatively limited and are rapidly disappearing in most countries even in sectors where they were traditionally important (such as in the energy and EGS markets). Remaining barriers to green FDI, as in the case of trade, are for the most part implicit rather than explicit. In particular, inadequate policy frameworks, limited administrative capacity and low profitability (due to low rates in sectors such as electricity or water) are probably the limiting factors to the capacity of countries – particularly developing countries – to absorb greater amounts of green FDI.      APPENDIX. EMPIRICAL EVIDENCE ON THE GREENING EFFECT OF FDI Zarsky and Gallagher (2003) correlate the stock of FDI as a ratio of GDP with the World Economic Forum‘s Environmental Sustainability Index. Data have been updated using World Bank data from 2005. The figure suggests that there is no consistent aggregate relationship between FDI and environmental quality. Figure 1.  FDI/GDP and ESI Rating, Countries 0.511.5FDI Stock / GDP30 40 50 60 70 80ESI Composite ScoreFDI Stock / GDP (2005) vs ESI Composite (2005)  Source: Authors’ calculations from World Bank and ESI data. Since the effects of FDI differ by firm, industry, sector and country, the factors that influence FDI‘s environmental performance are further analysed below, through case studies of the agricultural, manufacturing, mining, and services sectors. The review of the literature focuses on two primary concerns: 1. Do foreign firms perform better with respect to the environment than domestic firms, and 2. Do foreign firms transfer environmental technology to domestic firms?  While the results are not unanimous, the majority of case-study research indicates that FDI generally results in greater attention to and mitigation of pollution. In cases where FDI is not superior to domestic firms, domestic firms have not been shown to be outperforming foreign firms. Therefore a general conclusion is that FDI is almost always at least as environmentally sensitive as domestic investment, and in some cases superior.   In agriculture, Costa Rican banana multinationals led the way in waste management, one of the main environmental issues confronting large-scale farming. Likewise, multinationals were leaders in environmental improvements in the Brazilian pulp and paper industry. In Chile, however, there was no difference between foreign and domestic firms in the pulp and paper industry.   36 In manufacturing, several studies of FDI in the Mexican chemical and manufacturing industries find that foreign firms exceed Mexican firms in environmental performance, primarily because foreign firms are subject to high industry standards in their home countries. Some multinational affiliates welcomed increased environmental regulation because they already performed to international environmental standards. This, in turn, tended to force local firms to satisfy higher environmental standards. Despite this convergence effect between foreign and domestic companies in the same sector, these case studies show little evidence of broader spillover effects to domestic firms. This may suggest that while home country policies are crucial for environmental performance of the foreign investor, spillovers to domestic firms may depend more on the policies of the host country.   The story is somewhat less clear in mining but, again, foreign firms‘ environmental records either surpass those of domestic firms or equal them. Case studies in Latin America and Russia indicate that foreign firms operated at world-class environmental standards even when domestic regulation was weak. In some instances, foreign firms also lobbied both for more stringent and for more transparent environmental regulation, as they did in manufacturing.   In the case of environmental goods and services, technological disparities between countries drive FDI and are the source of beneficial environmental spillovers. In fact, in one case these spillovers are significant enough to warrant an Indian firm moving to Denmark for the purpose of acquiring know-how from Danish firms, which are at the technological frontier in wind energy. Provision of environmental infrastructure services, notably potable water delivery, requires complex organizational capabilities, knowledge and capital, typically possessed by multinational enterprises.   A.1 Agriculture Research on the environmental effects of FDI in the agricultural sector is limited. Gentry (1999) studied the environmental performance of foreign firms in the Costa Rican banana industry, the Brazilian soybean industry, and the Brazilian pulp and paper industry. The Costa Rican case is especially informative and is analysed in the following section. In the cases of Brazilian soy beans and pulp-paper industries, the effects of FDI are ambiguous and much less significant. A more recent study of the Brazilian pulp-paper industry is also discussed. Finally, a recent study of the environmental performance of foreign investment compared to domestic investment in Brazil and Chile with special attention to technology and regulatory effects is reviewed.   The Costa Rican banana industry (Gentry 1999) Costa Rica is the world‘s second largest banana exporting country. The three largest banana producers operating in Costa Rica – Chiquita, Dole, and Del Monte – are headquartered in the United States. These three firms account for 68% of Costa Rica‘s banana production. Between 1988 and 1994, land dedicated to banana production increased from 20,000 to 52,733 hectares. This expansion was driven by USD 393 million of foreign direct investment between 1987 and 1993.   Environmental Performance of Foreign Firms In 1991, Costa Rica‘s banana sector regulator, Corporacion Banaera Nacional, created an Environmental Protection Unit. The banana industry, probably fearing overly restrictive regulation, responded in 1992 by instituting self-regulatory ―goals‖ through an environmental commitment document with five major goals: 1. Creating the Environmental Banana Commission,  2. Encouraging waste management,  3. Changing agrochemical practices to reduce risks,  4. Promoting better soil use and reforestation practices, and  5. Introducing a bi-annual farm compliance assessment.     Under the terms of the commitment document, the banana industry improved its environmental performance in excess of local requirements. For instance, since banana production is extremely plastic-intensive, Dole and Del Monte satisfied their commitment to improved waste management by jointly developing a plastics recycling plant. Chiquita followed suit by establishing its own recycling and integrated waste management programs.   Foreign firms are often larger than domestic firms and can therefore benefit from economies of scale in reducing environmental impacts. Gentry (1999) noted that farms belonging to large marketing companies like Chiquita and Dole were more likely to employ environmentally preferred technologies. Small-scale producers did not implement intensive environmental management programs, citing capital costs and restricted European demand. Environmental Certification and the Role of NGOs In addition to responding to increasing regulatory pressure, the big players in the banana industry, mainly foreign firms, were pressured by NGOs through the 1990s to improve their environmental conduct. In the 1990s the English NGO ―EuroBan‖, a network of 28 European organizations, coordinated activism against the banana industry in Costa Rica. In 1993, 2 NGOs, the US Rainforest Alliance and the AMBIO Foundation, helped found the Eco-OK banana certification program (Charter and Polonsky 1999). The program evaluates firms on 5 major criteria:25 1. Handling of hazardous substances,  2. Integrated waste management,  3. Occupational health,  4. Water monitoring, and  5. Ecosystems  Chiquita has been certified on 25 of its 29 farms in Costa Rica and the remaining farms are currently in the certification process.  In the late 1990s, Chiquita and Rainforest Alliance developed an industry-specific environmental performance standard called ―Better Banana Project‖ and simultaneously pursued ISO 14001 certification, which Chiquita succeeded in achieving in all its Costa Rican operations by 2000. Brazilian Pulp-paper Industry (Gallagher 2008) FDI flows into the Brazilian pulp and paper industry averaged USD 8.1 million from 1995 to 2001 and increased to an average of USD 440.4 million between 2001 and 2006. The major result of the case study is that there is no ―pollution haven‖ in Brazilian pulp and paper – environmental regulation and performance are up to international norms. Of the 9 firms surveyed (5 Brazilian and 4 foreign), all were in compliance with domestic regulations and all had at least one plant certified to ISO 14001. Leading exporters were found to be the best environmental performers. The pulp and paper industry faces pressure from international markets ―to invest in forest and industrial certification systems, introduce new pollution-control technology, and improve resource input efficiency.‖ Thus international market pressure, rather than regulation, is credited with high levels of environmental performance in a historically dirty industry.  Chilean and Brazilian Forestry Industry (Borregaard, Dufey, and Winchester 2008) In Chile‘s pulp-and-paper industry there is no substantial difference in environmental performance between foreign and domestic firms. In the forestry industry there is no difference in the participation rate between foreign and domestic firms in the Clean Production Agreements of the National Council for Clean                                                      25  For a detailed list of inspection factors see Gentry (1999, 93, Table 4.7)   38 Production. Likewise, major foreign and domestic firms operating in the Brazilian forest industry have all achieved ISO 14000 certification.    Export market pressures and access concerns are credited with the convergence of environmental performance among domestic and foreign firms alike. Plant and equipment are provided by outside firms and leave ―limited scope for differences in mill design‖ -- meaning that environmental performance is likely to be relatively similar among foreign and domestic firms.  Regulation is weakly enforced in Brazil and Chile. However, because they fear eviction, foreign owned firms are generally more law abiding than domestic firms. A.2. Manufacturing The manufacturing sector has a rich body of literature on FDI and the environment. Using a survey methodology, Ruud (2002) found that affiliates of foreign multinationals performed better than domestic firms in the Indian chemical, metals and machinery production, and electronic industries. However, multinationals located in India perform as ―islands of environmental excellence in a sea of dirt.‖ (Ibid)  Ruud concludes that while FDI inflows are not causing a race to the bottom, they do not necessarily lead to improved performance of local industry. A study of the environmental performance of foreign firms in Cote d‘Ivoire, Morocco, Mexico and Venezuela‘s manufacturing sector used energy consumption and fuel type as a proxy for emissions and found that foreign ownership was associated with cleaner fuel use and greater energy efficiency (Eskeland and Harrison 1997).   Using data from 2,886 manufacturing joint venture (JV) projects in China, Dean et al. (2004) find that JVs locate in provinces where FDI, skilled workers, foreign firms and incentives are abundant. Additionally, JVs with partners from the most developed nations are attracted by ―stringent environmental levies‖ (Dean, Lovely, and Hua Wang 2004).  Dean et al (2009) advance the literature on pollution havens using a sample of 3,854 projects (―3.4% of the total [equity joint venture] projects entered into during the period‖) across Chinese provinces with different levels of pollution regulation stringency. They find statistically significant support for the pollution haven hypothesis when investment originates from Hong Kong, Taiwan, and Macao and flows into the most polluting industries, but no statistically significant support for the pollution haven hypothesis when investment comes from high-income countries. This likely reflects the fact that foreign investors tend to apply technologies similar to those they use at home, which involve greener processes and newer equipment for investors from high-income countries, whereas foreign investors from newly industrialized countries face less stringent standards at home and hence are less apt to use green technologies both at home and in investing abroad.   According to Gallagher (2004), technological leapfrogging to the forefront of environmental performance is more likely to result from FDI in industries where pollution is a ―function of plant vintage (or core technology)‖, e.g. chemical and petroleum products, or iron and steel. When pollution is a function of end-of-pipe technologies (and environmental regulation is lacking), the effect of foreign investment on environmental performance is ambiguous.  The following case studies focus on the chemical and the IT industries in Mexico.  Mexican Chemical Industry (Garcia-Johnson 2000) Responsible Care In the wake of the 1986 Bhopal disaster, the US Chemical Manufacturers Association (CMA) felt pressure to improve its safety, environmental and public relations programs. CMA responded by developing the Responsible Care program, which aimed to improve environmental performance and to     increase corporate accountability.26 In the late 1980s and early 1990s the US chemical industry demonstrated important environmental improvements. Toxic Release Inventory data suggests that the chemical industry reduced its emissions by more than any other industry between 1988 and 1996. The Responsible Care program is widely considered a successful example of corporate environmental volunteerism and has been emulated by the petroleum industry. International Responsible Care and Mexico Members of the International Council of Chemical Associations (ICCA) have implemented Responsible Care in 47 countries, making Responsible Care the most widespread sector-specific environmental management system (EMS) (OECD 2005b, 11). In the 1990s Mexican chemical manufacturers considered adopting measures similar to Responsible Care. Mexican adoption of Responsible Care appealed to some US affiliates operating in Mexico because they already followed the environmental guidelines of their US parent companies (Garcia-Johnson 2000). US affiliates hoped that establishing a clear set of consistently enforced regulations would ―level the playing field‖. U.S. affiliates may also have reasoned that because they already performed to high environmental standards, in a more regulated environment they would have a compliance advantage over less advanced Mexican firms. The two US chemical firms in Mexico interviewed by Garcia-Johnson (2000) enthusiastically welcomed the Responsible Care program although they did not proactively export Responsible Care to the Mexican industry. U.S. affiliates who were performing at a relatively high environmental standard were concerned that their reputations might suffer as a result of accidents at unrelated low-standard Mexican firms. Reputation and Compliance Advantage By most accounts, the threat of externally imposed regulation motivated the U.S. chemical industry to institutionalize its environmental policies. Foreign affiliates of U.S. firms, concerned with protecting their injured reputations, welcomed regulation of the chemical industry. Because these foreign firms were already exceeding potential standards the costs of compliance would be minimal. In fact, U.S. affiliates stood to gain from the changes in regulation: if Mexican firms were held to higher standards, the Mexican government might increase the supply of supporting infrastructure (e.g. hazardous waste disposal sites) for these environmental improvements.    Mexican IT Industry (Gallagher and Zarsky 2007; Zarsky and Gallagher 2008)  Foreign direct investment into Mexico‘s electronics sector increased five-fold between 1994 and 2000 (Gallagher and Zarsky 2007). Guadalajara became ―Mexico‘s silicon valley‖ as major foreign IT manufacturers located their operations in Mexico. The Mexican IT experience shows that foreign affiliates perform to higher environmental standards than domestic firms – only 266, or 0.1%, of all Mexican firms were certified under ISO 14000 in 2002 (Gallagher and Zarksy 2004) – however, spillovers may be limited. U.S. flagship operations such as IBM and HP, as well as contract manufacturers (CMs) – large firms which assemble components, provide intermediate goods for flagships -- used relatively less energy and water than their domestic competitors largely because energy and water efficiency were functions of plant vintage. Most foreign affiliates constructed their facilities after 1994 (Zarsky and Gallagher 2008). Lucent                                                      26  One motivation for Responsible Care would be to institutionalize industry standards in order to pre-empt and avoid an open policy debate around increased regulation of chemical industry standards.   40 Technologies was an early leader, when it built a state-of-the-art zero-effluent manufacturing facility in Guadalajara in 1991 (Gallagher and Zarsky 2007).   The domestic IT industry in Mexico did not capture technology-spillover effects resulting from FDI.  Trade and monetary policy impeded capture through vertical linkages. The trade program PITEX allowed companies to import inputs duty-free if 65% or more of the final product was exported (Gallagher and Zarsky 2007). This trade policy made it more attractive for multinationals to source their inputs globally (bypassing backward linkages) and encourage sale on foreign markets (bypassing forward linkages in the domestic market). Policy which kept the peso over-valued further discouraged local sourcing of components. Nevertheless some spillovers occurred, in the following areas:  Demonstration Effects: Lucent‘s Mexican operations were models of good environmental conduct. In addition to greenfield investment in a state-of-the-art production plant, Lucent made efforts to provide environmental training for domestic businesses. In 1997 and 1998 Lucent participated in and funded a World Bank project that ―mentored‖ SMEs in environmental management. Gallagher and Zarsky (2007) note that the success of this program was mixed – some of the mentoring firms did not have environmental management systems.  Competition Effects: Although technology spillovers had the potential to improve environmental performance of local firms – and some foreign companies made efforts to encourage upstream vertical spillovers – because foreign IT manufacturers did not face local competition, there was scant opportunity for such spillovers.   Backward Linkages: Domestic suppliers may improve their environmental performance in order to satisfy environmental standards imposed by the multinationals, and some multinationals are committed to improving suppliers‘ environmental performance. In 2002 Hewlett-Packard instituted a Supply Chain Social and Environmental Responsibility Policy program and in 2004 helped bring together a group of manufacturers under a common Electronics Industry Code of Conduct.  However, Gallagher and Zarsky (2007) note that local suppliers the authors interviewed had not been subject to environmental requirements by flagships.   A.3. Mining Mining is a much larger component of FDI in developing nations than in developed countries. For instance, gold mining accounted for 55% of FDI inflows in Ghana over the 1990s (OECD 2002). Mining and extractive industries have a more significant environmental impact than other industries (with the possible exception of the chemical industry). Because the extractive industry has a reputation for being particularly dirty, and because foreign investment in the extractive industry is a large part of FDI inflows to developing nations (where environmental regulation is less developed), a close look at the environmental performance of FDI in the mining sector is warranted.  Analysis of the environmental effects of FDI in the mining sector of sub-Saharan Africa suffers from a lack of hard data. Case studies indicate mixed environmental effects of FDI. Some foreign firms go above and beyond local environmental regulation while others exert downward pressure on regulation through lobbying efforts. Ghana realized some positive technological spillovers when foreign firms introduced more environmentally friendly processes (OECD 2002). In 3 out of the 4 case studies analyzed by Henzler (2002), foreign investment resulted in direct environmental benefits. The case studies drawn from the Russian Federation and Kazakhstan demonstrate technology spill-over effects where foreign investment encouraged the transfer of greener management practices and technologies.      Using a large plant-level data set (419 mines), Koop and Tole (2008) investigate the environmental performance of multinationals in the global gold mining industry. Environmental performance of gold mining firms in poor countries is not significantly different from that of firms in rich countries. Further, no statistically significant difference in environmental performance is observed between foreign and domestically owned firms. The empirical evidence is mixed on the environmental effects of FDI in the mining sector; results vary with technological, geographic and regulatory factors. Here we examine two illustrative examples of FDI in the mining sector drawn from the OECD‘s 2002 report ―Foreign Direct Investment and the Environment: Lessons from the Mining Sector‖. Chilean and Peruvian Mining (OECD 2002) Copper is Chile‘s largest export. Private production of copper increased from 393,000 tons in 1990 to 2.875 million tons in 1999. Between 1996 and 1998 FDI increased from 61.7% to 78.3% of total investment. Like Chile, Peru derives the largest share of its mining production value from copper (34%). Foreign investment in Peru‘s mining sector increased from 44% of total FDI in 1992 to 76% in 1996.   Environmental Performance of Foreign Firms In Chile, differences in environmental performance between older state-owned CODELCO operations and Chagres (owned by Exxon) have been pronounced. Historically, Exxon‘s refinery performed significantly better than state-owned refineries, producing 30% less emissions than the state-owned operations, though this gap has narrowed as Codelco reduced its emissions significantly during the 1990s. Survey results indicate that over the course of the 1990s, foreign and domestic investment in the mining sector converged with respect to environmental management. In the 1980s and early 1990s domestic firms lagged far behind foreign firms in the area of ―soft-technologies‖ such as Environmental Management Systems (EMS). These differences have narrowed, and in 2002 all mining operations in Chile had an environmental department. However, as of 2002, only foreign firms in Peru and Chile have been ISO 14001 certified. Regulation In Chile, foreign investment spurred the introduction of environmental legislation and of Environmental Impact Assessments (EIAs). These EIAs consider environmental factors beyond the scope of antiquated Chilean regulation from the 1970s. Foreign mining companies lobbied Chilean authorities to define clear regulations and, where gaps remain in domestic legislation, foreign firms often apply home standards. Peruvian domestic environmental regulation is plagued by weak enforcement; however, multinationals have behaved with world standard environmental ethics and have exceeded Peruvian standards. For example, the mining company Antamina complies with domestic regulation, World Bank guidelines, and environmental standards of its foreign owners.  In the cases of Chile and Peru, foreign affiliates‘ environmental policies and performance influenced domestic regulation and actively encouraged the creation of clearly defined environmental regulations, which contradicts the pollution haven hypothesis. Russian Extractive Industry (OECD, 2002) Russia's largest gold mine, Kubaka, is a joint venture between the Omolon Gold Mining Company and Canadian Kinross Gold Company (54.7%). In 1998, when Kinross took majority ownership of the mine, it instituted a comprehensive environmental management program. Kinross applied its internal   42 environmental policies and standards, which were well above those of most mining firms in Russia, and introduced equipment and techniques for waste-water management as well as soil and air quality monitoring.  By contrast, the Russian firm Norilsk Nickel, owned by the domestic Interros Industrial Financial Group, is the world's largest nickel manufacturer and its biggest single source of sulphur emissions. In 2001, Norilsk's annual report recognized that its production processes lagged far behind international competitors, so in 2001 Norilsk accepted grants from Norway and the Nordic Investment Bank to help modernize its major sulphur-emitting plant. In November 2009, Norilsk backed out of an agreement that would have required it to reduce sulphur emissions to 10% of its 1999 emissions level (Norwegian Ministry of Environment, 2009). A.4 Environmental Goods: Wind Turbines FDI in wind-power equipment manufacturing is predominantly market-seeking. FDI eclipses trade in the wind industry because of the high costs of transportation for large-scale wind equipment (Kirkegaard, Hanemann, and Weischer 2009). Wind-power Monthly Magazine recently estimated transportation to be 10% of total capital costs, on average (Gosman, 2010). Kirkegaard et al. (2009) state that intellectual property makes up a modest 2% of total turbine costs while transportation makes up 8% of total capital costs.  By contrast, Solar (PV) is subject to significantly lower transport costs and is predominantly supplied via FDI. There are four additional motives for FDI in wind manufacturing: satisfying local content requirements, seeking knowledge spillovers, acquiring intellectual property, and integrating wind turbine supply chains. Case: Suzlon   India‘s leading wind turbine manufacturer, Suzlon Energy Ltd, is an interesting example of a firm hoping to capitalize on knowledge spillovers. In 2004, Suzlon located its international headquarters in Denmark.   \"Denmark is global leader in know-how for wind-energy. That is why our global headquarters will be here,‖ announced Suzlon Chairman Tulsi Tanti, even though the Indian firm did not expect to sell turbines in the Danish market; domestic firms, including the world‘s leading turbine manufacturer, Vestas, supply 99% of Danish wind power equipment (Lewis and Wiser, 2007). Then in 2006 Suzlon moved to acquire Hansen, the German gearbox maker, thus bringing rotor blade, gearbox, controls, generator, and tower in-house (Agarwal and Bhatt, 2007). This acquisition made Suzlon a more integrated manufacturer than GE, Vestas or Gamesa.  Suzlon expects greater integration to reduce manufacturing costs and reduce delivery times (Lewis, 2007). In May of 2007 Suzlon acquired turbine manufacturer Repower of Germany for approximately USD 1.4 billion (Lewis, 2007). The deal delivers technology transfers for the manufacture of higher capacity turbines including large 5MW offshore models (Agarwal and Bhatt, 2007). Suzlon provides examples of FDI in the wind industry where market-seeking is not the direct object.  Locating its corporate headquarters in Denmark was a clear move to take advantage of knowledge spillovers. Acquiring Hansen, a firm that produced a key component for its turbines, was motivated by efficiencies of integration. Finally, the purchase of a competitor with advanced technologies was an outright transfer of technology through FDI. Case: Goldwind Until recently, Goldwind and other leading Chinese turbine manufacturers licensed turbine technology from Western firms.  Goldwind licensed turbine technology from Repower for a 750kW turbine; and from Vensys, Goldwind licensed a 1.2MW turbine. A 2007 study by Wiser highlighted the different ―technology development strategies‖ employed by Suzlon and Goldwind (Lewis, 2007): in 2007     Goldwind relied exclusively on licensed technology while Suzlon had used FDI to acquire technology and integrate its supply chain.   In 2008, Goldwind acquired a 70% stake in the German turbine manufacturer Vensys (Windpower Monthly Magazine, 2008). Goldwind has since begun to manufacture Vensys models in China (UNCTAD, 2010a) and  now has the capacity to produce one hundred 1.5MW and 2.5MW turbines annually in Germany for sale within Europe (Windpower Monthly Magazine, 2009b). FDI has become a crucial part of Goldwind‘s business, and the chairman of Goldwind‘s board, Wu Gang, advises Chinese firms to engage in joint ventures and practice Greenfield FDI to enter the world market (Windpower Monthly Magazine, 2009b). A.5. Environmental Services  Infrastructure Services: (OECD, 2005a) In 2003 the world‘s largest steel maker, Arcelor constructed a USD 420 million plant on the island of San Francisco in Brazil. The Vego du Sul plant was completed in 2005 and Arcelor decided to outsource water, energy and waste utilities to Veolia Environment in order to satisfy environmental regulations, reduce costs, and ―focus investments on its core business‖. Via a build-own-operate contract, which does not require Arcelor to invest any capital, Veolia Environment will provide services for 15 years including ―transformation and distribution of electrical power, the distribution of natural gas, and production and distribution of industrial gases (nitrogen and hydrogen) and of compressed air, solid-waste management, wastewater management, and the provision of water (process water, water for fire-fighting, demineralised water, hot water, cooling water and potable water)‖. The Korean semiconductor manufacturer Hynix requires a ―constant supply of high-quality, ultra-pure water‖. Like Arcelor, ―in order to focus on its core business‖, Hynix decided to sell its water treatment capacity to Veolia and create a long-term contract for service provision. Veolia Water and Korean financial organizations acquired all of Hynix‘s industrial water treatment and generating stations, and a fully-owned subsidiary of Veolia Water (VW) contracted to provide water to Hynix for 12 years. Veolia Water is required to treat wastewater far beyond Korea‘s environmental standards. The contract delivered technology benefits as well, since Veolia Water was required to re-engineer the water recycling process and improve the recycling rate compared to the original plant operators. FDI in the service sector has the potential to result in technology transfer from spillovers as well. Using firm-level data from a World Bank survey, Hale and Long (2006) find positive spillovers are captured by more technologically advanced domestic firms in the service market. Their empirical results suggest two channels for technology (soft technology) spillovers: movement of highly skilled workers from FDI firms to domestic firms and network externalities among highly-skilled workers (Galina Hale and Cheryl Long 2006).  Non-infrastructure Services: Environmental Resources Management (OECD, 2005a) Environmental Resource Management (ERM) was hired by a multinational to perform remediation and cleanup of soil, surface water and ground water at a production site which was being decommissioned in Indonesia. ERM has a commercial presence in Jakarta – nearly all of the 15 employees at their Jakarta office are native Indonesians. The contract required ERM to take over monitoring duties at a former production site. The client‘s concern was primarily reputational; Indonesian ―regulations are vague, subject to interpretation and not rigorously enforced‖.   44 REFERENCES ADB. 2009. Understanding Urban Water Tariff in the People’s Republic of China. Agarwal, Satyam, and Nalin Bhatt. 2007. Suzon Energy. Investment Report. Motilal Oswal. www.scribd.com/doc/6577492/Suzlon-Energy  Albornoz, Facundo, Matthew A. Cole, Robert J. R. Elliott, and Marco G. Ercolani. 2009. In Search of Environmental Spillovers. World Economy 32, no. 1.    Asia Water Project.  \"Players In the Water Sector\" The Asia Water Project: China. www.asiawaterproject.org/for-investors/china-water-sector/players-in-the-water-sector/. Anon. 2009. Water prices bubble in Lanzhou – People's Daily Online. Newspaper. People's Daily Online. http://english.peopledaily.com.cn/90001/90776/90882/6748116.html. Araya, Monica. 2003. WTO Negotiations on Environmental Goods and Services: Maximizing Opportunities? Global Environment & Trade Study. Yale Center for Environmental Law & Policy.. Bakker, Anuschka. 2009. Tax and the Environment: A World of Possibilities. Blaise, Séverine. 2005. On the link between Japanese ODA – and FDI – in China: a microeconomic evaluation using conditional logit analysis. Applied Economics 37, no. 1.  Blazejczak, Jürgen, Frauke G. Braun, and Dietmar Edler. 2009. Global Demand for Environmental Goods and Services on the Rise: Good Growth Opportunities for German Suppliers. Weekly Report, no. 20. Blomström, Magnus, Steven Globerman, and Ari Kokko. 1999. The Determinants of Host Country Spillovers from Foreign Direct Investment: Review and Synthesis of the Literature. Stockholm School of Economics. http://ideas.repec.org/p/hhs/hastef/0339.html. Borregaard, Nicola, Annie Dufey, and Lucy Winchester. 2008. Effects of Foreign Investment versus Domestic Investment on the Forestry Sector in Latin America (Chile and Brazil). Working Group on Development and Environment in the Americas. Tuft's Global Development and the Environment Institute. Buchner, Barbara, Jessica Brown, and Jan Corfee-Morlot. 2011. Monitoring and Tracking Long-Term Finance to Support Climate Action. Draft Charter, Martin, and Michael Jay Polonsky. 1999. Greener marketing. Greenleaf Publishing. China Law Update. 2009. Foreign Investment Catalogues and the Investment Environment in China. China Law Update. http://lawrwx.fyfz.cn  Corfee-Morlot, Jan, Bruno Guay and Kate M. Larsen. 2009. Financing Climate Change Mitigation: Towards a Framework for Measurement, Reporting, and Verification, OECD-IEA.  www.oecd.org/dataoecd/0/60/44019962.pdf.     Dardati, Evangelina, and Meryem Tekin. 2010. Multinationals and Environmental Regulation: Are foreign firms harmful or helpful? https://webspace.utexas.edu/ead397/www/index_files/trade_environment.pdf. Dasgupta, Susmita, Hemamala Hettige, and David Wheeler. 2000. What Improves Environmental Compliance? Evidence from Mexican Industry. Journal of Environmental Economics and Management 39, no. 1. Dauvergne, Jennifer Clapp and Peter. 2008. Paths to a Green World The Political Economy of the Global Environment. Academic Foundation. David Popp. 2009. Policies for the Development and Transfer of Eco-Innovations: Lessons from the Literature. OECD. http://ideas.repec.org/p/oec/envaaa/10-en.html. Dean, Judith M., Mary E. Lovely, and Hua Wang. 2004. Foreign Direct Investment and Pollution Havens: Evaluating the Evidence from China. United States International Trade Commission, Office of Economics. http://ideas.repec.org/p/ags/uitcoe/15854.html. Dean, Judith M., Mary E. Lovely, and Hua Wang. 2009. Are foreign investors attracted to weak environmental regulations? Evaluating the evidence from China. Journal of Development Economics 90, no. 1.   Ekaterini Iliadou. 2007. Electricity Sector Reform in Greece. www.uea.ac.uk/polopoly_fs/1.104662!ccp08-9.pdf  Engman, Michael, Osamu Onodera, and Enrico Pinali. 2007. Export Processing Zones: Past and Future Role in Trade and Development. OECD. http://ideas.repec.org/p/oec/traaab/53-en.html. Eskeland, Gunnar A., and Ann E. Harrison. 1997. Moving to Greener Pastures? Multinationals and the Pollution-Haven Hypothesis. Journal of Development Economics 70. http://papers.ssrn.com/sol3/papers.cfm?abstract_id=604985. Eurostat, 2009, The environmental goods and services sector, Eurostat Methodologies and Working papers, http://epp.eurostat.ec.europa.eu/cache/ITY_OFFPUB/KS-RA-09-012/EN/KS-RA-09-012-EN.PDF. Fu, Tao, Miao Chang, and Lijin Zhong. 2008. Reform of China's Urban Water Sector. IWA Publishing. Galina Hale, and Cheryl Long. 2006. What Determines Technological Spillovers of Foreign Direct Investment: Evidence from China. Economic Growth Center, Yale University. http://ideas.repec.org/p/egc/wpaper/934.html. Gallagher, Kevin. 2004. Free trade and the environment. Stanford University Press. ———. 2008. Foreign Investment and Sustainable Development: Lessons from the Americas. The Working Group on Development and Environment in the Americas. Gallagher, Kevin, Daniel Chudnovsky, and José Antonio Ocampo. 2009. Rethinking Foreign Investment for Sustainable Development. Anthem Press. Gallagher, Kevin, and Lyuba Zarksy. 2004. Sustainable Industrial Development?The Performance of Mexico’s FDI-led Integration Strategy. Tufts University: The Global Development And Environment Institute. http://ase.tufts.edu/gdae/pubs/rp/mexicofdireport11-03.pdf.   46 Gallagher, Kevin, and Lyuba Zarsky. 2007. The Enclave Economy. MIT Press. Garcia-Johnson, Ronie. 2000. Exporting Environmentalism: U.S. Multinational Chemical Corporations in Brazil and Mexico. 1st ed. The MIT Press. Gentry, Bradford S. 1999. Private Capital Flows and the Environment: Lessons from Latin America. Edward Elgar Publishing, January. George R.G. Clarke, Katrina Kosec, and Scott Wallsten. 2009. Has private participation in water and sewerage improved coverage? Empirical evidence from Latin America. Journal of International Development 21, no. 3.  Global Water Intelligence. 2006. Veolia's Shanghai Ambitions. www.globalwaterintel.com/archive/7/10/general/veolias-shanghai-ambitions.html    Gosman, Taylor. 2010. Cutting transport costs down to size. Windpower Monthly. Golub, Stephen S. 2009. Openness to Foreign Direct Investment in Services: An International Comparative Analysis. The World Economy 32. Haider Khan, Yibei Liu, and Haider Khan and Yibei Liu. 2008. Ecological Economics of Water in China: Towards A Strategy for Sustainable Development. http://econpapers.repec.org/paper/pramprapa/7705.htm. Hansen, Michael. 1999. Cross border environmental management in transnational corporations. https://openarchive.cbs.dk/bitstream/handle/10398/7010/occasional%20paper%205.pdf?sequence=1. Henna, Rema. 2010. US Environmental Regulation and FDI: Evidence from a Panel of US-Based Multinational Firms. American Economic Journal 2.  Hübler, Michael and Andreas Keller. 2008. Energy Savings via FDI? Empirical Evidence from Developing Countries. Kiel Institute for the World Economy. http://ideas.repec.org/p/kie/kieliw/1393.html.  James, James &, and E. L. Petersen. 1999. 1999 European Wind Energy Conference: wind energy for the next millennium: proceedings of the European Wind Energy Conference, Nice, France, 1-5 March 1999. Earthscan. Jha, Veena. 2009. Trade Flows, Barriers and Market Drivers in Renewable Energy Supply Goods. Issue Paper. ICTSD Programme on Trade and Environment. Johnstone, Nick. 2007. Environmental Policy And Corporate Behaviour. Edward Elgar Publishing. Kerr, Tom. 2010. Wind Energy: leading the clean technology revolution. Manila, the Philippines.  Kikeri, Sunita, and Aishetu Kolo. 2006. Privatization Trends. Note of Public Policy for the Private Sector by the World Bank Group. Kim, Joy. 2007. Issues of Dual Use and Reviewing Product Coverage of Environmental Goods. OECD. www.olis.oecd.org/olis/2006doc.nsf/FREDATCORPLOOK /NT000090EE/USD FILE/JT03224683.PDF      Kirkegaard, Jacob Funk, Thilo Hanemann, and Lutz Weischer. 2009. It Should Be a Breeze: Harnessing the Potential of Open Trade and Investment Flows in the Wind Energy Industry. Peterson Institute Working Paper Series. Peterson Institute for International Economics. http://ideas.repec.org/p/iie/wpaper/wp09-14.html. Klein, A, A Held, and M Ragwitz. 2008. Evaluation of different feed-in tariff design options. Best practice paper for the International Feed-In Cooperation.  Koop, Gary, and Lise Tole. 2008. What is the environmental performance of firms overseas? An empirical investigation of the global gold mining industry. Journal of Productivity Analysis 30, no. 2. KPMG Property and Infrastructure. 2008. The Water Business in China: Looking below the surface. Krugman, Paul R., and Maurice Obstfeld. 2009. International Economics: Theory and Policy. 6th ed. Addison Wesley. Lendo, Enrique. 2005. Defining Environmental Goods and Services: A Case Study of Mexico. Issue Paper. ICTSD. Levinson, Arik. 2008. Pollution and International Trade in Services. SSRN eLibrary. http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1143468. Levinson, Arik. 2009. Technology, International Trade, and Pollution from U.S. Manufacturing. American Economic Review 99(5).   Levinson, Arik. 2010. Offshoring pollution: Is the U.S. increasingly importing polluting goods? Review of Environmental Economics and Policy 4(1).  Levinson, Arik and Scott Taylor. 2008. Unmasking the Pollution Haven Effect. International Economic Review 49(1). Lewis, Joanna. 2007. Technology Acquisition and Innovation in the Developing World: Wind Turbine Development in China and India. Studies in Comparative International Development (SCID) 42, no. 3. Lewis, Joanna I., and Ryan H. Wiser. 2007. Fostering a renewable energy technology industry: An international comparison of wind industry policy support mechanisms. Energy Policy 35, no. 3.  Marin, Philippe. 2009. Public-Private Partnerships for Urban Water Utilities: A Review of Experiences in Developing Countries. World Bank Publications. Maskus, Keith. 2010. Differentiated Intellectual Property Regimes for Environmental and Climate Technologies. OECD Environment Working Papers, No. 17, OECD. McKee, Colin. 2007. Investing in Asia’s Water Sector. Association for Sustainable & Responsible Investment in Asia. Ministry of Commerce. 2007. Catalogue for the Guidance of Foreign Investment Industries. Invest in China. www.fdi.gov.cn/pub/FDI_EN/Laws/law_en_info.jsp?docid=87372  Neumayer, Eric. 2001. Pollution Havens: An Analysis of Policy Options for Dealing With an Elusive Phenomenon. The Journal of Environment Development 10, no. 2. OECD. 1999a. Foreign Direct Investment and the Environment. OECD PROCEEDINGS.    48 ———. 1999b. Foreign Direct Investment and the Environment. Centre for Co-operation with Non-members. Paris: OECD Publishing. ———. 2000. Guidelines for Multinational Enterprises.  ———. 2001. Environmental Goods and Services. OECD Publishing, July 24. ———. 2002. Foreign Direct Investment and the Environment: Lessons from the Mining Sector. OECD Global Forum on International Investment. Paris: OECD Publishing. ———. 2005a. Trade that benefits the environment and development. OECD Publishing. ———. 2005b. Environment and the OECD Guidelines for Multinational Enterprises. OECD Publishing. ———. 2005c. Achieving the Successful Transfer of Environmentally Sound Technologies: Trade-related Aspects. http://ideas.repec.org/p/oec/traaaa/2005-2-en.html. ———. 2008a. OECD Investment Policy Review of the Russian Federation: Russia's Energy Investment Policy. www.oecd.org/dataoecd/45/52/40311537.pdf. ———. 2008b. OECD Benchmark Definition of Foreign Direct Investment FOURTH EDITION. ———. 2009a. OECD Development Assistance Committee Tracks Aid in Support of Climate Change.  ———. 2009b. Private Sector Participation in Water Infrastructure: OECD Checklist for Public Action. www.oecd.org/daf/investment/ppp. ———. 2010a. OECD FDI Restrictiveness Index: 2010 Update. ———. 2010b. Draft Report on Environmental Goods and Services Industry.  ———. 2010c. Climate policy and technological innovation and transfer: an overview of trends and recent empirical results. www.oecd.org/dataoecd/54/52/45648463.pdf  ______. 2010d. Interim Report of the Green Growth Strategy: Implementing our Commitment to a Sustainable Future. Meeting of the OECD Council at Ministerial Level.  ———. 2010e. Transition to a low-carbon economy: public goals and corporate practices. www.oecd.org/daf/investment/cc  ———. 2010f. Perspectives on Global Development 2010. Shifting Wealth. OECD Development Centre. www.oecd-ilibrary.org/development/perspectives-on-global-development-2010_9789264084728-en  OECD (2011a). Framework conditions for private sector participation in water infrastructure in Russia, in Proceedings from the Regional Meeting held in Moscow in January 2010, OECD, VEB, World Bank and EU water Initiative, forthcoming 2011 OECD (2011b). ENV/EPOC/WPIEEP(2011)13. Environmental Policy Stringency and Foreign Direct Investment. OECD, forthcoming. OECD, and Eurostat. 1999. The Environmental goods and services industry. OECD Publishing.     Prakash, Aseem, and Matthew Potoski. 2006. New Dependencies: FDI and the Cross-Country Diffusion of ISO 14001 Management Systems. In Tuck School of Business, Dartmouth College. http://mba.tuck.dartmouth.edu/mechanisms/pages/Papers/prakash-potoski%20paper.pdf. Qi, Wu. 2010. China ramps up wind turbine capacity. Windpower Monthly Magazine, May. www.windpowermonthly.com/news/1000539/China-ramps-wind-turbine-capacity/?DCMP=ILC-SEARCH. Randy A. Becker, and Ronald J. Shadbegian. 2009. Environmental Products Manufacturing: A Look inside the Green Industry. The B.E. Journal of Economic Analysis & Policy 9, no. 1. The B.E. Journal of Economic Analysis & Policy. http://ideas.repec.org/a/bpj/bejeap/v9y2009i1n7.html. Ruud, Audun. 2002. Environmental management of transnational corporations in India - are TNCs creating islands of environmental excellence in a sea of dirt? Business Strategy and the Environment 11, no. 2: 103-118. doi:10.1002/bse.321. S&P, and TSX. 2010. S&P/TSX Clean Technology Index. Methodology. March. Sawhney, Aparna. 2003. Liberalization of Environmental Services. Expert Meeting on Definitions and Dimensions of Environmental Goods and Services in Trade and Development: India. UNCTAD. Shah, Kalim, and Jorge Rivera. 2007. Export processing zones and corporate environmental performance in emerging economies: The case of the oil, gas, and chemical sectors of Trinidad and Tobago. Policy Sciences 40, no. 4. The Economic Times. 2010. China Revamps FDI Rules, Curbs Con-eco-friendly Projects. The Economic Times, April 15. http://economictimes.indiatimes.com/news/international-business/China-revamps-FDI-rules-curbs-non-eco-friendly-projects/articleshow/5804474.cms. UNCTAD. 2006. Measuring restrictions on FDI in Services in Developing Countries and Transition Economies. UNCTAD Current Studies on FDI and Development no. 2. UNCTAD. 2008. Creating an institutional environment conducive to increased foreign investment and sustainable development. Accra, Ghana, April 20. www.unctad.org/en/docs/td426_en.pdf UNCTAD. 2009. World Investment Report. UNCTAD. 2010. World Investment Report.  Veolia Environment. 2006. Shanghai contract, China: Management of Shanghai Pudong water services. www.sustainable-development.veolia.com/en/Articles/Shanghai-water-services/. Wang, Junying, Liangjun Da, Kun Song, and Bai-Lian Li. 2008. Temporal variations of surface water quality in urban, suburban and rural areas during rapid urbanization in Shanghai, China. Environmental Pollution 152, no. 2. Windpower Monthly Magazine. 2008. Chinese suitor for German supplier -- Goldwind plans move into Europe. Windpower Monthly Magazine. www.windpowermonthly.com/news/963136/Chinese-suitor-German-supplier---Goldwind-plans-move-Europe/?DCMP=ILC-SEARCH. ———. 2009a. China Special – Infrastructure: Introducing fixed prices. Windpower Monthly Magazine. http://windpowermonthly.com/go/chinaspecial/965670/China-Special – Infrastructure-Introducing-fixed-prices/.   50 ———. 2009b. China Special - Going Global: Manufacturers look overseas for trade. Windpower Monthly Magazine. http://windpowermonthly.com/go/chinaspecial/965672/China-Special---Going-Global-Manufacturers-look-overseas-trade/. Wiser, Ryan, and Mark Bolinger. 2008. Annual Report on U.S. Wind Power Installation, Cost, and Performance Trends: 2007. Summary Report. US Department of Energy. World Bank. 2010. Investing Across Sectors. Investing Across Borders. http://iab.worldbank.org/Data/Explore%20Topics/Investing-across-sectors. Wu, Fulong. 2007. China's emerging cities: the making of new urbanism. Routledge. WWEA. 2010. World Wind Energy Report 2009. Bonn, Germany: World Wind Energy Association. Zarksy, Lyuba, and Kevin Gallagher. 2003. Searching for the Holy Grail? Making FDI work for Sustainable Development. Analytical Paper. World Wide Fund for Nature. http://ase.tufts.edu/gdae/publications/articles_reports/KG-LZ_FDI_report.pdf. Zarsky, Lyuba, and Kevin Gallagher. 2008. FDI Spillovers and Sustainable Industrial Development: Evidence from U.S. Firms in Mexico’s Silicon Valley. Discussion Paper. Working Group on Development and Environment in the Americas. http://ase.tufts.edu/gdae/Pubs/rp/DP18Zarsky_GallagherApr08.pdf. Zhang, Hui. 2007. The orientation of water quality variation from the metropolis river–Huangpu River, Shanghai. Environmental Monitoring and Assessment 127, no. 1. Zhong, Lijin, Arthur Mol, and Tao Fu. 2008. Public-Private Partnerships in China‘s Urban Water Sector. Environmental Management 41, no. 6.            www.oecd.org/daf/investment/green ",
    "Link": "https://core.ac.uk/download/153166344.pdf"
}