{
    "Title": "A comprehensive overview on nanofiber technology and their advancements in the field of pharmaceuticals",
    "Authors": "N. Yamini, SK. Arifa Begum",
    "Year": "No year available",
    "Abstract": "Nanotechnology is a growing technology that has been marked as the most vital scientific and commercial venture across the world with great benefits. Globally many researchers are involved in the development of newer types of nanomaterials through modifications of various fabrication techniques. Nanofibers have been an emerging trend in the field of nanomaterials due to its unique physicochemical characteristics. Properties such as high surface area and high porosity absorbance ratio with the interconnected fibrous networks makes nanofibers unique. The current review explores the present status and upcoming advancements in the field of nanofiber technology. The article is focused on the various preparation techniques and applications in medicine, tissue engineering and regenerative medicine and pharmaceuticals. Despite the advancements, the limitations and future prospects in the area of nanofiber technology have been highlighted",
    "Keywords": "No keywords available",
    "Publisher": "'Rubatosis Publication'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \nRubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology 51  \n \nInternational Journal of Research in  \nPharmaceutical sciences and Technology \n \nA comprehensive overview on nanofiber technology and their advancements in the field of \npharmaceuticals \nN. Yamini* and SK. Arifa Begum \nABSTRACT \n \nNanotechnology is a growing technology that has been marked as the most vital scientific and commercial \nventure across the world with great benefits. Globally many researchers are involved in the development of \nnewer types of nanomaterials through modifications of various fabrication techniques. Nanofibers have \nbeen an emerging trend in the field of nanomaterials due to its unique physicochemical characteristics. \nProperties such as high surface area and high porosity absorbance ratio with the interconnected fibrous \nnetworks makes nanofibers unique. The current review explores the present status and upcoming \nadvancements in the field of nanofiber technology. The article is focused on the various preparation \ntechniques and applications in medicine, tissue engineering and regenerative medicine and \npharmaceuticals. Despite the advancements, the limitations and future prospects in the area of nanofiber \ntechnology have been highlighted. \nKeywords: Nanofibers, electrospinning process, phase separation technique, pharmaceuticals, \nbioengineering. \n \nISSN: 2581-9143 \nResearch Article \nCorresponding Author \nName: N. Yamini \nEmail: yaminineppala55@gmail.com   \nArticle Info \nReceived on: 16-10-2020 \nRevised on: 25-10-2020 \nAccepted on: 30-10-2020 \nDOI: https://doi.org/10.33974/ijrpst.v2i3.247  \n \nCopyright© 2020, N. Yamini, A comprehensive \noverview on nanofiber technology and their ad-\nvancements in the field of pharmaceuticals, Pro-\nduction and hosting by Rubatosis Publications. \nINTRODUCTION \nThe advancements in the field of drug discovery \naugmented from the middle of 19th century. The \nworld of nanomaterials embraces for their \noutstanding physicochemical characteristics. \nNanomaterials include quantum dots, nanorods, \nnano tubes, nano wires, nano fibers and one-\ndimensional nanosheets. Amongst all, nanofibers \nstand apart due to their impending applications. \nNanofibers have been fabricated from various \nmaterials such as natural and synthetic polymers; \ncarbon based, semi-conducting and composite \nnanomaterials1. Nanofibers are defined as fibers with \ndiameters less than 50-500 nm. National Science \nFoundation (NSF) defines nanofibers as having at \nleast one dimension of 100 nm or less. The objective \nof nanofiber drug delivery system is to deliver a \ndefined amount of drug proficiently, specifically for a \ndefined period of time. Many techniques have been \nreported till date for the fabrication of nanofibrous \nscaffolds including electrospinning, self-assembly \nand phase separation techniques. Out of all, \nelectrospinning is a relatively simple and robust \nproduction method. Electrospinning has become a \nwidely used and reliable method since it allows the \nproduction of different alignment scaffolds of ultra-\nfine fibers, in the range of nano to microscale in \ndiameter, from a variety of natural and synthetic \npolymers. \n \nFigure 1: Structure of Nanofibers \nElectron microscopic view of a nanofiber \nAdvantages \nNow-a-days, nanofibers are emerging as a means for \nvarious drug delivery systems for the treatment of \ndiseases in the healthcare systems. The nanofibers \ndemonstrate the significance and suitability of them \nas drug carriers. The smaller size and surface area to \nvolume ratio of nanofibers is the winsome property \n N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \n52  Rubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology \n \nin the delivery of drug to the specific-site in the body2. \nSeveral biodegradable and/or biocompatible \npolymers are used as fiber matrices in drug delivery, \nbiosensors, tissue engineering, wound healing and \nnumerous other applications. Advances in \nelectrospinning technology have led to foster tubular \nnanofibrous structures and 3D nanofiber blocks. \nElectrospinning technique is the most expedient and \ncost-effective method for the commercial scale \nfabrication of nanofibers. \nProperties  \nThe distinctive feature of nanofibers that highlights \nthem among other conventional fiber preparations is \ntheir high surface area to volume ratio. Alignment of \nchannels within nanofibers is mainly differentiated \nby their mechanical and thermal properties in \ncomparison to bulk polymers and conventional \nfibers. \nThermal properties \nThermal analysis has been carried out on a number of \nelectrospun polymeric materials to understand the \nrelationship between nanostructure and thermal \nproperties. DSC studies have showed that \nelectrospun PLLA fibers have lower crystallinity, \nglass transition temperature (Tg), and melting \ntemperature (Tm) than semi crystalline PLLA resins. \nLower crystallinity is an unique feature for the \nnanofibers. The high evaporation rate followed by a \nrapid solidification is the reason behind that \ncharacter. The Tg and the peak crystallization \ntemperature (Tc) of the electrospun polyethylene \nterephthalate (PET) and poly- ethylene naphthalate \n(PEN) decreased significantly, while the heat of \ncrystalline melting increased. Whereas the melting \ntemperature of the PET and PEN electrospun fibers \nremained almost constant, without any significant \nvariations compared to that of regular fiber forms. \nPEO Nanofibers have a lower melting temperature \nand heat of fusion than the PEO powder, which is \nattributed to the poor crystallinity of the electrospun \nfibers. \nMechanical properties \nElectrospun fibers have nano structured surface \nmorphologies with tiny pores that influence \nmechanical properties like tensile strength, Young’s \nmodulus, etc. When these are compared with cast \nfilms, electrospun elastomers have shown almost a \n40% reduction in the peak tensile strength and 60% \nreduction in elongation at maximum applied stress. \nThe decrease in the tensile strength has also been \nreported with SLPF fibers. Nanofiber reinforced \npolymer composites have shown more highly \nenhanced mechanical properties than the unfilled or \ncarbon/glass fiber filled composites. Young’s \nmodulus of a nanofiber composite has been found to \nbe 10 times greater than the pure Styrene-Butadiene \nrubber. As it is evident, that there is less information \navailable on the mechanical properties of nanofibers \nand nanofiber composites. Research on the \nmechanical properties of nanofibers and their \ncomposites from a variety of polymers is important \nfor a greater understanding on the contributions of \nnanofibers to the mechanical and performance \nrelated characteristics of nanofiber composites.  \nFiltration properties \nAs the fibers themselves have a small diameter, the \nthickness of the nanofiber web can likewise be quite \nsmall, with a thickness of four diameters approaching \nonly one micron. The thin web has limited mechanical \nproperties that preclude the use of conventional web \nhandling. As a result, nanofiber web has been applied \non to various substrates. Substrates are selected to \nprovide complementary functionality to the \nnanofiber web. In the case of nanofiber filter media, \nsubstrates have been selected for pleating, filter \nfabrication, durability in use, and filter cleaning. is a \nphotomicrograph showing a cross-section of \nNanofibers electronspun onto a polyester spun bond \nsubstrate. The substrate is chosen to provide \nmechanical properties, while the nanofiber web \ndominates filtration performance. Controlling \nparameters of electrospinning allows the generation \nof Nanofibers webs with different filtration \ncharacteristics. Different fiber sizes can be made, \nsome as small as 40 nm. Fibers can be put on one side \nor on both sides of a substrate. Nanofibers have been \nelectrospun on to a variety of substrates, including \nglass polyester, nylon, and cellulose filter media \nsubstrates3-4. \nMethods for fabrication of nanofibers \nThere are many ways to fabricate nanofibers, such as \ntemplate synthesis, drawing, self-assembly, \nelectrospinning, random, aligned, and core-shell \nnanofibers, and phase separation. Out of all these \ntechniques template synthesis does not able to \nproduce continuous nanofibers and in the drawing \nprocess only the viscoelastic materials to be used \nwhich in turn creates a high tensions. That is the \nreason only three techniques such as phase \nseparation, self assembly and electrospinning are \nconsidered as the best methods in the preparation of \nnanofibers.  \nTemplate synthesis \n Template synthesis involves the use of membranes \nor templates to obtain a desired structure. \nNanoporous metal oxide membranes (e.g., aluminum \noxide membrane) are commonly used, where a \npolymer solution is allowed to pass with a certain \nforce through to a non solvent bath to produce \nnanofibers depending on the pore diameter. \nPhase separation \nOne of best method for production of nanofibers \nwhich preferentially can be used in many areas is \nPhase separation, but due to its heavy time \nconsumption during the preparation of the \n N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \nRubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology 53  \nnanofibers this method found to be not an ideal one. \nIn the process of the preparation of nanofibers the \nselected polymer solution to be gone through its \nbelow freezing point and then freeze to produce a set \nof nanofibers. Various nanofibers can be produced by \naltering their thermodynamic and kinetic factors. \nUsing phase separation process, preparation of \nscaffolds occur in five basic steps 1. Suspension of \npolymer, 2. phase separation and gelation, 3. \nExtraction of solvent from the gel by means of water, \n4. Freezing, and then 5. Freeze-drying under vacuum. \nThe creation of nanoscale fiber complex is caused by \nlow gelation temperature, while as a consequence of \ncrystals nucleation and their development, high \ngelation temperature produces the creation of \nplatelet like construction and is managed by \nincreasing of cooling rate, which can produce uniform \nnanofibers4. \nSelf assembly \nIn this method the atoms and molecules make \nthemselves to be attached with each other. Self-\nassembly method can be used to make different \nstructures, for example unilamellar and \nmultilamellar vesicles, bilayer, nanoparticles, \nmembranes, fibers, films, micelles, tubes and \ncapsules. Based on the self-assembly system, an \nampiphilic peptide that allows creation of thermally \nstable protein was designed.  The obtained \nnanofibers through the self assembly process is \nmorphologically thinner from the fibers produced by \nthe electrospinning process. Complication in the \nrange of productivity of nanofibers is the major \nproblem associated with the self assembly process4. \nElectrospinning \nAs nanofibers are becoming increasingly important, \nthe high through put preparation of high quality \nnanofibers has drawn remarkable attentions. \nCurrently, electrospinning is the most widely used \nmethod for the preparation of nanofibers. Other \nmethods including Bubbfil spinning, centrifugal \nspinning have also been reported for their potential \napplications in the biological field. Many theoretical \nresearches on electrospinning process have been \ndone by many teams and groups. Sir William Gilbert \nexplained the behavior of electrostatic and magnetic \nemanation. He found that by affecting the water \ndroplet by electrostatic field, the water gets cone and \nhopper shape, and a droplet extrudes from the head \nof the hopper. Electrospinning can be viewed as a \nkind of electro-spraying. As with electro-spraying, \nthe raw material of electrospinning is linked to a \nhigh-voltage power supply to enhance the liquid \nelectrostatic potential. High molecular degree of \npolymers is always used as raw materials based on \ntheir inter-molecular interaction.  \nThe surface charge of liquid and electrostatic \npotential have direct relationship so by increasing or \ndecreasing one of them, the identical action will \nhappen for another one. Usually by surface tension, \nthe volume shape of fluid is deducted. By charging the \nfluid, the surface charge acts in the reverse manner to \nsurface tension, resulting in the fluid changing shape, \nforming the structure known as the Taylor cone5-\n10.The size of the nanofibers produced through the \nelectrospinning process is in the range of 3nm \nwhereas the nanofibers produced through the other \nprocesses is in the range about 300nm this states the \nfame for the electrospinning process and keeps on \nthe top in the preparation of the nanofibers. Because \nof these extremely appreciable properties \nelectrospinning is the most popular technique for the \npreparation of nanofibers.   \n \nFigure 2: Electrospinning technique \nSynthesis of Nanofibers using Electrospinning \nprocess \nThe elctrospun nanofibers are synthesized by making \nthe polymer solution(melt) to pass through high \nelectrostatic potential. Fig. 1 shows the typical \nschematic preparation procedure of electrospinning. \nThis setup contains a spinneret (needle), high-voltage \npower supply with the good range of voltage, a glass \nsyringe with a small needle and a metal collector at \nthe base. The spinneret is filled with the melted \npolymer solution a needle is attached and driven by a \nsyringe pump in order to regulate the flow rate \nthrough the spinneret. A strong electrostatic force is \napplied in between the spinneret and the collector. \nAfter the loading of polymer solution, the solution \ngets charged through the electrostatic force and \nforms a charged droplet at the tip of the spinneret. \nDue to the repulsive forces between the electrically \nconductive liquid and electric field, the polymer \nsolution changes its form and deforms the droplet \ninto a conical-shaped structure known as Taylor \ncone, [Taylor-who has already made some studies on \nthe jet formation-1969]11-14. The jet is accelerated \nand stretched through the atmosphere with the \nevaporation of the solvent, and is used for preparing \ninterconnected mats of nanofibers on the oppositely \ncharged grounded collector. The collector or \nelectrode plate is coated with acrylic acid. The \nelectrode is usually flatted and is used for the \ncollection of both random and uniformly aligned \nnanofibers. Many nanofibers with special properties \ncan be obtained by modifying the design of the \n N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \n54  Rubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology \n \nspinneret and collector, such as the coaxial spinneret, \ngas jet spinneret, the bi component spinneret, ring \nelectrodes, and the rotating disc collector. \nIn the preparation of nanofibers through the \nelectrospinning process there are two main key \npoints that play a vital role in the alignment of fibers \nsuch as the choosing of the polymer and the collector. \nThe alignment of the fibers can be affected by the \narrangement of collector that sets the morphology of \nand the properties of synthesized nanofibers. There \nare different types of collectors such as the plate \ncollector, rotatory collector, grid-type collector, edge-\ntype collector, the collector with blade auxillary ,the \nwater bath collector, and the continuous collector. \nThere are many biodegradable polymers can be used \nto produce nanofibers such as natural, synthetic, and \nthe combination of both. Bio degradable polymers are \nalso used in the preparation of nanofibers mainly for \nthe surgical purposes and also for the cell carriers, \nand short-time scaffolds15-17. The reason behind \nusing the bio degradable is that they will be degraded \nin the body upon the time extent, thus they are acting \nas a replacement for the traditional sutures during \nthe surgeries. \nCoaxial electrospinning \nFabrication of the shell nanofibers can be made \nthrough the coaxial electrospinning process. This is \nlike an extension to the traditional method of \nelectrospinning technique. Comparing the both the \nnormal electrospinning and the coaxial \nelectrospinning, the coaxial consists of usual complex \nspinneret(needle) with a multiple polymer solution \nfeed system with a couple of interconnected \nchannels. These interconnected channels shelled by \nan outer tube required for the injection of one \nmaterial into the other. Thus nanofibers are collected \non a core-sheath structured composite fiber in \ngenerating a nanofiber with core-shell structures. \nIn the recent times the coaxial electrospinning has \nachieved greater popularity than before in the \npreparation of protein delivery field. Because the \nfabricated core-shell fibers have the greatest ability \nto keep the proteins in the same location for a longer \nperiod and providing a uniform distribution \nthroughout the fibers, therefore the proteins have the \npotential to be delivered in an organized manner \nbecause of the shell barricade18-20. \nTypes of polymers used \nDifferent types of polymers are used in the \npreparation of nanofibers such as the natural, \nsynthetic and the combination of the both. The list of \nthe polymers along with their respective solvents \nwere given as a summary in the Table No.1  \nApplications of Nanofibers \nNanofibers have a very wide range of applications in \nthe textile, biomedical and protective clothing fields. \nThese are also useful in the energy generation and \nstorage in batteries and fuel cells, super capacitors \nand also in the water treatment and ultrafiltration, \nphotocatalysis, tissue engineering and regenerative \nmedicine, biological sensing and finally in the drug \nand therapeutic agent delivery21-23. The fruits of the \nnanofibers in the field of biomedical has been known \nin the recent times. It’s an established fact that the \nnanofibers can deliver enormous changes in the \nmedical practice and also in the wound healing. For \nexample, in treating any wound the nanoparticles \nenter the wound very easily because of their design \nand size and start the drug release very effectively \ntherefore treating the wound and also create a \nbarrier in not entering the contaminants into the \nbody without causing pain to the patient.  \nWound dressing \nNanofibers produced through electrospinning \ntechnique could generate a simple platform to protect \nwounds. The different studies show that using \nelectric field the ultra fine nanofibers can be directly \nspun on to the injured place of skin to form a fibrous \nmat dressing. These nanofibers having the pore size \nbetween 500 and 100 µm are suitable for protecting \nthe wounds from bacteria. Most of the synthetic kind \nof polymers such as carboxyethyl chitosan/PVA, \ncollagen/chitosan, Silk fibroin, and ABA type \npoly(dioxanone-co-L-lactide)-block-poly ethylene \nglycol) (PPDO/PLLA-b-PEG) block copolymer have \nbeen electrospun and have been suggested for wound \ndressing usages24-27. For example, the multi \ncomponent chitosan/PVA/AgNPS nanofibers had \nshown a good effect against the E.Coli and also a \nnanofiber consisting of a  continuous uniform \npolyurethane dextran nanofibrous mats loaded with \nciprofloxacin HCl drug have been electrospum and \nare used as a wound dressing material against both \nGram positive and Gram negative bacteria. These are \nthe best examples for the synthetic polymers. Apart \nfrom the synthetic polymer usage some naturally \nbiodegradable polymers such as the chitosan/sericin \nand the silk fibers also showed a good anti microbial \neffect28-31. These are prepared as a non-woven \ncomposite nanofibers as they were biocompatible \nand non-toxic. This outcome clearly explains us that \nthe electrospun nanofibers have a great deal of \npotency of having anti-microbial properties.  \nTissue engineering and regenerative medicine \nTissue engineering and the regenerative medicine \nare the advancements in the field of medicine. Several \ntissues in the body are replaced by an identical \nstructure which is made by different particles and \nthey are made exactly like the same as the simple \ntissue in both the functions and the metabolism. \nNanofibers are the best alternatives in this arena \nbecause of their high surface to volume ratio and \ntheir versatility in function. Here, nanofibers are just \nused in the preparation of those new structures \nwhich are exactly like the original and to mimic the \n N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \nRubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology 55  \nfunction. Several biomaterials, entities of cells, \nbiomolecules are used in this preparation. \nDuring this preparation scaffolds have been \ndeveloped and are used in the replacement of the \ndamaged blood vessels and tissues. These are also \nhaving a greater impact when they are \ntopographically compared to the in vivo test. \nNanofiber scaffolds have a greater attention and the \nsimilarity with the cell normal activities such as the \ncellular growth, proliferation and differentiation. The \nselection of polymer for the preparation of these \nnanofibers and the scaffolds have been selected \ndepending on their usage and the site of application. \nThe usage of scaffolds in the field of tissue \nregeneration have been reported very lately, some \ntheir examples are discussed as follows: \nIn the initial preparations natural polymers such as \nchitin is used in the fabrication of nanofibers micro \npatterned through replica molding for engineering \ncell sheets as they are biodegradable and non-toxic \nthese structures are very much smooth and can be \naligned along the primary axis of the micro patterned \nfeatures leading to the formation of ultrathin and \nfree- standing ordered cell sheets which are very \nflexible and can be used as for the preparation of the \ncomplex tissue characters. Secondly, the electrospum \nPLGA nanofibers were functionalized with the \nadhesive peptides for cardiac tissue engineering \napplications, specifically for improving the adhesion \nand the contraction of the cardiomyocytes. In the \nthird, Biodegradable PCL nanofibers are made to \nenhance the proliferation and the adhesion of the \nmesenchymal stem cells (MSCs). In the fourth, \nmultifunctional osteo inductive nanofibers are made \nby using the natural polymer chitosan basing on the \nprocess self-assembly by using three bio active \npeptide molecules and then used as an implant \ncoating to promote bone-like mineralization on \nmedical grade titanium surface.  \nDrug and therapeutic agent delivery \nIndividual nanofibers and the scaffolds serves as best \nvehicles for the localized and therapeutic agents. The \nlarger surface area and the microporous structures of \nnanofibers helps for an efficient drug delivery along \nTable 1: List of the polymers used in Nanofibers \nName of the polymer Category Solvent \nPolycaprolactone Synthetic Acetone, Chloroform \nPolyurethane Synthetic DMF \nPET Synthetic Trifluoroacetic acid/Dimethyl chloride \nNylon-6-co-polyamide Synthetic Formic Acid \nPolyamide Synthetic Dimethylacetamide \nPVA Synthetic Water \nPolystyrene Synthetic DMF/Toluene \nCollagen Synthetic Hexafluoro-2-propanol \nNylon 6 and nylon 66 Synthetic Formic Acid \nPolyvinyl phenol (PVP) Synthetic THF \nPolyvinylcarbazole Synthetic Dichloromethane \nPLDLA Synthetic Chloroform \nPolyramide Synthetic Sulfuric acid \nPolyvinyl chloride Synthetic THF, DMF \nPoly-L-Lactide Synthetic Dichloromethane \nPolyurethane Synthetic THF, DMF \nPolycarbonate Synthetic DMF, THF \nPolyethylene oxide Synthetic Isopropyl alcohol \nCellulose acetate Synthetic Acetone \nPolybenzimidazole Synthetic Dimethyl acetamide \nPolyimides Synthetic Phenol \nPolyacrylonitrile Synthetic Dimethyl formaldehyde \nPCL Synthetic Chloroform, Dichloromethane, Toluene, Carbon tetrachloride \nPLLA Synthetic Water \nPLGA Synthetic Acetone \nPCL-PEG, PCL-PLLA Synthetic (copolymer) Chloroform, Dichloromethane, Toluene, Carbon tetrachloride \nPLGA-PEG, PLLA-PEG Synthetic (copolymer) Water, Acetone \nChitosan (CS) Natural (copolymer) Trifluoroacetic acid (TFA) \nCellulose Natural Organic solvents \nAlginate Natural (copolymer) Water \nGelatin Natural (renewable) Acetic  acid, Hot water \nHyaluronic acid Natural Water \nCollagen Natural Soluble in amino acid constituents \nSilk fibroin Natural Both aqueous and organic solvents \n \n N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \n56  Rubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology \n \nwith the encapsulation and direct incorporation of \nthe active molecules including drugs and the other \nsubstances. \nThe latest groundbreaking example is the \ndevelopment of Blood brain barrier (BBB) drug \ndelivery by the nanofiber based platform for the \ndelivery of therapeutic peptides across the BBB for a \nbiological response. These were synthesized by the \nself assembly process in which the active amphiphilic \npeptide moiety completely surrounds the nanofiber \ncore part. Surprisingly the nanofibrous configuration \npart helps in the controlled the degradation of the \npeptide release across the membrane whereas the \namphiphilic part helps in the transport of peptide \nmolecules between the blood and the brain. \nThe localized delivery of antibiotic ciprofloxacin can \nalso be achieved by the hydrophilic and \nbiodegradable PVA- sodium alginate composite \nnanofiber-based transdermal patch by the \nfunctionalization of the antibiotic. \nIn another work, it showed that the anticancer drug \nDoxorubicin can also be incorporated into the \npolymeric core shell nanofibers for an emerging \napplication in the tumor therapy against the ovary \ncancer. These fibers can be prepared by the co-axial \nelectrospinning process using two water soluble \npolymers PVA and chitosan. Doxorubicin (DOX) was \nincorporated into the nanofiber core for targeting \nSKOV3 human ovary cancer cells. The in vitro release \nstudies of these preparations showed that the DOX \nloaded fibers can be delivered into the nucleus of the \ncell and the drug release ratio can be controlled by \naltering the PVA and chitosan ratio. The DOX loaded \nPVA chitosan core shell nanofibers therefore \ninhibited the proliferation of the cancer cells, \nunderlining the potential application of the core shell \nnanofibers for ovarian cancer therapy32-35.  \nChallenges for nanofibers: \nDuring the past decade, there has been a notable \nexpansion in the number of cost-effective natural \nmaterials in the field of nanotechnology, owing to the \nadvent of electrospinning, and developments in the \nprocessing of natural polymers. Interest has \ncontinuously been paid to animal-based natural \nmaterials, such as chitosan, hyaluronic acid, collagen, \ngelatin, and silk fibroin, for electrospun nanofibers \nand pharmaceutical applications. However, plant-\nbased natural materials will be valuable for future \nresearch because of cost, availability, and commercial \nfactors, as well as for cultural and geo-political \nreasons. \nCONCLUSION \nNanofibers have a wide range of applications in the \nfield of cosmetics, clothing, environmental safety, \ntissue engineering and in the preparation of scaffolds \nand the wound healing. The current situation \nregarding the delivery of antibacterial drugs is \nconstantly drawing a very great attention. The local \ndelivery of these drugs is achieved by nanofiber \nbased formulations that are capable of localizing the \ndrugs at the site of action. Due to this effect, present \ninvestigations are still improving for further delivery \nopportunities combinely results in the technology \ntransfer from laboratory to industrial scale up \nTable 2: Antimicrobial agent loaded nanofiber applications36-51 \nAntibacterial agent Polymer Applications \nCiprofloxacin HCl Dextran/PU Wound dressing \nTetracycline hydro-\nchloride \nHalloysite nanotubes/PLGA PLA/PCL \nTissue engineering, Wound dressing \nand drug delivery applications \nDoxycycline hyclate PAA, PLLA Wound dressing, Tissue engineering \nAmpicillin PAN/agar Wound dressing \nVancomycin PLGA Implant \nNeomycin PSSA-MA/PVA Wound dressing \nAmoxicillin \n \nLaponite (LAP) doped PLGA \nBiomedical applications, Tissue engi-\nneering \nMetronidazole PCL/gelatin Bone tissue engineering \nRifampicin PLGA Bone tissue engineering \nFusicid acid PLGA Implant \nSilver nanoparticles \n \nSilk fibroin, PEA, Poly[2-(tert- butylaminoethyl) meth-\nacrylate], chitosan, Bacterial cellulose, PAN, PVDF \nWound dressing, Tissue engineering, \nWater filters, Antiadhesion mem-\nbranes \nPhotocatalytic tita-\nnia nanoparticles \nNylon 6 and soy protein, PVA \nWater purification technology and in \nbiotech- nology, Wound healing \nAnthraquinone-2, 6-\ndisulfonic acid \nGelatin Wound dressing \nBiteral PCL Prevention of post-surgical adhesion \nPolyethyleneimine \n(PEI) \nSilk fibroin Wound dressing, Bionanotextile \nChitosan PAN, PCL Filter applications, wound dressing \n \n N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \nRubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology 57  \nprocesses, which will make these formulations more \nprecious and irreplaceable. \nREFERENCES \n1. Kenry,Chwee Teck Lim. Nanofiber technol-\nogy:current status and emerging developments. \nProgress in polymer science 70(2017) 1-17. \n2. S Bharat Kumar. Kattamuri et.al. Nanofibers in \nPharmaceuticals - A Review Am. J. PharmTech \nRes. 2012; 2(6) ISSN: 2249-3387. \n3. Patel DB., Deshmkh R, Pawdel PK, Tadavi S, Kshir-\nsagar RV. Nanofibers as Drug Delivery system. J \nPharm Res 2009,2(7),1184-1187. \n4. Heidi Schreuder-Gibson, Phillip Gibson, “Use of \nElectrospun Nanofibers for aerosol Filtration in \ntextile structures”. US Army Soldier Systems Cen-\nter AMSSB-RSS-MS (N) Natick, Massachusetts, \nhttp://www.asc2004.com/23rdASC/oral_sum-\nmaries/L/LO- 05.PDF. \n5. Mohammad Mirjalili, Salar Zohoori. Review for \napplication of electrospinning and electrospun \nnanofibers technology in textile industry, J \nNanostruct Chem (2016) 6:207–213. \n6. Shin, Y.M., Hohman, M.M., Brenner, M.P., Rutledge, \nG.C.: Experimental characterization of electro-\nspinning: the electrically forced jet and instabili-\nties. Polymer 42(25), 09955–09967 (2001). \n7. Yarin, A.L., Koombhongse, S., Reneker, D.H.: Bend-\ning instability in electrospinning of nanofibers. J. \nAppl. Phys. 89(5), 3018 (2001). \n8. Long, Q., Cai, M., Li, J., Rong, H., Jiang, L.: Improving \nthe electrical catalytic activity of Pt/TiO2 nano-\ncomposites by a combination of electrospinning \nand microwave irradiation. J. Nanopart. Res. \n13(4), 1655–1662 (2010). \n9. Taylor, G.: Disintegration of water drops in an \nelectric field. Proc. R. Soc. Lond. Ser. A Math. Phys. \nSci. 280(1382), 383–397 (1964). \n10. Stranger, J., Staiger, M.P., Tucker, N., Kirwan, K.: Ef-\nfect of charge density on the Taylor cone in elec-\ntrospinning. Solid State Phenom. 151, 54–59 \n(2009). \n11. Asif Morie, Tarun Garg, Amit K.Goyal & Goutam \nRath, Nanofibers as novel drug carrier  –  An over-\nview. Copyright © 2014 Informa Healthcare USA, \nInc. ISSN: 2169-1401. \n12. Doshi J, Reneker D H.   1 995.  Electrospinning pro-\ncess and applications of electrospun fibers.  J Elec-\ntrostat.   35:151 – 160. \n13. Agarwal S,Wendorff J H,Greiner  A .2008.Use of \nelectrospinning technique for biomedical applica-\ntions. Polymer. 49:5603 – 5621. \n14. Huang L, Nagapudi K, Apkarian RP, Chaikof \nEL.2001.  Engineered collagen PEO nanofibers \nand fabrics. J Biomater Sci Polym Ed.12:979 – 993. \n15. Baji A,Mai Y-W , Wong SC ,Abtahi M ,Chen P.2010 \n.Electrospinning of polymer nanofi bers: effects on \noriented morphology, structures and tensile prop-\nerties. Compos Sci Technol. 70:703 –718.    \n16. Park S,Park, K Yoon, H Son ,J Min T, Kim G .2007 \n.Apparatus for preparing electrospun nanofi bers: \ndesigning an electrospinning process for nano-\nfiber fabrication. Polym Int. 56:1361– 1366. \n17. Frenot A, Chronakis IS.2003.Polymer nanofibers \nassembled by electrospinning. Curr Opin Coll In-\nterface Sci. 8:64–75. \n18. 18.Adnain Hider, Sajjad Haider, Inn-Kyu-Kang, A \ncomprehensive review summarizing the effect of \nelectrospinning parameters and potential applica-\ntions of nanofibers in biomedical and biotechnol-\nogy. Arabian Journal of Chemistry (2018) 11, \n1165-1188. \n19. Sun Z, Z ussman E, Yarin AL, Wendorff JH, Greiner \nA .2003. Compound core shell polymer nanofibers \nby coaxial electrospinning. Adv Mater 15:1929 –\n1932.   \n20. Castillo-Ortega M, Nájera-Luna A, Rodríguez-Félix \nD, et al. Preparation, characterization and release \nof amoxicillin from cellulose acetate and poly (vi-\nnyl pyrrolidone) coaxial electrospun fibrous \nmembranes. Mater Sci Eng C 2011; 31: 1772-8. \n21. Webster TJ, Siegel RW, Bizios R. 1999. Osteoblast \nadhesion on nanophase ceramics.   Biomaterials. \n20:1221 –1227.     \n22. Yang Y, Ylikauppila H, Nikkola L, Ashammakhi  \nN.2006.  Investigation of cell attachment on the \nscaffolds manufactured by electro- spun PCL-hya-\nluronan blend. 04– 08 September 2006, Grenoble, \nFrance.     \n23. Zou B, Liu Y, Luo X, Chen F,Guo X , Li X. 2012.  Elec-\ntrospun fibrous scaffolds with continuous grada-\ntions in mineral contents and bio- logical cues for \nmanipulating cellular behaviors. Acta Biomater.  \n8: 1576 – 1585. \n24. Harel, Y.-E., Gerstenhaber, J.A., Brodsky, R., Hun-\neke, R.B.,Lelkes, P.I., 2014. Electrospun soy pro-\ntein scaffolds as wound dressings: enhanced reep-\nithelialization in a porcine model of wound heal-\ning. Wound Med. 5 (0), 9–15. \n25. Katti DS, Robinson KW, Ko FK, Laurencin CT, \n2004. Bioresorbable nanofiber-based systems for \nwound healing and drug delivery: optimization of \nfabrication parameters. J.Biomed. Mater. Res. B: \nAppl. Biomater. 70B (2), 286–296. \n26. Martin P, 1997. Wound healing-aiming for perfect \nskin regeneration. Science 276 (5309), 75–81. \n27. Rho KS, Jeong L, Lee G, Seo BM, Park YJ, Hong SD, \nRoh S, Cho JJ, Park WH, Min BM, 2006. Electrospin-\nning of collagen nanofibers: effects on the behav-\nior of normal human keratinocytes and early-\n N. Yamini and SK. Arifa Begum., (2020) Int. J. Res. Pharm. Sci & Tech., 2(2), 51-58 \n58  Rubatosis Publications | International Journal of Research in Pharmaceutical Sciences and Technology \n \nstage wound healing. Biomaterials 27 (8), 1452–\n1461. \n28. Bhardwaj N, Kundu SC, 2010. Electrospinning: a \nfascinating fiber fabrication technique. Biotech-\nnol. Adv. 28 (3), 325–347. \n29. Chena, JP, Chang, GY, Chen, JK, 2008. Electrospun \ncollagen/chitosan nanofibrous membrane as \nwound dressing. Colloids and Surfaces. A Physico-\nchemical and Engineering Aspects. 313, 183–188. \n30. Friess W., 1998. Collagen biomaterial for drug de-\nlivery. Eur. J. Pharm. Biopharm. 45 (2), 113–136. \n31. Li C, Vepari C, Jin HJ, Kim HJ, Kaplan DL, 2006. \nElectrospun silk-BMP-2 scaffolds for bone tissue \nengineering. Biomaterials 27 (16), 3115–3124. \n32. Mazza M, Notman R, Anwar J, Rodger A, Hicks M, \nParkinson G, et.al. Nanofiber-based delivery of \ntherapeutic peptides to the brain. ACS Nano2013; \n7: 1016–26. \n33. James EN, Delany AM, Nair LS. Post-transcrip-\ntional regulation in osteoblasts using localized de-\nlivery of miR-29a inhibitor from nanofibers to en-\nhance extracellular matrix deposition. Acta Bio-\nmater 2014; 10: 3571–80. \n34. Kataria K, Gupta A, Rath G, Mathur RB, Dhakate SR. \nIn vivo wound healing performance of drug \nloaded electrospun composite nanofibers trans-\ndermal patch. Int J Pharm 2014; 469: 102–10. \n35. Yan E, Fan Y, Sun Z, Gao J, Hao X, Pei S, et al. Bio-\ncompatible core shell electrospun nanofibers as \npotential application for chemotherapy against \novary cancer. Mater Sci Eng C 2014; 41: 217–23. \n36. Unnithan AR, Barakat NAM, Pichiah PBT, et al. \nWound-dressing materials with antibacterial ac-\ntivity from electrospun polyurethanedextran nan-\nofiber mats containing ciprofloxacin HCl. Carbo-\nhydr Polym 2012; 90: 1786-93. \n37. Serincay H, Ozkan S, Yilmaz N, et al. PVA/PAA-\nbased antibacterial wound dressing material with \nAloe Vera. Polym-Plast Technol Eng 2013; 52: \n1308-15. \n38. Parwe SP, Chaudhari PN, Mohite KK, Selukar BS, \nNande SS, Garnaik B. Synthesis of ciprofloxacin-\nconjugated poly L-lactic acid) polymer for nano-\nfiber fabrication and antibacterial evaluation. Int J \nNanomedicine 2014; 9: 1463-77. \n39. Jannesari M, Varshosaz J, Morshed M, Zamani M. \nComposite polyvinyl alcohol)/poly(vinyl acetate) \nelectrospun nanofibrous mats as a novel wound \ndressing matrix for controlled release of drugs. Int \nJ Nanomedicine 2011; 6: 993-1003. \n40. Qi RL, Guo R, Zheng FY, Liu H, Yu JY, Shi XY. Con-\ntrolled release and antibacterial activity of antibi-\notic-loaded electrospun halloysite/ polylactic-co-\nglycolic acid) composite nanofibers. Colloids Surf \nB 2013; 110: 148-55. \n41. Zahedi P, Karami Z, Rezaeian I, et al. Preparation \nand performance evaluation of tetracycline hy-\ndrochloride loaded wound dressing mats based \non electrospun nanofibrous polylactic acid)/poly-\ncaprolactone) blends. J Appl Polym Sci 2012; 124: \n4174-83. \n42. Khampieng T, Wnek GE, Supaphol P. Electrospun \nDOXY-h loaded-polyacrylic acid) nanofiber mats: \nin vitro drug release and antibacterial properties \ninvestigation. J Biomater Sci Polym Ed 2014; 25: \n1292-305. \n43. Feng K, Sun HL, Bradley MA, Dupler EJ, Giannobile \nWV, Ma PX. Novel antibacterial nanofibrous PLLA \nscaffolds. J Control Release 2010; 146: 363-9. \n44. Yang H, Gao PF, Wu WB, et al. Antibacterials \nloaded electrospun composite nanofibers: release \nprofile and sustained antibacterial efficacy. Polym \nChem 2014; 5: 1965-75. \n45. Nitanan T, Akkaramongkolporn P, Rojanarata T, \nNgawhirunpat T, Opanasopit P. Neomycin-loaded \npolystyrene sulfonic acid-comaleic acid) (PSSA-\nMA)/polyvinyl alcohol (PVA) ion exchange nano-\nfibers for wound dressing materials. Int J Pharm \n2013; 448:71-8. \n46. Wang SG, Zheng FY, Huang YP, et al. Encapsulation \nof amoxicillin within laponite-doped polylactic-\nco-glycolic acid) nanofibers: preparation, charac-\nterization, and antibacterial activity. ACS Appl Ma-\nter Interfaces 2012; 4: 6393-401. \n47. Xue J, He M, Liu H, et al. Drug loaded homogeneous \nelectrospun PCL/gelatin hybrid nanofiber struc-\ntures for anti-infective tissue regeneration mem-\nbranes. Biomaterials 2014; 35: 9395-405. \n48. Gilchrist SE, Lange D, Letchford K, Bach H, Fazli L, \nBurt HM. Fusidic acid and rifampicin co-loaded \nPLGA nanofibers for the prevention of orthopedic \nimplant associated infections. J Control Release \n2013; 170: 64-73. \n49. Song J, Kang H, Lee C, Hwang SH, Jang J. Aqueous \nsynthesis of silver nanoparticle embedded cati-\nonic polymer nanofibers and their antibacterial \nactivity. ACS Appl Mater Interfaces 2012; 4: 460-\n5. \n50. Ghosal K, Latha MS, Thomas S. Poly (ester amides) \n(PEAs)- Scaffold for tissue engineering applica-\ntions. Eur Polym J 2014; 60: 58-68. \n51. Nguyen TTT, Tae B, Park JS. Synthesis and charac-\nterization of nanofiber webs of chitosan/polyvi-\nnyl alcohol blends incorporated with silver nano-\nparticles. J Mater Sci 2011; 46: 6528-37. \n",
    "Link": "https://core.ac.uk/download/354985120.pdf"
}