{
    "Title": "Property Institutions And Economic Development: Some Empirical Tests",
    "Authors": "Pryor, Frederic L.",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Swarthmore College Works Economics Faculty Works Economics 4-1-1972 Property Institutions And Economic Development: Some Empirical Tests Frederic L. Pryor Swarthmore College, fpryor1@swarthmore.edu This work is brought to you for free and open access by . It has been accepted for inclusion in Economics Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. Follow this and additional works at: https://works.swarthmore.edu/fac-economics  Part of the Economics Commons Let us know how access to these works benefits you  Recommended Citation Frederic L. Pryor. (1972). \"Property Institutions And Economic Development: Some Empirical Tests\". Economic Development And Cultural Change. Volume 20, Issue 3. 406-437. DOI: 10.1086/450566 https://works.swarthmore.edu/fac-economics/127   The University of Chicago Press is collaborating with JSTOR to digitize, preserve and extend access to Economic Developmentand Cultural Change.http://www.jstor.orgProperty Institutions and Economic Development: Some Empirical Tests Author(s): Frederic L. Pryor Source:   Economic Development and Cultural Change, Vol. 20, No. 3 (Apr., 1972), pp. 406-437Published by:  The University of Chicago PressStable URL:  http://www.jstor.org/stable/1152736Accessed: 28-04-2015 19:56 UTC REFERENCESLinked references are available on JSTOR for this article:  http://www.jstor.org/stable/1152736?seq=1&cid=pdf-reference#references_tab_contentsYou may need to log in to JSTOR to access the linked references.Your use of the JSTOR archive indicates your acceptance of the Terms & Conditions of Use, available at  http://www.jstor.org/page/info/about/policies/terms.jspJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of contentin a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship.For more information about JSTOR, please contact support@jstor.org.This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsProperty Institutions and Economic Development: Some Empirical Tests* Frederic L. Pryor Swarthmore College Ante lovem nulli subigebant arva coloni; ne signare quidem aut partiri limite campum fas erat: in medium quaerebant, ipsaque tellus omnia liberius, nullo poscente, ferebat. [VIRGIL]' A. Introduction The purpose of this essay is to examine quantitatively some factors influ- encing the origin, development, and continued existence of particular property institutions in 100 different economies and to test a number of hypotheses concerning such matters that are derived from simple deductive models. Property relations offer a rich field for exploration by comparative economists, but, unfortunately, analysis of property is usually left to the historian, jurist, or political scientist. Of course, certain aspects of property do have political or social elements, but this should not blind us to the important economic aspects of the institution as well. Some relations between property institutions and the level of economic development have been noted-particularly by Marxists-but such analyses have been neither systematic nor quantitative. In trying to dissect the effects of the level of economic development on property institutions, a number of serious problems arise in isolating * I would like to express my deep appreciation to Robert Carneiro who supplied the anthropological data used in this study. Thanks are also due to George Dalton, Norma Diamond, Victor Novick, Robert C. Mitchell, Zora Pryor, Scott Forman, and George Stolnitz for their helpful comments on a previous draft of this essay. I would also like to thank the International Development Research Center of Indiana University for partial financing of the project. 1 Virgil, Georgicon, bk. 1, lines 120 ff. Ere [Jove], no peasant vex'd the peaceful ground, Which only turfs and greens for alters found: No fences parted fields, nor marks nor bounds Distinguish'd acres of litigious grounds. But all was common, and the fruitful earth Was free to give her unexacted birth. [Dryden translation] 406 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor modal institutions in complex economies. In this regard, it seems easier to confine the analysis to small and technologically simple societies; there- fore, only precapitalist economies are included in this empirical study. Much of the discussion of this paper lies on the relatively unexplored interface between economics and anthropology, and I have felt free to borrow techniques from both disciplines. The procedure followed is quite straightforward. In the next section, I present several simple cost/benefit models and deduce a series of hypo- theses. In the following section, I discuss certain statistical problems that are not usually faced in economic analysis. The hypotheses are put to test in the fourth section, and the results are summarized and expanded upon in the final part of the essay. B. Theoretical Observations 1. Definitions In order to avoid ambiguity, simple definitions for \"property,\" \"property institutions,\" and \"economic development\" as used in this essay are presented below. Property is considered as a bundle of recognized relations (rights, obligations, claims, powers, privileges, or immunities) between people in regard to some good, service, or \"thing\" that has economic value. A number of terms in this definition, especially in regard to \"recognition\" and \"economic value,\" give rise to analytical difficulties;2 but, for the purpose of this essay, the definition appears sufficient. Property institutions include, not only property rights, but the various customs and regulations that structure the exercise and the transfer of such rights. Exercising of particular rights is strongly influenced by the way in which rights are validated (or the acts by which such rights become recognized), including contract customs and the specificity with which rights are defined. The transferring of rights covers not only exchange procedures but inheritance institutions as well. Propositions in this essay cover a number of different types of such property institutions. Since I am dealing with many primitive economies, it is necessary to give an explicit definition of economic development, especially since the ranking of these societies according to their relative development level proved to be the most difficult statistical task of the analysis. In this essay, I define detelopment according to four criteria relating to the complexity of the economy: the division of labor, the level of tech- nology, the diversity of production above the barest food necessities, and the elaborateness of economic organizations. Although some have argued that these characteristics are not necessarily correlated and that it is possible to conceive of a society with a high level of technology but with a very 2 These problems are nicely analyzed by Armen Alchian, \"Some Economics of Property,\" RAND Corporation Paper 2316, May 26, 1961. 407 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change limited division of labor,3 empirical evidence presented below indicates that these four characteristics of complexity form a unilinear scale. Other problems in regard to this definition, especially in its application, are discussed in the text and footnotes below. 2. Approach Two major assumptions underlie the approach of this study. a) The first assumption is that certain benefits and costs can be ad- duced for a given property institution; and, moreover, if these benefits and costs are analyzed in regard to the relevant societal groups, correct predictions can be made about the occurrence of the institution in particular economies.4 The application of this general assumption to particular cases, especially in the determination of the concrete benefits and costs or of the relevant groups in the society, raises a great many complex problems. Although I have chosen particular institutions for examination where such methodological problems do not arise too acutely, it is necessary to indicate briefly what kind of costs and benefits are relevant, especially since most of the societies considered in this study do not have market valuations on most of their goods and services. Benefits accrue to the owner of a particular property right if the \"thing\" under consideration has a positive marginal productivity or, in the case of consumption, has a positive marginal rate of substitution. In the case of production, this \"value\" is determined by such oft-discussed considerations as the level of technology, the availability of the thing, and the supply of other factors of production. And, with regard to consump- tion, the value is partly determined by individual preferences. Such a cost/benefit approach can be used in one of two ways. From particular cost/benefit considerations, we can set out certain economic (or, more specifically, developmental) considerations that are necessary for the occurrence of a particular property right or institution. Or, on the basis of additional considerations, we might argue that greater economic benefits than costs lead in all cases to the introduction of a particular right or institution, that is, that the specified economic conditions are sufficient for the existence of a particular right or institution. One such assumption might be that certain groups within primitive societies con- stantly try to maximize their economic positions, so that we can argue greater benefits than costs to a particular group leads in all cases to the 3 Such issues are discussed by Martin Orans, \"Surplus,\" Human Organization 25 (Spring 1966): 24-32. 4 This cost/benefit approach is followed in a number of essays and books on various aspects of property that have recently appeared: Harold Demsetz, \"Toward a Theory of Property Relations,\" American Economic Review 56 (May 1967): 347- 59; Mancur Olson, Jr., \"Some Historic Variations in Property Institutions\" (paper delivered at the Southern Economic Association Convention, Autumn 1967, New Orleans, La.); and Steven N. S. Cheung, The Theory of Share Tenancy (Chicago: University of Chicago Press, 1970). 408 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor existence of a particular right or institution. Verification of hypotheses stated in terms of either necessary or sufficient conditions gives rise to the same sorts of difficulties (e.g., specification and identification problems), but positive evidence for hypotheses stated in terms of necessary conditions does not need to be as strict as in the case of sufficient conditions. Although the cost/benefit approach may appear novel in the context of an institutional analysis of primitive societies, it is but one variant of \"functionalism\" that is practiced by some anthropologists. Unlike some varieties of functionalism, however, statistical tests can be set up so that propositions can be refuted; and, thus, we do not need to deal exclusively with tautologies. The hypotheses discussed below are stated only in terms of necessary conditions, which is the more moderate application of the cost/benefit approach; but quite adequate statistical tests can be carried out in these terms so that both negative and positive evidence can be sys- tematically evaluated. At the end of the essay, I also present certain evidence that the more extreme application of the cost/benefit approach also fits the data, and I present the results of further statistical tests. b) The second major assumption on which this essay rests is that, if the benefits and costs of particular property rights or institutions are related to the level of economic development, then such institutions should appear in a cluster of societies arranged according to their relative levels of development. In other words, if the property rights or institutions are related to an independent measure of economic development, they can be considered part of a unilinear scale of development. This, in turn, means that a point on the development scale can be designated such that societies at higher levels of development have the right or institution, while those at a lower level do not. If, for instance, a designated property right or institution is not present in the sixty poorest economies but is present in all of the forty richest, then it seems clear that such a right or institution is related to the level of economic development and that determination of the level of development of a society is sufficient to decide whether or not it has the right or institution under consideration. If, on the other hand, the right or institution exists in a pattern such as in every other economy along the development scale, then the hypothesis must be rejected. A third case arises when the property right of institution does not occur in the sixty poorest economies but is present in half of the forty richest; in this case, the level of economic development is a necessary but not suffi- cient condition for the occurrence of such a right or institution. In order to avoid misinterpretation, it should be noted that the rating of societies according to the way in which a subset of their properties fall along a unilineal scale does not imply that, if these societies change, their degree of development will rise; for the use of the development scale implies no probabilities about the possibilities of progressive versus regressive changes; and, moreover, many changes occurring within socie- ties may have no relation to those characteristics with which \"develop- 409 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change ment\" is determined. Other problems in regard to the definition or application of the development concept are discussed in the text and foot- notes below. 3. Four Sets of Hypotheses The hypotheses tested below are grouped into four sets, according to the similarity of their justification or content. The first set of hypotheses con- cern the factors of production in which property rights exist; these hypo- theses have by far the most rigorous economic justification. The next two sets of hypotheses deal with the specificity of property rights and the institutions influencing them, especially in regard to the transfer and delineation of such rights. And a final set of hypotheses concern the gener- ality of such rights, that is, the degree to which particular economic relations are independent of specific \"things\" and are institutionalized into money. a) Property rights in factors of production.5-Property rights in men in the form of slavery and in land are the rights most capable of analysis with the proposed cost/benefit approach. In regard to slavery, a general proposition can be simply stated: slaves are held only if they can produce enough of economic value to more than cover the cost of maintaining them, fitting them out for work, and guarding them.6 If we also assume that unimproved land is available in sufficient quantities that land rents cannot be easily collected, then a number of corollaries and specific hypotheses can be derived from the general proposition. In most situations, it is clearly less expensive in terms of resources to guard slaves from running away if the slaves work together in a group, where they can be more closely watched (e.g., in agriculture), rather than if they work in small groups over a large area (e.g., hunting and gathering). Hypothesis Al: Slavery appears only in predominantly agricultural societies and does not appear in hunting and gathering societies, other things remaining equal. Since the data show that primary reliance on 5 The propositions in this section are based on several concepts such as \"slavery\" and \"subsistence level,\" about which there is heated controversy. Starting from Harry Pearson's famous essay (\"The Economy has no Surplus,\" in Trade and Market in Early Empires, ed. Karl Polanyi et al. [Glencoe, Ill.: Free Press, 1957], pp. 320-42) a considerable body of literature has arisen concerning the meaning of \"subsistence level.\" Similarly, problems arise in determining what degree of rights of one individual over another constitute slavery. But, no matter how hard it may be to draw lines in particularly ambiguous cases, these distinctions rest on gross differences that can be distinguished in most cases. (For \"level of subsistence,\" see Marvin Harris, \"The Economy Has No Surplus ?\" American Anthropologist 61 [April 1959]: 185-99.) That is, the terms can be operationalized in a more or less adequate manner; a description of the way in which this was carried out in the data I am using will be published in a forthcoming book by Robert Carneiro. 6 These hypotheses about slavery are taken directly from Olson (n. 4 above). Among other things, they rest on the assumption that sufficient land is available that land rents cannot be easily obtained (see Evsey Domar, \"The Causes of Slavery or Serfdom: A Hypothesis,\" Journal of Economic History 30 [March 1970]: 18-32). 410 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor hunting and gathering for food production occurs only at relatively low levels of development, this hypothesis thus relates slavery to the relative level of economic development. Since slaves do not receive many fruits of their labor above the barest necessities, they have little incentive in most cases (unless they can buy their freedom) for working very hard and, as a consequence, are probably less productive than free men. From this consideration, we can argue that slavery does not pay the slave owner unless the technological level of the society is high enough so that the average product of labor in the fields is much more than sufficient to just feed the worker. Hypothesis A2: Slave- holding in a society does not occur until there is a regular surplus of food produced above the needs of the food producers; that is, the society is well above the bare subsistence level, other things remaining equal.7 The net costs (production minus maintenance) of slaves are less if slaves are obtained as adults rather than as children, since there are fewer costs involved in teaching them the necessary skills of production.8 Hypothesis A3: Therefore, extratribal slavery should be more frequent than intratribal slavery, and the latter should occur only in societies with relatively higher levels of economic development, other things remaining the same. Before turning to the hypotheses about land, three features of these hypotheses which hold for the other fourteen hypotheses as well must be briefly noted. First, because of their simplicity, the three hypotheses avoid many of the complications that could occur if the cost/benefit approach were applied to more complex situations. Second, the hypotheses are not rigorous in the sense that sufficient conditions are established; however, necessary conditions are put forth which can be statistically tested. And finally, the ceteris paribus condition at the end of each hypothesis is quite important, since it allows a certain random condition. This means that, above or below the critical level of development that is relevant to the hypothesis, there may be certain societies that do not fit exactly into the predicted patterns.9 If the random element is too great, the hypothesis 7 Friedrich Engels (The Origin of the Family, Private Property, and the State [New York: International Publishers, n.d.]) presented arguments similar to these to prove the existence of slavery societies that had passed a certain level of economic development. His analysis differs from mine in two major respects: first, he argued that development is a sufficient condition, while here I contend merely that it is a necessary condition for slavery; second, he argued in terms of societies where the economy is based primarily on slavery, while I am concerned only with the existence of slavery, even though it may not be of critical importance to the economic function- ing of the society. 8 If slave-raiding parties are organized to obtain slaves from other tribes, then the costs of extratribal slavery are not zero; in most cases, however, slaves are obtained as a by-product from other activities such as war and, as a result, have a low marginal cost. There are also, of course, certain training costs of extratribal slaves as well. All of these costs seem lower in most cases than the resource costs of raising slaves. 9 For instance, the justification for hypothesis A2 is in terms of the average product of labor. However, if the marginal productivity of labor is very much lower 411 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change does not hold; the use of a probability model does, however, allow us to distinguish between these two cases. In a situation where unimproved land is available for all and where agricultural technology is very simple, there are no economic justifications for claims longer than one planting cycle on a particular piece of land. If cultivators of land use a technology such that agricultural practices in one year affect productivity in the next year, then there are some obvious economic benefits to those making improvements (investments) in a particular piece of land to assert long-term claims on its use. Hypothesis A4: Therefore, we would expect above a certain point on the development scale to find continuous ownership (disposition) rights by individuals or families over land which has been improved, even after the cultivated plot, house site, etc., is abandoned, other things remaining the same. If land plots become relatively scarce, this tendency toward continuous-ownership claims on use is reinforced (see also below). We are now at a point to see an important possible relationship between inequality and the level of development. If improvement of land brings considerable returns or if slaveholding is profitable, then property income can become important, and a source of income inequality arises. Indeed, the higher the productivity of labor, the more beneficial real and slave property can be to its owner. Furthermore, since there are certain economies of scale of protection (if a piece of land can be successfully guarded by a watchman walking the perimeter, then two watchmen can guard four times the property that one watchman can, since the area increases to the square as the boundary doubles), the benefits of property inequality rise more than the cost when more property is obtained or when the productivity of property rises. Thus, at higher levels of economic development, there are necessary conditions for greater economic inequality. For someone holding claims on the use of land to obtain large eco- nomic benefits from his land, it is often necessary for some part of the land to be cultivated by slaves or tenants. As long as free land is available or land distant from the community on which it is difficult for those holding nominally exclusive rights to enforce their claims, then tenancy does not pay the tenant, since he can always get the use of certain lands for himself without paying for their use. It is economic scarcity, either natural or contrived, that make tenancy inescapable for landless agriculturalists. There are, as many have noted, certain positive relations between economic development and land scarcity. It is well known that economic development is positively related to sizes of communities, and a scarcity than the average product, the hypothesis will not hold, and the pattern of slave- holding societies on the development scale will appear quite irregular. By including the case of a considerable difference between marginal and average productivity among the \"random factors,\" however, the analysis can proceed if a probability model is used for testing the hypotheses. 412 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor arises of land \"close\" to the community. \"Closeness\" can, of course, be affected by the methods of transportation, the sphere of military influence, etc.; but these should not blind us to the basic relationships that can exist between land scarcity and development. The necessary conditions for land tenancy thus rest on the existence of economic inequality and an economic scarcity of land. And, above a certain point on the development scale, the necessary conditions for these two factors also exist. We thus arrive through a chain of reasoning1o to Hypothesis A5: At a relatively high level along the development scale, rental of land by landlords to tenants will appear as a common system of tenure, other things remaining the same. Up to now, I have made no distinction between individual and family \"claims on the use of some land.\" It seems to be commonly agreed among anthropologists that property rights by single individuals in personal items and movable property is manifested at quite low levels of economic development; individual (as opposed to family) property rights of land appears at a much higher level of development. From the cost/benefit standpoint from which I have been arguing, a number of reasons can be adduced to support such a proposition. For instance, the higher the amount of production over cost (net production) from a particular piece of land, the more an individual property holder can afford to buy protection for his property rather than relying on his family. And the higher the net production and the greater the effects of investment on a particular piece of land, the more the economic interests of a single individual who is working a piece of land can diverge from those of his family. And the higher the net production and the greater the effects of investment on a particular piece of land, the more the economic interests of a single individual who is working a piece of land can diverge from those of his family. Unfortunately, I do not have sufficient data to test any proposition about the increasing importance of individual property claims in land at higher levels of economic development in a direct fashion.\"1 Indirect evidence is, however, available from the examination of inheritance insti- tutions, and it is to such matters that we now turn. b) The transfer ofproperty rights.-The above hypotheses all deal with the kinds of rights that are exercised over particular factors of production. The cost/benefit analysis can also be applied to property institutions, of 10 There is also a hidden assumption that higher labor productivity is necessarily associated with a higher level of economic development, a relationship that has been disputed by some (e.g., Orans [n. 3 above]) but which has sufficient weight for the burden of proof to be on those that dispute it. This proposition has also been often argued on noneconomic grounds. 11 Some data on this matter are presented by Robert B. Textor (A Cross-cultural Summary [New Haven, Conn.: Human Relations Area File Press, 1967]) in his \"finished characteristic\" 135. Unfortunately, data for only fourteen societies whose relative level of economic development are determined in this study are presented. This seems too small a sample from which to draw conclusions. 413 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change which an important class includes those institutions which structure the delineation and transfer of property rights between members of society. In regard to delineation and transfer institutions, the general (and almost tautological) proposition underlying the hypotheses below is quite simple: the higher the level of economic development and the greater the wealth, the greater the possibilities of serious disputes over wealth and the more there is at stake in such disputes. Greater wealth thus gives rise to greater benefits in explicit delineation of property rights and the ways in which property can be transferred.12 Since the costs of institutions con- cerning such matters need not be great and since the benefits are greater at higher levels of development, a number of testable hypotheses can be quickly derived. If there is not appreciable accumulation of wealth, the disposition of personal wealth after death is not very important; and, without much loss to anyone, such wealth could even be destroyed. However, at some level of economic development, such accumulation of individual wealth will become important enough to be desired by heirs, and the benefits of in- heritance rules become apparent. Hypothesis BI: At some point along the scale of economic development, most individual property in goods is transmitted by inheritance rather than being destroyed at the death of the owner, other things remaining equal. If the above proposition is true, then, from the considerations dis- cussed above about the emergence of individual as opposed to family property in land, it would seem likely that inheritance of movable property would precede inheritance of landed (real) property.13 Hypothesis B2: Formal inheritance procedures appear at lower level on the development scale for movable than for real property, other things remaining the same. From the general proposition, it should also be apparent that, the greater the wealth, the greater the benefits of highly formal procedures of 12 One possible ambiguity in these and the following remarks arises because different evaluations may be placed on such wealth. As the level of development rises, the \"amount\" of wealth in a society rises when measured in constant prices (or when considered in sheer physical terms); but, when measured in current prices (or in current opportunity costs), the situation is not so clear. It is useful to distinguish here between wealth in long-lasting consumer goods and in factors of production. In the case of consumer goods, we have evidence that the income elasticity of demand is considerably greater than unity, so that the amount of such wealth, when measured in current opportunity costs, increases with a rising level of economic development. In regard to wealth in land, as productivity rises, the value of the produce of the land rises, and, ceteris paribus, we might expect that the relative exchange value of the land would rise. A similar argument can be adduced for capital; and, in addition, it is possible that the capital/output ratio of the society might also increase-at least to a certain plateau-because of the increase in the physical amount of capital as well. 13 As many anthropologists have argued (e.g., Melville J. Herskovits, Economic Anthropology [New York: W. W. Norton & Co., 1952], chap. 15), even very primitive hunting and gathering societies have familial property rights in land. Both real and movable properties exist in all societies of the sample, so that the proposition cannot be argued on the grounds that real property does not exist at certain levels of develop- ment. 414 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor inheritance, especially since the latter are not necessarily much more expensive. Hypothesis B3: At a relatively high stage of economic develop- ment, testamentary disposition of property appears, either by a written will, through a formal executor, or orally in the presence of a witness, other things remaining equal. In addition to inheritance institutions, other arrangements exist for the transfer of property. Special situations arise in the cases of individual property where the owners die without direct descendants (for the inherit- ance rules to apply) or heirs (for the testamentary rules to apply). The more valuable the property, the more beneficial to the political leaders that its disposition be regularized by intervention from the government of the society. In the case of land, such regularization would appear at a further point on the development scale than where continuous claims of ownership rights by individuals or families would appear. Hypothesis B4: At a rela- tively high stage of development, agricultural land would revert to the chief, king, or state as personal property or for reassignment when the owner abandons the lands or dies without heirs (i.e., escheat), other things remaining the same. A final aspect of the transfer of property rights concerns the proce- dures for forfeiting such rights. One traditional way of forfeiting any kind of rights is by punishment for some kind of crime or violation of societal rules. At higher levels of economic development, as noted above, individual wealth is greater, and it becomes increasingly possible to punish a person by confiscating his property. Since this procedure is easier and less expensive to administer than other types of punishment involving compensation and since there can be more at stake in such a transaction at higher levels of development, the necessary conditions for its appearance should be clear. Hypothesis B5: At some state of economic development, certain offenses begin to be punished by confiscation of property (of which part may go to the offended party), other things remaining the same. c) Delineation of property rights.-Problems of the delineation of rights occur, not only in inheritance situations, but also in the very exercise of such rights. Such delineation can be almost costless, and, according to the general proposition stated in the above subsection, the benefits increase with more and more wealth at stake. Delineation of the land area over which an individual or family has rights of use can be used to verify a corollary to the general proposition, for, once productivity of improved land is much greater than unimproved land or once land has some scarcity value, the benefits of strictly defining the boundaries of such property become apparent. Hypothesis Cl: Shortly after the point on the development scale where landed property occurs, there should also arise the existence of continuous boundaries such as fences, rows or walls of stone, paths, ditches, or hedges to delimit agricul- tural fields, other things remaining equal. This is not a very strong hypo- thesis but points the direction toward more interesting propositions. 415 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change With higher levels of economic development and greater productivity of land, there are increasing benefits for continually more formal delinea- tion of land rights. Hypothesis C2: At a relatively high stage of economic development, there should arise a formal inscription of land or other forms of property through a registry of deeds, other things remaining the same. The public inscription of wealth has benefits to the society as a whole as well as the individual; the private recording of wealth benefits primarily the individual. The greater the wealth, the more property rights can be exercised, and the greater the benefits of the private recording of wealth so as to exercise such benefits to the greatest advantage. Thus, there is a relationship between economic development, wealth, and the benefits of such management devices. Hypothesis C3: At some point along the develop- ment scale, probably preceding the appearance of the public inscription of wealth, private recorded inventories of wealth should appear, other things remaining the same. d) Generalized property rights: money.-Up to now, we have been discussing property rights and institutions associated with very specific goods, services, and things, for example, pieces of land, rights in people, personal items, and so forth. But it should also be apparent that certain property rights can be defined in a more general and indirect way so that they represent a series of more specific property rights. Thus, we can have command over resources or goods in two ways: direct property rights in each resource or good or a generalized property right which allows such resources or goods to be obtained or used. There are two major benefits of such generalized property rights. First, as the number of different goods available for domestic trading increases, the number of possible different trades (i.e., pairs of goods in exchange) rises even faster (according to the well-known combinatorial rules). This is the origin of the problem of the \"coincidence of wants,\" the oft-discussed difficulty of finding a trading partner with complementary needs and surpluses. A generalized property right such as money greatly facilitates trade. Second, as wealth increases, the ease of managing such wealth in- creases when the different types of property rights can be expressed accord- ing to common numeraire. Although exchange value, as measured in monetary prices, catches only one facet of such property rights, it is an important one; and the positive relationship between the benefits of a generalized property right and the amount of individual wealth should be apparent. Higher levels of economic development are associated with greater per-capita trade and greater individual wealth. Thus, the benefits of a generalized property right is positively associated with the level of eco- nomic development. Furthermore, the costs of such a generalized right are probably independent of the level of development or even inversely related (since more advanced technologies allow more usable moneys to be made 416 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor more easily). From these considerations, we can frame a general proposi- tion: At higher levels of economic development, the necessary conditions for the use of increasingly more elaborate generalized property rights appear. A number of simple deductions from this proposition can be made. One of the least elaborate generalized property rights is a standardized medium of exchange which serves in particular circumstances a money role.14 Hypothesis DI: At some point on the development scale, a stan- dardized medium of exchange appears, other things remaining the same. A more formal (and possibly more costly) generalized property right occurs when the medium of exchange is given a highly standardized form. Hypothesis D2: At a higher stage of development, one or more types of coined money will appear, other things remaining the same. The development of money lessens the cost not only of individual exchange but of public exchange as well. Transfer of goods and services to the political leaders by the population appears easier. With wider use of a standardized medium of exchange, the process can be simplified and the administrative costs lowered by carrying out such transactions, at least partly, in the form of money. Hypothesis D3: At the same or higher development stage, taxes are collected in money, other things remaining the same. It must be explicitly noted that argumentation for this proposi- tion runs contrary to the suggestion sometimes found in the anthropological literature that noncommercial uses of money preceded commercial uses. These three hypotheses are, of course, quite obvious. A more difficult situation to analyze is a generalized property right for the temporary use of goods or resources. This can be examined by noting that paralleling the emergence of generalized property relations and the development of ex- change is a much clearer recognition of opportunity costs. As long as goods cannot be easily exchanged for other goods, the opportunity costs of temporarily lending particular goods to someone else cannot, in many cases, be easily measured. If goods have prices on them, loans can be more easily viewed in terms, not only of forgone consumption, but also of missed investment opportunities; that is, the costs of a loan to the lender become more apparent. Since an interest charge is a generalized right for compensation for the opportunity costs of lending and since these costs become more apparent in situations where there is a standardized medium of exchange (and where opportunity costs can be easily calculated), we can thus see a link between the level of development and economic 14 Many primitive economies do not have money in the sense of a completely generalized medium of exchange, unit of account, store of value, and standard of deferred payment, but rather limited-purpose monies serving one or two of these functions for a limited range of transactions. (This is explicated by George Dalton, \"Primitive Money,\" American Anthropologist 67 [February 1965]: 44-65.) In the following hypotheses, I am not concerned about some money-stuff that plays all of the roles of money, but rather about a money-stuff that plays the role of a medium of exchange for an appreciable range of ordinary goods and services. The exact coding definitions of such \"money\" will be presented in a forthcoming book by Robert Carneiro. 417 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change conditions for the existence of interest. Hypothesis D4: At a point on the development scale after the introduction of a standardized medium of exchange, money or goods begin to be lent out at interest, other things remaining the same. It must be noted that, although the emergence of interest has been argued on social and other grounds as well, no such specific hypothesis about the point of origin has been enunciated, at least in the literature I have been able to locate. On the whole, many of the seventeen hypotheses discussed above are common in the literature of economics or anthropology. And many have been justified or explained by a variety of social, political, and ecological reasons. Although the very simple benefit/cost arguments outlined above may seem quite naive to those who are aware of the complexity of most primitive societies and of the importance of analyzing economic institu- tions in a societal context, it is also important to bear in mind Ockham's principle of simplicity and the analytical advantages of linking a variety of seemingly unrelated phenomena to a single principle. We return to such questions at the end of the paper; it seems better to explore the statistical methods and to see if the hypotheses are verified before examining these more abstract and broader issues. C. Statistical Problems Two major statistical problems must be faced before the propositions stated above can be tested: The first is devising a method to rank the various primitive societies according to their relative levels of economic develop- ment; the second is obtaining sufficient data to carry out such a task. Each of these difficulties is discussed in turn below. 1. Determining the Relative Level of Economic Development The major analytic tool used here for ranking societies according to their relative level of economic development is the scalogram analysis devised by Louis Guttman 15 and applied in the analysis of development of primi- tive economies by Robert L. Carneiro.16 Since this technique may be 15 Louis Guttman's early work on scaling techniques is summarized in Samuel A. Stouffer, Louis Guttman, et al., Measurements and Prediction (Princeton, N.J.: Princeton University Press, 1950). The most useful descriptions of numerical tech- niques in scaling that we have found are: Allen L. Edwards, Techniques of Attitude Scale Construction (New York: Appleton-Century-Crofts, Inc. 1957), and Warren S. Torgerson, Methods of Scaling (New York: John Wiley & Sons, 1958). Scaling techniques have been continually improved with the introduction of computer methods, but none of the available programs could be used with the extremely large data matrix used in this study. 16 Carneiro and his associates have written a series of essays on the subject, including: \"Scale Analysis as an Instrument for the Study of Cultural Evolution,\" Southwestern Journal of Anthropology 28 (Summer 1962): 149-69; (with Stephen F. Tobias) \"The Application of Scale Analysis to the Study of Cultural Evolution,\" Transactions of the New York Academy of Sciences, 2d ser. 26 (1963): 196-207; \"On the Relation between Size of Population and Complexity of Social Organization,\" Southwestern Journal of Anthropology 23 (Autumn 1967): 234-44; \"Scale Analysis, 418 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor unfamiliar to economists, a brief explanation is warranted. The key idea behind the scalogram analysis is the \"dichotomous cumulative trait.\" A trait is dichotomous if there are only two possible ratings that the thing rated (e.g., persons, societies, etc.) can take. For instance, for a person the trait \"being six feet tall or over\" is dichotomous, while height in feet is not, since a person's height can take an infinite number of values. For a group of societies, a set of traits are \"cumulative\" if a society with a higher ranking has all the traits of a society with a lower rank plus a number of additional traits. This also means that, if trait A ranks above trait B, the former trait is possessed by all the societies that possess the latter plus a number of additional societies. A different way of looking at this cumulative phenomenon is to examine rankings of societies or traits using different subsets of societies and traits; a society that ranks higher than another on one scale (i.e., using one subset of traits) maintains this relative position when another scale is used; and a trait that is possessed by more societies than another also maintains this relative position with other scales (i.e., using another subset of societies). A further implication is that, if we are given the relative position of a trait, we can predict what societies possess it. A simple example of a set of dichotomous, cumulative traits is a set of traits based on the height continuum. Let us suppose that we have four traits: (1) being four feet tall or over; (2) being five feet tall or over; (3) being six feet tall or over; (4) being seven feet tall or over. Each of these is a dichotomous trait. Furthermore, if a person scores positively in only one trait, it must be the first; in two traits, the first two on the list. If one person has a higher rating than another, then he must score as high or higher on all the traits in the scale. This scalogram technique can be extended to the level of economic development quite easily. One hoary proposition is that, the higher the level of economic development, the greater the division of labor. Let us select the following four different measures of division of labor: the existence of a political leader who is a full-time specialist (i.e., does not regularly engage in subsistence agriculture); the existence of a full-time teacher (i.e., professional, secular instructor); the existence of a special full-time religious practitioner (e.g., priest); and the existence of a full- time craft specialist (e.g., brewer, lapidary, tailor, baker, tanner, etc.). Taking four primitive societies, the Rwala, the Ancient Incas, the Thonga, and the Semang, we can obtain the data which are given in table 1 below (the figure 1 indicates the existence of the trait; 0, its absence). Evolutionary Sequences, and the Rating of Cultures,\" in Handbook of Method in Anthropology, ed. Raoul Naroll and Ronald Cohen (New York: Natural History Press, 1970); \"Ascertaining, Testing, and Interpreting Sequences of Cultural Develop- ment,\" Southwestern Journal of Anthropology 24 (Winter 1968): 354-74; and (with Daisy F. Hilse) \"The Measurement of Cultural Evolution in the Ancient Near East and in Anglo-Saxon England,\" forthcoming. 419 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change TABLE 1 EXISTENCE OF FULL-TIME OCCUPATIONS IN FOUR SOCIETIES: UNREARRANGED DATA TRAITS Political Secular Religious Craft Total SOCIETIES Leader Teacher Practitioner Specialist per Society Rwala .............. 1 0 1 0 2 Ancient Incas ........ 1 1 1 1 4 Thonga ............. 1 0 1 1 3 Semang ............. 0 0 1 0 1 Total societies per trait ............ 3 1 4 2 If the rows and columns can be rearranged in order so that the l's form a \"triangle,\" then we have a set of cumulative traits forming a Gutt- man scale. As a start, it is useful to rearrange the rows and columns in ascending order of the total traits. The results are given in table 2 below. A Guttman scale can indeed be formed from the societies and traits since the 1-values form a triangle.\"7 Thus, the extent of the division of labor appears to be a unidimensional scale. From such results, we can also conclude that the Semang have the lowest and the Ancient Incas had the highest level of economic development, a conclusion that seems quite reasonable from what we know from the literature dealing with these two societies.18 TABLE 2 EXISTENCE OF FULL-TIME OCCUPATIONS IN FOUR SOCIETIES: REARRANGED DATA TRAITS Secular Craft Political Religious Total Traits SOCIETIES Teacher Specialist Leader Practitioner per Society Semang ............. 0 0 0 1 1 Rwala .............. 0 0 1 1 2 Thonga ............. 0 1 1 1 3 Ancient Incas ........ 1 1 1 1 4 Total societies per trait ............ 1 2 3 4 17 \"Triangle\" is a shorthand description of the fact that the line connecting the cutoff point (described below) must always proceed upward or to the left (assuming that the data are arranged as in table 2). 18 One problem of interpretation of \"economic development\" arises because we are dealing with societies of greatly different sizes (e.g., the Incas and the Semang). A very small society, no matter how high its level of technology, would have certain limitations placed on its division of labor; while a society composed of a large number of people is likely to have a certain division of labor with a relatively low level of technology. (For instance, if it is politically centralized, there will be full-time political 420 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor Before turning to more specific problems of calculating a Guttman scale for the problem at hand, several general observations about his approach are offered in order to avoid misunderstanding. First of all, the use of this method does not rest on any theory about how specific societies function or change. There is nothing in this technique that is based on any particular theory of economic development, except insofar as any theory is predicated on the implicit notion that \"economic development\" or \"complexity of the economy\" is a unidimensional con- tinuum. Similarly, this technique does not rest on the approaches of evolutionalist, diffusionist, structural-functionalist, or structuralist schools in anthropology.19 Second, this approach does not imply that other aspects of societies, especially those where economic elements may play a more secondary role (e.g., family structure, religious beliefs, or political forms), are necessarily related to the derived rankings of relative economic development, and, indeed, experiments along these lines showed that there were few such relationships.20 Third, the proof that the traits selected actually form a cumulative scale can only be seen in the process of rearranging the rows and columns to form such a scale. That is, although the traits are originally chosen on the basis of various a priori hypotheses about their relation to \"economic development\" (see below), the only indication of whether we chose the traits correctly is whether or not they form a unidimensional (cumulative) scale. officials and religious specialists.) However, it should be clear that the level of develop- ment and the size of a functioning economy are probably positively related: the small society with a high level of technology would find it advantageous to grow in size (e.g., through conquest) in order to utilize such technology through a more extensive divi- sion of labor; similarly, a large society with a low level of technology would probably not (except for the political and religious factors mentioned above) act as a single economic unit, so that the division of labor outside the several centralized political functions would be quite limited. Since 156 traits covering a wide number of economic activities in these societies are used, the scaling technique to determine the level of development should, in most cases, transcend the influence of size sufficiently so that the effects of the letter can be treated as a random element. Finally, it must be added that many of the hypotheses to be tested cannot be justified on the basis of scale or economic complexity; and, since it turns out that all of the hypotheses are validated, we have some justification in believing that the scaling technique actually does measure the relative level of development. 19 This technique has been employed by neoevolutionists such as Carneiro, but is not an exclusive tool of this approach. That is, there is no assumption that, when societies change, they necessarily change in a forward direction indicated by develop- ment scale. 20 I conducted a statistical fishing expedition with the 536 \"finished characteris- tics\" presented by Textor (n. 11 above) to see how many of these are significantly related to the level of economic development. Almost none of the social variables (especially those dealing with family structure) and few of the religious, political, and other noneconomic variables showed such a relationship. The investigation was complicated by the fact that, for many of the variables, the sample was quite small. For those noneconomic variables that do correlate, see Carneiro and Tobias (n. 16 above). 421 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change Finally, if the rating of the societies according to the selected traits contains errors, or if the traits selected do not truly reflect a particular place on the economic development scale, or if economic development is a multidimensional phenomenon, then certain \"nonscale elements\" appear in the matrix; that is the 1-values do not form a triangle. If this is the case, then two procedures must be followed. First, we must devise a way to measure the degree of difference from a perfect scale in order to ascertain whether or not such deviation is systematic or random. Second, we must devise procedures to improve the scaling by rearranging the rows and columns in a different way. Louis Guttman has introduced the concept of \"reproducibility\" as a measure of approximation to a perfect scale. The \"coefficient of reproduci- bility\" is a measure of approximation to a perfect scale and is defined as united minus the ratio of errors (a 0-value where a 1-value should be, and vice versa) to the total number of scaled items in the matrix. By maximizing the coefficient of reproducibility, the probability of correctly predicting the traits that a society possesses increases. The concept of error is slippery, however, for there are several techniques to determine what traits a society \"should\" possess. This is the problem of establishing the \"cutoff\" or \"cutting points,\" that is, the place in the rank order of societies where the most common response shifts from a 0-value to a 1-value. The difficulty can be most clearly seen in a numerical example given in table 3 below. Using a technique by Goodenough and Edwards, the cutoff point is determined by the number of societies per trait. Thus, for trait 1, the cutoff point is three from the bottom, while, for trait 4, it is seven from the bot- tom. These are drawn in with long straight lines (for a moment the short TABLE 3 AN ILLUSTRATION OF THE DIFFICULTIES IN MAXIMIZING THE COEFFICIENT OF REPRODUCIBILITY TRAIT NUMBER Total Traits SOCIETIES 1 2 3 4 per Society 1 ........ 0 0 0 0 2........ 0 0 0 1 1 3........ 0 0 1 0 1 4........ 1 0 0 0 1 5........ 0 0 1 1 2 6........ 0 1 0 1 2 7........ 0 0 1 1 2 8 ........ 0 1 1 1 3 9 ........ 1 1 1 1 4 10 ....... 1 1 1 1 4 Total societies per trait. 3 4 6 7 422 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor lines should be neglected). Thus, the Goodenough-Edwards technique gives an unambiguous method of ranking societies and traits (except in cases of tie scores) and, it should be clear, an unambiguous coefficient of reproducibility, even when tie scores among the traits or societies occur.21 In the above example, there are eight errors and forty (4 x 10) ratings, so that the coefficient of reproducibility is 1 - (8/40) = .80. It should be clear that the coefficient of reproducibility can be raised by changing the cutoff lines used in calculating the coefficient. For trait 1, the total number of errors can be reduced by placing the cutoff line above society 9; similarly, for trait 4 above society 5. For trait 3, the cutoff line can be placed above society 7 or 5 with the same number of errors (two). Using such a method (which is called the \"Cornell technique\"), cutoff points are placed where the short straight lines are drawn, and the derived coefficient of reproducibility is 1 - (5/40) = .875. In cases of larger matrices, the Cornell technique can result in still higher scores by re- arranging the rows and columns. However, as Edwards has pointed out, it then becomes impossible to predict the traits of a society with the accu- racy of the coefficient of reproducibility unless more information than the trait score is supplied. And I would add that there is no longer an unambi- guous ranking of traits and societies since, as demonstrated with trait 3, there are three different places where the cutoff point can be placed. Although both techniques are employed below, the results are quite similar: the Spearmen's coefficient of rank correlation between the country rankings using the two techniques is .98; and between the trait rankings (Experiment B), .95. It would be useful to have some measure of the statistical significance of the calculated coefficients of reproducibility, but so far no such measures are available. Part of the difficulty arises from a geometrical complication -if there is a small number of 1-values or 0-values, a random pattern would have a very much higher coefficient. One method of gaining insight into whether the derived pattern of 1- and 0-values (after the Goodenough- Edwards or the Cornell ranking technique has been employed) is statistic- ally meaningful is to compare the \"errors\" with that of a random pattern derived from a matrix of the same size and cutoff line as in the whole of the ranked matrix. For example, let us suppose that we have a matrix with ten societies and twenty traits and that there are forty I-values (20 percent of the ratings). If we use the Goodenough-Edwards technique, the cutoff line defines two areas with, respectively, forty and 160 ratings. Table 4 shows how the comparison pattern is derived. The table is constructed by assuming that the number of 1-values and 0-values are the same as the table to be examined but that the chances of either value appearing above or below the cutoff line depend only on the 21 It can also easily be shown that the cofficient of reproducibility is the same if the cutoff point is measured horizontally (i.e., from the societies) rather than vertically (from the traits) when the Goodenough-Edwards technique is employed. 423 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change TABLE 4 AN ILLUSTRATION OF THE DERIVATION OF THE COMPARATIVE \"RANDOM\" PATTERN Total Ratings* No. 0-Valuest No. 1-Valuest Above cutoff line ... 160 128 32 Below cutoff line .... 40 32 8 Total ............ 200 160 40 * 200 in example. t 80 percent in example. t 20 percent in example. number of ratings defined by this line. The patterns derived from the ranked table and from the \"random\" table are then compared, and a simple X2 calculation is carried out to see if they differ.22 Turning now to the specific problem at hand, the relative levels of economic development of the 100 primitive societies in the sample were determined by a scalogram using 156 different traits. In selecting them, I took advantage of some generally accepted propositions about the mani- festations of economic development as reflected in the complexity of the economy. More specifically, a higher stage of economic development is reflected by: a finer division of labor, a higher level of technology, a greater diversity of production above the bare subsistence level, and a greater elaborateness of economic organization. Thus, traits were selected that are related to the existence of specific occupations (examples are given in table I above); technology (e.g., existence of the plow, existence of bridges or sewers, use of arch in architecture, etc.); consumption products above those food products needed for subsistence (e.g., glass or pottery items, metal luxury goods, etc.); and complex economic institutions (e.g., large urban settlements, guilds, wage labor, permanent markets, etc.). Pre- liminary tests showed that the derived rank orders of societies were significantly highly correlated when ranked separately by each of these criteria. 22 My technique of comparing the results to a random pattern and then calculat- ing a x2 statistic is a variant of a technique analyzed by Karl F. Schuessler (\"A Note on Statistical Significance of Scalograms,\" Sociometry 24 [September 1961]: 312-18). It must be noted that this technique does not prove that traits form a cumulative scale but rather that the traits vary significantly from a random pattern in the two areas defined by the cutoff point. This test is, however, quite suited for testing \"necessary but not sufficient\" conditions; a test of sufficiency would involve examina- tion of the proportion of errors in areas at different distances from the cutoff line. This x2 technique can also be used to examine the statistical significance of the scaling of a single row (see below). Other more-complex methods of statistical analysis are also available (Leo A. Goodman, \"Simple [sic] Statistical Methods for Scalogram Analysis,\" Psychometrika 24 [March 1959]: 29-43, surveys this literature). However, the large size of the matrix and the particular way in which the hypotheses are stated make the above-described X2 test the most appropriate. 424 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor For the ranking of the traits and the societies, we have a matrix of 15,600 items. Using the Goodenough-Edwards technique, I counted the items that did and did not appear in the proper place above and below the cutoff line and calculated a coefficient of reproducibility. With the same rank order of societies, I then rearranged the order of traits and, using the Cornell technique, calculated a new coefficient of reproducibility (Experi- ment A), which, as one would suspect, is somewhat higher. Then, I re- arranged both the order of the societies and the traits, and, using the Cornell technique again, calculated still another coefficient of reproduci- bility (Experiment B), which is slightly higher than that in the previous experiment.23 All of these results are presented in table 5 below. To gain perspective, I present comparison patterns calculated on the assumption that the proportion of 1- and 0-values is the same for the two areas defined by the cutoff line. Coefficients of reproducibility can also be calculated for these random pattern tables and are presented for com- parison purposes. Finally, I compare the actual and the random patterns and calculate a X2 statistic (1 degree of freedom). It should be clear that the coefficient of reproducibility in all three cases is considerably higher than that derived from a random pattern. The X2 coefficients derived from comparing the actual data to the random pattern are all statistically significant far above the .99 level. Although the use of the Cornell technique improves the coefficient of reproducibility, loosening the constraints about rearranging the rows and columns and about drawing the cutoff lines does not greatly change matters. Two conclusions of importance for this study can be drawn from these results. First, the 156 traits chosen appear to fall along a unidimensional scale that indicates the relative levels of economic development; that is, the scalogram technique based on traits related to economic complexity proves a satisfactory method. Second, both the Goodenough-Edwards and the Cornell technique yield quite satisfactory results, and, therefore, we must make a decision as to which is the most appropriate to use. Use of the Cornell technique (for both the matrix determining level of develop- ment and for the individual traits to be tested) gives higher X2 values than the Goodenough-Edwards technique (for both the matrix determining level of development and for the individual traits to be tested). Further- more, the former method also seems more appropriate if we are worried about necessary and sufficient conditions. Therefore, it was chosen. Lists of the 100 societies, the 156 traits and their rankings using the various 23 This procedure was carried out by a semimechanized iterative process in which the computer printed out the matrix, decisions were made as to what rows or what columns were to be interchanged, proper instructions were given to the computer, and another matrix was printed out. The process continued until a close visual in- spection revealed no rearrangement that would result in fewer errors, a process that took nine iterations. Undoubtedly, more-refined methods would be able to reduce the errors somewhat, but the size of the matrix and the capacity of the small computer available to me prevented the use of such techniques. 425 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsTABLE 5 RESULTS OF THE SCALING EXPERIMENTS GOODENOUGH-EDWARDS CORNELL TECHNIQUE CORNELL TECHNIQUE TECHNIQUE EXPERIMENT A EXPERIMENT B Data 0-Values 1-Values Total 0-Values 1-Values Total 0-Values 1-Values Total Above cutoff line .... 12032 699 12731 12345 690 13035 12337 609 12946 Below cutoff line ..... 699 2170 2869 386 2179 2565 394 2260 2654 Total ........... 12731 2869 15600 12731 2869 15600 12731 2869 15600 \"Random\" Comparison Pattern 0-Values 1-Values Total 0-Values 1-Values Total 0-Values 1-Values Total Above cutoff line .... 10390 2341 12731 10638 2397 13035 10580 2366 12946 Below cutoff line ..... 2341 528 2869 2093 472 2565 1251 503 2654 Total ........... 12731 2869 15600 12731 2869 15600 12731 2869 15600 Summary Statistics Random Random Random Comparison Comparison Comparison Actual Data Pattern Actual Data Pattern Actual Data Pattern Total errors* ..................1398 4682 1076 4490 1006 4517 Coefficient of reproducibility .. .91 .70 .93 .71 .94 .71 X2t ......................... 7669. 9055. 9169. This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and Conditions* Zero-values where 1-values should be, and vice versa. t It must be emphasized that the x2 statistic relates to the difference between the actual and the random patterns, and, although it can be used to determine the degree to which the traits form a unidimensional scale, it does not directly measure a \"goodness of fit.\" Two extreme patterns of the errors are possible to visualize. The errors could be clustered around the cutoff line, a phenome- non that would be consistent with the notion that the possibilities of observation errors in regard to the trait are greatest in those societies around this line. Or the errors could be randomly distributed. This latter pattern implies, not only that observation errors are minimized, but also, perhaps, that some unspecified factor is impinging upon the scale. For the scale to represent fully a uni- dimensional phenomenon, such a factor would have to be taken into account. One simple way of determining which error pattern is predominant is to count the number of errors in a band of societies around the cutoff line and compare the result with what would be expected if the errors were random. For the Cornell technique (Experiment B), the following results are obtained: If the band is defined as five societies on either side of the cutoff line, then, with the assumption of a random distribution of errors, we would expect to find ninety-eight errors (this is not exactly 10 percent of the total errors because at the extreme end of the matrix the band has less than five societies); in actuality, we find 202, or 2.0 times as many). If the band is defined as ten societies on either side of the cutoff line, we would expect from an assumption about randomness 182 errors but find 390 (about 2.1 times as many) instead. It is noteworthy that the deviation from the random pattern is greater as the band becomes narrower. Thus, the first pattern-where the errors are clustered around the cutoff line- appears to predominate. Similar conclusions can be drawn from the matrices when the Goodenough-Edwards method is em- ployed. The results of this additional test thus give further confirmation of the correctness of the procedure we have followed. This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change techniques, and the results of the statistical tests using the Goodenough- Edward technique can be obtained from me. 2. The Data The data used for making the scale analysis come from a team project directed by Robert L. Carneiro at the American Museum of Natural History (AMNH) in New York City. Basing its research on a list of 356 traits,24 the AMNH team investigated 100 different primitive societies that were chosen so that societies from all different parts of the world are represented (in order to minimize influences of cultural diffusion). The raw materials were reports of field studies that have appeared in the anthro- pological literature for many decades. In order to gain some idea of the accuracy of this work, it is useful to cross-check these ratings against others that have been compiled. The data of thirty-two cross-cultural anthropological studies are summarized and analyzed in a book by Robert B. Textor,25 and, in addition, computer cards with such data are available from the Human Relations Area File at Yale University. Although Textor presents data for 400 societies, only fifty-five of them are the same as in the Carneiro study. And, out of the 536 traits presented by Textor, only thirty-three are sufficiently close to the Carneiro traits to warrant comparing. Finally, out of these thirty-three, only eighteen are economic traits that are used in this study. The results of such a comparison of these economic traits can be easily summarized.26 Out of the 683 ratings of the eighteen economic traits for the different societies from the Textor and Carneiro studies that are comparable, the same results are obtained in 82 percent of the cases. Part of the disagree- ment can be traced to slightly different definitions and concepts used in the two studies. In order to take this into account, the eighteen sets of traits were rated according to the degree of closeness before the comparisons were actually carried out. In the most comparable group, the differences between the two studies is 10 percent; in the least comparable group, 26 percent. Thus, the distribution of errors appears in the expected direction. The disagreements between the two sources can be investigated in other ways as well. First, the greatest amount of disagreement between the two sources should occur around the cutoff line, where random factors 24 Robert L. Carneiro and Stephen F. Tobias, \"Trait List to Be Used for the Study of Cultural Evolution by Means of Scale Analysis,\" 4th ed., mimeographed (New York: American Museum of Natural History, 1963). 25 Textor (n. 11 above). Most of the cross-cultural tabulations summarized by Textor come from the materials of the Human Relations Area File (HRAF). The Carneiro-Tobias data were not taken from this source but rather from a wide number of monographs, many of which are not included in the HRAF materials. Thus, the comparisons between the Textor and Carneiro-Tobias data cover errors due to differ- ences in coding and, in part, to differences in observation. 26 A more detailed summary can be obtained from me. 428 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor play the most important role. If the cutoff line (Goodenough-Edwards technique) is bracketed so that 20 percent of the societies for which data are available in both sources are included, then we should expect consider- ably more than 20 percent of the disagreements to fall within this range. Turning to the data, we find that 33 percent of the disagreements actually occur here. A greater-than-random number of disagreements between the two sources should also occur in the nonscale traits that fall outside the area bracketed around the cutoff line. That is, the further a society is from the cutoff line, the less likely it should have nonscale elements (have a 0 where 1 should be, and vice versa). For any group of societies away from the bracketed area, the chances are more likely that there are coding errors for the nonscale elements than for the scale elements and, thus, for disagree- ment between the two sources. Away from the bracketed societies around the cutoff line, the two sources disagree in 15 percent of the comparable cases; but, for the nonscale elements in this set, the degree of disagree- ment is 23 percent, which, as predicted, is higher. Thus, correct predictions about the distribution of error in all of the tests can be made. Such results give us greater confidence in interpreting the data and in carrying out the statistical testing of hypotheses ahead. D. The Empirical Tests Most of the hypotheses can be validated by showing that the traits in question are \"cumulative,\" that is, that after the societies have been ranked by level of economic development, the less advanced societies do not have the specified trait which appears in the advanced societies (where \"more\" and \"less\" advanced are determined by the cutoff line). The statistical procedures used in carrying out this task are similar to those used in table 5. The first step is to derive a \"random\" comparison pattern, and here we follow exactly the same method as before. For ex- ample, let us suppose that we have a sample of 200 societies and that forty of them have a particular trait (i.e., there are forty 1-values). Using the Goodenough-Edwards technique, the cutoff line defines two areas with, respectively, forty and 160 ratings; and a \"random\" comparison table is then constructed exactly as table 4. With the data, we arrange the societies according to the relative levels of economic development, draw a cutoff line, compare the results with the results from the random pattern, and finally calculate a X2 to see if they differ to a significant extent. A statistic very similar to the coefficient of reproducibility can also be calculated for each trait which provides a useful summary measure. The formula is: modified reproducibility coefficient equals unity minus the ratio errors to the total number of societies in the sample. The statistical test shows significant deviations from the random pattern, but does not distinguish between those where sufficient conditions are stated (where all of the societies above the cutoff line have the trait 429 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsTABLE 6 RESULTS OF THE STATISTICAL TESTS (CORNELL TECHNIQUE)* Rank in Coefficient Percentages Development of Societies of Societies Matrix of Reproduci- Hypotheses in Sample with Trait Trait bility C-Measure X2 Trait Property Rights in Factors of Production Al, A2, A3.. 100 32 25 .84 .31 39.29 War captives or persons bought outside the society, kept as slaves, and usually not adopted, liberated, or killed subsequently (i.e., extrasocietal slavery) Al, A2, A3.. 100 19 57-65 .90 .40 41.53 Debtors or criminals made slaves, or other free- born members of the society (including wives and children) sold into slavery (i.e., intrasocietal slavery) A4 ......... 100 34 19 .83 .53 29.04 Landed property: continuous ownership rights exercised by individuals or families over land which has been improved, even after cultivated plot, house site, etc., is abandoned A5 ......... 100 11 127-140 .95 .40 51.64 Rental of land or dwellings by landlords to tenants as a common system of tenure Transfer of Property Rights B1 ......... 100 68 12 .79 .33 32.87 Most individual (not family) property transmitted by inheritance rather than being destroyed at death of owner B2 ......... 45 49 11 .78 .20 13.93 Rules of inheritance governing real property B2 ......... 41 78 3 .80 .25 4.79 Rules of inheritance governing movable property This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsTransfer of Property Rights (continued) B3 ......... 100 24 47-50 .87 .23 38.22 Testamentary disposition of property, by a written will through a formal executor or orally in the presence of a witness B4 ......... 100 27 27 .88 .42 46.45 Agricultural land reverts to chief, king, or state as personal property or for reassignment when owner abandons the land or dies without heirs (i.e., escheat) B5 ......... 100 22 38 .87 .46 36.51 Certain offenses punished by confiscation of pro- perty, of which part may go to the offended party Delineation of Property Rights C1 ......... 100 35 15 .88 .25 59.15 Continuous boundaries (other than growing food plants) delimit agricultural fields (e.g., fences, rows, or walls of stone, paths, ditches, hedges) C2 ......... 100 6 127-40 .98 .50 67.68 Inscription of land or other forms of property (registry of deeds) C3 ......... 100 13 56-65 .98 .00 82.71 Recorded inventories of wealth (e.g., with pebbles, knotted cords, notched sticks, clay tablets) Generalized Property Rights: Money DI ......... 100 28 34 .83 .47 31.23 Occurrence of standardized medium of exchange D2 ......... 100 6 127-40 .96 .75 41.65 Coined money D3 ......... 100 8 127-40 .94 1.00 29.85 Taxation in money D4 ......... 100 13 66-72 .91 .56 31.92 Money of goods lent out at interest * The X2 statistics have 1 degree of freedom; a coefficient of 3.48 is significant at the .95 level; and 6.64, at the .99 level. The C measure (clus- tering measure) is defined in the text. The \"rank in development matrix of trait\" shows the rank order of the trait if it had been part of the matrix with which the relative levels of development were determined. (This was determined by comparing the cutoff point of the trait with the number of the trait in the development matrix with the same cutoff point.) The data for hypothesis B2 come from Textor (reporting Murdoch's EA74 and EA76 traits); all the rest of the data comes from Carneiro. This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change while none of those below the line do) and where necessary but not suffi- cient conditions occur (where some of the societies above the cutoff line have the trait while none of those below do). Since the hypotheses are stated in terms of necessary but not sufficient conditions, this is not disturbing. The results of the X2 tests as well as calculations of the coeffi- cient or reproducibility and the percentage of societies with the given trait are summarized in table 6 below. The first three hypotheses concern the presence of slavery and, from the table, it is clear that both intra- and extrasocietal slavery are cumulative traits. The first two hypotheses deal with the relative level of economic development at which slavery appears; and the most direct evidence of this is found in the rank order of traits composing the scale that are presented. The key question is the relative position of the slavery traits in regard to two crucial traits: \"agriculture provides the major part of subsistence\" and \"a surplus of food regularly produced over and above the annual subsistence needs of the food producers and not consumed by them.\" Both of these crucial traits are cumulative, and the former occurs at a lower stage of economic development than the slavery traits.27 Therefore, hypothesis Al about slavery occurring in agricultural rather than hunting and gathering societies is confirmed. Intrasocietal slavery also occurs above the surplus point, although extratribal slavery does not. Thus, hypothesis A2 about slavery occurring only in those societies well above the subsistence level receives only partial confirmation. If extrasocietal slaves are poorly fed and worked to death, then an implicit assumption of the original hypothesis is changed, and the actual results can be rationalized. Hypothesis A3 about extrasocietal slavery preceding intrasocietal slavery appears confirmed, because many more societies possess the former trait and the cutoff line is at a much lower level of development for the former than for the latter trait. Hypothesis A4 concerns the existence of continuous-ownership rights over improved land after a certain level of development and is more easily validated. Here, the only important test is whether the trait is cumulative, a factor which is demonstrated by the very high x2 statistic. The final hypothesis of the group (A5)-that rental of land or dwellings is a common form of tenure at high levels of economic development-is similarly validated by the high X2 statistic. This proposition, in turn, is based on the notion that at higher levels of economic development there is greater economic inequality, a phenomenon for which indirect evidence is available for only a small sample.28 27 These traits are, respectively, trait 11 and trait 36 in the rankings (Cornell technique), where the lowest number signifies that the trait occurs at a lower level of economic development. The X2 statistics are significant. 28 Hypothesis A5 is based on an argument concerning greater economic ine- quality at higher levels of economic development. Additional evidence on this matter 432 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor Hypotheses B1, B2, and B3, all deal with inheritance regulations, and in testing them several minor problems arise. Hypothesis BI states that, after a certain level of development, property is transmitted by inheritance rather than being destroyed at death. Such a trait turns out to be cumula- tive (according to the X2 test), and the hypothesis appears validated. Hypothesis B2 deals with formal inheritance procedures for movable pro- perty preceding procedures for real property. Both of these types of in- heritance arrangements appear cumulative, but several difficulties of interpretation arise. First, the data for B2 come from a different source than for hypothesis BI and show that inheritance regulations are intro- duced at a somewhat earlier stage on the developmental scale. Second, the cumulative nature of inheritance of movable property is just barely statistic- ally significant and, if we use the Goodenough-Edwards technique instead, falls slightly below the limit of significance. Nevertheless, it does appear that inheritance rules governing movable property occurred at an earlier developmental stage than for real property. And, combining the information from the two hypotheses, the following pattern seems clear: At the lowest levels of economic development, most individual property is destroyed at the death of the owner. At higher development levels, regulations for the inheritance of movable property appears; and, at a somewhat higher development levels, rules for the inheritance of real (land and structures) property exist. Such a pattern, in turn, offers strong evidence for the notion that family ownership of real property precedes individual ownership, which is a commonplace among anthropologists. Hypothesis B3 concerns testamentary disposition of property and is significantly related to the level of economic development. As predicted, such a trait appears at a much higher level of economic development than where rules of inheritance first appear. The appearance of escheat (hypo- thesis B4) and of the confiscation of property for punishment (hypothesis B5) also are significantly related to the level of economic development and are thus validated. Three hypotheses are offered above that link particular ways in which property rights are delineated with the level of economic development: more specifically, the existence of continuous boundaries delimiting agricultural fields (Cl), the formal inscription of land through a registry of deeds (C2), and the private recorded inventories of wealth (C3) are related to the relative level of economic development. Further, the first trait should appear first in societies ranked according to development, followed by the third, and then the second. The three hypotheses are validated by the high X2 statistics (which show that they are cumulative can be gained from Textor's FC137, which concerns the existence of invidious dis- plays of wealth. For the thirty societies which overlap the sample of societies used in this study, the trait appears to be cumulative, although there is a slight ambiguity. Using the Goodenough-Edwards technique, the X2 is somewhat below the required confidence limit; using the Cornell technique, the x2 is above this limit. Although a larger sample would be desirable in order to study this trait more extensively, the results do appear consistent with the hypothesis under examination. 433 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change traits) and by the relative number of societies that have each trait (which designate the relative points along the development scale at which the traits appear). The final group of hypotheses deal with the existence of general property rights, particularly in relation to the occurrence of money. All four traits are significantly cumulative, as shown by the high X2 statistic. Hypothesis D 1, that the existence of a standardized medium of exchange is related to the level of economic development, is thus validated. Hypothesis D2, that coined money appears at a higher stage of development, is vali- dated by the high X2 and the fact that many fewer societies possess this trait than the former. Hypothesis D3, that at the same or higher develop- mental stage taxes are collected in money, is also confirmed: the trait is cumulative and appears at roughly the same time as coined money. Hypothesis D4 is that at some point along the development scale after the appearance of a standardized medium of exchange, loans at interest occur. Again, the evidence is positive. The positive evidence for the seventeen hypotheses is impressive. The cost/benefit technique permits a number of varied hypotheses about the cumulative nature of certain economic traits to be generated for which the empirical evidence appears strong. Certain problems arise, however, in regard to the pattern of errors which deserves further attention. Such difficulties can be seen most clearly if the hypotheses themselves are strengthened. As I emphasized, the hypotheses are stated in terms of \"necessary but not sufficient\" conditions and, as such, remain relatively weak. Let us add an additional assumption: groups of men in primitive and peasant societies have a keen sense of their economic interests; and, if the economic potential for a particular property institution exist, the force of these interests leads to the establishment of the institution in question. We have now changed the hypotheses so that development is a sufficient condition for a property institution to appear. Further statistical tests are now necessary. As noted above, the X2 test employed in this study relates the observed pattern to a random pattern; and it should be clear that, the fewer the errors, the more closely related the trait to the level of economic develop- ment. From table 6 the reader can see that the errors are generally few and that the coefficients of reproducibility and the x2 coefficients are generally quite high. Examination of the pattern of errors now allows an interesting test to be made: if the errors cluster around the cutoff line, then there is a high probability that they are due to observational errors or small errors in scaling; if the errors are randomly distributed, then other factors may have to be taken into consideration before \"sufficient\" conditions for the various property institutions can be established. To examine these matters systematically, we can employ a technique used in others parts of this paper to compare the percentage of errors 434 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor within a zone around the cutoff line with the percentage that we would expect from a random distribution of errors. For simplicity, the zone is defined as 10 percent of the societies above and below the cutoff line; therefore, we would expect 20 percent of the errors to fall within this zone. In table 6 the C-measure (clustering measure) is the actual percentage of errors falling within the defined zone, using the Cornell technique to define the cutoff line (the Goodenough-Edwards technique yields similar results). In almost every case, more errors appear in the bracketed zone than would appear if they were distributed randomly (i.e., the C-measure is over .20 in all cases). In ten out of the seventeen traits that are examined, the C-measure is .40 or higher; that is, the actual errors are two times or more greater in number than expected within the zone. Thus, a large proportion of the recorded \"errors\" are probably due to statistical mis- takes rather than to the economic reality under examination. Since the remaining errors are relatively few, several interpretations are open to us. First, we could dismiss the remaining errors (i.e., the errors outside the bracketed areas) as due to random factors that act to offset the more basic economic forces in special circumstances. Second, we could argue that such errors are consistent with the hypotheses stated with necessary rather than sufficient conditions, but this approach implies a particular pattern of errors, namely, that the \"errors\" outside the bracketed area consist solely of traits not appearing in societies above the stage of development embodying the necessary conditions for that trait. Unfor- tunately, the pattern of errors does not appear like this but rather is roughly equally distributed on either side of the bracketed area. Third, we might argue that the economic-development factors play a very important but not a completely exclusive role in the appearance of particular property rights and institutions and that we cannot be completely sure of the critical mechanisms until alternative hypotheses to explain the same general phenomena are tested. I waver between the first and third interpretations, depending upon my state of modesty at the time, and must leave this issue to the reader. Interpretation of my results requires a brief discussion of one last major question: to what extent can one use these cross-section results to generalize about the development of property rights and institutions over time ? Since most of the relevant issues of this controversy have been often discussed in both the economic and anthropology literature, my comments can be brief. In regard to my scale of economic development, it should be clear that because of the possibilities of diffusion, it is possible that some of the traits would be in a somewhat different order on the development scale if time- series data were analyzed in a similar way. For example, because of contact with Europeans, use of certain technologies might appear now in much less economically developed societies than in the past, where such 435 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsEconomic Development and Cultural Change technologies had to be invented by members of the society itself. Neverthe- less, such changes in the ranking of traits and, perhaps, of several tribes should not deflect attention from the basic idea that, at a single point in time or over time, complexity is a unidimensional phenomenon that can be scaled.29 Further, this does not imply that a society cannot retrogress economically, but rather that, if it does retrogress, there is a certain pattern that can be predicted.30 For the property institutions examined in this study, three questions can be asked: Would they scale with time-series data ? Would they appear at the same point on the scale? And would they appear in the same order? The theoretical justifications of the various hypotheses suggests that they would scale, an assertion for which there is also a certain amount of positive empirical evidence to support.31 We would not expect cutoff lines of the property institutions to be at exactly the same point on the develop- ment scale as in the cross-section study. But, for those institutions in which relative ranks with other traits (e.g., intrasocietal slavery institutions appearing after societies are above a bare subsistence level) or relative ranks with other property institutions (e.g., inheritance of personal property preceding inheritance of real property) are important, we would expect that the same relative ranks would obtain because of the theoretical justifications offered in the previous section. E. Summary and Conclusions In this essay, I have examined seventeen hypotheses about the relation- ship of property rights and institutions to economic development which were derived from a rough judgment about the economic costs and benefits involved in each. By examining the existence of such institutions in 100 primitive societies that have been ranked according to their relative levels of economic development, positive evidence of the hypotheses appeared in every case. Although the hypotheses were stated in terms of necessary conditions, with an additional hypothesis about the great importance of the role of economic interests in primitive societies, the stated conditions become sufficient for the existence of the property institution under examination. Certain additional evidence for this matter is adduced from the data as well. Three general conclusions can be drawn from such an exercise: First, for some economic institution, it is not necessary to take into account the social matrix of an economy in order to predict their occurrence. That is, considerations of the level of economic development appear to 29 Empirical evidence on this matter is presented by Carneiro, \"Ascertaining, Testing, and Interpreting Sequences of Cultural Development\" (n. 16 above). 30 This is not to deny that some type of hysteresis effect might be present but, rather, that if a society retrogresses, there is a great probability that those traits that are highest on the trait list will be lost first. 31 Carneiro, \"Ascertaining, Testing, and Interpreting\" (n. 16 above). 436 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and ConditionsFrederic L. Pryor transcend particular cultural, social, or political considerations that might lead the investigator to make a more complicated theoretical analysis than necessary. Second, the scalogram technique, which I have used to rank the societies according to their relative level of economic development, is an analytical tool which can be of considerable use to economists. Since it allows quantification of qualitative data, it can be used, not only in analyzing institutions (as I have employed it), but also in many other cases where one may wish to scale attitudes, or patterns of activities, or proper- ties where metric devices cannot be directly applied. Finally, by taking account of some very simple cost/benefit considera- tions, it is possible to make accurate predictions about relationships between economic development and property institutions. Since property rights and institutions structure the pattern of decision making which influences economic activity, we can analyze at least one facet of a subject that has been too long neglected by economists. A general positive theory of property lies far in the future. But, since we may be reaching the point of diminishing returns from multiequational descriptions of economies, it might be useful to begin a more systematic analysis of the economic institutions that underlie the dry equations. 437 This content downloaded from 130.58.65.20 on Tue, 28 Apr 2015 19:56:01 UTCAll use subject to JSTOR Terms and Conditions",
    "Link": "https://core.ac.uk/download/84121881.pdf"
}