{
    "Title": "Maternity or catastrophe: a study of household expenditure on maternal health care in India",
    "Authors": "Chandra, R., Mukherjee, S., Singh, Aditya",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Scientific Research Publishing, Inc.'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Vol.5, No.1, 109-118 (2013)                                                                            Health \ndoi:10.4236/health.2013.51015 \nMaternity or catastrophe: A study of household  \nexpenditure on maternal health care in India \nSaradiya Mukherjee1, Aditya Singh2*, Rakesh Chandra1 \n \n1Centre for the Study of Regional Development, Jawaharlal Nehru University, New Delhi, India \n2Global Health and Social Care Unit, School of Health Sciences and Social Care, University of Portsmouth, Portsmouth, UK;  \n*Corresponding Author: aadigeog@gmail.com \n \nReceived 11 November 2012; revised 13 December 2012; accepted 21 December 2012 \nABSTRACT \nUsing data from 60th round of the National Sam-\nple Survey, this study attempts to measure the \nincidence and intensity of ‘catastrophic’ mater- \nnal health care expenditure and examines its \nsocio-economic correlates in urban and rural \nareas separately. Additionally, it measures the ef- \nfect of maternal health care expenditure on po- \nverty incidence and examines the factors asso- \nciated with such impoverishment due to mater- \nnal health care payments. We found that mater- \nnal health care expenditure in urban households \nwas almost twice that of rural households. A \nlittle more than one third households suffered \ncatastrophic payments in both urban and rural \nareas. Rural women from scheduled tribes (ST) \nhad more catastrophic head counts than ST \nwomen from urban areas. On the other hand, the \ncatastrophic head count was greater among il- \nliterate women living in urban areas compared \nto those living in rural areas. After adjusting for \nout-of-pocket maternal health care expenditure, \nthe poverty in urban and rural areas increased \nby almost equal percentage points (20% in urban \nareas versus 19% in rural areas). Increasing edu- \ncation level, higher consumption expenditure \nquintile and higher caste of women was asso- \nciated with increasing odds of impoverishment \ndue to maternal health care expenditure. To re- \nduce maternal health care expenditure induced \npoverty, the demand-side maternal health care \nfinancing programs and policies in future should \ntake into consideration all the costs incurred \nduring prenatal, delivery and postnatal periods \nand focus not only on those women who suf- \nfered catastrophic expenditure and plunged into \npoverty but also those who forgo maternal \nhealth care due to their inability to pay.  \n \nKeywords: Out-of-Pocket Payments; Maternal \nHealth Care; Poverty; NSSO; Catastrophic  \nExpenditure \n1. INTRODUCTION \nThe Millennium Development Goals (2000) have reit-\nerated the need to reduce maternal mortality by 75% \nbetween 1990 and 2015. Despite significant decrease in \nthe incidence of maternal mortality (from 409,053 in \n1990 to 273,645 maternal deaths in 2011), safe mother-\nhood still remains a distant dream for many around the \nworld, especially in developing countries [1]. As far as \nIndia is considered, it contributed around 20% of all ma-\nternal deaths occurred worldwide in 2005 [2] and this \nleads many to cast serious doubts about meeting the \nMDG-5 within time for the country. Most of the mater-\nnal deaths are preventable if mothers have access to pro-\nfessional care before, during and after pregnancy [3,4]. \nSince the level of maternal health care utilization is still \nvery low in India [5], it is imperative to substantially \nincrease the use of maternal health care especially among \npoor in order to reduce maternal mortality and improve \nmaternal health. \nThe state of government health services in India is \nmarked by unavailability and absenteeism of health pro-\nfessions, poor health facility infrastructure, shortage of \ndrugs and equipment, physical inaccessibility and callous \nbehavior of health care professionals [6-8]. On the other \nhand, private sector is characterized by high user fees \nand high costs of medical expenditure. The cost of health \nservices and the household’s ability to pay for health \nservices could influence the utilization of maternity ser- \nvices [9]. Many studies have explored the issue of the \ncost of maternal health care in the past [10-14]. However, \nthese studies have calculated maternal health care expen-\nditure without any reference to total household expendi-\nture. This could lead some to believe that small maternal \nhealth care expenditure is not a problem or huge expen-\nditure is a cause of concern. A small cost of maternal \nhealth care does not necessarily mean that it does not  \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nS. Mukherjee et al. / Health 5 (2013) 109-118 110 \ncause impoverishment. Similarly, a high cost of health \ncare expenditure also does not always necessarily mean \nthat it reduces the standard of living of the household. In \nfact, even a small expenditure could plunge the house-\nhold into poverty, if the household has no capacity to pay \nfor health care. Contrary to that, a large expenditure may \nor may not force a family into poverty that has ability to \npay for health care. So, the question here is how large the \nmaternal health expenditure needs to be to force a \nhousehold to a state where they decide either to forgo \nmaternal health care or sacrifice consumption of other \ngoods (including basic needs sometimes). Such levels of \nhealth care expenditure are generally referred to as “cata- \nstrophic” [15]. \nNo definite answer can be found in previous studies as \nto what level of expenditure could be “catastrophic” for a \nhousehold. In most of the recent studies, it has been arbi-\ntrarily taken as 40% of food expenditure or 10% of total \nhousehold expenditure or income [16-18]. Poor house-\nholds generally have very little to spend on health care \nbecause most of the household resources are absorbed by \nitems related to basic needs, such as food. This catastro-\nphic expenditure has been shown to have effects on pov-\nerty levels in many other countries [19-22]. \nUrban and rural areas are fundamentally very different \nfrom each other in many respects. Urban areas are gener-\nally characterized by higher income level, better and ac-\ncessible health infrastructure. The health seeking behav-\nior of mothers living in urban areas is also found to be \nvery different compared to that of rural mothers [23]. \nThere is only one national level quantitative study avail-\nable on the issue of catastrophic maternal health care \nexpenditure in India [14], To our knowledge, as yet, no \nstudy has attempted to study catastrophic maternal health \ncare expenditure and poverty induced by it separately for \nurban and rural areas. \nKeeping in mind the gaps left by research carried out \nin the past, this study aims to investigate the incidence, \nintensity and socio-economic correlates of “catastrophic” \nmaternal health care expenditure. It also measures the \neffect of maternal health care expenditure on poverty \nincidence and examines the factors associated with this \nimpoverishment due to maternal health care payments. \nThe analyses are conducted separately for urban and ru-\nral areas. The concepts and operational definitions of the \nindicators for incidence and intensity of catastrophic \nmaternal care expenditure and impoverishment due to \nmaternal care expenditure are given in detail in next sec-\ntion. \n2. DATA AND METHODS \nThe study uses data from 60th round (January-June \n2004) of the National Sample Survey (NSS) which is a  \nnationally representative survey conducted in India (ex-\ncluding a few far-off and inaccessible places) aimed at \ncollecting socio-economic data employing scientific sam-\npling methods. Each round of the survey collects data on \na particular theme. The survey adopts a stratified two- \nstage design with sampling of census villages in the rural \nareas (Panchayat wards in case of Kerala) and the NSS \nurban frame survey (UFS) blocks in the urban areas in \nthe first stage, followed by sampling of households in the \nsecond stage [24]. \nThe survey collected information on consumer expen-\nditure in 30 days before survey from 73,868 households \nusing a set of five questions on consumption aggregates, \nrather than through a detailed listing of consumption \nitems. The five items used for calculating the household \nconsumption expenditure were 1) purchases 2) home- \nproduced stock 3) receipts from exchange of goods and \nservices 4) gifts and loans and, 5) free collection. The \ndata on total maternal health care expenditure [antenatal \ncare (ANC), delivery care and postnatal care (PNC)] was \ncollected for all ever-married women aged 15 - 49 years \npregnant during the 365 days before the survey. Aggre-\ngate expenditures incurred by type of services (ANC, \ndelivery and PNC) and the source of care (government or \nprivate health facility or home) were also investigated. \nNo information was elicited on expenditure for abortion \ncare. In all, 9660 (6533 in rural and 3127 in urban) \nwomen reported that they were pregnant during 365 days \nbefore the survey.  \n3. MEASUREMENT OF VARIABLES \n3.1. Measuring Incidence and Intensity of \nCatastrophic Maternal Health Care  \nExpenditure \nCatastrophic expenditure is defined as that level of \nout-of-pocket (OOP) health expenditure which exceeds \nsome fixed proportion of household income or house-\nhold’s capacity to pay. The “capacity to pay” is the total \nannual household consumption expenditure net of sub-\nsistence expenditure on food and other basic needs. The \n“capacity to pay” of the household, in this study, has \nbeen derived by subtracting household poverty-line ex-\npenditure separately for rural and urban adjusted to house- \nhold size from household consumption expenditure [14]. \nSince, NSS does not differentiate between food and non- \nfood items in the 60th round survey, taking poverty line \nas subsistence expenditure is the best way to measure the \ncapacity to pay. The inflation adjusted data on national \n(India) poverty line for the year 2004-2005, as provided \nby the Planning Commission of India, was multiplied by \nhousehold size to calculate the capacity to pay. The “ca-\npacity to pay” was adjusted to zero for households below \npoverty line. In this study, a household suffers catastro-\nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nS. Mukherjee et al. / Health 5 (2013) 109-118 111\nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nphic expenditure, only if total maternal health care ex-\npenditure is more than 40% of “capacity to pay”. \n3.1.1. Catastrophic Head Count \nThe catastrophic head count measures the incidence of \ncatastrophic expenditure. It is the proportion of house-\nholds whose maternal health care expenditure is more \nthan 40% of their annual capacity to pay. Such house-\nholds are coded as “1” and if total maternal health care \nexpenditure is equal to less than 40%, household was \ncoded as “0”. If “Ti” represents total OOP maternal \nhealth care expenditure, “Xi” is the total annual per cap-\nita consumption expenditure of the ith household and “f” \nrepresents the annual per capita poverty line expenditure, \nthen “capacity to pay” of the household can be written as \n(Xi-f). If total household expenditure of a household is \nless than poverty line expenditure, the “capacity to pay” \nis treated as “0”. The cut-off based on proportion of the \n“capacity to pay” of the household could be denoted by \nZ cat. In this case, it is taken as 0.4. Now, let   E 1 if , T X f Zi i i     cat, and = 0 otherwise. Then, \nthe catastrophic head count is ∑Ei, where sum is over \nall the households N. Thus, the catastrophic head count \nratio now is E Ni  [25]. \n3.1.2. Mean Catastrophic Overshoot \nThis measure captures the depth or intensity of catas-\ntrophic payments i.e. the amount by which the maternal \nhealth care expenditure exceeds the threshold (in our \ncase, 40% of annual capacity to pay). The mean catas- \ntrophic overshoot “Oi” is given by \n  catT X f * Z\nN\ni i     \n3.2. Measuring Impoverishment Due to  \nMaternal Health Care Payments \nImpoverishment due to maternal health expenditure is \ncomputed by treating the households which fall below \npoverty line after paying for maternal health care. Using \nhousehold expenditure gross of OOP payments for ma-\nternal health care, the poverty head count is Hgross. If \nOOP payments are subtracted from household expendi-\nture before poverty is assessed, then the head count rises \nto Hnet.  \nFollowing O’ Donnell et al. (2008), pre and post ma-\nternal health care poverty head count ratios can be writ-\nten in the following manner. If xi is the total con-sump- \ntion expenditure of household i, then (the gross of ma-\nternal health care payments) poverty head count ratio is: \ngross\ngross 1\n1\nN\ni ii\nN\nii\ns p\nH\ns\n\n\n   \nwhere, 1grossip  , if xi < PL and is 0 otherwise, where si \nis the household size. N is the number of households in \nthe sample, and PL is the poverty line. \nThe net of health payments i.e. post payment poverty \nheadcount is obtained by replacing pigross with pinet = 1, if \n(xi − Ti) < PL or 0 otherwise, where Ti is total maternal \nhealth care expenditure [25]. \nnet\nnet 1\n1\nN\ni ii\nN\nii\ns p\nH\ns\n\n\n   \n3.3. Logistic Regression \nTo examine the effects of various socio-economic \ncorrelates of the catastrophic maternal care expenditure \nand poverty induced by it, we use binary logistic regres-\nsion analysis. The first dependent variable in the analysis \nis “catastrophic maternal health care expenditure” coded \nas “0” for non-catastrophic expenditure and “1” for \ncatastrophic expenditure. The second dependent variable \nis “impoverishment due to maternal health care spend-\ning”. It is coded as “0” for non-impoverishment and “1” \nfor impoverishment. The independent variables included \nin the analysis are religion, social group, educational \nattainment of women, the age of women, monthly per \ncapita consumption expenditure (MPCE) quintiles, and \nhousehold’s principal occupation.  \n4. RESULTS \nUsing data from 60th round of National Sample Survey, \nwe first calculated the incidence and intensity of the \ncatastrophic maternal health care expenditure and its \nimpoverishment effect on the households. We also made \nan attempt to examine the factors associated with the \nincidence of impoverishment due to maternal health care \nexpenditure. \n4.1. Incidence and Intensity of Catastrophic \nMaternal Health Care Expenditure \nTable 1 presents the estimates of catastrophic head \ncount—a measure of incidence of catastrophic maternal \nhealth care expenditure. It also presents the distribution \nof mean catastrophic overshoot—a measure of intensity \nof catastrophic maternal health care expenditure. \nThe average total expenditure was found higher in ur-\nban areas (Rs.4502) compared to rural areas (Rs.2224). \nAs for catastrophic head count, it was slightly higher in \nrural areas (37%) than in urban areas (35%). Among re-\nligious groups, Muslim (49%) in urban and Christian \nhouseholds (84%) in rural areas suffered catastrophic \nexpenditure more than any other religious group. More \nwomen belonging to poorer households (from lower \nquintiles) both in rural and urban areas were found to be \nS. Mukherjee et al. / Health 5 (2013) 109-118 \nCopyright © 2013 SciRes.                                 http://www.scirp.org/journal/health/Openly accessible at  \n112 \n \nTable 1. Catastrophic head count and mean catastrophic overshoot for maternal health care expenditure by the background charac-\nteristics of women in rural and urban India, 2004. \nBackground characteristics Total expenditure (in Rupees) \nCatastrophic \nhead count (in %) \nMean overshoot \n(in Rupees) Number of women \n Rural Urban Rural Urban Rural Urban Rural Urban \nReligion         \nHindu 2176 4690 61.7 33.6 575 892 5115 2325 \nMuslim 2022 3525 64.6 48.6 499 1313 825 510 \nChristian 5016 5880 84.3 23.0 1182 1434 352 151 \nOthers 3652 3913 75.6 32.4 426 400 241 142 \nMPCE quintiles        \nI 1141 2400 76.4 79.1 722 1561 1324 842 \nII 1456 2695 54.7 52.9 663 1194 1464 442 \nIII 2163 3956 14.6 14.2 459 980 1430 593 \nIV 2845 5614 8.7 8.5 374 561 1024 637 \nV 4968 9277 5.2 2.6 530 159 1291 614 \nSocial groups        \nST 1676 2665 44.1 28.5 627 340 945 215 \nSC 1488 2982 42.9 47.2 1060 450 1302 499 \nOBC 2157 4195 36.6 40.4 1107 653 2605 1137 \nOthers 3094 5649 29.4 26.7 790 649 1681 1277 \nHousehold’s main occupation       \n1 2485 4398 35.4 34.3 591 799 1123 1443 \n2 1369 5256 48.2 29.5 503 1020 1276 1191 \n3 2573 2577 40.7 54.8 762 1107 706 369 \n4 2313 6642 31.3 43.2 514 2202 2787 121 \n5 3585 - 26.1 - 710 - 638 - \nAge groups        \n15 - 19 1528 4908 36.1 37.5 497 1650 617 183 \n20 - 24 2472 3984 35.6 34.8 614 804 2621 1289 \n25 - 29 2208 4587 35.6 35.2 541 956 1824 1037 \n30 - 34 2156 5757 42.4 40.3 594 1176 908 410 \n35 - 39 1464 4,950 38.1 40.4 468 969 371 152 \n40 - 44 2210 4970 49.9 25.9 854 599 123 36 \n45 - 49 1258 3656 39.0 25.6 281 877 69 21 \nEducational attainment       \nNot literate + Below primary 1415 2242 42.0 52.3 831 441 3624 879 \nPrimary + Middle 3128 3893 30.8 36.1 1094 773 1993 988 \nSecondary + Diploma 4591 5643 25.5 23.8 950 926 758 771 \nGraduate + Higher 5943 9045 13.3 14.1 960 549 157 489 \nTotal 2244 4502 37.1 35.9 572 959 6533 3217 \nSource: Estimated using unit-level data from 25th Schedule on Morbidity and Health Care of 60th round of National Sample Survey conducted in 2004. Note: \nHousehold’s principal occupation: Rural 1) Self-employed in non-agriculture, 2) Agricultural labor, 3) Other labor, 4) Self-employed in agriculture, 5) Others; \nUrban: 1) Self-employed, 2) Regular wage/ salary earnings, 3) Casual labor, 4) Others. \n \ndisproportionately burdened by catastrophic expenditure. \nThe catastrophic head count of women belonging to \nScheduled Castes (SC) and Other Backward Castes (OBC) \nin urban areas was higher than Scheduled Tribes (ST)  \nand caste group known as “Others”. However, it was \nhigher among ST (44%) and SC (43%) women compared \nto “Others” (29%) in rural areas. With increasing educa-\ntional attainments of women, the head count of catastro-\nphic payments on maternal health care decreased sub-\nstantially in both rural and urban India. Women belong-\ning to households engaged in agricultural labor in rural \nareas (48%) and casual labor as main occupation in ur-\nban areas (55%) showed the highest catastrophic head \ncount for maternal health care expenditures. \nS. Mukherjee et al. / Health 5 (2013) 109-118 113\nTable 1 also shows the amount of mean overshoot in \nrupees by background characteristics of women. The mean \novershoot was greater for the women form urban house-\nholds (Rs.959) than their counterparts living in rural ar-\neas (Rs.572). The depth of catastrophic expenditure was \nhigher among women belonging to households from lower \nMPCE quintiles compared those belonging to higher con-\nsumption quintiles, both in rural and urban areas. The \nmean overshoot among women from Christian house- \nholds in rural areas was highest (Rs.1182) followed by \nHindus (Rs.575) and Muslims (Rs.499). The overshoot \namong women from Christian households was highest \n(Rs.1434) in urban areas as well, followed by women \nfrom Muslim households (Rs.1313). \nWith respect to social groups, the average overshoot \nwas highest for women who belonged to OBCs (Rs.1107) \nfollowed by SCs (Rs.1060) in rural areas and “Others” \n(Rs.649) in urban areas. Illiterate women and women \nwith less than five years of education were least affected. \nThis pattern was same for both rural and urban areas. \nThere was no clear pattern of overshoot across age groups \nof women in both rural and urban areas. The maternal \nhealth expenditure of the women from the households, \nwhose main occupation was to work as “other labors”, \novershoots their “capacity to pay” by Rs.762 in rural \nareas. The depth of financial burden was highest among \nthe women belonging to the household with their main \noccupation catagorized as “Others” (Rs.2202) followed \nby “regular wage/salary earnings” (Rs.1107) in urban \nIndia. \n4.2. Determinants of Catastrophic Maternal \nHealth Care Expenditure \nTable 2 presents the odds ratios from two separate (one \nfor rural areas and one for urban areas) logistic regres-\nsion analyses performed to examine the effects of inde-\npendent variables on catastrophic maternal health care \nexpenditure. The MPCE of households was found to be a \nhighly significant predictor (p ≤ 0.001) of catastrophic \nmaternal health care expenditure. The odds of experienc- \ning a catastrophic expenditure reduce significantly by 66%, \n96%, 98% and 99% for second, third, fourth and fifth \nquintile compared to the first quintile in rural areas. In \nurban areas, the odds decrease even more sharply. The \nodds of catastrophic expenditure among women from the \nrichest quintile in urban area are almost zero compared to \nwomen from the poorest quintile. While, among social \ngroups in rural areas, the women belonging to STs were \n69% more likely to witness catastrophic OOP expendi-\nture on maternal health care compared to “Others”. In \nurban areas, results were in expected direction but none \nof them were found to be significant. \nTable 2. Results of logisitc regression showing the determi-\nnants of catastrophic maternal health care payments in rural and \nurban India, 2004. \nOdds Ratios \nBackground \ncharacteristics \nRural Urban \nReligion   \nHindu®   \nMuslim 1.03 1.36** \nChristian 1.23 0.60 \nOthers 1.12 0.63 \nMPCE quintiles  \nI®   \nII 0.34*** 0.26*** \nIII 0.04*** 0.03*** \nIV 0.02*** 0.01*** \nV 0.01*** 0.00*** \nSocial groups  \nOthers®   \nOBC 1.34 1.21 \nSC 1.42 1.22 \nST 1.68*** 0.85 \nHousehold’s main occupationΩ \nSelf-employed in agriculture® \nSelf-employed in  \nnon-agriculture 1.22\n** 0.66*** \nAgricultural labour 1.80*** 1.07 \nOther labour 1.48*** 0.91 \nOthers 0.51*** _ \nAge-groups  \n35 - 49®   \n25 - 34 1.36*** 2.08*** \n15 - 24 1.46*** 1.69*** \nEducational attainment \nNot literate®  \nPrimary/Middle 0.68*** 0.56** \nHigher 0.86*** 0.76*** \nNote: ΩHousehold’s principal occupation: Rural: 1) Self-employed in agri-\nculture, 2) Self-employed in non-agriculture, 3) Agricultural labor, 4) Other \nlabor, 5) Others; Urban: 1) Self-employed, 2) Regular wage/salary earnings, \n3) Casual labor, 4) others; ® = Reference category; Level of significance: \n***p ≤ 0.001; **p ≤ 0.05; *p ≤ 0.01; N (Rural) = 6109; (Urban) = 2897; \nPseudo R2 = 0.309 (Rural) and 0.307 (Urban). \n \nAs for religion, Muslim women in urban areas were  \n36% more likely to experience catastrophic maternal health \ncare payments compared to Hindu women. The odds of \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nS. Mukherjee et al. / Health 5 (2013) 109-118 \nCopyright © 2013 SciRes.                                 http://www.scirp.org/journal/health/Openly accessible at  \n114 \ncatastrophic expenditure were 34% less among women \nbelonging to the households engaged in regular wage \nemployment in urban areas compared to women from \nself-employed households. However, household’s prin-\ncipal occupation was also found to be a significant pre-\ndictor variable in rural area except for the women who \nbelonged to households engaged in occupations catego-\nrized as “Others”. Women from household reporting their \nmain occupation as “self-employed in non-agriculture”, \n“agricultural labor”, and “Other labor” showed higher \nodds of experiencing catastrophic payments. Similarly, \nwith respect to the reference category of women aged 35 - \n49, the women from lower age groups had significantly \nhigher chance of incurring catastrophic payments. Rural  \nwomen with middle and higher education were less \nlikely to incur catastrophic expenditure by 31% and 13%, \nrespectively. Similar pattern was found in urban areas too \nwhere women with middle and higher education were \n43% and 24% less likely to suffer from catastrophic OOP \npayments. \n4.3. Impoverishment Due to Maternal Health \nCare Expenditure \nUsing methods discussed above, we calculated pre and \npost maternal health care expenditure poverty head counts \nfor both rural and urban areas. Tables 3 and 4 present the \nestimates of mean maternal health care expenditure; pre  \n \nTable 3. Maternal health care expenditure and increase in poverty head count due to maternal health care expenditure in rural areas \nof India, 2004. \nMean MHC expenditure (in Rupees) Poverty head count (in %) Background \ncharacteristics ANC Delivery PNC Pre Post Difference \nReligion       \nHindu 567 1186 423 32.6 53.7 21.1 \nMuslim 525 1050 447 30.0 49.3 19.3 \nChristian 1089 3104 823 11.9 21.5 9.6 \nOthers 782 2268 602 17.8 34.8 17.0 \nMPCE quintiles      \nI 277 613 251 100 100 0.0 \nII 388 734 334 45.5 76.1 30.6 \nIII 559 1145 459 0.0 28.2 28.2 \nIV 736 1577 532 0.0 18.6 18.6 \nV 1021 3135 812 0.0 14.3 14.3 \nSocial groups      \nST 284 496 896 54.2 64.1 9.9 \nSC 408 825 255 42.3 60.1 17.8 \nOBC 650 1189 318 33.1 53.3 20.2 \nOthers 688 1819 587 24.3 44.4 20.1 \nHousehold’s main occupation@ \n1 713 1243 529 31.0 53.8 22.8 \n2 360 706 303 49.6 62.4 12.8 \n3 671 1399 503 35.1 58.1 23.0 \n4 577 1308 428 31.1 49.2 18.1 \n5 732 2297 556 19.0 40.5 21.5 \nAge groups      \n15 - 24 408 1089 334 32.1 52.2 20.1 \n25 - 34 671 2608 454 36.1 53.8 17.7 \n35 - 49 577 1234 567 49.9 62.8 12.9 \nEducational attainment \nIlliterate + <Below Primary \n 361 717 337 44.6 59.0 14.4 \nPrimary + Middle \n 826 1731 571 23.0 47.2 24.2 \nSecondary + Diploma \n 822 3147 622 11.3 42.1 30.8 \nGraduation + Higher \n 1130 3961 852 4.4 27.7 23.3 \nTotal 580 1225 439 35.3 53.8 18.5 \nNote: The estimated figures show gross and net maternal health care payments poverty head counts. Inflation adjusted poverty line (rural and urban) as given by \nPlanning Commission for 2004-2005 has taken for the analysis. @Household’s main occupation: Rural 1) Self-employed in non-agriculture, 2) Agricultural labor, \n3) Other labor, 4) Self-employed in agriculture, 5) Others; MHC stands for maternal health care. \nS. Mukherjee et al. / Health 5 (2013) 109-118 115\nTable 4. Maternal health care expenditure and increase in poverty head count due to maternal health care expenditure in urban areas \nof India, 2004. \nMean MHC Expenditure (in Rupees) Poverty head counts (in %) Background \ncharacteristics ANC Delivery PNC Pre Post Difference \nReligion       \nHindu 1026 3013 651 28.2 50.0 21.8 \nMuslim 799 2284 442 41.5 66.3 24.8 \nChristian 865 3916 1099 9.2 33.8 24.6 \nOthers 697 2505 711 21.8 50.5 28.7 \nMPCE quintiles      \nI 577 1387 434 100 100 0.0 \nII 702 1522 471 19.6 71.3 51.7 \nIII 717 2729 508 0.0 27.2 27.2 \nIV 1095 3743 776 0.0 25.4 25.4 \nV 1784 6505 987 0.0 14.1 14.1 \nSocial groups      \nST 611 1717 337 27.5 36.9 9.4 \nSC 697 1801 484 44.7 61.6 16.9 \nOBC 920 2737 538 36.7 57.2 20.5 \nOthers 1191 3660 798 22.7 44.7 22.0 \nHousehold’s main occupation@ \n1 959 2778 610 33.1 54.6 21.5 \n2 1376 3513 665 22.5 44.0 21.5 \n3 663 1465 556 53.5 70.4 16.9 \n4 1549 4498 844 38.3 56.2 17.9 \nAge groups      \n15 - 24 1957 5432 1148 32.3 50.7 18.4 \n25 - 34 2225 6789 756 30.3 53.0 22.7 \n35 - 49 1100 1876 589 48.6 63.9 15.3 \nEducational attainment \nIlliterate + Below Primary \n 800 1314 444 40.6 71.5 30.9 \nPrimary + Middle \n 780 2474 535 50.1 70.8 20.7 \nSecondary + Diploma \n 1845 3682 771 39.1 86.9 47.8 \nGraduation + Higher \n 1224 6405 938 32.2 94.9 62.7 \nTotal 984 2886 632 32.7 52.4 19.7 \nNote: The estimated figures show gross and net maternal health care payments poverty head counts. Inflation adjusted poverty line (rural and urban) as given by \nPlanning Commission for 2004-2005 has taken for the analysis; @Household’s main occupation: Urban: 1) Self-employed, 2) Regular wage/salary earnings, 3) \nCasual labor, 4) Other; MHC stands for maternal health care. \n \nand post payment poverty head count for rural and urban \nareas respectively. The differentials in pre and post ma-\nternal health care poverty head count by background \ncharacteristics of women are being described in this sec-\ntion. Hindu women (21%) were most vulnerable to ma-\nternal health care induced poverty followed by Muslim \nwomen (19%) in rural India. On the other hand, the in-\ncrease in poverty head count was very small among \nChristian women. In urban areas, women belonging to \n“Other” religions (mainly comprised of Sikhs, Jains, \nBuddhists and Zoroastrians) experienced highest increase \n(29%) in maternal health care expenditure induced pov-\nerty. The incidence of poverty induced by OOP payments \nfor maternal health care was found to be highest for the \nsecond consumption expenditure quintile (31%) followed \nby the third quintile (28%). This pattern among con-\nsumption quintiles was similar for both rural and urban \nareas. Since, every household in the lowest MPCE quin-\ntile, in both rural and urban areas, was below poverty \nline, the pre-post difference was zero. However, the in-\ncrease in poverty head count due to maternal health care \nexpenditure (except highest quintile where the increase \nin poverty is equal) was more in other quintiles in urban \nhouseholds compared to rural households. \nWith respect to social groups, the increase in poverty  \nhead count was found to be highest for women belonged \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nS. Mukherjee et al. / Health 5 (2013) 109-118 116 \nto households from caste group known as “Others” in \nboth rural and urban areas. The women, who belonged to \nthe households whose main occupation was “Other la-\nborer”, “Other” and “Self-employed in non-agriculture” \nin rural areas, were found to be most vulnerable due to \nmaternal health care spending with an increase of 23%, \n23% and 22% in poverty headcount, respectively. Simi-\nlarly in urban areas, women form the households that \nwere either “self-employed” or earning “regular wages/- \nsalary” experienced an increase (22%) in the poverty \nhead count. Among different age groups of women, the \nhighest increase in poverty head count due to OOP ma-\nternal health care expenditure was among women aged \n15 - 24 years in rural areas (20%) and 25 - 34 years in \nurban areas (23%). \n4.4. Determinants of Impoverishment Effect \nof Maternal Health Care Spending \nTable 5 presents the odds of impoverishment due to \nmaternal health care spending for both, rural and urban \nIndia (coded “1” for impoverishment and “0” for non- \nimpoverishment). The MPCE quintiles were found to be \nsignificant in both rural as well as in urban areas. The \nodds increase with the quintiles, for instance, the odds of \nbeing poor for the fifth MPCE quintile were 23% and \n85% higher compared to the first quintile (the poorest \nquintile) in rural areas and urban areas, respectively. \nAmong social groups, the likelihood of being poor af-\nter paying for maternal health care was significantly \nlower by 99% and 98% for women who belonged to SCs \nand STs compared to women belonging to “Others” caste \ncategory in urban areas. The odds were found to be in \nsimilar direction; however, the odds were not as small as \nthey were in urban areas. Muslims and Christians in rural \nareas were 31% and 5% less likely to be poor due to ma-\nternal health care expenditure.  \nHowever, in urban areas, the odds of being poor due to \nmaternal health expenditure were 23% and 13% higher \namong Christians and Others, respectively than among \nHindus. Interestingly, Muslims women were 66% less \nlikely to be poor than Hindu women. It was also found \nthat women with middle education were 44% and 33% \nless likely to plunge into poverty due to OOP maternal \nhealth care expenditure in rural and urban area, respec-\ntively. On the other hand, women with higher education \nwere more likely (76% for rural and 87% for urban) to \nbe impoverished by OOP maternal health care expendi- \nture. \n5. DISCUSSION AND CONCLUSION \nUsing 60th round NSS data, we estimated catastrophic \nhead count and mean catastrophic overshoot. Secondly, \nwe measured pre and post maternal health care expendi-  \nTable 5. Results of logistic regression showing the determi-\nnants of impoverishment due to maternal health care payments \nin rural and urban India, 2004. \nOdds Ratios \nBackground Characteristics \nRural Urban \nReligion   \nHindu®   \nMuslim 0.69** 0.34*** \nChristian 0.95** 1.23*** \nOthers 0.67* 1.13** \nMPCE quintiles  \nI®   \nII 1.27*** 1.56*** \nIII 1.06*** 1.23* \nIV 1.19*** 1.42** \nV 1.23** 1.85** \nSocial groups  \nOthers®   \nOBC 0.54* 0.68** \nSC 0.48 0.01** \nST 0.45** 0.02** \nHousehold’s main occupationΩ \n1®   \n2 0.56 0.48 \n3 0.67 0.51 \n4 0.98 1.20 \n5 0.76 - \nAge-groups  \n35 - 49®   \n25 - 34 1.56 1.56 \n15 - 24 1.20 1.32 \nEducational attainment \nNot literate®   \nPrimary/Middle 0.56** 0.67** \nHigher 1.76*** 1.87*** \nNote: ΩHousehold’s Principal Occupation: Rural: 1) Self-employed in agri-\nculture, 2) Self-employed in non-agriculture, 3) Agricultural labour, 4) \nOther labour, 5) Others. Urban: 1) Self-employed, 2) Regular wage/salary \nearnings, 3) Casual labour, 4) Others; ® = Reference category; Level of \nsignificance: ***p ≤ 0.001; **p ≤ 0.05; *p ≤ 0.01: N (Rural) = 6109; (Urban) \n= 2897; Pseudo R2 =0.209 (Rural) and 0.207 (Urban). \n \nture poverty head count. Additionally, we also examined \nsocio-economic factors associated with the catastrophic \nOOP maternal health care expenditure and poverty in-\nduced by it, separately for urban and rural areas. \nDespite Government of India’s efforts to increase ma-\nternal health care utilization in government health facili-\nties, a large chunk of urban population including urban \npoor goes to private sector. The poor people face the \nhighest burden in relative terms despite the fact that they \nspend less in absolute terms and most of the maternal \nhealth care services in government health facilities are \nfree of cost. The percentage share for catastrophic OOP \nexpenditure was slightly lower for urban households than \ntheir rural counterparts. It may be due to better govern-\nment health services and relatively higher income of \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nS. Mukherjee et al. / Health 5 (2013) 109-118 117\nhouseholds in urban areas. The fact that a higher propor-\ntion of socio-economically backward households suf-\nfered with catastrophic expenditure for maternal health \ncare could be linked with their lower “capacity to pay” \nand greater dependency on private health sector. \nAlthough, women from “SC” and “ST” categories gen-\nerally exhibit poor outcomes in almost all socio-eco- \nnomic and health indicators [5], these women in our \nstudy showed decreased odds of impoverishment in-\nduced by maternal health care expenditure in both rural \nand urban areas compared to women from higher castes. \nThis is also evident from pre-post difference in poverty \nhead counts by caste. The women from “OBC” and \n“Other” households witnessed largest increase in poverty. \nThese castes are considered socio-economically better- \noff compared to SC and ST. It was also seen that like \npoorer households, many richer households too plunged \ninto poverty due to maternal care expenditure. This indi-\ncates that neither rich nor poor can have maternal health \ncare without affecting their well-being. \nIt was anticipated that the new demand side financing \nfor maternal health care in the form of Janani Suraskha \nYojana (JSY) program might help in reducing the burden \nof out of pocket expenditure especially for the disadvan-\ntaged section of the society. The JSY gives cash assis-\ntance (Rs.1400 and Rs.1000 respectively in rural and \nurban areas of low performing states and Rs.700 and \nRs.600 respectively for rural and urban areas of high \nperforming states) to all pregnant women who deliver at \na public health facility [26]. However, our study shows \nthat the out of pocket expenditure for delivery care ex- \nceeds substantially the amount currently assigned to the \npoor through JSY not only in urban areas but also in rural \nareas. Moreover, the maternal health expenditure induced \npoverty is also slightly higher in urban areas than in rural \nareas. It is worth mentioning here that the expenditure \nfor antenatal and postnatal care also makes a substantial \npart of total maternal health expenditure in both rural and \nurban India. In the absence of any external financial \ncover for the costs of antenatal care and postnatal care \nservices, it is likely that the picture of OOP maternal \nhealth expenditure induced poverty probably did not \nchange substantially during last seven years of JSY im- \nplementation. The impact of delivery care cash transfer \nthrough JSY on maternal health care expenditure at \nhousehold level is yet to be examined with a recent data. \nIf maternal health care expenditure induced poverty is to \nbe reduced substantially, the demand-side maternal \nhealth care financing programs and policies in future \nshould take into consideration all types of costs incurred \nduring prenatal, delivery and postnatal periods and focus \nnot only on those women who suffered catastrophic ex- \npenditure and plunged into poverty but also those who \nforgo maternal health care due to their inability to pay. \nLooking at the limited scope of the paper, it could be \nsuggested that the future work on this issue could esti-\nmate and analyse state-wise rural-urban differentials in \ncatastrophic expenditure for maternal health care and pov-\nerty induced by it which is even more relevant from the \npolicy perspective of the states. Due to the limitations of \nNSS dataset, we could not examine some relevant vari-\nables that could possibly have an effect on catastrophic \nexpenditure and poverty induced by it. An extensive and \nin-depth exploration of these factors could be a next step \nfor further research in this area. \n6. ACKNOWLEDGEMENTS \nWe are highly thankful to Dr. P. M. Kulkarni, Professor at Centre for \nthe Study of Regional Development (CSRD), Jawaharlal Nehru Uni-\nversity (India), for his guidance. \n \nREFERENCES \n[1] Starrs, A. (2001) Skilled attendance at delivery: A review \nof the evidence. The Interagency Group for Safe Moth-\nerhood, Family Care International, New York. \n[2] Hogan, M.C., Foreman, K.J., Naghavi, M., et al. (2010) \nMaternal mortality for 181 countries, 1980-2008: A sys-\ntematic analysis of progress towards Millennium Devel-\nopment Goal 5. Lancet, 375, 1609-1623. \ndoi:10.1016/S0140-6736(10)60518-1 \n[3] World Health Organisation (WHO) (2005) The World \nHealth Report 2005: Make every mother and child count. \nThe World Health Organization, Geneva.  \nhttp://www.who.int/whr/2005/en/  \n[4] Dhakal, S., Chapman, G.N., Simkhada, P.P., van Tei-\njlingen, E.R., Stephens, J., et al. (2007) Utilization of \npostnatal care among rural women in Nepal. BMC Preg-\nnancy and Child health, 7, 1-9. \n[5] International Institute for Population Sciences (IIPS) and \nORC Macro International (2007) National Family Health \nSurvey (NFHS-3), 2005-2006. IIPS, Mumbai. \n[6] Hussain, Z. (2011) Health of the national rural health \nmission. Economic & Political Weekly, 46, 53-60. \n[7] Garg, S., Singh, R.M. and Grover, M. (2012) India’s \nhealth workforce: Current status and the way forward. \nThe National Medical Journal of India, 25, 111-113. \n[8] National Rural Health Mission (NRHM) (2011) Bulletin \non Rural Health Statistics in India 2011. Ministry of \nHealth and Family Welfare (Statistics Division), Gov-\nernment of India. http://nrhm-mis.nic.in/Publications.aspx  \n[9] Mohanty, S. and Srivastava, A. (2012) Out-of-pocket \nexpenditure on institutional delivery in India. Health Pol-\nicy and Planning. doi:10.1093/heapol/czs057 \n[10] McCord, C., Premkumar, R., Arole, S. and Arole, R. \n(2001) Efficient and effective emergency obstetric care in \na rural Indian community where most deliveries are at \nhome. International Journal of Gynaecology and Obstet-\nrics, 75, 297-307. doi:10.1016/S0020-7292(01)00526-4 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nS. Mukherjee et al. / Health 5 (2013) 109-118 \nCopyright © 2013 SciRes.                                 http://www.scirp.org/journal/health/Openly accessible at  \n118 \n[11] Balaji, R., Dilip, T.R. and Duggal, R. (2003) Utilization \nof and expenditure on delivery care services: Some ob-\nservations from Nashik District, Maharashtra. Regional \nHealth Forum, 7, 33-41. \n[12] Duggal, R. (2004) The political economy of abortion in \nIndia: Cost and expenditure patterns. Reproductive Health \nMatters, 12, 130-137.  \ndoi:10.1016/S0968-8080(04)24012-5 \n[13] Sharma, S., Smith, S., Pine, M. and Winfrey, W. (2005) \nFormal and informal reproductive health care user fees in \nUttaranchal, India. Policy Project, Washington. \n[14] Bonu, S., Bhusan, I., Rani, M. and Anderson, I. (2009) \nIncidence and correlates of catastrophic maternal health \ncare expenditure in India. Health Policy and Planning, 24, \n445-456. doi:10.1093/heapol/czp032 \n[15] Ghosh, S. (2010) Catastrophic payments and impover-\nishment due to out-of-pocket health spending: The effects \nof recent health sector reforms in India Asia Health Pol-\nicy Program. Working Paper #15. \nhttp://asiahealthpolicy.stanford.edu \n[16] Xu, K., Ravndal, F., Evans, D.B. and Carrin, C. (2009) \nAssessing the reliability of household expenditure data: \nResults of the World Health Survey. Health Policy, 91, \n297-305. doi:10.1016/j.healthpol.2009.01.002 \n[17] Wagstaff, A. and vanDoorslaer, E. (2003) Catastrophe and \nimpoverishment in paying for health care: With applica-\ntions to Vietnam 1993-1998. Health Economics, 12, 921- \n932. doi:10.1002/hec.776 \n[18] Kawabata, K., Xu, K. and Carrin, G. (2002) Preventing \nimpoverishment through protection against catastrophic \nhealth expenditure. The Bulletin of the World Health Or-\nganization, 80, 612. \n[19] Limwattananon, S., Tangcharoensathie, V. and Prakongsa, \nP. (2007) Catastrophic and poverty impacts of health \npayments: Results from national household surveys in \nThailand. The Bulletin of the World Health Organization, \n85, 600-606. doi:10.2471/BLT.06.033720 \n[20] Mendola, M. (2007) The impoverishing effect of adverse \nhealth events: Evidences from Western Balkans. Policy \nResearch Working Paper No 4444. The World Bank, \nWashington. \n[21] Wagstaff, A. and van Doorslaer, E. (2003) Catastrophe \nand impoverishment in paying for health care: With ap-\nplications to Vietnam 1993-98. Health Economics, 12, \n921-934. doi:10.1002/hec.776 \n[22] O’Donnell, O., van Doorslaer, E., Rannan-Eliya, R., et al \n(2007) The incidence of public spending on health care: \nComparative evidence from Asia. World Bank Economic \nReview, 21, 93-123. doi:10.1093/wber/lhl009 \n[23] Navaneetham, K. and Dharmalingam, A. (2000) Utiliza-\ntion of maternal health care services in South India, Cen-\ntre for Development Studies. Trivendrum Working Papers \n307, Centre for Development Studies, Trivendrum. \n[24] National Sample Survey Organization (NSSO) (2006) \nMorbidity, health care and condition of the aged: NSSO \n60th round (January-June 2004). Ministry of Statistics and \nProgram Implementation, Government of India, New \nDelhi. \n[25] O’Donnell, O., Van Doorslaer, E., Wagstaff, A. and Lin-\ndelow, M. (2008) Analyzing health equity using house-\nhold survey data: A guide to techniques and their imple-\nmentation. The World Bank, Washington. \n[26] Ministry of Health and Family Welfare (MOHFW) (2006) \nJanani Surakhsha Yojana—Features and frequently asked \nquestions. Government of India.  \nhttp://jknrhm/PDF/JSR.pdf  \n \n",
    "Link": "https://core.ac.uk/download/29586457.pdf"
}