{
    "Title": "Advances in Nanomaterials Sciences and Nanotechnology for Sustainable Development: A Review",
    "Authors": "Assey, Gervas E., Malasi, Wilhelm S.",
    "Year": "No year available",
    "Abstract": "The fields of materials sciences have great opportunities to address the challenges of sustainable development of modern societies. The sub-disciplines of materials sciences of interest in this review are nanomaterials sciences and nanotechnology. Nanomaterials possess one external dimension measuring 1-100 nm. They have larger surface area for the same mass than their bulk materials. They are more reactive with effects on their electrical, optical and magnetic properties. Thus, nanomaterials are promising for sustainable development in the areas of energy, water, chemicals, electronics, medical and pharmaceutical industries, CO2 mitigation and agriculture. To this end, this review explores the advances in nanomaterials sciences, nanotechnology and the potential applications of nanomaterials for sustainable development. In this review, 73 peer reviewed articles and abstracts were retrieved. The review considered nanomaterials of carbon, inorganic materials, semiconductors, polymeric and lipid based materials. It has been found that nanomaterials sciences and nanotechnology is promising for potential applications in the areas of environmental remediation, energy, food, agriculture, industry, molecular biology, medicine and in pharmaceutical industries for sustainable development.\nKeywords: nanomaterials sciences, nanotechnology, sustainable developmen",
    "Keywords": "No keywords available",
    "Publisher": "'African Journals Online (AJOL)'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " Tanzania Journal of Science 47(4): 1450-1463, 2021   ISSN 0856-1761, e-ISSN 2507-7961 © College of Natural and Applied Sciences, University of Dar es Salaam, 2021  1450            http://tjs.udsm.ac.tz/index.php/tjs                 www.ajol.info/index.php/tjs/  Advances in Nanomaterials Sciences and Nanotechnology for Sustainable Development: A Review  Gervas E. Assey* and Wilhelm S. Malasi Department of Natural Sciences and Information Technology Faculty of Science, Mwenge Catholic University, P.O. Box 1226, Moshi, Tanzania E-mail addresses: gervas.assey@mwecau.ac.tz; wilhelm.malasi@mwecau.ac.tz *Corresponding author Received 21 Jun 2021, Revised 30 Sep 2021, Accepted 1 Oct 2021, Published Oct 2021 DOI: https://dx.doi.org/10.4314/tjs.v47i4.11  Abstract The fields of materials sciences have great opportunities to address the challenges of sustainable development of modern societies. The sub-disciplines of materials sciences of interest in this review are nanomaterials sciences and nanotechnology. Nanomaterials possess one external dimension measuring 1-100 nm. They have larger surface area for the same mass than their bulk materials. They are more reactive with effects on their electrical, optical and magnetic properties. Thus, nanomaterials are promising for sustainable development in the areas of energy, water, chemicals, electronics, medical and pharmaceutical industries, CO2 mitigation and agriculture. To this end, this review explores the advances in nanomaterials sciences, nanotechnology and the potential applications of nanomaterials for sustainable development. In this review, 73 peer reviewed articles and abstracts were retrieved. The review considered nanomaterials of carbon, inorganic materials, semiconductors, polymeric and lipid based materials. It has been found that nanomaterials sciences and nanotechnology is promising for potential applications in the areas of environmental remediation, energy, food, agriculture, industry, molecular biology, medicine and in pharmaceutical industries for sustainable development.  Keywords: nanomaterials sciences, nanotechnology, sustainable development.  Introduction Nanotechnology deals with materials in the size range of 1 to 100 nm. These materials display different properties such as electrical conductance, chemical reactivity, magnetism, optical effects and physical strength as compared to their bulk materials because of their small sizes (Nikalje 2015). Generally, nanoscience is defined as the study of the phenomena and manipulations of materials at atomic, molecular and macromolecular scales where the properties differ from those at larger scale and exhibit unique novel functional applications (Ravichandran 2010). The ideal nanomaterials that are required include less harmful to the environment, decompose or require less raw materials or energy to produce than the materials they are replacing (Hardcastle and Waterman-Hoey 2010). Lighter stronger steel, smaller and faster computers, more effective medicines, more Tanz. J. Sci. Vol. 47(4) 2021 1451 efficient solar panels and hydrogen fuel cells are among the products that can be generated using nanotechnology (Hardcastle and Waterman-Hoey 2010). With rising world population, increasing demand for safe water, crops, health care and energy, it is likely to stretch the available resources of the planet. Therefore, a sustainable model for the global development in order to fulfil needs of the future generation is inevitable (Torrisi 2012).  The science of nanomaterials plays key roles in tackling many of the sustainable development issues such as safe water supply and food decontamination as well as green technology (Torrisi 2012). Scientists working at the nanoscale are creating new tools and technologies to address some of the world’s biggest challenges including; smaller faster and more portable electronics with larger data storage capacity, medical devices and drugs to detect and treat diseases more effectively with low costs and less side effects, filters to provide clean and safe drinking water, stronger lighter and more durable materials, techniques to clean up hazardous chemicals in the environment, sensors to detect and identify harmful chemicals or biological agents (National Nanotechnology Initiative 2003). Nanotechnology has the potential to improve the environment both through direct applications of the nanomaterials to detect, prevent and remove pollutants as well as indirectly by using nanotechnology to design cleaner industrial processes and create environmentally responsible products (EPA 2007). The properties of nanomaterials greatly influence their interactions with biomolecules and cells due to their peculiar sizes, shapes, chemical compositions, surfaces, structures, charges, solubility and agglomeration (Nikalje 2015).  Because of new and emerging nanotechnology products, the need for experts in characterization methods for nanoscale materials such as describing size, shape and morphology and surface topography generally require the applications of different equipment than it would be in characterizing molecules (FDA 2007) Sustainable development is one of the most pressing issues today. It is a remarkable opportunity for practitioners in materials sciences and engineering because many of the approaches that are required to address these challenges are concerned with materials (Apelian 2012). The combination of biology and nanotechnology is expected to revolutionize biomedical research by exploiting novel phenomenon and physical, chemical and biological properties of materials present at the nanoscale (10–9 m) and systems through synthesis and control of matter at nanoscale levels and direct applications of the nanoscale materials to biological targets (Menaa 2011). This review summarizes the various nanomaterials advances and their applications in the areas of environment, energy, medicines, pharmaceuticals and agriculture for sustainable development.  Methodology Search criteria This work required a rigorous review of documents and literature materials including; online publications, academic domains and official publications that were obtained from the internet through Google, Google Scholar and PubMed. Selected studies were those which addressed nanomaterials sciences for sustainable development, applications of nanomaterials for environmental remediation, the utilization of nanoparticles and nanotechnology to address the challenges for sustainable development and of the applications of nanoparticles and nanotechnology in medicine, especially in the areas of therapeutics and diagnostics. Other studies chosen were those on the applications of nanomaterials in pharmaceutical sciences, nanomaterials for sustainable agriculture and in the electronic industry. Notwithstanding, studies on carbon dots, graphene quantum dots, inorganic quantum dots,  applications of nanotechnology in Assey and Malasi - Advances in nanomaterials sciences and nanotechnology … 1452 information and communications technology  and biotechnology were also selected.  Terms used in the search of the review materials The terms used in the search were: ‘materials science’, ‘nanomaterials science’, ‘nanotechnology’, ‘nano-filters’, ‘carbon nanotube’, ‘carbon based nanoparticles’, ‘metal oxide nanoparticles’, ‘metal nanoparticles’, ‘semiconductor nanoparticles’, ‘polymeric nanoparticles’, ‘lipid based nanoparticles’, ‘nanoparticles functionalization’, ‘immobilization’, ‘carbon dots’,‘graphene quantum dots’, ‘inorganic quantum dots’, ‘magnetic resonance imaging (MRI)’, ‘nanoscale sensor elements’, ‘biocompatibility’, ‘photo-catalysis’, ‘photo-stability’, ‘green technology’, ‘environmentally sound technology’, ‘green chemistry’, ‘sustainable development goals’, and ‘sustainable nanomaterials’.  Screened publications The total screened publications were 73. Among the studies identified, 20 publications reported on nanotechnology and the environment, 2 publications on nanotechnology and energy, 6 publications on nanomaterials and sustainable development, 2 publications on nanotechnology and its risks and opportunities, 6 publications on advanced nanomaterials and nanotechnology, one publication on nanotechnology applications in food and food industry, one publication on carbon dots, semiconductor quantum dots and inorganic quantum dots, 12 publications on nanomedicine, including gene delivery, therapeutics and diagnostics together with applications in cell and molecular biology, one publication on nanoparticles used in humidity sensing, one publication on mechanical, thermal, and dielectric properties of functionalized graphene oxide/polyimide nanocomposite films.   Results and Discussion The world’s challenges that require nanomaterials and nanotechnology interventions Some of the world’s challenges that require nanomaterials and nanotechnology interventions in order to achieve sustainable development  include; smaller faster and portable electronics with larger data storage, techniques to clean up hazardous chemicals in the environment, medical devices and drugs to detect and treat diseases more effectively with less side effects, low cost filters to provide clean drinking water, stronger lighter and more durable materials and sensors to detect and identify harmful chemicals and biological agents (National Nanotechnology Initiative n.d.). Some of the nanomaterials that are currently in use especially in the areas of cell and molecular biology include; liposomes which are model of cellular membranes, albumin nanoparticles, polymeric nanoparticles, iron oxide nanoparticles, gold nanoparticles and quantum dots (Wang and Wang 2014). Figure 1 shows some common types of nanostructured materials and Figure 2 presents different types of nanoparticles with their approximate sizes. Nanotechnologies entail a systematic synthesis, analysis (characterization) and applications of structures, molecular materials, inner surfaces with at least one critical dimension or with manufacturing tolerance typically below 100 nano-meters (Hessen Nanotech 2008). Nanoscience and nanotechnology constitute the knowledge and rational manipulations of materials at atomic and molecular levels, generally with structures less than 100 nm (Ravichandran 2010).  Figure 1: Some common types of nanostructured materials (Kulkarmi 2015). Tanz. J. Sci. Vol. 47(4) 2021 1453  Figure 2: Different types of nanoparticles with their approximate sizes (Rangasamy 2011).  Figure 3 shows some nanomaterials that are currently being utilized as building blocks in developing the next generation of sustainable products and technologies in water purification, energy generation, energy conversion and storage, greenhouse gas management and control, materials supply and utilization and green chemistry and manufacturing (Diallo et al. 2013). Metal oxide nanoparticles are promising as catalyst materials for water purification, particularly titanium dioxide (TiO2) nanoparticles have emerged as photo catalysts for water treatment that can serve both as oxidative and reductive catalysts for organic and inorganic pollutants (Diallo et al. 2013).  Applications of nanoparticles in environmental remediation Manganese oxide with various structures and morphologies currently enjoys applications in the fields of catalysis, electrochemical supercapacitors and adsorption. Adsorption method of MnO2 hollow nano-spheres (MHNSs) were prepared and then adsorption capacity of methyl orange (MO) onto the (MHNSs) was investigated by adjusting the pH, initial MO concentration and contact time. The results showed that, the thermodynamics analysis of the adsorption of MO on MHNSs was spontaneous and exothermic, an example of a physical process (Hu et al. 2019). Due to high surface areas and enhanced reactivity, nanoparticles offer a profound potential for remediation of various contaminants in the environment (Seqqat et al. 2019). Among many applications of nanotechnology of environmental implication is remediation of contaminated ground water by using nanoparticles containing zero-valent iron. This is one of the most prominent examples of rapidly emerging technologies with considerable potential benefits (Mansoori et al. 2008) Zero-valent iron removes aqueous contaminants by reductive de-chlorination in the case of chlorinated solvents or by reduction to an insoluble form in the case of aqueous metal ions. On the other hand, iron undergoes redox reactions with dissolved oxygen and water. Supported zero-valent iron nanoparticles with diameters between 10-30 nm were used for separation and immobilization of Cr(VI) and Pb(II) from aqueous solution through reduction of  Cr to Cr(III) and Pb to Pb(0) (Mansoori et al. 2008). Since fresh water sources are becoming scarce Assey and Malasi - Advances in nanomaterials sciences and nanotechnology … 1454 due to overconsumption and contamination, sea water has become the available option. Desalination by using carbon nanotubes membranes has the potential to reduce desalination costs. On the other hand, nano-filters could be used to remediate or clean up groundwater and surface water that are contaminated with chemicals and other hazardous substances (Mansoori et al. 2008). The risk associated with the nanoparticles is that some are toxic. They can enter the human body in various ways and reach the vital organs via the blood stream and cause damage OECD n.d.). It is important that the materials that are used for remediation of pollution are themselves not pollutants instead are biodegradable (Guerra et al. 2018). Nanotechnology is used in water treatment such as review of possible applications of nanoparticles/nano-filters for removal of pollutants from water and wastewater (Delgado et al. 2014). Among the advanced nanomaterials which are used for environmental remediation are the functional nanomaterials and nanocomposites. Different processes in the remediation protocol are: absorption, chemical reaction, photo-catalysis, adsorption and filtration. Figure 4 shows different contaminants that cause air pollution, water and soil and the different processes that have been used to remediate or remove the contaminants from these media. The possible contaminants in water as shown in Figure 4 are: bacteria, pesticides, heavy metals, solvents and oil, while the possible contaminants in soil are: food waste, chlorinated compounds and heavy metals and the possible contaminants in air are: CO2, NH3, carboxylic acids, NOx and aldehydes.  Figure 3: Nanomaterials that are used as building blocks in developing sustainable products (Diallo et al. 2013).  Tanz. J. Sci. Vol. 47(4) 2021 1455 The application of biodegradable materials is of great importance because they do not generate material waste to be disposed after the treatment process and could offer a greener and safe alternative for environmental remediation of pollutants (Delgado 2014). Green nanotechnology is referred to with other concepts such as green chemistry and green engineering and manufacturing. It aims at processes and products that are safe, energy efficient, less waste and lessen greenhouse gas emissions. Such processes and products rely on renewable materials and or are environmentally friendly (OECD 2013). The principles of green chemistry can be applied to produce safe and more efficient and suitable nano-manufacturing processes (OECD 2013).  Applications of nanomaterial science in energy In terms of energy supply, there must be a shift from fossil fuels to renewable energy sources which generate less greenhouse gases. With current technology, renewable sources of energy such as hydro-electricity, biofuels and geothermal energy will not be sufficient to meet the energy consumption needs of the world. Table 1 shows the future possibility of applying nano-structuring/nanotechnology in the energy sector (Hessen Nanotech 2008). This has been divided into five sectors, namely; chemical, optical, mechanical, electronic and thermal.    Figure 4: Environmental remediation approaches (Guerra et al. 2018).  Assey and Malasi - Advances in nanomaterials sciences and nanotechnology … 1456 Nevertheless, materials development are needed in nanostructured materials and advanced photovoltaic materials such as nano-crystalline silicon thin films and novel chalcogenides (Apelian 2012). The goals for global sustainable development report among others are achieving energy decarbonisation and universal access to energy. Nano-technology may be deployed to reduce non-renewable resources utilization and exploit and support ecosystem processes (Global Sustainable Development Report 2019). Nanomaterials are used in the construction industry to enhance energy and resource efficiency because of their unique characteristics (Nandekar and Rautdesai 2019). Nanotechnology offers great potential benefits in the way it extracts, develops, uses and dissipates materials.  It changes the flow, recovery and recycling of valuable resources especially the use of energy, transportation of people and goods and availability of safe and clean water (National Nanotechnology Initiative 2003).  Table 1: The future possibilities of applying nanostructured materials in energy sector (Hessen Nanotech 2008) Chemical Optical  More efficient catalysts in fuel cells or for the chemical conversions of fuels through extended surfaces and specific catalyst design.  More powerful batteries, accumulators and supercapacitors through higher specific electrode surfaces.  Optimized membranes with higher temperature and corrosion resistance for application in polymer electrolyte fuel cells or separators in lithium-ion-batteries.  Nanoporous materials for the storage of hydrogen, e.g. metal hydrides or metalorganic compounds.  Optimized light absorption properties of solar cells through quantum dots and nano-layers in stack cells.   Anti-reflection properties for solar cells to increase energy yield of solar cells.   Luminescent polymers for the production of energy-efficient organic light diodes. Mechanical Electronic  Improved strength of construction materials for rotor blades of wind power plants.  Wear-resistant nano-layers for drill probes, gear boxes and engine components.  Optimized separability of gas membranes for the separation and deposition of carbon dioxide from flue gases of coal-fired power plants.  Gas-tight polymer nanocomposites for the reduction of hydrocarbon emissions from vehicle tanks.  Optimized electron conductivity through carbon nanotubes and nano-structured superconductors.  Electric insulators through nano-structured filters in components of high-voltage power lines.   Enhanced thermos-electrical for more efficient power generation from heat through nano-structured layer systems. Thermal  Nano-structured heat protection layers for turbine blades in gas and aircraft turbines.  Improved heat conductivity of carbon nanotubes for optimized heat exchangers.  Optimized heat stores based on nano-porous materials (zeolites) or microencapsulated phase-change storage.  Nano-foams as super-insulation systems in building insulation which are capable of efficiently minimizing the convective heat transport even at small thickness of the insulation layer, due to the nano-porous structure.      Tanz. J. Sci. Vol. 47(4) 2021 1457 Nanotechnology will continue to be increasingly used in a number of fields like energy technology, information and communication technology or biotechnology (Fleischer and Grunwald 2008). Nanotechnology allows for manipulation of individual atoms and molecules to create materials, devices and systems with enhanced physical properties such as light and stronger steel, smaller and faster computers, more efficient solar panels, hydrogen fuel cells and more efficient medicines (Hardcastle and Waterman-Hoey 2010). Nanotechnology consumes less energy, reduces material wastes and helps in monitoring (Zhang et al. 2011). Nanomaterials can be used for solar cells, namely utilization of nanostructures graphene thin films as electron transfer layer in dye–sensitized solar cells (Delgado et al. 2014).   Quantum and carbon dots There are three types of quantum dots, namely; graphene (GQD), metal oxide quantum dots such as (ZnO and TiO2) and inorganic quantum dots (ZnO-PbS, ZnSe, CdSe and CuInS/ZnS) (Gayen et al. 2019).  Carbon dots (CD) on the other hand are carbonaceous nanomaterials that were discovered accidentally but are drawing much attention as new nano-sized fluorescent particles. CD are biocompatible non-toxic photo-stable and easily functionalized with photo-luminescent and water solubility.  They are used in cell imaging, catalysis, electronics, bio-sensing, power and targeted drug delivery (Gayen et al. 2019, Boakye-Yiadom et al. 2019). They have good conductivity and are environmentally friendly. They have additional advantage over the other well recognized quantum dots (Boakye-Yiadom et al. 2019). Quantum dots differ in properties from large particles due to quantum mechanics. Their properties are intermediate between bulk and discrete atoms. The absorption spectra of these particles are very broad and the emission is confined to a narrow band. They emit bright colours, have long life times and high efficiency. Carbon-based quantum dots consisting of graphene quantum dots (GQDs) and carbon quantum dots (CQDs, C-dots or CDs) are a new class of carbon nanomaterials with sizes below 10 nm. These materials have superior biological properties such as low toxicity, and good bio-compatibility, which make them potential for applications in bio-imaging, bio-sensing and biomolecular/drug delivery (Wang and Hu 2014). Figure 5 above shows carbon quantum dots (CQDs) which have unique properties and great potential in biomedicine, optronics, catalysis and sensors. Their outstanding electronic properties such as electron donors and acceptors, causing chemi-luminescence and electrochemical luminescence make them to have wide potential applications in optronics, catalysis and sensors (Wang and Hu 2014).  Figure 5: CQDs with unique properties have great potential in biomedicine, optronics, catalysis and sensors (Wang and Hu 2014). Assey and Malasi - Advances in nanomaterials sciences and nanotechnology … 1458 Nanotechnology in food, agriculture and industry Nanotechnology in food industry is used in two forms in nano-food applications; food additives or nano-inside and food packaging or nano-outside.  Nano-food additives may be used to influence product shelf life, texture, flavour, nutrient composition or even detect food pathogens and provide functions as food quality indicators (Ravichandran 2010). In the food packaging context, nanotechnology is mainly considered to be of use to increase product shelf life, indicate spoilt ingredient and increase product quality (Ravichandran 2010). Direct applications of nanotechnology in agriculture include; delivery of agrochemicals and nutrition, pesticides and nano-fertilizers. For instance, the applications of nano-fertilizers facilitate slow and steady release of nutrients and thereby reducing the loss of nutrients while enhancing nutrients application efficiency (Abobatta 2018).  Nanotechnology is highly suitable for applications in agricultural production as it increases the quality and quantity of yields. It reduces soil, water and air pollution by agrochemicals and thus makes agriculture more sustainable (Bakker et al. 2017). A schematic representation of the applications of nanotechnology in agriculture is shown in Figure 6 (Duhan et al. 2017). Nanotechnology is widely used in industry for the manufacture of scratch proof eyeglasses, crack resistant paint, transparent sunscreens, stain repellent fabrics, self-cleaning windows and ceramic coatings for solar cells.  Nanoparticles applications in cell molecular biology and in medicine Some of the applications of nanomaterials in biology are: fluorescent biological labels, bio-detection of pathogens, drug and gene delivery, detection of proteins, probing of DNA structure tissue engineering, tumour destruction via heating (hyperthermia), separation and purification of biological molecules and cells, MRI contrast enhancement and phago-kinetic studies (Salata 2004). Nanomedicine is the science and technology of diagnosing, treating and preventing diseases and traumatic injury, relieving pain and preserving and improving human health using molecular tools and molecular knowledge of human body.   Figure 6: A schematic representation of nanotechnology applications in agriculture (Duhan et al. 2017). Tanz. J. Sci. Vol. 47(4) 2021 1459 In general, the purpose of nanomedicine is defined as the comprehensive monitoring, control, construction, repair, defence and improvement of all human biological system working from molecular level by using engineered devices and nanostructures ultimately to achieve medical benefits (ESF/EMRC 2004).  Nanoparticles are used in doing delivery due to their small sizes and large surface areas. Drug nanoparticles show the increase in solubility and enhance bioavailability. They have additional ability to cross the blood brain barrier (BBB) and enter the pulmonary system where they are absorbed through the light function of epithelial cell of the skin (Kohane 2007). The advantages of nanoparticles which are used as drug carriers include:  high stability, high carrier capacity, they can incorporate both hydrophilic and hydrophobic and have variable routes of applications such as inhalation and oral applications. One of the nanomaterials that are used for drug delivery are the carbon nanotubes (CNTs) displayed in Figure 7. Carbon nanotubes (CNTs) are organic nanoscale molecules compatible with living organism tissues and can be used in a variety of applications as carriers of drugs in appropriate positions inside the human body (Valavanidis and Vlachogianni 2016). CNTs can be functionalized with bioactive peptides, proteins, nucleic acids and drugs, and are used to deliver their cargos to cells and organs (Valavanidis and Vlachogianni 2016). They are less toxic and are not immunogenic.  Figure 7: Polymer coating of carbon nanotubes (CNTs) as potential drug delivery system (Valavanidis and Vlachogianni 2016).  Another emerging highly branched polymer molecules which can be used for drug delivery are dendrimers. These show high ratios of surface groups to molecular volume which make them promising synthetic vectors for gene delivery (Valavanidis and Vlachogianni 2016). Figure 8 shows a dendrimer as highly branched polymeric nanomaterial.  Figure 8: Dendrimers as highly branched polymeric nanomaterial as potential drug and gene delivery system (Valavanidis and Vlachogianni 2016).  In medicine, nanomaterials are designed which interact at cellular level. They interact at molecular level with living cells and tissues (Zaib and Iqbal 2019). Novel nanotechnology methods have been used to deliver DNA and small interfering RNAs into biological systems through the so called gene therapy (Riley II and Vermerris 2017). By definition, gene therapy refers collectively to the methods aimed at influencing gene expression in living organisms through delivery of integrated or non–integrated exogenous DNA or RNA to treat or prevent diseases (Riley II and Vermerris 2017). Nanoparticles can have unique physical and chemical properties, such as biomolecular functionalization for detection of biomolecules and cells. They can be applied for gene delivery, diagnostics, imaging, molecular diagnosting and therapeutics (Valavanidis and Vlachogianni 2016). Nanotechnologies provide the methods by which biological information can be acquired easily, quickly and inexpensively analysed and then enormously increase the possibilities of preventive medicine (Krukemeyer et al. 2015).  Assey and Malasi - Advances in nanomaterials sciences and nanotechnology … 1460 Therapy and diagnostics are increasingly fused into the new specialist medical field of theranostics because the nanotechnology and medicine serve the diagnostics and the therapeutics purposes simultaneously (Krukemeyer et al. 2015). Nanomaterials are used for tissue repair and replacement, implant coatings, tissue regeneration, structural implant materials, bone repair, bio-resource-able materials, implantable materials (sensory aids, retina implants), surgical aids, operation tools and in smart instruments (Rangasamy 2011). In tissue engineering for example in bone implant, it was demonstrated that by creating nano-sized features on the surface of the hip or knee prosthesis one could reduce the chances of rejection as well as to stimulate the production of osteoblasts cells responsible for the growth of the bone matrix and are found on the advancing surfaces of developing bone (Salata 2004). Renovated medicine aims at fixing or replacing deteriorated tissues and organs by using nanotechnology materials and equipment.  Nano-medicine allows the capability to treat diseases from inside the cell and at the cellular and molecular levels (Radwan 2018). The production of nanoscale biosensors and drug delivery system based on carbon nanotubes has been driven by the fact that biological species such as proteins and enzymes can be immobilized either in the hollow tube cavity or on the surface of the carbon nanotube. Nanoparticles or nano-porous particles can functionalize organic groups that maybe used as biomarkers, tracers and drug delivery systems for the treatment of cancer (Menaa 2011). Tumour cells can be imaged in-vitro or in–vivo by magnetic resonance imaging (MRI) using nano-particles as contrasting agents (Menaa 2011).  Synthesis, analysis and applications of nanoparticles Ferric oxide nanostructures such as nanowires, nano-belts, nano-flowers and other special nanostructures have been synthesized by using different techniques (Srivastava et al. 2017). The above researchers have synthesized nanostructured ferric oxides (A and B) via chemical vapour precipitation method by using two different precipitation agents, namely ammonium hydroxide and sodium hydroxide. X–ray diffraction proved the formation of ferric oxide crystallite sizes of materials A and B being 40 and 18 nm, respectively.  Nanostructured material B showed good sensitivity and less hysteresis and reproducibility (Srivastava et al. 2017). The drawback associated with the nanostructure metal oxide materials is that their applications lead to environmental pollution with nanoparticles. The “smart” nanomaterials include light weight graphene structures, carbon-metal nano-hybrid, self-assembly nano-architectures, and stimuli responsive polymeric materials to shape controlled inorganic nano-particles (Palchoudhury et al. 2020). These new nanomaterials have catalyzed new innovations in flexible electronics, drug delivery, catalysis, environmental remediation and sustainable agriculture (Palchoudhury et al. 2020). Various morphologies of TiO2 nanostructures can be prepared using different methods such as sol–gel method, hydrothermal, chemical vapour deposition, electro-deposition and physical vapour deposition. Rashad et al. (2019) fabricated TiO2 nanoparticles with morphologies ranging from sphere, rods, fibres, tubes, sheets and interconnected architecture by using the methods such as electron spinning, templating and hydrothermal. They used the titanate nanowires and nano-sheets with different morphologies in photo-catalytic degradation of crystal violet an industrial synthetic dye and studied their efficiency with respect to different morphologies. Tao et al. (2019) prepared 3-D magnetic graphene ball (MGB) material by using cellulose as carbon source. The prepared 3–D MGB nanoparticles were investigated for removal of oil from water Tanz. J. Sci. Vol. 47(4) 2021 1461 which demonstrated outstanding adsorption performance and excellent recyclability. The size of the nanoparticles ranged between 20–30 nm.   Like viruses, nanomaterials can be transported by endocytosis into cells where they can cause acute or long term harm. Information about morphology, particle size distribution, crystal structures and surface properties (specific surface area, surface chemistry and charge) is also required in order to properly interpret the behaviour and effects of nano-materials into the environment (Packroff et al. 2016). Several biodegradable materials such as liposomes, polymeric nanoparticles and dendrimers have been used as ‘’smart’’ carriers that can controllably release pharmaceutical drugs in aqueous solution up on the structural degradation triggered by various chemical factors such as pH (Chen et al. 2013). In producing polymeric nanomaterials, block copolymers are produced by sequential addition of monomers into a living materials and polymerization are characterized by a reactive chain end (e.g. carbocation, organo-metallic complex) and then lack of side reaction (e.g. chain termination or chain transfer) during growth of polymer chain (Geckeler and Nishile 2010).  Conclusion The reviewed studies have shown that advances in nanomaterials science and nanotechnology have potential applications in solving some of the challenges of sustainable development. The major challenges of the sustainable development that can be solved by using nanomaterials and nanotechnology include; promotion of sustainable agriculture in order to reduce soil, water and air pollution caused by agrochemicals, the applications of nano-fungicides, nano-herbicides and nano-fertilizers for efficient utilization of micronutrients in plants. Another challenge is the availability and sustainable management of safe and clean water from contaminated and polluted water sources. Nano-filter membranes can be used to remove contaminants and hazardous chemicals and obtain safe and clean water suitable for drinking. In order to obtain affordable, sustainable and modern energy, nanomaterials can enable manufacturing of more efficient solar panels and hydrogen fuel cells. Other challenges with potential solution by using these technologies include; combating climate change and its impacts by using nanomaterials to remove the greenhouse gases from the environment that cause climate change, drug delivery and diagnostics in medical fields, nano-sensing, nano-imaging and food packaging and preservation. The properties that make these materials to be superior to the bulk materials are their small sizes and higher surface area per unit mass compared to that of bulk materials. Due to their small sizes and large surface areas, dry nanoparticles show increased solubility and enhance bioavailability (Kohane 2007).  Acknowledgments  Authors acknowledge the enormous help obtained from the authors whose articles are cited and included in this work.   Conflicts of interest: No conflict of interest.  References Abobatta WF 2018 Nanotechnology application in agriculture. Acta Sci. Agric. 2(6): 99-102.  Apelian D 2012 Materials science and engineering’s pivotal role in sustainable development for the 21st century. MRS Bulletin 37: 318-323. Retrieved from www.mrs.org/bulletin. DOI:10.1017/mrs2012.53. Bakker T, Brauers E, Van Der Elst G and Wangari E 2017 Nanotechnology in Agricultural Production. UN Policy Analysis Branch, Division for Sustainable Development. Boakye-Yiadom KO, Kesse S, Opoku-Damoah Y, Filli M, Aquib M, Joelle MMB, Farook MA, Mavlyanova R, Raza F, Bavi R and Wang B Assey and Malasi - Advances in nanomaterials sciences and nanotechnology … 1462 2019 Carbon dots: Application in bioimaging and theranostics. Int. J. Pharm. 564: 308-317. Chen S, Zhang Q, Hu Y, Zhang J and Liang X 2013 Nanomaterials in medicine and pharmaceutical nanoscale materials development with less toxicity and more efficacy. Eur. J. Nanomed 5(2): 61-79. Delgado JMPQ, Öchsner A and de Lima AGB 2014 Nanotechnology for energy and environment. Advances in Materials Science and Engineering 2014. Diallo MS, Fromer NA and Jhon MS 2013 Nanotechnology for sustainable development: Retrospective and outlook. In: Nanotechnology for Sustainable Development (pp. 1-16). Springer, Cham. Duhan JS, Kumar R, Kumar N, Kaur P, Nehra K and Duhan S 2017 Nanotechnology: The new perspective in precision agriculture. Biotechnol. Rep. 15: 11-23. EPA 2007 Nanotechnology white paper. Office of the Science Advisor, Science Policy Council, Washington, DC 20460. Available at www.epa.gov/osa. ESF/EMRC 2004 Forward look on nanomedicine consensus conference, LeBischenberg, 8-10 November. FDA 2007 A Report of the Nanotechnology Task Force Public Health service, Department of Health and Human Services, Rockville, MD 20857. July 25. Fleischer T and Grunwald A 2008 Making nanotechnology developments sustainable. A role for technology assessment? J. Cleaner Prod. 16: 889-898. Gayen B, Palchoudhury S and Chowdhury J 2019 Carbon dots: A mystic star in the worth of nanoscience. J. Nanopart. 2019. Geckeler KE and Nishile H (Eds) 2010 Advanced Nanomaterials. Wiley-VCH VerlagGmbH & Co. KGaA, Weinheim.Volume1, Germany. Global sustainable Development Report (GSDR) 2019 The future is now. Science for Achieving Sustainable Development. United Nations, New York. Guerra FD, Attia MF, Whitehead DC and Alexis F 2018 Nanotechnology for environmental remediation materials and applications. Molecules 23(7): 1760. Hardcastle A and Waterman-Hoey, S 2010 Advanced manufacturing sustainability and workforce development pilot study. Washington State University Extension Energy Program (WSUEEP 0-018). Hessen Nanotech 2008 Application of nanotechnologies in the energy sector. Hessian Ministry of Economy, Transport Urban and Regional development. Available at www.hessen-nanotech.de. Hu X, Zhang F, Wang H, Zhang X and Zhang L 2019 Synthesis of MnO2, hollow nano-spheres through selective etching method as an effective adsorbent to remove  methyl orange (MO) from aqueous solution. J. Nanopart. 2019. Kohane DS 2007 Micro-particles and nanoparticles for drug delivery. Biotechnol. Bioeng. 96(2): 203-209. Krukemeyer MG, Krenn V, Hnebber W and Resch R 2015 History and possible uses of nanomedicine based on nanoparticles and nanotechnological progress. J. Nanomed. Nanotechnol. 6: 336. Kulkarmi SK 2015 Nanotechnology: principles and practices. 3rd Edition, Springer International Publishing, Cham, Switzerland with Capital Publishing Company. New Delhi, India. Mansoori GA, Bastami RT, Ahmadpour A and Eshaghi Z 2008 Environment application of nanotechnology. Ann. Rev. Nano Res. 2(2): 439493. Menaa B 2011 The Importance of Nanotechnology in Biomedical Sciences. J Biotechnol Biomaterial 1:105e. doi:10.4172/2155-952X.1000105e Nandekar UP and Rautdesai R 2019 Nanotechnology innovations in construction industry and environmental sustainability. Int. J. Innovat. Technol. Exploring Eng. 8(11S): DOI: 10.35940/ijitee.K1055.09811S19 National Nanotechnology Initiative (NNI) 2003 Nanotechnology and the environment report of Tanz. J. Sci. Vol. 47(4) 2021 1463 the National Nanotechnology Initiative (NNI) workshop, May 8-9, 2003. National Nanotechnology Initiative (NNI), (n.d). Nanotechnology. Big things from a tiny world available at: www.nano.gov Alexandria, VA, USA. Nikalje AP 2015 Nanotechnology and its application in medicine. Med. Chem. 5(2): 081-089. OECD 2013 Nanotechnology for green innovation science. Technology Industry, Policy PapersNo.5. http://dx.doi.org/10.1787/5k450q9j8p8q-en. OECD n.d. Alliance centre for technology. Paris, France and Munches, Germany Eds: Dr. Christoph Lauterwasser. Alliance Centre for Technology. Packroff R, Volker D, Mutz D, Bresch H and Bosse H (Eds) 2016 Review of the joint research strategy of the higher federal authorities: Nanomaterials and other advanced materials. Application Safety and Environmental Compatibility. Palchoudhury S, Aich N and Zhou Z 2020 Advances in smart nanomaterial: Environmental perspective.Journal of Nanomaterials 2020. Radwan FAA 2018 Nanotechnology and medicine. Mater. Sci. Nanotechnol.  2(2): 7-8. Rangasamy M 2011 Nanotechnology: A review. J. Appl. Pharm. Sci. 1(2): 8-16. Rashad S, Zaki AH and Farghali AA 2019 Morphological effect of titanate nanostructure on the photocatalytic degradation of crystal violet dye. Nanomaterials and Nanotechnology 9(1): 1-10. Ravichandran R 2010 Nanotechnology applications in food and food processing: Innovative green approaches opportunities for Global market. Int. J. Green Nanotechnol. Phys. Chem. 1(2): 72-96. Riley II MK and Vermerris W 2017 Recent Advance in nanomaterials for gene delivery: A review. Nanomaterials 7: 94. Salata OV 2004 Applications of nanoparticles in biology and medicine. J. Nanobiotechnol. 2(1): 1-6. Seqqat R, Blaney L, Quesada D, Kumar, B and Cumbal L 2019 Nanoparticles for environment engineering and nanomedicine. J. Nanotechnol. 2019. Srivastava R, Sing S and Verma N 2017 Experimental investigation on humidity sensing of nanostructure of ferric oxide. Adv. Nanomater. 1(1): 16-21. Tao T, Li G, He Y and Yang X 2019 3-D magnetic graphene balls as sorbents for cleaning oil spills. Nanomater.Nanotechnol. 9: 1-7. Torrisi A 2012 Nanotechnology for Sustainable Development. Angle Journal. Retrieved from http://anglejournal.com/article/2012-10-nanotechnology-for-sustainable-development/ A version of this article was originally published in A Global Village, Issue 8 in October 2012. Valavanidis A and Vlachogianni T 2016 Engineered nanomaterial for pharmaceutical and biomedical products new trends benefits and opportunities. Pharm. Bioprocess 4(1): 13-24. Wang Y and Hu A 2014 Carbon quantum dots: synthesis, properties and applications. J. Mater. Chem. C  2(34): 6921-6939. Wang EC and Wang AZ 2014 Nanoparticle and their application in cell and molecular biology. Integ. Biol (Camb}. 6(1): 9-26. doi:10.1039/c3ib40165k. Zaib S and Iqbal J 2019 Nanotechnology: Application techniques approaches and advances in toxicology and environmental impact of engineered nanomaterials, MedDocs Publishers, LLC. Zhang B, Misak H, Dhanasekaran PS, Kalla D and Asmatulu R 2011 Environmental impacts of nanotechnology and its products. Proceedings of the 2011, Midwest Sections Conference of the American society for Engineering.   ",
    "Link": "https://core.ac.uk/download/487601486.pdf"
}