{
    "Title": "Gene Therapy for Cardiovascular Disease",
    "Authors": "Baker, Andrew H., Denby, Laura, Dishart, Kate L., Work, Lorraine M.",
    "Year": "No year available",
    "Abstract": "The last decade has seen substantial advances in the development of gene therapy strategies and vector technology for the treatment of a diverse number of diseases, with a view to translating the successes observed in animal models into the clinic. Perhaps the overwhelming drive for the increase in vascular gene transfer studies is the current lack of successful long-term pharmacological treatments for complex cardiovascular diseases. The increase in cardiovascular disease to epidemic proportions has also led many to conclude that drug therapy may have reached a plateau in its efficacy and that gene therapy may represent a realistic solution to a long-term problem. Here, we discuss gene delivery approaches and target diseases",
    "Keywords": "No keywords available",
    "Publisher": "Hindawi Publishing Corporation",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "© 2003 Hindawi Publishing Corporation\nJournal of Biomedicine and Biotechnology • 2003:2 (2003) 138–148 • PII. S1110724303209086 • http://jbb.hindawi.com\nREVIEW ARTICLE\nGene Therapy for Cardiovascular Disease\nKate L. Dishart, Lorraine M. Work, Laura Denby, and Andrew H. Baker∗\nBHF Blood Pressure Group, Department of Medicine and Therapeutics, University of Glasgow,\nWestern Inﬁrmary, Glasgow G11 6NT, UK\nReceived 5 June 2002; accepted 19 July 2002\nThe last decade has seen substantial advances in the development of gene therapy strategies and vector technology for the treatment\nof a diverse number of diseases, with a view to translating the successes observed in animal models into the clinic. Perhaps the\noverwhelming drive for the increase in vascular gene transfer studies is the current lack of successful long-term pharmacological\ntreatments for complex cardiovascular diseases. The increase in cardiovascular disease to epidemic proportions has also led many\nto conclude that drug therapy may have reached a plateau in its eﬃcacy and that gene therapy may represent a realistic solution to a\nlong-term problem. Here, we discuss gene delivery approaches and target diseases.\nINTRODUCTION\nGene transfer enables the overexpression of candidate\ntherapeutic genes either locally or systemically. Cardio-\nvascular disease targets under investigation include ther-\napeutic angiogenesis in ischaemic myocardium and limb\nmuscles, treatment of hypertension, vascular bypass graft\nocclusion, and prevention of postangioplasty restenosis\n(Table 1). Cardiovascular diseases are diverse and as such\nhave unique traits requiring precise tailoring of gene ther-\napystrategiestoaparticulardisease.Thosefeatureswhich\nmay vary include mode of delivery, type of vector, length\nof gene expression, and target tissue. Unlike other inher-\nited genetic defects which may require more long-term\ngene transfer, transient, nonintegrative gene expression\nhas been shown to be suﬃcient to promote neovascular-\nizationinthecaseofangiogenesis[1].Thismayalsoapply\nto antiproliferative strategies for the prevention of neoin-\ntima formation postangioplasty, for the prevention of in-\nstent restenosis, or for gene therapy of coronary artery by-\npass graft failure [2, 3]. However, complex diseases with\nsubstantial polygenic inﬂuences such as essential hyper-\ntension will require sustained gene overexpression.\nSTRATEGIES FOR GENE DELIVERY\nThe breadth of applications for vascular gene ther-\napy is accompanied by a need to deliver the therapeutic\ngene(s) to diverse vascular cell types including vascular\nsmoothmuscle(SMC),endothelium,myocardium,ortis-\nsues that inﬂuence lipid metabolism. Vector systems and\ngene delivery technologies must therefore be developed\nfor individual applications. The four main modes of in-\ntroducing therapeutic genes into the vasculature are ex\nvivogene transfer to vessel segments and gene delivery us-\ning cell-based, systemic, and local delivery approaches.\nExvivogenetherapy\nWhere appropriate, ex vivo genetic modiﬁcation of\nvascular tissue is preferred as this allows the delivery of\ntherapeutic genes to the target tissue in a safe and eﬃcient\nmanner. This is the method of choice for gene therapy of\nvein graft failure. During coronary artery bypass surgery\n(CABG), there is direct access to the vein in the clinical\nsetting, enabling incubation and subsequent transduction\nwith the vector before grafting. In this way, systemic re-\nlease of the vector is avoided therefore decreasing poten-\ntial deleterious transgene expression at distal sites. Addi-\ntionally, the immune system response to the virus is di-\nminished, since at the time of grafting all excess virus has\nbeen removed.\nCell-basedgeneticmodiﬁcation\nCell-based gene therapy involves the harvesting of\ncells from patients, ex vivo transduction to express\ntherapeutic genes, and subsequent reimplantation of\ngenetically-modiﬁed autologous cells. There have been\nvery few studies of this kind. Perhaps the best example of\nthis approach is the ex vivo approach used by Grossman et\nal [4] to treat familial hypercholesterolaemia. They trans-\nduced hepatocytes with retroviruses expressing a wild-\ntype copy of low density lipoprotein receptor (LDL-R).\nUpon reimplantation, a reduction in the total cholesterol\nlevel from 671 to 608 was observed for one year [4]. De-\nspite the partial success of this approach, there has been\nlittle enthusiasm for this cell-based strategy. In a diﬀer-\nentapproach,injuredratcarotidarterieswereseededwith2003:2 (2003) Gene Therapy for Cardiovascular Disease 139\nTable 1. Gene therapy strategies for the treatment of cardiovascular diseases.\nDisease Therapeutic approach Target\nAtherosclerosis Antiatherogenic LCAT, apoAI, apoE mRNA\nVein graft failure, Diﬀusable/secreted gene products VEGF, FGF, eNOS, antithrombotic\nischaemia, thrombosis agents, SOD, heme oxygenase\nVein graft failure Inhibitors of smooth muscle cell p53, TIMPs, Rb, p21\nmigration/proliferation\nThrombosis Prevention of thrombus formation TFPI, tPA\nRestenosis Suicide genes Tk\nHypertension Antisense oligonucleotides Angiotensinogen, AT1 receptor, ACE\nVein graft failure Decoys Soluble VCAM, E2F\nHypertension Reduction in blood pressure Kallikrein, ANP, eNOS, endothelin\nSMCs overexpressing the tissue inhibitor of matrix metal-\nloproteinase (TIMP)-1, a signiﬁcant decrease in neointi-\nmal hyperplasia was observed conﬁrming that this tech-\nnique can be used to exploit a biological eﬀect [5].\nLocalgenedeliveryinvivo\nAs many target vascular tissues are inaccessible by sys-\ntemic vector administration, such as the ischaemic my-\nocardium or atherosclerotic coronary arteries, local deliv-\nery devices have achieved substantial attention and de-\nvelopment as means of delivering vectors in a safe, se-\nlective, and eﬃcient manner. Catheter design has rapidly\nevolved since its ﬁrst attempts at arterial wall gene trans-\nfer [6]. Delivery catheters can be used under X-ray ﬂu-\noroscopy guidance for gene delivery and by means of a\ncontrast medium, only the lumen of the vessel is vis-\nible. Development of this process using magnetic res-\nonance imaging (MRI) will provide valuable informa-\ntion on the vessel wall structure and interactions be-\ntween genes and atherosclerotic lesions [7]. Another ex-\nample of localised vascular gene transfer is by the use of\nstents [8]. Stents are commonly used devices that provide\nas c a ﬀold structure to hold diseased arteries open. This\ncan be exploited as a medium through which to deliver\ngenes. Although stents have provided an eﬀective treat-\nment for stenotic saphenous aortocoronary bypass grafts,\nprocedure-related complications have been observed in\n20% of cases [9]. A recent study in a pig model demon-\nstrated stable in vivo transgene expression in the vascula-\nture over a 4-week period from a ﬁbronectin-coated stent\nplatform seeded with green ﬂuorescent protein (GFP)\ntransduced autologous SMC [10]. However, adherence of\ncells to stent surfaces under ﬂow conditions is particularly\npoor with certain cell types such as endothelial cells [11].\nStents designed with a distal-embolic protection device in\nconjunction with a covering of therapeutic genes could\nbe used to prevent adverse coronary events. A wide array\nof mechanical devices for gene delivery have been investi-\ngated for local gene therapy and include double balloon,\nchannel balloon, and hydrogel coated catheters, microp-\norous coated stents, microspheres, and nipple catheters\n(for review see [12]).\nSystemicgenedelivery\nFollowing in vivo administration of viral vector sys-\ntems, liver sequestration predominantly occurs, preclud-\ning eﬃcient vascular gene delivery through this route of\nadministration[13,14].Duetotheeﬃcientuptakeofsys-\ntemically administered vectors by the liver, cardiovascular\ngenetherapeuticstrategiesarelimitedforthismodeofde-\nlivery due to the inadequacies in vector technology. How-\never,thelivercanbeusedtomodifylipidmetabolism[15]\nor as a factory through which to ﬂood the bloodstream\nwith soluble therapeutic proteins. Systemic gene therapy\nhas been explored for the treatment of hypercholestero-\nlaemia and hypertension (for review see [16]). As an ex-\nample, systemic injection of adenovirus-apoE into the tail\nvein of atherosclerotic apoE−/− mice caused an immediate\nfall in plasma cholesterol levels and a sustained reduction\nin atherosclerosis [15].\nVECTORS FOR GENE THERAPY\nViralvectors\nSuccessful gene therapy requires the fulﬁlment of sev-\neralcriteria,namely,theappropriatetherapeuticgeneand\nmost importantly a suitable vector for delivery and sub-\nsequent eﬃcient expression of the transgene. The ideal\ngene transfer vector should be nonpathogenic, eﬃciently\ntransduce target cells, and elicit a minimal immuno-\ngenic response whilst providing the required time in vivo.\nAt present, no single viral vector fulﬁls all the criteria\nfor use in cardiovascular gene therapy and the advan-\ntages/disadvantages of each are summarised in Table 2.\nExamples of the therapeutic use of vectors are given in the\nrelevant section describing cardiovascular disease.\nThe vast majority of gene transfer studies, not just\nthose pertaining to cardiovascular diseases, have focussed140 Kate L. Dishart et al 2003:2 (2003)\nTable 2. Key features of gene therapy viral vectors.\nViral vectors Integration Long-term gene Immune response Comments\nexpression\nAdenovirus −− +\nBroad tropism, easy to produce high titre stocks,\nwidely characterised in vivo\nAdeno-associated\n++ − Limited cloning capacity, nonpathogenic, integrate\nvirus (AAV) randomly in the absence of the rep gene\nLentivirus ++ − Retrovirus-derived, pseudotyping with heterologous\ncoat proteins improves biosafety\nRetrovirus + + − Only infects dividing cells\non the use of adenoviruses. Adenovirus (Ad) is by far the\nmost commonly applied and well characterised of the ex-\nisting viralvectorsfromanexperimentalorclinicalstand-\npoint. Indeed, of all ongoing gene therapy clinical tri-\nals almost 28% can be attributed to Ad-based protocols\nwithlessthan8%treatingvasculardisorders(http://www.\nco.uk/genmed). Ad-mediated gene therapy is dependent\non the level of the coxsackie-adenovirus receptor (CAR)\nand integrins (αvβ3 and αvβ5) expressed on the target cell\n(Figure 1a). In the context of the cardiovascular system,\nAd infection levels are relatively low when compared to\nthe hepatic system, however, many successful gene ther-\napy applications have been documented using local de-\nlivery to target tissue and clinical trials are ongoing [12].\nAd can be produced to a high titer and will infect both\nnondividing and dividing cells. However, Ad can result in\na marked inﬂammatory and immunogenic response lim-\niting gene expression, which remains relatively transient\nbut can be overcome with gutless Ad vectors [15].\nThelastfewy earsha v eseenanincr easeinstudieswith\nadeno-associated virus (AAV)-based vectors and conse-\nquently AAV has emerged as an important vector system\nfor gene therapy. rAAV is a replication-defective virus that\nis unable to replicate without a helper virus (Figure 1b). It\ncan be stripped of its viral genes to allow a virus coat that\ncanbepackagedwithatransgenecassetteofupto4.5kbp.\nUnlike other viral vectors, AAV has the ability to integrate\ninto the genome therefore allowing long-term expression\nof the transgene, although in nondividing cells it appears\nthat rAAV vectors can exist as high-molecular weight epi-\nsomal DNA [17]. wtAAV integrates stably into chromo-\nsome 19 [18]h o w e v e r ,r A A Vv e c t o r sd on o ts p e c i ﬁ c a l l y\nintegrate at this site as rep protein is required to produce\nt h i ss i t es pe c i ﬁ c i ty[ 19]. This problem can be overcome by\ninserting a truncated rep protein, which allows the rAAV\nto restore its ability to integrate at the chromosome 19 site\n[20].SingleintramuscularinjectionofAAV-LacZ intoim-\nmunocompetent mice produced detectable expression for\nmore than 1.5 years without any evidence of a cellular im-\nmune response [21]. The lack of immunogencity of AAV\nis an important feature of the vector and gives it a major\nadvantage over adenoviruses (Table 2).\nNonviralvectors\nOfthecardiovasculartrialsrunningin2001,47%used\neither plasmid DNA or liposome carriers [1]. One ap-\nproach involves the use of synthetic antisense oligonu-\ncleotides, designed to attenuate detrimental proteins [22].\nCis-elementdouble-strandedoligodeoxynucleotides (also\nknown as decoys) have been employed to modulate gene\nexpression through the removal of trans-acting factors\nfrom endogenous cis-elements [23]. This is not only a\npowerful gene therapy strategy but also enables the study\nof endogenous gene regulation both in vitro and in vivo.\nFor the cardiovascular system, ultrasound can enhance\ngene therapy of naked plasmid DNA and has been shown\nto increase biological eﬀects of therapeutic genes such as\np53 [24]. Gene transfer of recombinant human VEGF\ncDNA in a rabbit model of arterial balloon injury led\nto reendothelialization which was 95% complete within\n1w e e k[ 25]. In turn, intimal thickening and the occur-\nrence of thrombotic occlusion were diminished with an\nassociated restoration in endothelial cell-dependent va-\nsomotor reactivity. The treatment of peripheral vascu-\nlar disease has seen the intramuscular injection of plas-\nmid DNA encoding vascular endothelial growth factor\n(VEGF) to increase collateral vessel development and tis-\nsue perfusion in the muscle [26]. Importantly, in a clin-\nical trial using ex vivo E2F decoy oligodeoxynucleotide\ntransfection of human vein grafts, Mann et al [42]h a v e\nshown this strategy to reduce proliferation and hence\nthe occurrence of vein graft occlusion. In addition, no\nclinical complications were associated with the proce-\ndure.\nCARDIOVASCULAR DISEASE TARGETS\nFOR GENE THERAPY\nMany diseases aﬀecting the cardiovascular system are\namenable to gene therapy protocols. Indeed, success has\nbeen achieved experimentally. Here, we brieﬂy review\nthe therapeutic strategies relating to the treatment of is-\nchaemia, late vein graft failure, atherosclerosis, thrombo-\nsis, and hypertension.2003:2 (2003) Gene Therapy for Cardiovascular Disease 141\nAd 5\nEC Hepatocytes\nCAR\nαvβ3/5 integrins\n(a)\nAAV-2\nEC Hela\nHSPG\nFGFR1\nαvβ5 integrins\n(b)\nFigure 1. (a) Adenoviral (Ad) attachment and internalisation is mediated through the knob protein of the ﬁber binding to CAR,\nfollowed by interaction of the penton base at the base of the ﬁber shaft with αv integrins on the cell surface. Following internalisation,\nthe virus is localised within cellular endosomes which upon acidiﬁcation allows the virions to escape and traﬃc to the nucleus. Ad-\nmediated infection is therefore, dependent on levels of CAR with hepatocytes being highly permissive as shown with reasonable levels\nof transduction in endothelial cells (EC). (b) AAV2 binds to the primary receptor heparin sulfate proteoglycan (HSPG) on the cell\nsurface and internalization is assisted by the secondary receptors αvβ5 integrins and ﬁbroblast growth factor receptor 1. Transduction\nof vascular cell, in particular EC, is very poor compared with permissive cell types such as HeLa. Transduction of both cell types with\nrAAV2-eGFP clearly shows the diﬀerence in transduction eﬃciency.\nIschaemia\nPeripheral ischaemic diseases are commonly associ-\nated with the lower extremities and can be character-\nized by an impaired blood supply resulting from nar-\nrowed or blocked arteries, which subsequently starve tis-\nsues of the necessary nutrients and oxygen. Similarly, in-\nadequate blood ﬂow to the heart gives rise to myocar-\ndial ischaemia. This may occur if coronary ﬂow is reduced\nby the presence of an atherosclerotic plaque, a blood clot\nor an artery spasm. Surgical bypassing and percutaneous\nrevascularization have alleviated many of the symptoms\nbut is not suitable for all patients due to the extension of\narterial occlusion and microcirculation impairment. Am-\nputation and heart transplants are the only forms of treat-\nment for ischaemia and therefore gene therapy provides\nan alternative solution [27, 28]. The two main therapeutic\ngenes under investigation are the angiogenic growth fac-\ntors (VEGF) and ﬁbroblast growth factor (FGF). Research\nhas focused on delivering these agents to the site of is-\nchaemia (Table 1). VEGF is a heparin binding glycopro-\ntein, which is a principal angiogenic factor for endothe-\nlial cells. The delivery of VEGF to target cells lends it-\nself to gene transfer since it is naturally secreted from\ncells and therefore can achieve its biological eﬀect with\na limited number of transfected cells (Figure 2). Gow-\ndak et al [29] demonstrated that intramuscular injec-\ntion of AdVEGF121 resulted in signiﬁcant lengthening of\narterioles and capillaries of nonischaemic limbs in the\nrat and rabbit. Furthermore, tissue perfusion in animals\nreceiving gene delivery two weeks prior to experimen-\ntal induction of skeletal muscle ischaemia by removal\nof the femoral artery was preserved [29]. Clinically, Ad-\nmediated transfer of VEGF has been demonstrated to im-\nprove the endothelial function and to lower the extremity\nﬂow reserve in patients with peripheral arterial disease.\nIn this case, AdVEGF121 was delivered intramuscularly142 Kate L. Dishart et al 2003:2 (2003)\n(1) In vivo virus\nadministration\n(2) Angiogenic growth factor\nproduction and binding to receptor\n(3) EC\nactivation/proliferation\n(4) ECM remodelling\n( 5 )C o l l a t e r a lv e s s e lg r o w t h\nVEGF\nVEGF\nFigure 2. Angiogenesis in the ischaemic myocardium. Diseased\nor injured tissues produce and release angiogenic growth factors\nthat diﬀuse into nearby tissues. To boost concentration of these\ngrowth factors, such as VEGF, viruses engineered to express one\nof the 19 existing angiogenic growth factors can be injected into\nthe ischaemic area [1]. The angiogenic growth factors bind to\nspeciﬁc receptors located on the endothelial cells (EC) of nearby\npreexisting blood vessels [2]. Activation of EC by VEGF occurs\nupon binding to its receptors [3]. Synthesis of new enzymes is\ntriggered. These enzymes dissolve tiny holes in the sheath-like\ncovering (basement membrane) surrounding all existing blood\nvessels.Theendothelialcellsproliferateandmigrateoutthrough\nthe dissolved holes of the existing vessel [3]. Extracellular ma-\ntrix (ECM)-degrading enzymes dissolve the tissue in front of\nthe sprouting vessel tip [4]. As the vessel extends, the tissue is\nremoulded around the vessel and proliferating endothelial cells\nroll up to form a blood vessel tube [5]. Blood vessel loops are\nformed from individual blood vessel tubes and these are stabi-\nlized by the formation of SMC.\nand endothelial function determined 30 days postinjec-\ntion [30].\nIn a phase-I clinical trial involving a group of 21 pa-\ntients given AdVEGF121 by direct myocardial injection\nintotheischaemicregion,noadverseeﬀectsweredetected\nlocally or systemically. Furthermore, angiography sug-\ngested an improvement in the area where the vector\nhad been delivered and patients described alleviation in\nangina symptoms [31]. More recently, the AGENT trial\nhas addressed the safety and anti-ischaemic eﬀects of ad-\nministering Ad-FGF4 in patients suﬀering from angina.\nSingle intracoronary infusion of Ad-FGF4 was shown\nto result in improved exercise times assessed using the\nexercise treadmill test compared to the placebo group\nand no adverse side eﬀects [32]. A single intramuscular\ninjection of AAV-VEGF has been shown in the rat is-\nchaemic hindlimb model to produce an increase in cap-\nillary growth, a signiﬁcant increase in mean blood ﬂow of\nthe ischaemic limb, and a higher average skin tempera-\nture [33]. An intracardiac injection of AAV-VEGF165 has\nalso been shown to induce angiogenesis in the ischaemic\nmyocardium without any evidence of angioma formation\n[34].\nAlthough VEGF has positive eﬀects on the promotion\nof angiogenesis, there are pertinent safety considerations.\nIt has been shown that VEGF may enhance atheroscle-\nrotic plaque development through an increase in focal\nmacrophage levels [35]. Macrophages then induce those\ngrowth factors and cytokines, which mediate intimal hy-\nperplasia and contribute to plaque instability through\nenhancing levels of matrix metalloproteinases (MMPs)\nand other hydrolytic enzymes. Other potential risks of\ntherapeutic angiogenesis include the production of non-\nfunctional, leaky vessels, and stimulation of angiogene-\nsis in tumours [36]. Animal studies in mice highlight the\nneed for regulated expression of VEGF as persistent un-\nregulated VEGF expression following intraventricular in-\njection resulted in the formation of intramural vascular\ntumours at the site of myoblast implantation [37]. The\ndevelopmentoftissue-speciﬁcvectorsandpromotersmay\nhelp to minimise the risks from these adverse reactions.\nProtectionfromreperfusioninjury\nReperfusion of ischaemic myocardium resulting from\ndissolution of the blockage by clinical intervention, may\nin turn further injure the damaged tissue as a result of\nreperfusion injury. Reperfusion leads to oxidative stress in\nthe tissue and hence may itself require intervention. Hy-\npoxic regulatable elements and overexpression of agents,\nwhich scavenge free radicals or reduce oxidative stress,\nhavebeentargetedusinggenetherapyprotocols(Table 1).\nTo produce long-term myocardial protection Melo et al\n[38] used AAV to deliver the cytoprotective heme oxy-\ngenase gene by intramyocardial injection into rat hearts.\nThey found that eight weeks after administration of the\nAAV-hHO-1 when acute coronary artery ligation was per-\nformed the treated rats had a dramatic reduction in my-\nocardialinfarctionsize[38].Phillipsetal[39]alsodevised\na cardioprotective strategy using a “vigilant vector” AAV\nconstruct.Thisinvolvesaheartspeciﬁcpromoter,MLC2v,\nwhich only expresses mRNA in the heart. The vector also\nincludes a hypoxia regulatory element (HRE) which can\nact as an “on” switch so that production of the trans-\ngene antisense AT1R only occurs when ischaemia is de-\ntected. This would result in long-term protection of car-\ndiac function during bouts of ischaemia [39]. In an acute\nmodel of oxidative stress, the eﬀects of expression of su-\nperoxide dismutase (SOD) from adenoviral vectors was\ninvestigated [40]. High doses of Ad-SOD3 (3 × 1010 pfu)\nresulted in a 3-fold elevation of serum SOD activity\nand was protective against hepatic ischaemia-reperfusion\ninjury.\nLateveingraftfailure\nAs one of the most commonly performed surgical\nprocedure at some 400,000 cases worldwide each year,\ncoronary artery bypass grafts (CABG) are eﬀective at re-\nlieving symptoms of angina and prolong life for those pa-\ntients with multiple vessel disease. Vein grafts are inserted\ninto the arterial circulation and undergo a sequence of2003:2 (2003) Gene Therapy for Cardiovascular Disease 143\nTIMP-3\nControl\nCaspase\nactivation\nDeath receptors\n(b) Apoptosis\nECM\nTIMP-3\n(a) Migration\nCollagenases\nStromelysins\nGelatinases\nMMPs MT-MMPs\nActive MMPs Matrix proteolysis\nand cell migration\nFigure 3. Gene therapy by overexpression of TIMP-3. Following Ad-mediated gene delivery to vascular smooth muscle cells, TIMP-3\nis secreted and is found located with the extracellular matrix (ECM). From here, TIMP-3 is available to exert two distinctly dif-\nferent phenotypes through its metalloproteinase inhibitory eﬀects. (a) Matrix metalloproteinases (MMPs, including collagenases,\nstromelysins, gelatinases, and membrane-type metalloproteinases [MT-MMPs]) are upregulated following vascular injury. TIMPs,\nthrough their native MMP inhibitory activity, are able to bind to and retard pro-MMP-to-active enzyme conversion and combined\nwith the ability to block active MMP activity, matrix proteolysis and hence cell migration is inhibited [45]. (b) TIMP-3, uniquely\namongst the TIMP family, is also able to promote smooth muscle cell death through death receptor-induced caspase activation and\ninduction of apoptosis [46]. Micrographs courtesy of Mark Bond, Bristol Heart Institute, UK.\nadaptive physiological changes. Early thrombotic occlu-\nsion occurs in 10% of grafts with patency rates of 50%\nover 10 years due to the onset of intimal thickening and\natheromas [3]. Early thrombosis occurs in the ﬁrst few\nweeks after grafting, particularly at the distal anastomosis\ndue to vessel wall injury. Drug treatments include aspirin\nand other antiplatelet agents, which reduce but do not\neliminate early occlusions but are often associated with\nhemorrhagic side eﬀects. Late vein graft failure is char-\nacterized by progressive medial thickening and neointima\nformation. Therefore, vein graft failure limits the clinical\nsuccess of coronary bypass grafting in terms of symptoms\nand mortality.\nRemodelling of the vascular wall by MMPs promotes\nSMC migration and proliferation, ultimately leading to\nneointima formation and a narrowing of the vessel lu-\nmen [3]. The main therapeutic targets in the context of\nlate vein graft failure are those aﬀecting SMC migration\nand proliferation. Vein graft lends itself ideally to gene\ntherapy, as there is a clinical therapeutic window whereby\nsurgically prepared vein can be genetically modiﬁed prior\nto grafting. Many candidate therapeutic target genes have\nbeen studied experimentally with the aim to prevent the\nformation of neointimal lesions associated with late vein\ngraft failure (Table 1) .S M Cp r o l i f e r a t i o na n dm i g r a t i o n\nand matrix degradation are integral to lesion formation\nand hence, among those classes of gene investigated are\nantiproliferative, proapoptotic, antiinﬂammatory, or an-\ntimigratory agents (for review see [41]).\nThe PREVENT clinical trial [42] aimed to assess the\neﬃcacy of intraoperative gene therapy in patients receiv-\ningbypassveingrafts.Byblockadingthecelltranscription\nfactor E2F with decoy oligodeoxynucleoties at the time of\ngrafting, they were able to signiﬁcantly reduce the inci-\ndence of post-operative occlusion. E2F upregulates up to\na dozen cell cycle genes and its inhibition inhibits target\ncell cycle gene expression and DNA synthesis. The success\nof this trial in reducing bypass graft failure in a high risk\ncohort underlines the important role that gene therapy\ncould play in the prevention of vein graft failure.\nMMPs have been shown to be an integral part of\nneointima formation, and overexpression of the naturally\noccurring tissue inhibitors of MMPs (TIMPs) is a possi-\nble approach. Ad-mediated transfer of TIMPs has been\nd e m o n s t r a t e di nan u m b e ro fm o d e l so fv e i ng r a f tf a i l -\nure. In a mouse model, local delivery of Ad-TIMP-2 was\nfound to reduce vein graft diameter [43]. In contrast, us-\ning the pig saphenous vein-carotid artery interposition\ngraft model, George et al [46] demonstrated that while\nAd-mediated TIMP-2 delivery was ineﬀective at reduc-\ning vein graft neointima formation, TIMP-3 had a pro-\nfound inhibitory eﬀect on lesion formation (Figure 3).\nThis was attributed, in part, to its proapoptotic eﬀect in\nthe medial and neointimal layers. Encouragingly, the re-\nsults from the porcine model were translated into a hu-\nman ex vivo model of vein graft failure with an 84% re-\nduction in neointima formation following local delivery\nof Ad-TIMP-3 [46]. Similarly, TIMP-1 was also shown to144 Kate L. Dishart et al 2003:2 (2003)\nhaveaninhibitoryeﬀectonlesionformationinthismodel\n[47].\nEndothelialnitricoxidesynthase(eNOS)isimportant\nto vascular homeostasis and plays a vasoprotective role\nby inhibiting platelet and leukocyte adhesion, inhibiting\nSMC proliferation and migration, and in turn promot-\ning endothelial survival. Local eNOS delivery would, in\ntheory, arrest the proliferative response to vascular injury.\nNitric oxide (NO) bioactivity is substantially reduced\npostbypass graft surgery whilst levels of NO scavenging\nsuperoxide are increased. It is therefore likely that the loss\nof NO may contribute to vascular remodelling events in\nthe vein graft [48]. West et al [49] showed that Ad-nNOS\ngene transfer in a rabbit vein graft model favourably af-\nfected vein graft remodelling by inhibiting the early in-\nﬂammatorychangesandreducinglateintimalhyperplasia\n[49]. They observed an increase in NOS activity, a reduc-\ntion in adhesion molecule expression and inﬂammatory\ncell inﬁltration, and a reduction in basal superoxide gen-\neration.\nTargeting SMC proliferation has also been shown to\nbe eﬀective using gene therapy protocols. In a rabbit\nmodel of vein grafting, Ad-mediated expression of a con-\nstitutively active form of the retinoblastoma gene prod-\nuct(Ad∆Rb)reducedneointimaformationfourweeksaf-\nter surgery by 22% [50]. In the human saphenous vein\nm o d e lo fv e i ng r a f t ,t a r g e t i n gS M Cb yo v e r e x p r e s s i o no f\nwild-type p53 both induced apoptosis and inhibited SMC\nmigration resulting in a reduction in lesion formation\n[51]. Likewise, overexpression of C-type natriuretic pep-\ntide, which inhibits SMC growth by Ad resulted in accel-\neratedgraftre-endothelialisationandreducedthrombosis\nand neointima formation [52] .K i b b ee ta l[ 53] inhibited\nintimal hyperplasia in porcine vein grafts by incubation\nwith Ad-iNOS for 30 minutes prior to surgery. This eﬀect\nwas sustained up to 21 days postgrafting [53]. While these\nstrategies all show short-term eﬀects, long-term studies\nare fundamentally important owing to the long-term na-\nture of bypass graft failure.\nThrombosis\nDefects in the vessel wall, namely, endothelial cell dys-\nfunction can result in a reduction of antithrombotic ac-\ntivity leading to clot formation. The two main groups of\nanti-thrombotic genes are those with antiplatelet or anti-\ncoagulant activity. Prostacylin (PGI2), nitric oxide (NO)\nand thrombin inhibitors all act through the inhibition of\nplatelet adhesion and aggregation, in conjunction with\nthe prevention of vascular SMC proliferation and vaso-\nconstriction. The anti-thrombotic treatment, tissue plas-\nminogen activator (tPA), which has anticoagulant prop-\nerties and is used to lyse existing clots, may be a use-\nful therapeutic gene for antithrombotic therapy (Table 1).\nThe short half-life of tPA could be overcome with sus-\ntained overexpression from a gene therapy vector. Other\nanticoagulant gene products include hirudin, thrombo-\nmodulin, antistasin and, tissue factor pathway inhibitor\n(TFPI). Hirudin is perhaps the most potent inhibitor of\nthrombin, the enzyme responsible for ﬁbrinogen cleav-\nage, platelet activation, and SMC proliferation [54]. The\nadvantage of local expression of antithrombotic thera-\npeutic genes is that not only is thrombolysis promoted\nat speciﬁc sites in the artery, but also the side eﬀects of\nthe conventional anticoagulant are avoided. Clinical con-\nditions amenable to antithrombotic gene therapy include\nCABG, percutaneous transluminal coronary angioplasty,\nperipheral artery angioplasty, and intravascular stenting.\nIntravascular clot formation is a major cause of acute\nmyocardial infarction and contributes to the majority of\nsudden deaths in patients with coronary artery disease.\nSuccessful thrombolysis for acute thrombosis is depen-\ndent on prompt treatment and delays in vector admin-\nistration and expression of antithrombotic factors sug-\ngests that antithrombotic gene therapy is more likely to\nplay a role in the prevention of reocclusion and chronic\narterial narrowing. Cyclo-oxygenase-1 (COX-1), the rate\nlimiting enzyme in the synthesis of PGI2,w a so v e r e x -\npressed by local delivery of Ad to porcine carotid arteries\nimmediately postangioplasty. This was shown to increase\nthe levels of PGI2 and, in turn, inhibit thrombosis in in-\njured vessels [55]. By manipulating the coagulation cas-\ncade integral in thrombus formation, a number of posi-\ntive gene therapy studies have been reported. In a rabbit\nstasis/injury model of arterial thrombosis, local overex-\npression of thrombomodulin using Ad was assessed. In\naddition to reducing thrombosis, the vector did not in-\nduce inﬂammatory damage at the site of delivery [56].\nWork by the same group targeting tissue-type plasmino-\ngenactivator(tPA)alsodemonstratedeﬀectiveprevention\nof thrombus formation [57]. Local gene transfer of TFPI\ninto rabbit carotid arteries using an Ad vector prior to\nexperimental thrombosis induction completely inhibited\nthe formation of thrombi without aﬀecting systemic co-\nagulation status [58]. Similar data were described in the\nporcine carotid artery model following local delivery of\nAd-TFPI [59].\nAtherosclerosis\nDue to the complexity and interplay of genetic and\nenvironmental factors in the development of atheroscle-\nrosis, it is unlikely that localized gene therapy will be a\nuseful approach in the primary prevention of the disease.\nIneﬃcient intravascular gene transfer eﬃciency through\natherosclerotic lesions and lipid-rich atheromas has been\nattributed to the very low numbers of transfectable cells\nand the high connective tissue content [60]. An exten-\nsive list of therapeutic genes exists for the treatment of\natherosclerosis including LDL- or VLDL-receptor gene\ntransfer to overcome LDL-receptor eﬃciency, a major in-\nherited genetic defect and a determinant of atheroscle-\nrosis. Patients with defective enzymes vital for lipopro-\ntein metabolism such as lipoprotein and hepatic lipases\nwould beneﬁt from gene transfer of DNA producing the\ncorrect enzymes. A reduction in the level of atherogenic2003:2 (2003) Gene Therapy for Cardiovascular Disease 145\napolipoprotein (apo) B100 is possible after gene trans-\nfer of the apoB mRNA editing enzyme, whilst lipoprotein\nA could be lowered with synthesis inhibiting ribozymes.\nApolipoprotein AI (apoAI) and lecithin-cholesterol acyl-\ntransferase (LCAT) are important factors in the removal\nof excess cholesterol and the subsequent reduction in the\nincidence of atherosclerotic lesions (Table 1). Through in\nvitro bicistronic expression of these two genes from AAV\nplasmid vectors, it was shown that increased synthesis of\napoAI and LCAT could play a role in reducing atheroscle-\nrotic risk [61].\nTheapoE−/− transgenicmouseisawell-establishedex-\nperimental model for atherosclerosis as it develops severe\nhypercholesterolaemia and atherosclerotic lesions similar\nto humans. Harris et al (2002) found that they could de-\ntect apoE mRNA in the muscle from a single intramus-\ncular injection into the apoE−/− mouse, but could not\ndetect circulating recombinant apoE in the plasma [62].\nHowever circulating antibodies were detected against the\nhuman apoE. The most signiﬁcant ﬁnding of this study\nwas three months after administration of the AAV-apoE\nthey found a signiﬁcant reduction (approximately 30%)\nin atherosclerotic plague density in the aortas of treated\nanimals compared to the controls. These results suggest\nthat only low levels of apoE are required to produce pro-\ntection against atherosclerosis.\nAttenuation of lesion development has been demon-\nstrated using Ad-mediated overexpression of heme\noxygenase-1 [63], TIMP-1 [64], platelet-activating factor\nacetylhydrolase (PAF-AH)—the enzyme responsible for\nthe inactivation of PAF [65] and apoE itself, administered\nintravenously [66]. Of particular signiﬁcance, Kim et al\n[15] recently described the lifetime correction of hyperc-\nholesterolaemia in apoE−/− mice following a single intra-\nvenousinjectionofahelper-dependentAdvector.Follow-\nup of 2.5 years old mice demonstrated 100% coverage of\ntheaortawithatheroscleroticplaquesincontrolmicewith\nalmost no lesion development in treated animals [15].\nHypertension\nSystemic hypertension is a common multifactorial\ndisorder primarily manifesting itself as chronic high\nblood pressure and is a major risk factor for atheroscle-\nrosis, peripheral vascular disease stroke, and many other\ncomplications associated with structural damage to the\ncardiovascular system. Drugs for controlling high blood\npressure are eﬀective over a 24-hour period, are nonspe-\nciﬁc and cause side eﬀects. It is well established that the\nhyperactive renin-angiotensin system (RAS) is a key fac-\ntor in primary hypertension and gene therapy strategies\nhave concentrated on those genes in the RAS controlling\nregulation of blood pressure.\nDue to its multifactorial nature, gene therapy for hy-\npertension has yet to be demonstrated clinically. Many\ngene therapy interventions have, however, been employed\nsuccessfullyinthelaboratory(forreview,see[67,68,69]).\nTargeting elements involved in the oxidative stress path-\nways (Table 1), Alexander et al [70] and Fennell et al [71]\nhave demonstrated an improvement of endothelial func-\ntion in the SHRSP with local delivery of Ad-eNOS [70]\nor Ad-extracellular SOD [71]. Angiotensin II-induced\nhypertension and accompanying endothelial dysfunction\nwere studied by Nakane et al [72]. Gene transfer of Ad-\neNOS but not SOD (copper/zinc or extracellular SOD)\nwasshowntorestoreendothelialfunction exvivoinaortic\nringsfromtreatedrabbits[72].Ad-eNOSdeliveryintothe\nrostral ventrolateral medulla of SHRSP and WKY rats re-\nsulted in a signiﬁcant reduction in blood pressure in both\nrats [73]. A continuous supply of tissue kallikrein by a\nsingle intramuscular injection of Ad produced a signif-\nicant delay of elevated blood pressure for ﬁve weeks in\nthe SHR [74]. An increase in vasodilator proteins such as\nkallikrein, eNOS, and atrial natriuretic peptide (ANP) in\nanimal models has correlated with a reduction in blood\npressure [75].\nAntisense targeting angiotensinogen and the an-\ngiotensin type-1 (AT1) receptor attempted to decrease\nthose genes responsible for vasoconstriction [76]. AAV-\nplasmids have been used to deliver antisense AT1-R to\nSHR rats [76]. They showed that a single intracardiac in-\njection was suﬃcient to reduce blood pressure by 30mm\nHg when compared to the controls over a ﬁve-week pe-\nriod [76]. The eﬀect of AAV-AGT-AS on the development\nof hypertension in SHR rats has also been examined. The\nrats were injected with AAV-AGT-AS ﬁve days after birth\nas the development of hypertension in SHR rats com-\nmences between the eighth and tenth week after birth.\nA signiﬁcant slowing of the development of hypertension\nfor six months was observed but there was no complete\ninhibition of the rise in blood pressure [77].\nTHE FUTURE OF GENE THERAPY IN THE TREATMENT\nOF CARDIOVASCULAR DISEASE\nDue to the complexity of cardiovascular disorders, a\nmajor stumbling block may be the identiﬁcation of the\nbest gene to treat the disease. It is most likely that a cock-\ntail of therapeutic genes rather than a single particular\ngene will be the most eﬀective treatment of certain car-\ndiovascular diseases such as hypertension and atheroscle-\nrosis. In order for gene therapy to become a reality in\nthe cardiovascular clinic, eﬀective therapeutic genes and\nsuitable vectors must be identiﬁed and developed. Results\nfrom the ﬁrst clinical trials have indicated that vascular\ngene transfer is not only safe but may have therapeutic\nbeneﬁts when administered intravascularly or intramus-\ncularly.\nREFERENCES\n[1] Isner JM, Vale PR, Symes JF, Losordo DW. Assess-\nment of risks associated with cardiovascular gene\ntherapy in human subjects. Circ Res. 2001;89(5):\n389–400.146 Kate L. Dishart et al 2003:2 (2003)\n[2] Kingston PA, Sinha S, David A, Castro MG, Lowen-\nstein PR, Heagerty AM. Adenovirus-mediated gene\ntransfer of a secreted transforming growth factor-β\ntype II receptor inhibits luminal loss and constric-\ntive remodeling after coronary angioplasty and en-\nhances adventitial collagen deposition. Circulation.\n2001;104(21):2595–2601.\n[3] Baker AH, Mehta D, George SJ, Angelini GD. Pre-\nvention of vein graft failure: potential applications\nfor gene therapy. Cardiovasc Res. 1997;35(3):442–\n450.\n[4] Grossman M,RaderDJ,MullerD,et al.Apilot study\nof ex vivo gene therapy for homozygous familial\nhypercholesterolaemia. Nat Med. 1995;1(11):1148–\n1154.\n[5] Forough R, Koyama N, Hasenstab D, et al. Over-\nexpression of tissue inhibitor of matrix metallopro-\nteinase-1 inhibits vascular smooth muscle cell func-\ntions in vitro and in vivo. Circ Res. 1996;79(4):812–\n820.\n[6] Nabel EG, Plautz G, Nabel GJ. Site-speciﬁc gene ex-\npression in vivo by direct gene transfer into the arte-\nrial wall. Science. 1990;249(4974):1285–1288.\n[7] Yang X, Atalar E, Li D, et al. Magnetic resonance\nimaging permits in vivo monitoring of catheter-\nbased vascular gene delivery. Circulation. 2001;\n104(14):1588–1590.\n[ 8 ]K l u g h e r zB D ,J o n e sP L ,C u iX ,e ta l .G e n ed e l i v -\nery from a DNA controlled-release stent in porcine\ncoronaryarteries.Nat Biotechnol.2000;18(11):1181–\n1184.\n[9] Baim DS, Wahr D, George B, et al. Randomized\ntrial of a distal embolic protection device during\npercutaneous intervention of saphenous vein aorto-\ncoronary bypass grafts. Circulation. 2002;105(11):\n1285–1290.\n[ 1 0 ]P a n e t t aC J ,M i y a u c h iK ,B e r r yD ,e ta l .At i s s u e -\nengineered stent for cell-based vascular gene trans-\nfer. H u mG e n eT h e r . 2002;13(3):433–441.\n[11] Vassalli G, Dichek DA. Gene therapy for arterial\nthrombosis. Cardiovasc Res. 1997;35(3):459–469.\n[12] Yla-Herttuala S, Martin JF. Cardiovascular gene\ntherapy. Lancet. 2000;355(9199):213–222.\n[13] JaﬀeHA,DanelC,LongeneckerG,etal.Adenovirus-\nmediated in vivo gene transfer and expression in\nnormal rat liver. Nat Genet. 1992;1(5):372–378.\n[14] Koeberl DD, Alexander IE, Halbert CL, Russell DW,\nMiller AD. Persistent expression of human clotting\nfactor IX from mouse liver after intravenous in-\njection of adeno-associated virus vectors. Proc Natl\nAcad Sci USA. 1997;94(4):1426–1431.\n[15] Kim IH, Jozkowicz A, Piedra PA, Oka K, Chan L.\nLifetime correction of genetic deﬁciency in mice\nwith a single injection of helper-dependent aden-\noviral vector. Proc Natl Acad Sci USA. 2001;98(23):\n13282–13287.\n[16] Ponder KP. Systemic gene therapy for cardiovascular\ndisease. Trends Cardiovasc Med. 1999;9(6):158–162.\n[17] Flotte TR, Aﬁone SA, Zeitlin PL. Adeno-associated\nvirus vector gene expression occurs in nondividing\ncells in the absence of vector DNA integration. Am J\nRespir Cell Mol Biol. 1994;11(5):517–521.\n[18] Kotin RM, Siniscalco M, Samulski RJ, et al. Site-\nspeciﬁc integration by adeno-associated virus. Proc\nNatl Acad Sci USA. 1990;87(6):2211–2215.\n[ 1 9 ]Y o u n gS MJ r ,M c C a r t yD M ,D e g t y a r e v aN ,S a m u l s k i\nRJ. Roles of adeno-associated virus Rep protein and\nhuman chromosome 19 in site-speciﬁc recombina-\ntion. JV i r o l . 2000;74(9):3953–3966.\n[20] Rinaudo D, Lamartina S, Roscilli G, Ciliberto G, To-\nniatti C. Conditional site-speciﬁc integration into\nhumanchromosome19byusingaligand-dependent\nchimericadeno-associatedvirus/Repprotein.JV irol.\n2000;74(1):281–294.\n[21] Xiao X, Li J, Samulski RJ. Eﬃcient long-term gene\ntransfer into muscle tissue of immunocompetent\nmice by adeno-associated virus vector. JV i r o l . 1996;\n70(11):8098–8108.\n[22] Phillips MI, Wielbo D, Gyurko R. Antisense inhi-\nbition of hypertension: a new strategy for renin-\nangiotensin candidate genes. Kidney Int. 1994;46(6):\n1554–1556.\n[23] Morishita R, Aoki M, Kaneda Y. Oligonucleotide-\nbased gene therapy for cardiovascular disease: are\noligonucleotide therapeutics novel cardiovascular\ndrugs? Curr Drug Targets. 2000;1(1):15–23.\n[24] Taniyama Y, Univ O, Jsapan S, et al. Local delivery\nof naked plasmid DNA of p53 gene into rat bal-\nloon injured carotid artery using low voltage ultra-\nsound with contrast microbubbles (optison): devel-\nopment of novel non-viral transfection system into\nblood vessels. Circulation. 2000;102(suppl II):II–164\nabstract.\n[25] Asahara T, Chen D, Tsurumi Y, et al. Accelerated\nrestitutionofendothelialintegrityandendothelium-\ndependent function after phVEGF165 gene transfer.\nCirculation. 1996;94(12):3291–3302.\n[26] Tsurumi Y, Takeshita S, Chen D, et al. Direct in-\ntramuscular gene transfer of naked DNA encoding\nvascular endothelial growth factor augments collat-\neral development and tissue perfusion. Circulation.\n1996;94(12):3281–3290.\n[27] Losordo DW, Vale PR, Symes JF, et al. Gene ther-\napy for myocardial angiogenesis: initial clinical re-\nsults with direct myocardial injection of phVEGF165\nas sole therapy for myocardial ischemia. Circulation.\n1998;98(25):2800–2804.\n[28] Baumgartner I, Pieczek A, Manor O, et al. Consti-\ntutive expression of phVEGF165 after intramuscular\ngenetransferpromotescollateralvesseldevelopment\nin patients with critical limb ischemia. Circulation.\n1998;97(12):1114–1123.\n[29] GowdakLH,PoliakovaL,WangX,etal.Adenovirus-\nmediated VEGF121 gene transfer stimulates angio-\ngenesis in normoperfused skeletal muscle and pre-\nserves tissue perfusion after induction of ischemia.\nCirculation. 2000;102(5):565–571.2003:2 (2003) Gene Therapy for Cardiovascular Disease 147\n[30] Rajagopalan S, Shah M, Luciano A, Crystal R, Nabel\nEG. Adenovirus-mediated gene transfer of VEGF121\nimproves lower-extremity endothelial function\nand ﬂow reserve. Circulation. 2001;104(7):753–\n755.\n[31] Rosengart TK, Lee LY, Patel SR, et al. Angiogenesis\ngene therapy: phase I assessment of direct intramy-\nocardial administration of an adenovirus vector ex-\npressing VEGF121 cDNA to individuals with clini-\ncally signiﬁcant severe coronary artery disease. Cir-\nculation. 1999;100(5):468–474.\n[32] Grines CL, Watkins MW, Helmer G, et al. Angio-\ngenic Gene Therapy (AGENT) trial in patients with\nstable angina pectoris. Circulation. 2002;105(11):\n1291–1297.\n[33] Shimpo M, Ikeda U, Maeda Y, et al. AAV-mediated\nVEGF gene transfer into skeletal muscle stimu-\nlates angiogenesis and improves blood ﬂow in a\nrat hindlimb ischemia model. Cardiovasc Res. 2002;\n53(4):993–1001.\n[34] Su H, Lu R, Kan YW. Adeno-associated viral vector-\nmediated vascular endothelial growth factor gene\ntransfer induces neovascular formation in ischemic\nheart. Proc Natl Acad Sci USA. 2000;97(25):13801–\n13806.\n[35] Celletti FL, Waugh JM, Amabile PG, Brendolan A,\nHilﬁker PR, Dake MD. Vascular endothelial growth\nfactor enhances atherosclerotic plaque progression.\nNat Med. 2001;7(4):425–429.\n[36] Springer ML, Chen AS, Kraft PE, Bednarski M, Blau\nHM. VEGF gene delivery to muscle: potential role\nfor vasculogenesis in adults. Mol Cell. 1998;2(5):\n549–558.\n[37] Lee RJ, Springer ML, Blanco-Bose WE, Shaw R,\nUrsell PC, Blau HM. VEGF gene delivery to my-\nocardium: deleterious eﬀects of unregulated expres-\nsion. Circulation. 2000;102(8):898–901.\n[38] Melo LG, Agrawal R, Zhang L, et al. Gene ther-\napy strategy for long-term myocardial protection\nusing adeno-associated virus-mediated delivery of\nheme oxygenase gene. Circulation. 2002;105(5):602–\n607.\n[39] Phillips MI, Tang Y, Schmidt-Ott K, Qian K,\nKagiyama S. Vigilant vector: heart-speciﬁc promoter\ninanadeno-associatedvirusvectorforcardioprotec-\ntion. Hypertension. 2002;39(pt 2):651–655.\n[ 4 0 ] W h e e l e rM D ,K a t u n aM ,S m u t n e yO M ,e ta l .\nComparison of the eﬀect of adenoviral delivery of\nthree superoxide dismutase genes against hepatic\nischemia-reperfusion injury. Hum Gene Ther. 2001;\n12(18):2167–2177.\n[41] Kibbe MR, Billiar TR, Tzeng E. Gene therapy for\nrestenosis. Circ Res. 2000;86(8):829–833.\n[42] Mann MJ, Whittemore AD, Donaldson MC, et al.\nEx-vivo gene therapy of human vascular bypass\ngrafts with E2F decoy: the PREVENT single-\ncentre, randomised, controlled trial. Lancet. 1999;\n354(9189):1493–1498.\n[43] HuY,BakerAH,ZouY,NewbyAC,XuQ.Localgene\ntransferoftissueinhibitorofmetalloproteinase-2in-\nﬂuences vein graft remodeling in a mouse model.\nArterioscler Thromb Vasc Biol. 2001;21(8):1275–\n1280.\n[44] Baker AH, Zaltsman AB, George SJ, Newby AC.\nDivergent eﬀects of tissue inhibitor of metallopro-\nteinase-1, -2, or -3 overexpression on rat vascu-\nlar smooth muscle cell invasion, proliferation, and\ndeath in vitro. TIMP-3 promotes apoptosis. JC l i n\nInvest. 1998;101(6):1478–1487.\n[45] Bond M, Murphy G, Bennett MR, Newby AC, Baker\nAH. Tissue inhibitor of metalloproteinase-3 induces\na Fas-associated death domain-dependent type\nII apoptotic pathway. J Biol Chem. 2002;277(16):\n13787–13795.\n[46] George SJ, Lloyd CT, Angelini GD, Newby AC, Baker\nAH. Inhibition of late vein graft neointima forma-\ntion in human and porcine models by adenovirus-\nmediated overexpression of tissue inhibitor of\nmetalloproteinase-3. Circulation. 2000;101(3):296–\n304.\n[47] George SJ, Johnson JL, Angelini GD, Newby AC,\nBaker AH. Adenovirus-mediated gene transfer of\nthe human TIMP-1 gene inhibits smooth muscle\ncell migration and neointimal formation in human\nsaphenous vein. Hum Gene Ther. 1998;9(6):867–\n877.\n[48] Buttery LD, Chester AH, Springall DR, et al. Ex-\nplanted vein grafts with an intact endothelium\ndemonstrate reduced focal expression of endothelial\nnitric oxide synthase speciﬁc to atherosclerotic sites.\nJ Pathol. 1996;179(2):197–203.\n[49] West NE, Qian H, Guzik JJ, et al. Nitric oxide syn-\nthase (nNOS) gene transfer modiﬁes venous bypass\ngraft remodeling: eﬀects on vascular smooth muscle\ncell diﬀerentiation and superoxide production. Cir-\nculation. 2001;104(13):1526–1532.\n[50] Schwartz LB, Moawad J, Svensson EC, et al.\nAdenoviral-mediated gene transfer of a constitu-\ntively active form of the retinoblastoma gene prod-\nuct attenuates neointimal thickening in experimen-\ntal vein grafts. JV a s cS u r g . 1999;29(5):874–881.\n[ 5 1 ]G e o r g eS J ,A n g e l i n iG D ,C a p o g r o s s iM C ,B a k e rA H .\nWild-type p53 gene transfer inhibits neointima for-\nmation in human saphenous vein by modulation\nof smooth muscle cell migration and induction of\napoptosis. Gene Ther. 2001;8(9):668–676.\n[ 5 2 ]O h n oN ,I t o hH ,I k e d aT ,U e y a m aK ,e ta l .A c c e l -\nerated reendothelialization with suppressed throm-\nbogenic property andneointimal hyperplasiaof rab-\nbit jugular vein grafts by adenovirus-mediated gene\ntransfer of C-type natriuretic peptide. Circulation.\n2002;105(14):1623–1626.\n[53] Kibbe MR, Tzeng E, Gleixner SL, et al. Adenovirus-\nmediated gene transfer of human inducible nitric\noxide synthase in porcine vein grafts inhibits intimal\nhyperplasia. JV a s cS u r g . 2001;34(1):156–165.148 Kate L. Dishart et al 2003:2 (2003)\n[54] Mehta SR, Eikelboom JW, Rupprecht HJ, et al. Eﬃ-\ncacy of hirudin in reducing cardiovascular events in\npatients with acute coronary syndrome undergoing\nearly percutaneous coronary intervention. Eur Heart\nJ. 2002;23(2):117–123.\n[55] Zoldhelyi P, McNatt J, Xu XM, et al. Prevention of\narterial thrombosis by adenovirus-mediated transfer\nof cyclooxygenase gene. Circulation. 1996;93(1):10–\n17.\n[56] Waugh JM, Yuksel E, Li J, et al. Local overexpres-\nsion of thrombomodulin for in vivo prevention\nof arterial thrombosis in a rabbit model. Circ Res.\n1999;84(1):84–92.\n[57] Waugh JM, Kattash M, Li J, et al. Gene therapy\nto promote thromboresistance: local overexpression\nof tissue plasminogen activator to prevent arterial\nthrombosis in an in vivo rabbit model. Proc Natl\nAcad Sci USA. 1999;96(3):1065–1070.\n[58] Nishida T, Ueno H, Atsuchi N, et al. Adenovirus-\nmediated local expression of human tissue factor\npathway inhibitor eliminates shear stress-induced\nrecurrent thrombosis in the injured carotid artery of\nthe rabbit. Circ Res. 1999;84(12):1446–1452.\n[59] Zoldhelyi P, McNatt J, Shelat HS, Yamamoto Y, Chen\nZQ, Willerson JT. Thromboresistance of balloon-\ninjured porcine carotid arteries after local gene\ntransfer of human tissue factor pathway inhibitor.\nCirculation. 2000;101(3):289–295.\n[60] Laitinen M, Makinen K, Manninen H, et al.\nAdenovirus-mediated gene transfer to lower limb\nartery of patients with chronic critical leg ischemia.\nH u mG e n eT h e r . 1998;9(10):1481–1486.\n[ 6 1 ]F a nL ,D r e wJ ,D u n c k l e yM G ,O w e nJ S ,D i c k -\nson G. Eﬃcient coexpression and secretion of anti-\natherogenic human apolipoprotein AI and lecithin-\ncholesterol acyltransferase by cultured muscle cells\nusing adeno-associated virus plasmid vectors. Gene\nTher. 1998;5(10):1434–1440.\n[62] Harris JD, Schepelmann S, Athanasopoulos T, et al.\nInhibition of atherosclerosis in apolipoprotein-E-\ndeﬁcient mice following muscle transduction with\nadeno-associated virus vectors encoding human\napolipoprotein-E. Gene Ther. 2002;9(1):21–29.\n[ 6 3 ]J u a nS H ,L e eT S ,T s e n gK W ,e ta l .A d e n o v i r u s -\nmediated heme oxygenase-1 gene transfer inhibits\nthedevelopmentofatherosclerosisinapolipoprotein\nE-deﬁcient mice. Circulation. 2001;104(13):1519–\n1525.\n[64] Rouis M, Adamy C, Duverger N, et al. Adenovirus-\nmediated overexpression of tissue inhibitor of\nmetalloproteinase-1 reduces atherosclerotic lesions\nin apolipoprotein E-deﬁcient mice. Circulation.\n1999;100(5):533–540.\n[65] Quarck R, De Geest B, Stengel D, et al. Adenovirus-\nmediated gene transfer of human platelet-activat-\ning factor-acetylhydrolase prevents injury-induced\nneointima formation and reduces spontaneous ath-\nerosclerosis in apolipoprotein E-deﬁcient mice.\nCirculation. 2001;103(20):2495–2500.\n[66] Harris JD, Graham IR, Schepelmann S, et al. Acute\nregression of advanced and retardation of early aor-\ntic atheroma in immunocompetent apolipoprotein-\nE (apoE) deﬁcient mice by administration of a sec-\nond generation [E1(-), E3(-), polymerase(-)] ade-\nnovirus vector expressing human apoE. Hum Mol\nGenet. 2002;11(1):43–58.\n[67] Phillips MI. Is gene therapy for hypertension possi-\nble? Hypertension. 1999;33(1):8–13.\n[68] Phillips MI. Gene therapy for hypertension: the pre-\nclinical data. Methods Enzymol. 2002;346:3–13.\n[69] Gelband CH, Katovich MJ, Raizada MK. Current\nperspectives on the use of gene therapy for hyper-\ntension. Circ Res. 2000;87(12):1118–1122.\n[70] Alexander MY, Brosnan MJ, Hamilton CA, et al.\nGene transfer of endothelial nitric oxide synthase\nbut not Cu/Zn superoxide dismutase restores ni-\ntric oxide availability in the SHRSP. Cardiovasc Res.\n2000;47(3):609–617.\n[71] Fennell JP, Brosnan MJ, Frater AJ, et al. Adenovirus-\nmediated overexpression of extracellular superoxide\ndismutase improves endothelial dysfunction in a rat\nmodel of hypertension. Gene Ther. 2002;9(2):110–\n117.\n[72] Nakane H, Miller FJ Jr, Faraci FM, Toyoda K, Heis-\ntad DD. Gene transfer of endothelial nitric oxide\nsynthase reduces angiotensin II-induced endothelial\ndysfunction. Hypertension. 2000;35(2):595–601.\n[73] Kishi T, Hirooka Y, Ito K, Sakai K, Shimokawa H,\nTakeshitaA.Cardiovasculareﬀectsofoverexpression\nof endothelial nitric oxide synthase in the rostral\nventrolateralmedullainstroke-pronespontaneously\nhypertensive rats. Hypertension. 2002;39(2):264–\n268.\n[74] Zhang JJ, Wang C, Lin KF, Chao L, Chao J. Human\ntissuekallikreinattenuateshypertensionandsecretes\ninto circulation and urine after intramuscular gene\ndelivery in hypertensive rats. Clin Exp Hypertens.\n1999;21(7):1145–1160.\n[75] Chao J, Chao L. Kallikrein gene therapy: a new strat-\negyforhypertensivediseases.Immunopharmacology.\n1997;36(2-3):229–236.\n[76] Phillips MI, Mohuczy-Dominiak D, Coﬀey M, et al.\nProlonged reduction of high blood pressure with an\nin vivo, nonpathogenic, adeno-associated viral vec-\ntor delivery of AT1-R mRNA antisense. Hyperten-\nsion. 1997;29(1 Pt 2):374–380.\n[77] Kimura B, Mohuczy D, Tang X, Phillips MI. Atten-\nuation of hypertension and heart hypertrophy by\nadeno-associated virus delivering angiotensinogen\nantisense. Hypertension. 2001;37(pt 2):376–380.\n∗ Corresponding author.\nE-mail: ab11f@clinmed.gla.ac.uk\nFax: +44 1412111763; Tel: +44 1412112100",
    "Link": "https://core.ac.uk/download/pdf/3396978.pdf"
}