{
    "Title": "Interim report on the feasibility of constructing a regional Measure of Domestic Progress (MDP) for East Midlands Development Agency",
    "Authors": "New Economics Foundation",
    "Year": "No year available",
    "Abstract": "Investigates the feasibility of constructing an adjusted monetarised indicator of regional economic well-being, based on the structure of the nef’s Measure of Domestic Progress (MDP).  Provided an overview of challenges in issues addressed in the development of the Regional Index of Sustainable Economic Wellbeing (RISEW) for the 2006 Regional Economic Strategy",
    "Keywords": "No keywords available",
    "Publisher": "East Midlands Development Agency",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " 7Interim Report on the Feasibility of Constructing a Regional Measure of Domestic Progress (MDP)  A report prepared for emda  Nef (the new economics foundation)  2005 This work, with the exception of logos, photographs and images and any other content marked with a separate copyright notice, is licensed under a Creative Commons Attribution 2.0 UK: England & Wales License  The use of logos in the work is licensed for use only on non-derivative copies. Under this licence you are free to copy this work and to make derivative works as long as you give the original author credit.   The copyright is owned by Nottingham Trent University.                      This document forms part of the emda Knowledge Bank                      Interim report on the feasibility of constructing a  regional Measure of Domestic Progress (MDP) for  East Midlands Development Agency         2This interim report forms part of a project being carried out by nef (the new economics foundation) on the feasibility of constructing an adjusted monetarised indicator of regional economic well-being, based on the structure of the nef’s Measure of Domestic Progress (MDP). A final report will be made available in September 2005.  Headlines • MDP is a monetarised indicator of economic well-being and quality of life. • It is based on a macro-level cost-benefit analysis, with financial estimates of economic, social and environmental costs and benefits. • These costs & benefits are based on calculating financial estimates of 24 different domains and draw on at least 50 different data sources. • The quality of available data at a regional level varies across the different domains – this does provide additional challenges to constructing a regional MDP. • Most domains have reasonable UK regional coverage back to 1994and feasibly some domains could be “back-casted” to about 1990 but this will involve compromises regarding their robustness. • Some data sources, such those used for the energy-use related domains, will require proxy calculations to be conducted to make estimates of regional level usage.   • Comparable European data is not currently available for the vast majority of domains, though better data are starting to be collated and so this could be re-viewed in four to five years’ time. • Potentially a more interactive version of MDP could be devised that allows users to alter key ‘input parameters’ – this would ensure greater transparency regarding the assumptions behind the calculations.    Conclusions • It is feasible to construct a draft, pilot regional MDP for the East Midlands. • The time series could start in 1994 and with less robustness in 1990. It could probably be brought up to within a year of two of the current date (say 2003/4). • Some domains will require proxy calculations to made due to a lack regional data – regional energy use data, for example, is not collected and reported in the level of detail required.   • It is not feasible, at this time, to construct a common European-wide MDP that would enable comparisons across the European Regions.    3Further contents of this interim report  Section 1:  Overview of the construction of MDP Section 2: Particular challenges of a regional MDP Section 3:  Presenting MDP – example using the UK-MDP 1990 – 2002  Appendix 1:  Summary of the data availability at a UK level Appendix 2: Summary of the data availability at a European level              Contacts:   Nic Marks  Head of well-being research nef (the new economics foundation) 3 Jonathan Street, London SE11 5NH nic.marks@neweconomics.org 01235 851 360  Tim Jackson Advisor and author of UK MDP Professor of Sustainable Development University of Surrey tim.jackson@surrey.ac.uk  Nat McBride Researcher nat_mcbride@yahoo.co.uk     4Section 1: Construction of the Measure of Domestic Progress (MDP)  The MDP builds on a variety of previous work over the last 20 years at constructing adjusted economic indicators of quality of life. It is based on earlier index called the Index of Sustainable Economic Welfare (ISEW)1 and is closely related to the Genuine Progress Indicator (GPI) that has been developed by the US-based lobby group Redefining Progress. MDP is a composite indicator of quality of life (QoL) as it seeks to weight different factors that are pertinent to QoL and create a single performance indicator. Its model is effectively a macro-level cost benefit analysis. • It starts with the economic benefits derived from consumer expenditure. • Then some economic adjustments for ensuring that economies prudently invest for the future and manage their trade balances effectively.  Depending on the actual year and state of the economy these may involve extra economic costs. • The value of social benefits are added that are not accounted for in personal consumption figures, such as public expenditure on health and education as well as an estimate of the value of unpaid domestic labour at home.  In a regional MDP we would recommend also including an estimate of the value of unpaid voluntary work outside the home. • Social costs are deducted such as expenditures that defend our quality of life rather than enhance it. These include factors such as the cost of car accidents, crime, and family breakdown. In addition changes in the distribution of income are accounted for, reflecting the diminishing marginal utility of money. • Estimates of environmental costs are then made. These include water and air pollution as well as estimates of the costs of climate change and ozone depletion. Further adjustments are made regarding the management of renewable and non-renewable stocks of natural capital such as fossil fuels and natural assets, such as farmlands and natural habitats.    • Currently there are no estimates of environmental benefits. Table 1 indicates all the components of the MDP classified by these cost-benefit domains.  All of these domains, and the factors beneath them, have different trends over time and one of the benefits of a transparently constructed indicator, such as MDP, is that they can be tracked individually.  The worked example in section 3 of this report illustrates this point.                                                        1 Jackson T & Marks N (1994) Measuring Sustainable Economic Welfare, Stockholm Environment Institute and nef  5    Table 1: Components of the UK MDP   Type Indicator Influence on MDP Economic Benefits Consumer expenditure  +ve  Difference between expenditures on and service flow from consumer durables -ve Net capital growth mainly +ve Economic Adjustments and Costs Net international position mainly –ve Value of services from domestic labour +ve Social Benefits Public (non-defensive) expenditures on health and education +ve Effects of inequality in the distribution of incomes -ve Defensive private expenditures on health and education -ve Costs of commuting -ve Costs of car accidents -ve Costs of noise nuisance -ve Costs of crime -ve Social Costs Costs of family breakdown -ve Costs of personal pollution control -ve Costs of air pollution -ve Costs of water pollution -ve Estimated costs of climate change -ve Environmental costs – pollution and climate change Costs of ozone depletion -ve Loss of natural habitats -ve Loss of farmlands -ve Environmental costs – use of natural resources Depletion of finite natural resources -ve  6Section 2: Particular challenges of regional MDP  Constructing a regional MDP is in some quite precise ways more challenging than constructing a national MDP.  These challenges will have to be dealt with satisfactorily in order create a robust indicator.  The first problem is that historical data sets at the regional level are non-existent in many areas before about the mid-1990s when regional politics became important.   This means that we will be unable to create a long historic time series for a regional MDP.  A more serious problem is that many data sets, including resource use data, trade data, social data and investment data, are still not collected and reported routinely in the same level of detail at the regional level as they are at the national level.  This means that constructing a regional MDP will sometimes have to rely on taking a national data and adjusting this data to the regional basis by using an appropriate proxy for regional activity levels.  In other words, constructing a regional MDP will involve more statistical manipulation than constructing a national MDP, and may ultimately have a reduced reliability.    An example of this additional work and potential loss of accuracy is provided by several important domains in the MDP that rely on energy consumption data, namely: air pollution, long-term environmental damage and resource depletion.    Energy consumption data by fuel type are not routinely reported at the regional level; some data on gas and electricity consumption in the domestic sector does exist; but accounting for coal and oil consumption, which are important to both air pollution and long-term environmental damage, is less consistent; energy consumed in the commercial, industrial and public sector is also not reported by fuel type at the regional level. None of these issues is insuperable; for example, it would be possible to estimate industrial and commercial sector energy consumption by using national estimates of fuel consumption (by type) per unit of GVA (possibly in different SIC sectors) and multiplying these by the total GVA (in each sector) in the region.  As already indicated however, this would entail more work than constructing an account of energy-related domains at the national level – where fuel consumption statistics are routinely reported in sufficient detail to distinguish by type and activity.  It would also be inaccurate to the extent that the composition of local industry differed from the national proxy.   An alternative approach would be to attempt to collate regional data on industrial energy consumption by using a detailed profile of the industrial infrastructure and applying one of the more detailed SIC code based energy databases – such as the one used in the UK Environmental Accounts.  However this would entail considerably more work than envisaged in the construction of a national MDP and is probably infeasible in the time-scale of the RES.  Similar problems exist in other domains.  Even where basic economic data are concerned, there are problems associated with accounting at the regional level that simply do not exist at the national level.    For example, the regional equivalent of the domain ‘net international position’ would require detailed data on ‘inter-regional’ economic flows across the regional boundary.  It appears unlikely that we will find robust data of this kind dating back beyond 1994, if we can find it at all.   It may be possible to take the regional contribution to international trade as a proxy for the regions contribution to national economic sustainability (in this specific sense); but it should be noted that this would have a different interpretation in the regional index, that would require some justification. Another possibility might be to use a crude proxy based on the regional proportion of national GVA and applying this to the national ‘net international position’; again this example illustrates both the additional data manipulation required, and the potentially damaging loss of reliability involved.  In conclusion, it is feasible to construct a pilot version of a regional MDP but it will involve certain proxy calculations to be carried out.  This will affect the robustness of the indicator in specific ways, examples of which have been outlined above.  A decision will need to be made about when to start the time series for a regional MDP. The earliest feasible year would be 1990, however this would involve several domains to be ‘back-casted’; whereas an index starting in 1994 would reduce these problems.  7Section 3:  Presenting MDP – example using the UK MDP 1990 – 2002  As we do not have a regional version of MDP, in the following illustrative figures we have used the data from the MDP for the whole UK. The data is presented from 1990 – 2002 to illustrate the approximate timescale that a regional MDP might be calculable for.    Trends are presented for all the major domains though it is feasible to have trends for each individual component of MDP.   It is feasible that an interactive version of a regional MDP could be created. It would then be possible to alter key ‘input parameters’ and observe how the underlying assumptions affect the trend data. This would require more complex modelling that would be outside the scope of a draft pilot version but would allow over time greater participation in the construction of the indicator from emda. On the final page of graphs a comparison between MDP and GDP is presented.  There are potentially creative ways of presenting the relationship between these two indicators.  For example rates of growth can be compared, though MDP’s growth rates may need to be smoothed (perhaps by a rolling 3-year average) to overcome some peculiarities of the interaction between domains.  All the figures are in 1995 pounds sterling to remove inflation effects. All the graphs are based on the national MDP for the UK, which was constructed by Tim Jackson and published as a nef report Chasing Progress in April 2004. The report is available  from the nef web-site: http://www.neweconomics.org/gen/well-being_mdp.aspx     8Economic Contributions to MDP – Benefits, Costs and Overall Contribution   Graph 1: Economic Benefits 02,0004,0006,0008,00010,00012,0001990 1994 1998 2002  Graph 2: Economic Adjustments (Costs) -1,000-750-500-25001990 1994 1998 2002 Graph 3: Overall Economic Contribution to MDP 01,0002,0003,0004,0005,0006,0007,0008,0009,00010,0001990 1992 1994 1996 1998 2000 2002   9Social Contributions to MDP – Benefits, Costs and Overall Contribution  Graph 4: Social Benefits 01,0002,0003,0004,0001990 1994 1998 2002 Graph 5: Social Costs  01,0002,0003,0004,0001990 1994 1998 2002 Graph 6: Social Contribution to overall MDP -1,000-50005001,0001990 1992 1994 1996 1998 2000 2002  10Environmental Contributions to MDP – Pollution & Resource Costs and Overall Contribution   Graph 7: Environmental Costs relating to Pollution  01,0002,0003,0004,0001990 1994 1998 2002 Graph 8: Environmental costs relating to Resource Use  01,0002,0003,0004,0001990 1994 1998 2002 Graph 9: Environmental (negative) Contribution to Overall MDP   -8,000-6,000-4,000-2,00001990 1992 1994 1996 1998 2000 2002    11Overall Measure of Domestic Progress – UK – 1990-2002  Graph 10: Per capita MDP and GDP: 1990 – 2002.  Figures in 1995 £s.  02,0004,0006,0008,00010,00012,00014,00016,0001990 1992 1994 1996 1998 2000 2002MDP GDP Graph 11: Per capita MDP and GDP – re-based to 1990 = 100  4060801001201401601990 1992 1994 1996 1998 2000 2002MDP rebased GDP rebased    12Graph 12:  Per capita MDP and GDP year on year growth rates. -8%-6%-4%-2%0%2%4%6%8%10%12%1990 1992 1994 1996 1998 2000 2002MDP Growth GDP Growth MDP Growth (smoothed)   Please note that graph 12 uses a 3-year rolling average to smooth some of the variance out of MDP growth. This means that the 2002 figure is provisional as it is just an average of the 2001 & 2002 because data for 2003 is unavailable.  All of the above graphs are illustrative of some of the ways that a regional MDP could be presented. Clearly all data could be presented as re-based trend data, though this then hides their relative contribution to overall MDP.   13Appendix 1:  Availability of UK Regional Data   Summary of data availability to date Most regional data only go back to mid 1990s – after that we will need to extrapolate from national data using recent years as a guide to splitting by region. This will give an approximation of the trend for a region, but won’t show trends between regions.  Dates given below are for the periods for which robust data are available.  All letters refer to the column headings in MDP spreadsheets.   A: Consumer Expenditure Data availability National data 1948-2005 Consumer Trends, National Accounts Regional data 1994-1999 Regional Economic Indicators   Notes For 2000-2004 calculate from national figures weighted by regional household expenditure from Regions in Figures (HH exp is by far the largest component of consumer exp.)     B: Income Distribution Data availability National and regional data 1998-2004 ASHE (Annual Survey of Hours and Earnings); 1970-1998 from NES (New Earnings Survey)  Notes NES data is not directly comparable to ASHE data, which is weighted. Differences are fairly small, but as an article from the ONS on ASHE methodology comments, income differences are generally higher in the weighted ASHE data than NES, because of the poor response rates from respondents in high-paying occupations.    E: Household Labour & Volunteering Data availability National time use data 1961-2000 BBC, ERSC, ONS Time Use Survey.  Regional time use data 1995-2000 ONS Time Use Survey.  Notes Costs for this column are based on time use data showing hours spent on domestic/volunteering activities, together with a suitable hourly rate. Options for this rate are: - use the national minimum wage (data 1999-present, ONS) - weight minimum wage figures by average regional earnings (data 1998-2004, ASHE) - use regional rates of pay for certain types of job, e.g. cleaner, gardener (data 1998-2004, ASHE)    F: Public Expenditure Health/Education Data availability National data 1991-2002 Annual Abstract of Statistics.   Regional proxy data 1996-2003 (health) and 2000-2003 (education) Regions in Figures, Annual Abstract of Statistics    14Notes Regional expenditure data on health and education are not available. However, a reasonable proxy might be to combine national expenditure with regional student numbers and medical statistics (e.g. GP consultations, mortality rates).  Need to define exactly what kind of education expenditure we are going to count here.   G,H,L: Consumer durables, Private Expenditure Health/Education, Personal Pollution Control Data availability National data 1963-2004 Consumer Trends Regional data 1967-2004 Family Expenditure Survey, Regions in Figures  Notes Most of the regional data (at least th accessible) is broken down by broad function only, which may not be sufficient for separating out all durables from non-durables. Detailed breakdowns given for 1998-2003 in the FES, broad function breakdown for 2004 in Regions in Figures      I: Commuting Data availability National data 1985-2004 National Travel Survey Regional data 1996 HH Noll; 1998-2004 National Travel Survey, Regions In Figures; 1998-2003 Family Expenditure Survey, Regional Transport Statistics    Notes Regional travel expenditure is available from the FES, which can be combined with regional data on proportions of travel due to commuting and/or average commuting times.     J: Crime Data availability National data 1982-2004 British Crime Survey Regional data begins 1998, fully available 2001-2004 British Crime Survey  Notes The 1998 survey gives some regional data (burglary, vehicle theft, violence); fear of crime is added in 2000; there is regional data for all categories for 2001-04.    K: Family Breakdown Data availability National data 1858-2002 Marriage, Divorce & Adoption Regional data 1991-2000 ONS Population Trends 1991-2003, Marriages by region 1976-2000  Notes Regional data is not directly available, but may be calculated for the years 1991-2000 from the overlap between Population Trends and Marriages by region.    M: Car Accidents Data availability National and regional data 1990-2004 Dept for Transport, National Travel Survey, Regional Transport Statistics  15Notes No costing defined yet – statistics are of number of casualties (fatal, serious injuries, etc) which need to be combined with some estimate of cost per accident.    N: Water Pollution Data availability National and regional data 1990-2003 Environment Agency  Notes Gives lengths of river in the region classed as ‘good’, ‘fair’, ‘poor’, etc. Classification is given separately for chemical and biological quality, and these lengths of river may (and probably do) overlap.    O: Air Pollution Data availability National data 1970-2003 Environment Agency Regional data 1994-2004 Environment Agency  Notes The Environment Agency data is emissions from the major sources – heavy industries such as printing, milling, etc. We also have national data for 1993-2003 on emissions due to transport (National Environmental Technology Centre), which could be combined with regional data on traffic flows (Regional Transport Statistics, National Road Traffic Survey). Also available for 2003 only (and future years) is regional fuel use by type of vehicle – Energy Trends.    Additional notes on columns N and O Some data on individual pollution incidents and clean-up costs are available from 2001 Environment Agency. Regional summaries (whole Midlands region, not East/West split) of numbers of water pollution incidents 1990-2003.    P: Noise Pollution Data availability National data 1984-2003 – all noise DEFRA Regional data 1994-2002 for traffic noise complaints & prosecution; for airport areas 1993-2003 DEFRA  Notes Could also estimate from traffic flows: we have national & regional data for passenger km 1994-2004 National Road Traffic Survey    Q,R: Loss of Habitats, Farmlands Data availability National and regional data on land use 1990-2004 DEFRA    Waste Data availability National and regional data 1998-2002 Environment Agency  16Notes The statistics here are tonnages of waste – cost estimates can probably be provided by the Environmental Services Association (waste contractors’ trade body).     S,T: Depletion of non-renewables, Long-Term Environmental Damage Data availability Energy use (heating & power): national data 1970-2003 Energy use (heating & power): regional data to NUTS4 for gas 2001-2003, electricity 2003 (experimental) DTI Energy use (travel): national vehicle km 1955-2004 National Road Traffic Survey Energy use (travel): regional vehicle km 1994-2004 National Road Traffic Survey  Notes The DTI hope to publish regional data on all fuel use for heating and power by end of year, but this is the full extent of their regional data so far. Some proxy will have to be estimated for the time being e.g. national data adjusted using population figures or household expenditure on energy plus average unit costs of gas/electricity.   The national vehicle km data are broken down by vehicle type; regional figures are forthcoming but not available yet. We do however have regional transport fuel consumption data available for 2003 – so we can check the validity of assumptions and calculations based on passenger km    U: Ozone depletion Data availability Not assessed  Notes Probably drop this – virtually no CFC emissions anywhere now.    V: Net Capital growth Data availability Gross capital formation: national data 1948-2004 ONS Blue Book (UK National Accounts) Gross capital formation: regional data 1998-2000 ONS Labour market: national and regional data 1992-2005 Labour Force Survey  Notes The ONS hope to publish more recent data on capital formation this year but have some issues with data quality at present, and may delay or cancel publication.    W: Net International Position Data availability National data 1946-2004 ONS Pink Book (UK Balance of Payments) Regional data 2000-2004 Regions in Figures      17Section 4: Availability of EU Regional Data   Eurostat has a new database of regional data (REGIO / NEW CRONOS) which has data from the national statistics offices of EU members and candidate countries. Data availability varies wildly, but it is certain that a complete comparison of all EU regions will not be possible.  Some data is also available through a project coordinated by Heinz-Herbert Noll (H-H Noll) to gather regional ISEW data across Europe, but this is even more limited than Eurostat at present – the project’s primary aim is to specify ideal datasets regardless of data availability, rather than working from what already exists. Once that stage is complete, work will begin to gather the data, but this will not happen within the timeframe of this project.  A: Consumer Expenditure Household income at NUTS2 generally available from Eurostat 1995-2002, but limited years for some countries: • Czech Republic 1995-2003 • Spanish province of Melilla 2001-2002 • France 1995-2001 • Italian regions Bolzano-Bozen and Trento – no data • Hungary 2000-2002 • Netherlands 1995-2001 • Austria 1995-2000 • Poland 1998-2001 • Portuguese regions Lisboa, Centro, Alentejo 2000-2002 • No data at all for Cyprus, Luxembourg, Malta, Slovenia  Summary: 1995-2000 is feasible, as long as we can sacrifice Hungary, Cyprus, Malta, Slovenia and a few other regions. B: Income Distribution No regional data available on Eurostat or H-H Noll. H-H Noll has national data from 1995-2001 for most countries. Eurostat has patchy data 1995-2003 – most countries missing one or more years. Reasonably full time series for Belgium, Germany, Greece, Spain, France, Ireland, Italy, Luxembourg, Netherlands, Austria, Portugal, Finland, UK; could extrapolate and interpolate for most of the rest; single points only for Slovakia and Malta.  Summary: national data is sufficiently complete to make reasonable estimations 1995-2003; for regional data we could assume a uniform income distribution through the country, but this is a shaky assumption with little value for regional comparison. E: Household Labour & Volunteering Limited national data with limited comparability from Multinational Time Use Survey. Regional data availability even more limited, although it is possible that some national studies listed below also have a regional element to the underlying data, but just don’t make it available via the international resource – would need to contact individual countries’ statistics offices to confirm. Volunteering not explicitly included in all studies, either.  • Austria 1992 (3 regions) • Belgium 1999 (Flanders only), 1998-2000 (3 regions), 1992-2002 annually (3 regions) • Cyprus – no data • Denmark 2001 (no regional split) • Estonia 1996, 1999-2000 (no regional split) • Finland 1996, 1999-2000 (no regional split) • France 1996 (2 regions only, small sample), 1998-1999 (no regional split) • Germany 1990, 1992, 2001-2002 (no regional split) • Greece 1996,1997 (no regional split)  18• Hungary 1992, 1993, 1996, 1999-2000 (no regional split) • Ireland 1996 (no regional split) • Italy 1996 (no regional split, small sample), 2002-2003 (no regional split) • Latvia 1996 (urban / rural split only) • Lithuania 1997 (no regional split, small sample) • Luxembourg 1996 (no regional split, small sample) • Malta – no data • Netherlands 1990, 1995, 2000 (unclear without ordering the studies whether there is any regional breakdown) • Poland 1996, 2001 (no regional split) • Portugal 1996, 1999 (no regional split) • Slovakia 1996 (pilot study only) • Slovenia 1996, 2000-2001 (no regional split) • Spain 1990 (Aragon province only), 1990, 1991, 1992-1993, 2002-2003 (no regional split), 1997-1998, 2002-2003 (Basque province only) • Sweden 1990-1991, 2000-2001 (no regional split), 1993, 1996 (small sample)  Summary: to extract any regional figures from this data we will mostly have to (a) assume that time use is invariant across the whole country, and (b) fore- and back-cast from limited time series. Where there is only one year’s data (several countries) we will also have to decide whether to assume changes over time follow the pattern of other countries or to just use the same data for all years. F: Public Expenditure Health/Education National expenditure data 1991-2002 on Eurostat. Some regional data calculable from this, using the regional figures on number of students in different stages of education. Very patchy though – many regions missing many years of data.  Summary: insufficient data for regional analysis. G,H,L: Consumer durables, Private Expenditure Health/Education, Personal Pollution Control National data on Eurostat for all EU countries for 1999, and for some countries for 1988 and 1994. The following are missing: • 1988 – Czech Republic, Denmark, Estonia, Ireland, Cyprus, Latvia, Lithuania, Hungary, Malta, Austria, Poland, Slovenia, Slovakia, Finland, Bulgaria, Romania. Also, no detailed breakdown for Germany • 1994 – Czech Republic, Estonia, Cyprus, Latvia, Lithuania, Hungary, Malta, Poland, Slovenia, Slovakia, Finland, Bulgaria, Romania  Summary: lack of full time series for all countries is limiting, and with no regional data on income distribution either, any use of national data as a proxy is subject to the same shaky assumptions as for column C above. I: Commuting Limited data with limited comparability – see Time Use data for column E above.  J: Crime No data on Eurostat or H-H Noll. K: Family Breakdown National data 1980-2000 for most countries, Eurostat and H-H Noll. No regional data. M: Car Accidents Regional data 1988-2000 for most countries / regions – missing some years and some regions, e.g. Portuguese regions.  Summary: insufficient data for a thorough regional analysis, but enough for a workable comparison of most EU regions.  19N: Water Pollution National data 1990-2003 European Environment Agency but with significant omissions (all years for Denmark and France only):  • No data for Belgium, Estonia, Finland, Germany, Sweden • Very limited years for Greece, Lithuania, Spain • Several years missing for Ireland, Italy, Latvia, Poland  Of the countries with enough data to work from (Austria, Czech Republic, Denmark, France, Hungary, Ireland, Italy, Latvia, Luxembourg, Netherlands, Poland, Slovakia, Slovenia) the regional data is very variable. Regional data is given in the form of individual rivers rather than NUTS regions, and would therefore need to be correlated to regions using detailed maps:  • Full or nearly full data: Austria, Czech Republic, Denmark, Hungary, Luxembourg, Poland, Slovakia,  • Partial data: France, Ireland (most rivers from 1998-2003),  • Very limited data: Italy, Latvia (missing 1996-2001), Netherlands, UK  Summary: insufficient data for regional analysis. O: Air Pollution European Environment Agency has “Airbase”, a database of air quality from individual monitoring stations around Europe – but which appears to be largely empty at present. Not a useful source of regional data; insufficient for regional analysis.  P: Noise Pollution Nothing useful found. Q,R: Loss of Habitats, Farmlands National and regional land use data for 1990 and 2000, Corine Land Cover Project. 1990 data available at NUTS3 as Excel file, most countries covered. 2000 data available on application (web download restricted to a mapped image). Some soil quality data from 1980 available for southern Europe. Waste National and regional data available from 1980-2000, but extremely patchy – most countries have only one or possibly two years of data across that period; there is none at all for the UK in recent years. Insufficient for regional analysis.  S,T: Depletion of non-renewables, Long-Term Environmental Damage National GHG emissions 1990-2002 European Environment Agency. No regional data. Eurostat gives national figures for energy consumption of electricity, gas, petroleum, by industry, transport and households. No regional data. V: Net Capital growth National and regional data 1995-2001 Eurostat (Regio), with some notable exceptions:  • Spain, Latvia, Luxembourg, Malta, Slovenia, UK – no data at all. • Slovakia – 1995 only • Poland – 1998-2000 only • Netherlands – 1995-1999 only • Denmark, Greece, France, Hungary – 1995-2000 only  Summary: insufficient data for a full regional analysis. National data to fill the gaps will certainly be available through each country’s own statistics office, but regional data may not be. A detailed trawl  20through UK statistical publications reveals regional data on this aspect only from 1998-2003, so it is likely that similar shortcomings will be found elsewhere – never mind the linguistic barriers to such a search. W: Net International Position National data available 1999-2005 Eurostat (Regio). No regional data      ",
    "Link": "https://core.ac.uk/download/30624484.pdf"
}