{
    "Title": "Applications of titanium dioxide nanoparticles in nanomedicine",
    "Authors": "El-Adl,  Mohamed, El-Sayed,  Gehad, El-Sherbini,  El-Said, El-Sherbini,  El-Said, Salama, Basma, Taniguchi,  Akiyoshi",
    "Year": "No year available",
    "Abstract": "Nanotechnology is an exciting field that has a profitable outcome due to the increased applications of nanomaterials in many areas such as industry, agriculture, business, medicine and public health. Nanomedicine is a science that studies the application of nanotechnology in medicine. For diseases diagnosis, treatment, monitoring, control and prevention. Titanium dioxide nanoparticles (TiO2 NPs) possess the potential to be used in nanomedicine for cancer diagnosis and therapy due to their advantageous characteristics such as biocompatibility, photocatalytic activity and good optical and electronic properties. This review aims to introduce nanomedicine and nanomaterials and focus on the recent research interest toward TiO2NPs in medicine",
    "Keywords": "No keywords available",
    "Publisher": "'Mansoura University'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Mansoura Veterinary Medical Journal 22:3 (2021) 111-116  DOI: 10.21608/MVMJ.2021.196036 Review Article                                                                                                                                   Biochemistry Applications of titanium dioxide nanoparticles in nanomedicine Basma Salama1, El-Said El-Sherbini1, Gehad El-Sayed1, Mohamed El-Adl1, Akiyoshi Taniguchi2  ion, Faculty of Veterinary Medicine, Mansoura University, Mansoura 35516, EgyptDepartment of Biochemistry and chemistry of Nutrit1 National Institute for Materials Science, Japan2 ARTICLE HISTORY  ABSTRACT Received: 29.09.2020 Revised: 06.08.2021 Accepted: 16.09.2021 Correspondence to: Basma Salama  Tel: +201093823101;  Email dr.basma_bio@yahoo.com;   Nanotechnology is an exciting field that has a profitable outcome due to the increased applications of nanomaterials in many areas such as industry, agriculture, business, medicine and public health. Nanomedicine is a science that studies the application of nanotechnology in medicine. For diseases diagnosis, treatment, monitoring, control and prevention. Titanium dioxide nanoparticles (TiO2 NPs) possess the potential to be used in nanomedicine for cancer diagnosis and therapy due to their advantageous characteristics such as biocompatibility, photocatalytic activity and good optical and electronic properties. This review aims to introduce nanomedicine and nanomaterials and focus on the recent research interest toward TiO2 NPs in medicine.  Keywords: Nanomedicine, Nanomaterials, Titanium dioxide nanoparticles.                 1. INTRODUCTION   Recently, nanotechnology has gained significant interest due to increasing applications of nanomaterials, materials sized in the scale of 1 to 100 nm, in many fields such as industry, agriculture, medicine and public health [1].        Nanomedicine is the application of nanotechnology in medicine for disease diagnosis and treatment and disease monitoring, control and prevention. Nanomedicine is considered an Enabling Technology that provides new and forward-looking solutions to manage non-solved medical needs [2].           The application of nanomaterials in nanomedicine can be divided into three main subdivisions: nano-diagnosis, nano-therapy, and regenerative medicine (organ replacement or transplantation). Moreover, there is a new exciting and emerging field that aims to combine diagnosis and therapy and is entitled as theranostics. Theranostic medicine is merely using the same system for both disease diagnosis and treatment [3].        Nanomedicine improves clinical practice by introducing novel medicines for both disease diagnosis and treatment by Providing beneficial molecules that were previously toxic and clinically untuneful. Moreover, nanomedicine could improve drug bioavailability that will subsequently lead to reducing the dose and toxicity. Besides, nanomedicine provides a very useful drug-targeting through controlled and site-specific release, site-selective distribution in the body and increased capability of crossing biological barriers. All of these beneficial outcomes of nanomedicine depend on the properties of nanomaterials [4]. 2.  Nanomaterials         To fully understand the advantages of nanomaterials and how could the properties of the nanomaterials affect the outcomes of using these    materials in medicine, we need to answer important questions; what the definition of a nanomaterial is and   how to decide whether a material is considered as a nanomaterial or not.        The European Commission (EC) defined the nanomaterials based on the European Commission Joint Research Center and the Scientific Committee on Emerging. Accordingly, the EC recommended that nanomaterial can be defined as a natural or manufactured particle, either in an unbound state or as an aggregate where the external dimensions are in the size range of 1– 100 nm for ≥ 50 percentage of the particles [5].   The small size of the nanomaterials provides novel physical and chemical properties that are different from their conventional bulk chemical equivalents. These physical and chemical properties can alter pharmacokinetics such as absorption, distribution, the ability to cross biological barriers, metabolism and elimination [6]. But, some concerns about the nanomaterial's safety have emerged; therefore, FDA advises evaluating the safety of the nanomaterials and their impact on public health [7].  3. Properties of nanomaterials   The size of the nanomaterial is the most important property to characterize a nanomaterial. Nano-size nanomaterials provide a high specific surface area about the volume leading to an increase in the particle surface energy and render the nanomaterials much more reactive. In a biological system, nanomaterials are capable of adsorbing biomolecules such as proteins and lipids on its surface. One of the most critical interaction in the biological system depends on adsorption of the plasma biomolecules leading to the formation of the corona layer on the nanoparticles [8]. The structure of the corona layer depends on the root of the entry of 112                                                                                                            B. Ahmed et al. 2021                                                                                                            Mansoura Vet Med J 22:3 (2021) 111-116 nanomaterials to the body and on the body fluid in which the nanoparticles will get through such as blood, gastro-intestinal fluid or lung fluid. The corona constitution could be changed while moving from one biological fluid to another [9].         Other properties of the nanomaterials such as optical, electrical and magnetic properties can be modified by electron confinement. The remarkable outcome is that different sizes, shapes and chemical compositions of a nanomaterial can be skillfully engineered. Besides, their surfaces could be modified to render the nanoparticles more interactive toward specific biological targets [10].    Obtaining successful biological outcomes comes after careful particle design. A well-known mechanism of how nanomaterials could interact with any biological system is mandatory as it will influence the cellular signaling pathways, kinetics and transport. Therefore, a better understanding of the molecular processes leads to well-engineered nanomaterials that could target a desired site in the body [11].  4. Application of nanoparticles for cancer therapy         Recently, there is an excellent research effort for the implementation of nanoparticles (NPs) for cancer therapy to prevent cancer incidence and progression owing to their antitumor activity. The anti-cancer activity of NPs is related to intrinsic NPs capability; for example, some NPs capable of inducing oxidative stress or DNA adduct. Besides, NPs anti-cancer activity could depend on activities relies on external stimuli, such as hyperthermia results from tumor irradiation by magnetic fields or infrared rays. NPs, with such activities, could be employed as antitumor therapies such as photodynamic therapy and photothermal therapy. In radiotherapy, the external radiation stimulates NPs can produce free radicals that can eradicate cancer cells. Besides, NPs could affect the tumor environment, such as blood vessels or stroma, to prevent the development of tumors. Moreover, some NPs inhibited tumor progression as a result of their oxidative stress activities [12].           The use of NPs in cancer therapy in both active and passive response. The tolerant attitude of NPs through the enhanced permeability and also increase retention effects with the presence of leaky vasculature can permit the diffusion of NPs into cancer tissues to accumulate and eradicate cancer cells [13].          The disadvantage of relying on the passive process for cancer therapy is that the leakage in the vascular system present in cancer can be located in inflamed tissue and will target drug delivery. Researchers could overcome this disadvantage by directing the used anti-cancer drug through active processes. It depends on the ability to render the NPs o be functionalized and targeted at the cancerous cell. Modifying the NPs surface by biomolecules or a ligand to a specific target on the surface of cancer cells might increase the uptake of the anti-cancer drugs into the cancerous cells instead of healthy normal tissues [14]. Here we will focus on Titanium dioxide nanoparticles as one of the essential nanoparticles that recently is being studied for nanomedicine. 5. Titanium dioxide nanoparticles (TiO2 NPs)          Titanium dioxide or titanium (IV) oxide or Titania is a metal oxide particle with the chemical formula, TiO2. According to U.S National Nanotechnology, TiO2NPs are one of the commonly manufactured NPs worldwide. TiO2 NPs have many industrial applications as paints, printing ink, rubber, paper, cosmetics, pharmaceuticals, sunscreens, car materials, implanted biomaterials and decomposing organic matters in wastewater [15].         The recent growth of the research interest has been seen in nanoscience, and nanotechnology resulted in discovering new physical and chemical properties. At the same time, the size of the material becomes smaller down to the nanometer scale. TiO2 NPs demonstrated unique characteristics that promote its utilization in favor of medicine [2]        In the research area of cancer therapy and diagnosis, the small size of NPs allows their incorporation into cells via endocytosis, and they, therefore, may affect the cellular function [16]. Furthermore, the magnitudes of their modulatory effects may vary considerably among different sizes and surface coatings of the NPs [17].  TiO2 NPs is considered to be a suitable candidate for biomedical applications due to their many advantageous characters such as good optical and electronic properties, photocatalytic activity as well as being stable, non-toxic, cheap, and biologically and chemically inert [18]. Simultaneously, the high surface area of TiO2 NPs results in remarkable capability for drug loading and nanocarriers formation. Therefore, TiO2 NPs reconsidered as an efficient drug carrier for cancer chemotherapy [19].           In cancer radiotherapy, TiO2 NPs showed a promising anti-cancer activity due to its photocatalytic activity. For example, TiO2 NPs are efficiently used in photodynamic therapy (PDT). The primary mechanism of action of PDT depends on the excitation of photosensitizer upon exposure of electromagnetic radiation that generates cytotoxic ROS, which induces the cascade of apoptosis. Moreover, TiO2 NPs showed a promising anti-cancer effect in photothermal therapy (PTT). The principle of PTT depends on the accumulation of TiO2 NPs in cancer cells that will be excited with irradiation of tumor tissue leading to hyperthermia and cell death. Moreover, TiO2 NPs are applied in cancer bioimaging, such as photodynamic diagnosis (PDD) [20]. 6. Characterization of TiO2 NPs           Despite the widespread use of TiO2 NPs, their use in research has some problems, such as irregular shape, broad size range, and a high potential for aggregation, all of which make it difficult to generate accurate data regarding nanoparticle safety for use in the future development of nanoparticle applications. Size, in particular, is a critical parameter affecting both the cellular uptake and cytotoxicity of nanoparticles. Kim et al. found that 113                                                                                                            B. Ahmed et al. 2021                                                                                                            Mansoura Vet Med J 22:3 (2021) 111-116 nanoparticles ranging from 400 to 800 nm exhibit enhanced cytotoxicity resulting from ROS generation in response to oxidative stress [21]. Furthermore, Andersson et al.  reported that both the primary size and agglomeration size of nanoparticles play essential roles in cytotoxicity through different cellular uptake pathways and pro-inflammatory responses. Therefore, controlling the size of nanoparticles is particularly important for research examining their cytotoxicity [22].  The relationship between the sizes of nanoparticles and their cytotoxicity has not been thoroughly elucidated. The critical problem preventing the elucidation of this relationship is rooted in the non-uniform sizes of the nanoparticles used in previous studies and their tendency to aggregate. Because of these issues, it has been challenging to define suitable size ranges for nanoparticles to be used in drug delivery and therapeutic agents. Therefore, the production of nanoparticles of uniform size and shape could increase their medical applicability by enabling the accurate determinations of the relationship between nanoparticle size and biocompatibility [23]. 7. Coating of TiO2 NPs by polyethylene glycol  Figure I. Scanning electron microscope (SEM) and Transmission electron microscope (TEM) images of TiO2 NPs that shows the aggregation tendency of the nanoparticles [24].  Figure II. Morphological characterization and structure diagram of TiO2 PEG nanoparticles of different sizes. TiO2-PEG nanoparticles 100, 200, and 300 nm in size were characterized by SEM (upper panels) and TEM (lower panels). Both SEM and TEM images showed that the nanoparticles were spherical and uniform. The characterization of TiO2PEG NPs confirmed the enhancement effect of PEG-glycation on the dispersity and uniformity of TiO2 NPs [23].   Polyethylene Glycol (PEG) is generally considered a safe polymer. It is therefore widely utilized in medicine and biotechnology due to its unique properties, such as biocompatibility, ready excretion from living organisms, and resistance to protein adsorption. In our work, PEG was used to functionalize the TiO2 surface to decrease the cytotoxicity of NPs.  Generally, when NPs are dispersed in a culture medium, protein molecules adsorb onto the surface, forming a corona that increases the mean size of the particles [25]. However, surfaces covered with PEG resist protein adsorption due to the high steric exclusion of PEG. Besides, PEG modification decreases the surface area/volume ratio and thus reduces the aggregation of NPs. Therefore, PEG modification was expected to reduce the tendency of TiO2-PEG NPs to aggregate and hence improves the biological efficacy of TiO2-PEG NPs [26].   8. Applications of TiO2 NPs for cancer therapy  8.1. TiO2 NPs and PDT         PDT is one of the effective treatment models that has been studied for various cancers. PDT depends on its sensitivity to light and non-toxic photosensitizer (PS) drugs given to cancer patients and could accumulate in the tumor tissue [27]. The PS can be excited with light, which has a wide range of wavelength of 580 to 810 nm. The resultant excitation of the PS within the particular wavelength will react with the cancerous tissues' molecular oxygen, and ROS is generated to eradicate cancer tissues. PDT reaction induces tumor death by several cell death pathways, especially autophagy and apoptosis [28].          TiO2 NPs could be used as PS. TiO2 NPs are safe inert in a non-excited state, and when applied to the patient, it accumulates in tumor tissue. After TiO2 NPs being excited by a light source with a long therapeutic threshold wavelength that ranges from 580 to 810 nm, a photo-oxidative reaction occurs in which NPs react with water and produce OH* radicals and O2* anions, that are a cytotoxic type of ROS. Increased ROS will induce oxidative stress and initiate cell death pathways to cause cancer cell death [29].  1. Administration of      TiO2 NPsApoptosisTiO2 NPs and PDT4. TiO2 NPs induce ROS generation leading to apoptosis Created by bio render Figure III. mechanism of using TiO2 NPs in PDT. After systematic administration of TiO2 NPs, the NPs accumulate in tumor tissue, and with site-selective irradiation, TiO2 NPs inside cancer cells increased ROS regeneration leading to apoptosis and cancer cells death.  114                                                                                                            B. Ahmed et al. 2021                                                                                                            Mansoura Vet Med J 22:3 (2021) 111-116 8.2. TiO2 NPs and PTT PTT is a therapeutic method in which photon energy is converted into heat to induce hyperthermia in malignant tumor cells. In this method, energy conversion is performed by nanoparticles (NPs) to enhance induced heat efficacy. The low cytotoxicity and high optical absorbance of TiO2 NPs used in this technique are significant [30].        PTT using NPs promises a new technique to efficiently treat cancer cells without any significant limitation or side effects. In particular, TiO2 NPs play an efficient role in converting the photon energy of laser light into heat due to their specific physicochemical properties such as good thermal conductivity, good optical absorption, and in-vivo chemical, thermal stability. These characteristics enable NPs to induce hyperthermia in malignant tissues [31]. 1. Administration ofTiO2 NPsHyperthermiaTiO2 NPs and PTT4. TiO2 NPs convert photon energy of laser in to heatCreated by bio render2. TiO2 NPs accumulatein tumor tissue3. Laser irradiation Figure IV. mechanism of using TiO2 NPs in PTT. After systematic administration of TiO2 NPs, the NPs accumulate in tumor tissue, and with site-selective irradiation, TiO2 NPs inside cancer cells convert the laser energy into heat and generates hyperthermia that results in cancer cells death.  9. Applications of TiO2 NPs for cancer diagnosis 9.1. TiO2 NPs and PDD  The European association of urology has recommended PDD for the detection of urinary bladder carcinoma. PDD depends on using a photosensitizer, which is a fluorophore drug characterized by being non-toxic to the cells and able to localize in cancer tissues only precisely. By site-selective irradiation using laser light with Low wavelengths, ranging from 370 to 410 nm, the PS will be excited [32]. The excited PS will fluoresce, leading to auto-fluorescent tumor identification. If PDD will be engineered and applied correctly, it will be rapid, accurate, non-invasive and has the potential to be used to identify both primary and secondary cancer. Since PDD utilizes photosynthesizers, PDT can be used immediately after cancer identification; since the photosynthesizers agent remains inactive after it fluoresces at the low wavelength, it can be activated at a high wavelength start immediate treatment [33].         The first generation PDD agents is 5-Aminolevulinic acid (5-ALA), which is enzymatically converted to protoporphyrin IX (PpIX). 5-ALA is considered the only widely used first-generation PS in dermatology as it demonstrated a promising outcome for PDD. ALA could be excited at a wavelength range of 375 to 445 nm, such as visible blue light. Even though the limitations of first-generation PSs promote the research to discover and develop further PSs, that could show superior properties to allow them to be considered an ideal choice for a combination of both PDT and PDD applications [34].           TiO2 NPs are used as enhancement agent to increase fluorescence signals. Much recent research work concluded that TiO2 PEG NPs could decrease photobleaching, enhance and prolong fluorescence of PDD agents and hence, improve tumor visualization by PDD [35]. The simultaneous application of PDD with PDT is very advantageous as it will lead to cancer diagnosis and therapy. The benefits came from the synergistic mechanism of action in which a PS drug will be used and excited with several light sources. Therefore, the PS can induce two different biochemical effects. One is fluorescence for diagnosis, and the second is a biochemical response, such as apoptosis for treatment [36].  The difference between PDD and PDT mechanisms rely on how the PS would be excited. For PDT, the PS is excited using a light source with a longer therapeutic window wavelength, ranges from 600 to 800 nm. It leads to a photo-oxidative reaction and induction of ROS regeneration, such as hydroxyl radicals and superoxide anions. The increased ROS could induce oxidative stress within cancer cells and initiate cell death pathways that finally results in tumor destruction. PDD and PDT have the same requirements: a PS drug that can accumulate in cancer tissue. The only difference being the different light wavelengths to be used for PS excitation that lead to either diagnostic auto-fluorescence or cytotoxic species induction for treatment [37]. Conclusion       Recently, nanomaterials elucidated a favorable outcome in the field of nanomedicine. Therefore, many research efforts are conducted to discover, characterize and modify new nanomaterials for the favor of medicine.       TiO2 NPs are nanomaterials widely used in cancer therapy and bioimaging, such as photodynamic therapy, photothermal therapy and photodynamic diagnosis. Modification in the characteristics and surface coating of TiO2 NPs could lead to new and different outcomes directed toward the improvement of nanomedicine. Therefore, it is recommended to study, modify and investigate the biological, medical, and toxicological effects of TiO2 NPs.    115                                                                                                            B. Ahmed et al. 2021                                                                                                            Mansoura Vet Med J 22:3 (2021) 111-116 Acknowledgement: NA Conflict of interest  Authors declare that they have no conflict of interest Authors, Contribution Authors contributed equally Abbreviations NPs TiO2 FDA PS PDT PTT PDD Nanoparticles Titanium dioxide Food and drug administration Photosynthetizer Photodynamic therapy Photothermal therapy Photodynamic diagnosis    REFERENCES  [1] Jeevanandam J, Barhoum A, Chan YS, Dufresne A, Danquah MK. Review on nanoparticles and nanostructured materials: history, sources, toxicity and regulations. Beilstein J. Nanotechnol. 2018;9:1050-74. https://doi.org/10.3762/bjnano.9.98 [2] Raja G, Cao S, Kim D-H, Kim T-J. Mechanoregulation of titanium dioxide nanoparticles in cancer therapy. Mater. Sci. Eng: C. 2020;107:110303. https://doi.org/10.1016/j.msec.2019.110303 [3] Akram MW, Raziq F, Fakhar-e-Alam M, Aziz MH, Alimgeer K, Atif M, et al. Tailoring of Au-TiO2 nanoparticles conjugated with doxorubicin for their synergistic response and photodynamic therapy applications. J. Photochem. Photobiol. A Chem, 2019;384:112040. https://doi.org/10.1016/j.jphotochem.2019.112040 [4] Shah Z, Nazir S, Mazhar K, Abbasi R, Samokhvalov IM. PEGylated doped-and undoped-TiO2 nanoparticles for photodynamic Therapy of cancers. Photodiagn Photodyn Ther, 2019;27:173-83. https://doi.org/10.1016/j.pdpdt.2019.05.019 [5] Rauscher H, Sokull-Klüttgen B, Stamm H. The European Commission's recommendation on the definition of nanomaterial makes an impact. Nanotoxicol. 2012;7:1195-7.  https://doi.org/10.3109/17435390.2012.724724 [6] Bleeker EA, de Jong WH, Geertsma RE, Groenewold M, Heugens EH, Koers-Jacquemijns M, et al. Considerations on the EU definition of a nanomaterial: science to support policy making. Reg Toxicol Pharmacol. 2013;65:119-25. https://doi.org/10.1016/j.yrtph.2012.11.007 [7] Guidance D. Guidance for industry considering whether an FDA-regulated product involves the application of nanotechnology. Biotechnol Law Rep. 2011;30:613-6. https://doi.org/10.1089/blr.2011.9814 [8] Del Pino P, Pelaz B, Zhang Q, Maffre P, Nienhaus GU, Parak WJ. Protein corona formation around nanoparticles–from the past to the future. Mat Horiz. 2014;1:301-13. https://doi.org/10.1039/C3MH00106G [9] Louro H. Relevance of physicochemical characterization of nanomaterials for understanding nano-cellular interactions.  Cell Mol Toxicol Nanopart: Springer; 2018. p. 123-42. https://doi.org/10.1007/978-3-319-72041-8_8 [10] Koltsakidou A, Terzopoulou Z, Kyzas GZ, Bikiaris DN, Lambropoulou DA. Biobased poly (ethylene furanoate) polyester/TiO2 supported nanocomposites as effective photocatalysts for anti-inflammatory/analgesic drugs. Mol. 2019;24:564. https://doi.org/10.3390/molecules24030564 [11] Albanese A, Tang PS, Chan WC. The effect of nanoparticle size, shape, and surface chemistry on biological systems. Ann Rev Biomed Eng. 2012;14:1-16. https://doi.org/10.1146/annurev-bioeng-071811-150124 [12] Noman MT, Ashraf MA, Ali A. Synthesis and applications of nano-TiO 2: Rev Environ Sci and Poll Res. 2019;26:3262-91. https://doi.org/10.1007/s11356-018-3884-z [13] Danhier F, Feron O, Préat V. To exploit the tumor microenvironment: passive and active tumor targeting of nanocarriers for anti-cancer drug delivery. J Control Rel. 2010;148:135-46. https://doi.org/10.1016/j.jconrel.2010.08.027 [14] Fernandes E, Ferreira JA, Andreia P, Luís L, Barroso S, Sarmento B, et al. New trends in guided nanotherapies for digestive cancers: a systematic review. J Control Rel. 2015;209:288-307. https://doi.org/10.1016/j.jconrel.2015.05.003 [15] Sul Y-T. Electrochemical growth behavior, surface properties, and enhanced in vivo bone response of TiO2 nanotubes on microstructured surfaces of blasted, screw-shaped titanium implants. Int J Nanomed. 2010;5:87. https://doi.org/10.2147/IJN.S8012 [16] Thurn KT, Arora H, Paunesku T, Wu A, Brown EM, Doty C, et al. Endocytosis of titanium dioxide nanoparticles in prostate cancer PC-3M cells. Nanomed Nanotechnol Biol  Med. 2011;7:123-30. https://doi.org/10.1016/j.nano.2010.09.004 [17] Krug HF, Wick P. Nanotoxicology: an interdisciplinary challenge. Ang Chem Int Ed. 2011;50:1260-78. https://doi.org/10.1002/anie.201001037 [18] Jiang H, Wang T, Wang L, Sun C, Jiang T, Cheng G, et al. Development of an amorphous mesoporous TiO2 nanosphere as a novel carrier for poorly water-soluble drugs: effect of different crystal forms of TiO2 carriers on drug loading and release behaviors. Micro Meso Mat. 2012;153:124-30. https://doi.org/10.1016/j.micromeso.2011.12.013 [19] Wang Y, Wang Q, Zhang C. Synthesis of Diamond‐Shaped Mesoporous Titania Nanobricks as pH‐Responsive Drug Delivery Vehicles for Cancer Therapy. ChemistrySelect. 2019;4:8225-8. https://doi.org/10.1002/slct.201900992 [20] Ulatowska-Jarża A, Pucińska J, Wysocka-Król K, Hołowacz I, Podbielska H. Nanotechnology for biomedical applications-enhancement of photodynamic activity by nanomaterials. Bull the Pol Acad Sci Tech Sci. 2011;59:253-61. https://doi.org/10.2478/v10175-011-0031-0 [21] Kim BY, Rutka JT, Chan WC. Nanomedicine. N Eng J Med. 2010;363:2434-43. https://doi.org/10.1056/NEJMra0912273 [22] Andersson PO, Lejon C, Ekstrand‐Hammarström B, Akfur C, Ahlinder L, Bucht A, et al. Polymorph‐and size‐dependent uptake and toxicity of TiO2 nanoparticles in living lung epithelial cells. Small. 2011;7:514-23. https://doi.org/10.1002/smll.201001832 [23] Sun Q, Ishii T, Kanehira K, Sato T, Taniguchi A. Uniform TiO 2 nanoparticles induce apoptosis in epithelial cell lines in a size-dependent manner. Biomat Sci. 2017;5:1014-21. https://doi.org/10.1039/C6BM00946H [24] Sun Q, Kanehira K, Taniguchi A. Low doses of TiO2-polyethylene glycol nanoparticles stimulate proliferation of hepatocyte cells. Sci Technol Adv Mat. 2016;17:669-76.  https://doi.org/10.1080/14686996.2016.1239499 [25] Garvas M, Testen A, Umek P, Gloter A, Koklic T, Strancar J. Protein corona prevents TiO 2 phototoxicity. PLoS One. 2015;10:e0129577. https://doi.org/10.1371/journal.pone.0129577 [26] Dell'Orco D, Lundqvist M, Oslakovic C, Cedervall T, Linse S. Modeling the time evolution of the nanoparticle-protein corona in a body fluid. PloS one. 2010;5:e10949. https://doi.org/10.1371/journal.pone.0010949 [27] Naidoo C, Kruger CA, Abrahamse H. Photodynamic therapy for metastatic melanoma treatment: A review. Technol Can Res Treat. 2018;17:1533033818791795. https://doi.org/10.1177/1533033818791795 [28] Mokwena MG, Kruger CA, Ivan M-T, Heidi A. A review of nanoparticle photosensitizer drug delivery uptake systems for photodynamic treatment of lung cancer. Photodiag Photodyn Ther. 2018;22:147-54. https://doi.org/10.1016/j.pdpdt.2018.03.006 [29] Liu L, Miao P, Xu Y, Tian Z, Zou Z, Li G. Study of Pt/TiO2 nanocomposite for cancer-cell treatment. Journal of Photochemistry and Photobiology B: Biology. 2010;98:207-10. https://doi.org/10.1016/j.jphotobiol.2010.01.005 [30] Tanner K. Titanium in medicine. Proceed Ins Mech Eng, Part H: J Eng Med. 2002;216:215-. https://doi.org/10.1243/0954411021536432 [31] Yin ZF, Wu L, Yang HG, Su YH. Recent progress in biomedical applications of titanium dioxide. Phys Chem Chem Phys. 2013;15:4844-58. https://doi.org/10.1039/c3cp43938k [32] Hu Y, Masamune K. Flexible laser endoscope for minimally invasive photodynamic diagnosis (PDD) and therapy (PDT) toward efficient tumor removal. Opt Exp. 2017;25:16795-812. https://doi.org/10.1364/OE.25.016795 [33] He J, Yang L, Yi W, Fan W, Wen Y, Miao X, et al. Combination of fluorescence-guided surgery with photodynamic therapy for the treatment of cancer. Mol Imag. 2017;16:1-15. https://doi.org/10.1177/1536012117722911 116                                                                                                            B. Ahmed et al. 2021                                                                                                            Mansoura Vet Med J 22:3 (2021) 111-116 [34] Inoue K, Fukuhara H, Shimamoto T, Kamada M, Iiyama T, Miyamura M, et al. Comparison between intravesical and oral administration of 5‐aminolevulinic acid in the clinical benefit of photodynamic diagnosis for nonmuscle invasive bladder cancer. Can. 2012;118:1062-74. https://doi.org/10.1002/cncr.26378 [35] Kanehira K, Yano Y, Hasumi H, Fukuhara H, Inoue K, Hanazaki K, et al. Fluorescence Enhancement Effect of TiO2 Nanoparticles and Application for Photodynamic Diagnosis. Int J Mol Sci. 2019;20:3698. https://doi.org/10.3390/ijms20153698 [36] Tang QO, Tran GT, Gamie Z, Graham S, Tsialogiannis E, Tsiridis E, et al. Statins: under investigation for increasing bone mineral density and augmenting fracture healing. Exp Opi on Invest Drug. 2008;17:1435-63. https://doi.org/10.1517/13543784.17.10.1435 [37] Abrahamse H, Kruger, C. A., Kadanyo, S., & Mishra, A. Nanoparticles for advanced photodynamic therapy of cancer. Photomed Las Surg. 2017;35:581-8. https://doi.org/10.1089/pho.2017.4308  ",
    "Link": "https://core.ac.uk/download/524772426.pdf"
}