{
    "Title": "How Do I Engage in Partner Reading With My Child?",
    "Authors": "The Meadows Center for Preventing Educational Risk",
    "Year": "No year available",
    "Abstract": "How Do I Engage in Partner Reading With My Child? ----   ¿Cómo participo en lectura en pareja con mi hijo? ---- Educatio",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "PLUSThis work was supported by the U.S. Department of Education through Grant H326M150016 to The University of Texas at Austin and the University of Maryland. The opinions expressed are those of the authors and do not represent the views of the U.S. Department of Education.How Do I Engage in Partner Reading With My Child?What are the components of partner reading?There are two components of partner reading:1. Partners take turns reading a short, interesting text. 2. Partners periodically stop and discuss text-based comprehension questions.Why engage in partner reading?Partner reading provides your child with the following:1. Practice reading text aloud2. Immediate corrective feedback 3. Text-based discussion4. A model of what good reading sounds likeThese benefits of partner reading can improve your child’s reading fluency. Reading fluency is your child’s ability to read quickly, accurately, and with expression. Better reading fluency is linked to better reading comprehension, which is the ultimate goal of reading (Stevens, Walker, & Vaughn, 2016). Reading fluently isn’t the only thing that will improve your child’s reading comprehension. Text-based discussions embedded in partner reading can also help your child connect information to make better sense of what he or she reads (Kamil et al., 2008).How often should I engage in partner reading practice with my child?The more students read and interact with text, the better! As students read, they are exposed to content and vocabulary, which can increase their background knowledge and, ultimately, comprehension (Swanson, Edmonds, & Hairrell, 2011)! We know you are busy, but can you find at least 20 minutes 3 days per week to engage in partner reading with your child?Middle school students are expected to read and comprehend upper-level text. You might be wondering whether there are things you can do at home to improve your child’s reading skills. Partner reading is an easy way to do just that by providing your child with more reading practice!How do I prepare for partner reading?Step 1: Select a text. You and your child can read materials that were sent home by teachers or you can choose something else entirely. Consider the following when choosing a partner reading text:• The text should be interesting. Try to find a text that supports content your child is learning about in school or a text that focuses on a topic that is interesting to your child.• The text should not be too long. Try to find a text that is approximately two to four pages in length. • The text should be challenging but possible for your child to read with your help.Step 2: Decide when you will pause to ask reading questions. Places to pause include before a new section of an article, after a paragraph with important information, and after any paragraph or section with information that may be confusing for your child. Use a sticky note or write on the text to remember when to ask questions.Step 3: Develop text-based comprehension questions. Questions should have answers that your child can support with evidence from the text. Will you ask your child general questions like, “What is this section mostly about?” Or will you ask your child specific questions like, “Why did the children call him ‘Boo’ instead of his real name?”What are the partner reading procedures?1.\t Read\tthe\tfirst\tsection\tof\tthe\ttext. Make sure your child follows along with you by reading silently. 2.\t Ask\tyour\tchild\tthe\tfirst\treading\tquestion. If your child answers incorrectly or is unsure of the answer, reread and discuss the section to find the correct answer together.3. Have your child read the next section. Follow along to help your child with any words he or she does not know or mispronounces. If your child mispronounces a word or hesitates for more than 3 seconds before reading a word, simply say, “The word is _____________. What word?”4. Ask your child the next reading question. If your child answers incorrectly or is unsure of the answer, ask him or her to reread the section. Then, discuss the section to identify the correct answer together. 5. Continue taking turns reading the remaining sections. Following each section, ask your child your predeveloped text-based comprehension questions. 6.\t At\tthe\tend\tof\tthe\ttext,\task\tyour\tchild\ta\tfinal\tquestion\tabout\tthe\ttext\toverall. Examples of final questions are “What is this text mostly about?” and “What happened in the beginning, middle, and end of the text?” If needed, return to the text to discuss important details that your child may have left out.How does partner reading look in action?Please see the next page for an example text with the partner reading procedures marked.ReferencesKamil, M. L., Borman, G. D., Dole, J., Kral, C. C., Salinger, T., & Torgesen, J. (2008). Improving adolescent literacy: Effective classroom and intervention practices: A practice guide (NCEE 2008-4027). Washington, DC: National Center for Education Evaluation and Regional Assistance. Retrieved from http://ies.ed.gov/ncee/wwcStevens, E. A., Walker, M. A., & Vaughn, S. (2016). The effects of reading fluency interventions on the reading fluency and reading comprehension performance of elementary students with learning disabilities: A synthesis of the research from 2001 to 2014. Journal of Learning Disabilities. Advance online publication. Swanson, E., Edmonds, M., & Hairrell, A. (2011). Applying a cohesive set of comprehension strategies to content area instruction. Intervention in School and Clinic, 46(5), 266–272.This Study Should Move You — Toward a Healthier and Longer LifeU.S. and global guidelines call for 150 minutes of light exercise, or 75 minutes of intense exercise, each week. Doctors say it is smart to spread out your exercise so you get some exercise on most days of the week. According to past studies, there are likely many benefits to regular exercise. Some people pack their exercise into one or two workouts per week. These people lower their risk of dying in the next 10 years nearly as much as people who exercise more often, the new study suggests.Each person in a survey of nearly 64,000 adults reported how much exercise they had done in the last month. They were then placed into four groups.Question: How much should we exercise each week? And should we exercise only a couple of days or more days in the week?Inactives Made up 60 PercentOne group was made up of inactive people. Inactive people exercise very little in their free time. Another group was made up of regular exercisers. A third group exercised enough. However, they did all their exercising in one or two days, not spread out over a whole week. They exercised a lot, but not often.The last group was made up of people who were not active enough. They exercised a little bit, but got less than the recommended amount of exercise per week. For people in the third and last groups, the risk of dying was lower than it was for people who were completely inactive. These groups included people who exercised, but not enough or not often. People who exercised enough and often lowered their risk a little more.Question: What did we learn in this section?Exercise Reduced Risk by 40 PercentAny amount of activity helped cut the risk of dying of heart disease. Exercise helped reduce risk by about 40 percent.Exercise has many other benefits. It can help prevent memory loss, depression, high blood pressure, unhealthy sleep patterns, and diabetes, experts say. Some of these effects don’t last very long, says Hannah Arem of George Washington University. The more often you exercise, the more of these benefits you’ll experience.The results are still being studied, and more information is needed, said Dr. Daniel Rader, a heart doctor at the University of Pennsylvania. “People who exercise more regularly report that they feel like they have a better quality of life,” among other benefits, he said.Still, the results are “quite fascinating and a bit surprising,” Rader said. “Even if you have time to do something only once a week, this study would suggest it’s still worth doing.”Question: What are some other benefits of exercise?Final question: What was this article mainly about?Adapted from https://newsela.com/articles/exercise-risk-warriors/id/25556/1. Parent reads the first section while the child follows along.2. Parent and child discuss the first text-based discussion question.3. Child reads this section.4. Parent and child discuss the text-based discussion question for this section.5. Parent reads this section.6. Parent and child discuss the text-based discussion question.7. Parent and child discuss the final, overarching question.",
    "Link": "https://core.ac.uk/download/226940430.pdf"
}