{
    "Title": "Beyond LLM in M-theory",
    "Authors": "A Donos, B Chen, B Fraser, BS Acharya, D Gaiotto, D Martelli, E D’Hoker, Eoin Ó Colgáin, EÓ Colgáin, EÓ Colgáin, EÓ Colgáin, H Kim, H Lin, I Bah, I Bah, J Kowalski-Glikman, J Russo, J-E Bourgine, JM Figueroa-O’Farrill, JM Figueroa-O’Farrill, JM Maldacena, JP Gauntlett, JP Gauntlett, JP Gauntlett, JP Gauntlett, JP Gauntlett, JP Gauntlett, JP Gauntlett, JP Gauntlett, JP Gauntlett, M Spalinski, N Kim, N Kim, O Aharony, O Aharony, O Lunin, OA Mac Conamhna, P Figueras, PG Freund, R Reid-Edwards, RS Ward, S-J Rey, V Pestun",
    "Year": "No year available",
    "Abstract": "The Lin, Lunin, Maldacena (LLM) ansatz in D = 11 supports two independent\nKilling directions when a general Killing spinor ansatz is considered. Here we\nshow that these directions always commute, identify when the Killing spinors\nare charged, and show that both their inner product and resulting geometry are\ngoverned by two fundamental constants. In particular, setting one constant to\nzero leads to AdS7 x S4, setting the other to zero gives AdS4 x S7, while flat\nspacetime is recovered when both these constants are zero. Furthermore, when\nthe constants are equal, the spacetime is either LLM, or it corresponds to the\nKowalski-Glikman solution where the constants are simply the mass parameter.Comment: 1+30 pages, footnote adde",
    "Keywords": "No keywords available",
    "Publisher": "'Springer Science and Business Media LLC'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "ar\nX\niv\n:1\n20\n8.\n59\n79\nv3\n  [\nhe\np-\nth]\n  8\n Fe\nb 2\n01\n3\nFPAUO-12/10\nBeyond LLM in M-theory.\nEoin O´ Colga´in\nDepartamento de F´ısica, Universidad de Oviedo,\n33007 Oviedo, Spain\nAbstract\nThe Lin, Lunin, Maldacena (LLM) ansatz in D = 11 supports two inde-\npendent Killing directions when a general Killing spinor ansatz is con-\nsidered. Here we show that these directions always commute, identify\nwhen the Killing spinors are charged, and show that both their inner\nproduct and resulting geometry are governed by two fundamental con-\nstants. In particular, setting one constant to zero leads to AdS7 × S4,\nsetting the other to zero gives AdS4 × S7, while flat spacetime is re-\ncovered when both these constants are zero. Furthermore, when the\nconstants are equal, the spacetime is either LLM, or it corresponds to\nthe Kowalski-Glikman solution where the constants are simply the mass\nparameter.\n1 Introduction\nGiven a supersymmetric solution with an anti-de Sitter (AdS) factor in D = 11\nsupergravity, it is expected that a corresponding superconformal field theory (SCFT)\nexists [1]. Beyond the near-horizon of M2 and M5-branes, one way to get more\nintricate geometries is to consider wrapped branes. In the past, explicit solutions\nof this nature have been constructed in lower-dimensional gauged supergravities\n[2, 3, 4, 5, 6], and subsequent efforts have been made directly in higher-dimensions\nto characterise large classes of AdS geometries by employing wrapped brane ansa¨tze\n[7, 8, 9]. While the latter offers greater generality, primarily because one is not\nconfined to a particular dimensional reduction, a recognised advantage of working in\nlower-dimensions is that it is easier to construct explicit solutions. A notable recent\nexample is a new class of four-dimensional N = 1 SCFT [10, 11] duals generalising\n[2]1.\nMore generally still, it is possible to discard wrapped brane intuition completely\nand embrace powerful Killing spinor techniques in higher-dimensions [13, 14]. In the\nprocess the Killing spinor equations (KSE) are converted into differential conditions\non spinor bilinears (differential forms) which characterise the spacetime. In D =\n11 this approach has been applied widely [15, 16, 17, 18, 19], but two prominent\nexamples concern geometries dual to four-dimensional N = 1 [20] and N = 2\nSCFTs [21]. The beauty here is that the expected SO(4, 2) conformal symmetry\ngets encoded in the AdS5 factor, while the key distinction between N = 1 and\nN = 2 depends on the presence of a two-sphere encoding the SU(2) R-symmetry\ngeometrically. Up to warpings, these ansa¨tze are extremely general and an added\nbonus is that, in each case, a U(1) R-symmetry emerges for free form the KSE\nanalysis.\nQuotients of AdS5 × S5 aside [22], all known solutions corresponding to N = 2\nSCFT dual geometries can be traced to the Lin, Lunin, Maldacena (LLM) class of\ngeometries [21], earning it a billing as the most general class of geometries dual to\nN = 2 SCFTs. The generality of the LLM geometries has recently been strengthened\nby the observation [23] that a missing four-form flux in the analysis of LLM is\ninconsistent with supersymmetry. Given their uniqueness, the LLM geometries serve\nas an important basis for subsequent studies. In particular, the gravity duals of a\nlarge class of N = 2 generalised quiver gauge theories [24] were identified and\nanalysed by Gaiotto and Maldacena [25]. As discussed in [25], since solutions to\n1See [12] for a recent discussion on the construction of solutions in higher-dimensions highlight-\ning some associated difficulties.\n1\nthe LLM class of geometries are in one-to-one correspondence with solutions to the\ncontinuum Toda equation, the task of finding solutions can be simplified greatly by\nthe introduction of a global U(1) and reduction to type IIA supergravity, a setting\nwhere the Toda equation is replaced by an easier to solve Laplace equation. This\nsimplification has facilitated recent solutions [26, 27].\nIt is also worth bearing in mind that recent developments in our understanding\nof N = 2 gauge theories mean that geometric insights are not solely confined to\nsupergravity solutions. By using localization, the S4 partition function of N = 2\ngauge theories can be reduced to a finite-dimensional matrix integral [28], allowing\none to study the free energy [29] and circular Wilson loops [30, 31, 32, 33] at strong\ncoupling in the large-N limit. Current findings are in agreement with the sugges-\ntion in [34] that the dual theory may be sub-critical with only seven “geometric”\ndimensions comprising an AdS5 and S\n1 factor. This appears consistent with a recent\nsearch for smooth AdS5 × S2 geometries in type IIB supergravity, which concludes\nthat the SU(2) R-symmetry must be non-geometric [35].\nAgainst this background, in this paper we take the LLM ansatz in D = 11 to\nits logical conclusion. Recall that LLM [21] initially introduced a general Killing\nspinor ansatz only to truncate it once a flux term along the internal spacetime\nwas removed. While it was subsequently shown that there are no supersymmetric\nAdS5×S2 geometries in D = 11 supported by this omitted flux [23], an unexpected\nby-product was the emergence of an extra Killing direction beyond the expected\nSU(2)×U(1) R-symmetry. Although LLM can be recovered by identifying the two\nKilling directions [23], more generally it is valid to ask if either of them can play a\nroˆle as a global U(1) such as in [25].\nSo, in this paper we tidy up a loose-end in [23], by treating these two Killing\ndirections independently. Following a review in the next section, in section 3.1 we\nshow that the Killing vectors always commute, while their inner product is propor-\ntional to the product of two fundamental constant scalar bilinears. We calculate the\nnorm of the vectors and observe that when the two fundamental constants are equal\nthat one either has LLM or a spacetime with a null Killing vector. Indeed, it is in\nthis case that we note in 3.2 that it is always possible to find a linear combination\nso that the Killing spinors are independent of this direction. Later in section 5 we\nconfirm that this null spacetime is indeed the maximally supersymmetric pp-wave\nin D = 11.\nMore generally, when the two constants differ, an extreme case of which is when\none of them is zero, we see that the Killing spinors are always charged with respect\nto both directions indicating that supersymmetry must be double that of LLM.\n2\nIt is then well-known [36] that AdS4 × S7, AdS7 × S4 and flat spacetime are the\nonly timelike possibilities. A noticeable caveat here is that the Killing spinors are\nuncharged for flat spacetime, so to fill this gap in the argument, in section 4.1\nwe determine the Killing spinors and the geometry by integrating the differential\nconditions directly. Our observations here on the existence of different branches of\nsupersymmetric solutions in D = 11 supergravity mirror findings in related settings,\nnotably half-bps spacetimes with isometry SO(2, 2)× SO(4)× SO(4) [37, 38].\nIn the rest of this paper, case by case, we reduce the Killing spinors of the known\nsolutions from D = 11 down on S5 and S2 to isolate the two Killing spinors of the\nLLM ansatz. This allows us to construct all the bilinears explicitly, confirm that the\nconstant bilinears take the expected form and satisfy ourselves that the differential\nconditions of [23] are satisfied. As we will see in due course, the involved form of\nthese spinors, especially for the Freund-Rubin spacetimes, suggests that using spinor\nbilinears is not an ideal way to solve the Killing spinor equations, and that these\nare better solved in D = 11. On the other hand, through the language of spinor\nbilinears, we are in a position to make general statements about supersymmetric\nspacetimes beyond LLM.\n2 Review\nWe begin with a lightning review of D = 11 supergravity solutions preserving\nSO(6) × SO(3) symmetry2. The D = 11 supergravity ansatz may be written as\na warped product of S5, S2 and a Lorentzian signature spacetime, M4,\nds2 = e2λ\n[\n1\nm2\ndΩ25 + e\n2AdΩ22 + ds\n2\nM4\n]\n,\nF (4) = G + vol(S2) ∧ F , (2.1)\nwhere the warp factors, λ and A, are functions of the coordinates onM4 and F and\nG are respectively two-forms and four-forms on M4. m is a constant denoting the\ninverse radius of S5. Throughout this work where m does not appear it should be\nassumed that we have set it to unity. We stress that this is the most general flux\nansatz consistent with the symmetries of the metric.\nDespite the symmetries of the fluxes mirroring those of the D = 11 spacetime\nansatz, it is known that the existence of G is inconsistent with supersymmetry in\nthis warped product setting [23], thus generalising a statement that G cannot be\nturned on perturbatively from the LLM class [21]. Therefore, neglecting orbifolds\n2As in [21, 23] we consider the analytically continued geometries with S5 appearing.\n3\nof AdS5 × S5 [22], all the known regular3 solutions dual to D = 4 N = 2 SCFTs fit\ninto the LLM class in D = 11.\nWith G set to zero, one finds the supersymmetry variations as they appear in\nLLM [21],\nγµ∂µλǫ± ∓\n(\n1\n12\ne−3λ−2AγµνFµν +mγ5\n)\nǫ∓ = 0, (2.2)\n(±ie−Aγ5 + γµ∂µA) ǫ± ±\n(\nmγ5 +\n1\n4\ne−3λ−2AγµνFµν\n)\nǫ∓ = 0, (2.3)\n∇µǫ± ±\n(\nm\n2\nγµγ5 +\n1\n4\ne−3λ−2AγνFµν\n)\nǫ∓ = 0. (2.4)\nA linear combination of (2.2) and (2.3) leads to an algebraic condition indepen-\ndent of F (\nγµ∂µ(3λ+ A)± ie−Aγ5\n)\nǫ± ∓ 2mγ5ǫ∓ = 0. (2.5)\nFurther details of various conventions can be found in the appendix.\nIn the absence of the four-form flux, G, these equations may be solved by iden-\ntifying the two spinors [21]\nǫ− = −γ5ǫ+, (2.6)\nso one only has to solve the Killing spinor equations for a single spinor4. In the\nprocess one finds a single Killing direction. However, when this condition is relaxed,\none finds two potentially independent Killing directions [23], and only when these\ntwo directions are identified, does one recover the LLM spinor ansatz (2.6). As the\nfocus of this work is exploring geometries where the two Killing vectors are treated\nindependently, we henceforth relax (2.6) and deal with the various complications.\nOnce one relaxes the condition on the spinors one can construct an exhaustive\nset of scalar and vector bilinears, a complete list of which can be found in appendix\nA. Furthermore, it can be shown that two of the vectors, K1 and ℜ(K8) in the\nnotation of [23], are Killing directions and that the warp factors are independent of\nthese directions5. We will throughout this work refer to these Killing directions as\nX and Y respectively.\n3A well-known remarkable feature of the LLM class of solutions is that supersymmetric solutions\nare in one-to-one correspondence with solutions to the continuum Toda equation. Despite separable\nsolutions to the Toda existing, such as those of [39], only one regular solution is known [2].\n4One attractive feature of the LLM spinor ansatz is that the vector spinor bilinears\nǫ¯γµǫ, ǫ¯γ5γµǫ, ǫ¯\ncγµǫ one constructs are all mutually orthogonal and define a natural orthonormal\nframe.\n5ℜ and ℑ denote real and imaginary parts.\n4\nEmploying a slight rewriting of the results of [23], we document the following\ndifferential conditions on the scalars:\neAd(e−AS1) = e\n−AK4, (2.7)\neAd(e−Aℜ(T3)) = −e−Aℑ(K7), (2.8)\ne−3λd(e3λS1) = 2mℑ(K8), (2.9)\ne−3λd(e3λℜ(T3)) = 2mK2, (2.10)\ndU2 = −mK5. (2.11)\nFurthermore, supersymmetry tells us that the following bilinears are trivial\nU1 = T1 = ℑ(S3) = 0, (2.12)\nand that we have two constant scalar bilinears\ndS2 = dℑ(T3) = 0. (2.13)\nThese constants we will refer to henceforth as s and t respectively. As we shall see\nin due course, it is these two constants that play a pivotal role in determining the\nfinal form of the resulting geometry. An extra bonus is that supersymmetry also\nallows us to determine certain bilinears in terms of these constants:\nS3 = −2meAs,\nT2 = 2me\nAt,\nK3 = −seAd(3λ+ A),\nℜ(K7) = −teAd(3λ+ A). (2.14)\nMore details on notation and conventions can be found in [23].\n3 Killing vectors\nRecall from [23] that when the Killing vectorsX and Y are identified one recovers the\nLLM geometries [21]. The goal of this note is to address the possibility of these two\ndirections being independent. To do this, we will in the next subsection use general\ntechniques based on the spinor bilinears to determine the relationship between these\nKilling vectors. More particularly, we will determine their inner product, their norms\nand work out the Lie derivative of one vector with respect to the other.\nAlthough Killing directions that emerge from the Killing spinor equations typ-\nically correspond to R-symmetries, in the subsequent subsection we show that the\n5\nbilinears and their constituent spinors are indeed generically charged with respect\nto both X and Y . It is in this sense that we label them “R-symmetries”, though as\nwe will appreciate later, only one of them corresponds to a traditional R-symmetry\nof the internal geometry.\nHaving shown that X and Y are R-symmetries, this rules out any immediate\nconnection to the work of Gaiotto and Maldacena [25]. As a simple check of this,\nwe explicitly show that the U(1) isometry of the hyperbolic space in the Maldacena-\nNu´n˜ez solution cannot correspond to X or Y , or indeed any combination. Therefore,\nthe connection to [25] is through first recovering LLM by setting X = Y and then\ninserting a new U(1) isometry by hand.\n3.1 Commuting vectors\nHere we determine the inner product of X and Y and also the Lie derivative of\none with respect to the other. We will see in due course that the vectors always\ncommute, a statement that naturally becomes trivial when they are the same vector,\ni.e. in LLM. A similar calculation with commuting Killing vectors appeared in [35].\nWe begin by addressing when the vectors are orthogonal. Using the Fierz identity\n(A.8), it is possible to show that the inner product of X and Y is\nX · Y = −2\n3\nst\n[\n1 + 4m2e2A +\ne2A\n2\n|d(3λ+ A)|2\n]\n, (3.1)\nor by further combining with K3 · ℜ(K7), it is possible to directly show that the\nbracket cannot vanish:\nX · Y = −st [1 + 4m2e2A] . (3.2)\nIn deriving this result we have made use (2.14). One can confirm that this result is\nindeed consistent with LLM by employing the following rewritings\ns = t = 1,\n2X = 2Y = −KLLM ,\n2meA = − sinh ζLLM , (3.3)\nand comparing to (F.31) of LLM [21]. These identities allow us also to infer the\nfollowing useful identity\ne2A|d(3λ+ A)|2 = (1 + 4m2e2A). (3.4)\nReturning to (3.2), we observe that the Killing directionsX and Y are orthogonal\nwhenever one of s and t are zero, or indeed when both vanish.\n6\nWe can now calculate the norms of the Killing vectors using (3.4) and expressions\nin the appendix (A.11), (A.12). A straightforward calculation then reveals the\nfollowing:\n|X|2 = − [S21 + ℜ(T3)2 + t2(1 + 4m2e2A)] , (3.5)\n|Y |2 = [S21 + ℜ(T3)2 − s2(1 + 4m2e2A)] . (3.6)\nWe now see thatX is timelike which is expected since its temporal component cannot\nbe zero without the spinors ǫ± being zero (see appendix). In contrast, whether Y is\ntimelike or spacelike depends on the scalars S1 and ℜ(T3), which are zero for LLM,\nin which case, (3.2), (3.5) and (3.6) all agree.\nNow we are on the verge of making an interesting observation. We can show that\nthe norm of the difference X − Y is zero whenever s = t. This means that X − Y is\neither zero or null. Then, it is known from the work of [23] that LLM follows once\nX and Y are identified. This leaves the only unexplored possibility with s = t being\na null spacetime. Later, by integrating the differential conditions, we will identify\nthis null spacetime uniquely.\nWe now turn attention to whether the vectors X and Y commute or not. This is\nindependent of any choices for s and t. Essentially one can ask under what conditions\nis the Lie derivative of Y with respect to X , LXY ≡ [X, Y ], zero. To answer this\nquestion, one first determines dX and dY [23]\ndX = m\n2\n[ǫ¯+γ5γµνǫ− − ǫ¯−γ5γµνǫ+] dxµν + 2mse−3λ−AF , (3.7)\ndY = −m\n2\n[ǫ¯+γµνǫ+ − ǫ¯−γµνǫ−] dxµν + 2mte−3λ−AF . (3.8)\nThe commutator may then be written iXdY − iY dX . This expression can be\ndivided into a part involving contractions with the two-form flux F and a part\nwithout. We first focus on the part of the commutator involving F .\nUsing (2.14) and the expressions [23]\niXF = 2me3λ+2A\n[\n2sdeA −K3] = 2msd [e3λ+3A] , (3.9)\niYF = 2me3λ+2A\n[\n2tdeA − ℜ(K7)] = 2mtd [e3λ+3A] , (3.10)\nit is an easy task to convince oneself that these F dependent terms vanish.\nWe now turn attention to the remaining terms. Making use of the following\nidentities:\nγµγ\nµν = 3γν ,\nγµγ\nργµν = −γρν − 3ηρν,\nγµγ\nρσγµν = −γρσν + γρησν − γσηρν , (3.11)\n7\na lengthy calculation6 involving the Fierz identity reveals that\n[X, Y ] = 2m2eA [−sℜ(K7) + tK3] , (3.12)\nwhich identically vanishes using (2.14). As a result [X, Y ] = 0 without having to\nmake any assumption about the constants s or t. In other words, these Killing\nvectors always commute and the LLM class of geometries where X = Y is just one\nconfiguration where this relationship between the vectors becomes trivial. Our hope\nfor the rest of this paper is to identify spacetimes where X and Y are independent.\n3.2 Killing vectors are R-symmetries\nIn this subsection we bring attention to the fact that the spinor bilinears are in\ngeneral charged with respect to X and Y . Some calculations involving the Fierz\nidentity reveal the following relationships:\nX ·K2 = −S1s, (3.13)\nX ·K4 = 2eAsℜ(T3), (3.14)\nX · ℑ(K7) = 2eAsS1, (3.15)\nX · ℑ(K8) = sℜ(T3), (3.16)\nand\nY ·K2 = −tS1, (3.17)\nY ·K4 = 2eAtℜ(T3), (3.18)\nY · ℑ(K7) = 2eAtS1, (3.19)\nY · ℑ(K8) = tℜ(T3). (3.20)\nUsing (2.7) - (2.10) and the fact that the warp factors are independent of X and\nY [23], we can now infer that the scalar bilinears S1 and ℜ(T3) are charged with\nrespect to both X and Y . Note from (2.5) it is not possible for ǫ+ to be charged\nwhile ǫ− is not, since as the warp factors are independent, we have to conclude that\nboth ǫ+ and ǫ− are charged with respect to X and Y .\nOne can now worry about what happens when one of s and t take special values.\nWhen either s or t is set to zero, it would appear that the above bilinears become\nindependent of the X or Y direction. However, by analysing other directions, one\ncan show using (2.11) that the spinors are still charged with respect to both\nX ·K5 = itU2,\nY ·K5 = isU2. (3.21)\n6At some point it is good to use the identity 1\n2\nǫ¯1γρσǫ2ǫ¯3γ5γ\nρσνǫ4 = ǫ¯3γρǫ4ǫ¯1γ5γ\nρνǫ2.\n8\nMore generally, for generic s, t, with s 6= t, it can be shown that it is not possible\nto find a linear combination so that the Killing spinors become independent of this\ndirection.\nHowever, when s = t we see that the spinors are no longer charged with respect\nto the direction X − Y , and further when s = t = 0 that the spinors are no longer\ncharged with respect to both X and Y . We will deal with these special cases in\nthe next section. For the moment, we stress that the Killing spinors are generically\ncharged with respect to both X and Y . We will put this observation to use again\nin the section 4.\nSo far we have assumed that the Killing spinors are completely generic. For\nexample, by confining ourselves to Killing spinors where the scalar bilinear U2 is\nzero, we see that we can find a linear combination, i.e. tX − sY , such that the\nabove bilinears are no longer charged with respect to this direction. Then, despite\nit being a bit awkward, we have the freedom to adopt X and tX − sY as our two\nKilling directions, so that the Killing spinors are now only charged with respect to\none of these directions. However, having set U2 = 0, we also have K\n5 = 0 and\nusing (2.36) of [23], K9 = 0. As we will discuss more fully in the next section,\nour ansatz generically assumes at least sixteen supersymmetries, a situation which\ncorresponds to the Killing spinor ǫ+ having only a single component. In general,\nit can have a maximum of two independent components corresponding to maximal\nsupersymmetry. Therefore, without loss of generality, we can then take ǫ+ to be\na two-component spinor. Then by employing the explicit gamma matrices in the\nappendix, it is possible to show that if U2 = 0, then ǫ− ∝ γ5ǫ+, meaning that we\nare back to LLM. Similar arguments hold when S1 and ℜ(T3) are taken to vanish.\n3.3 Connection to Gaiotto-Maldacena\nSince the continuum Toda equation has a reputation for being difficult to solve,\nstarting with the work of Gaiotto-Maldacena [25] (GM), recent solutions have been\nconstructed by exploiting an extra U(1) symmetry that may be introduced by hand\nalong the Riemann surface. In the process one trades the Toda equation for the\ncylindrically symmetric Laplace equation and a resulting equivalence with axially\nsymmetric electrostatic problems in three dimensions [42] (see also [43]). As this\nU(1) is a global symmetry, while preserving supersymmetry, one can reduce to IIA\nwhere it is possible to identify further solutions [26, 27].\nWith this added U(1), we now have solutions with two commuting U(1)’s, one\ncorresponding to the original R-symmetry of LLM, and an extra U(1) corresponding\nto a global symmetry. While isometries emerging from the Killing spinor equations\n9\nare typically expected to correspond to R-symmetries, such as the isometries arising\nin [20, 21, 16, 17, 18, 19] in the context of D = 11 supergravity, here we look at a\nsample geometry in the GM class and confirm that the added U(1) cannot play any\nrole in X or Y .\nTo do this, we select a prominent example of a spacetime with this extra U(1)\nsymmetry, namely the Maldacena-Nu´n˜ez solution [2], but with the metric on the\nhyperbolic space rewritten to highlight the U(1). The overall solution takes the\nform [44]\nds2 =\n1\n2\nW 1/3\n[\nds2(AdS5) +\nW−1\n2\ncos2 θds2(S2) +\n1\n2\ndθ2\n+\n1\n2\nds2(H2) +W−1 sin2 θ (dψ + v)2\n]\n, (3.22)\nF (4) =\ncos2 θ\n4W\n[\n− 1\nW\n[3 + cos2 θ] sin θdθ(dψ + v) + cos θ vol(H2)\n]\n∧ vol(S2),\nwhere\nW = 1 + cos2 θ, ds2(H2) = 4\n[\ndr2 + r2dβ2\n(1− r2)2\n]\n, v =\n2r2\n1− r2dβ. (3.23)\nNote that this solution corresponds to an analytic continuation of the LLM\nansatz, but this distinction will not be important for our purposes. As the solution\nis expressed in the form of our ansatz (2.1), we can now simply read off the warp\nfactors:\neλ =\nW 1/6√\n2\n, eA =\nW−1/2 cos θ√\n2\n. (3.24)\nAs X and Y both satisfy the same condition (3.9) and (3.10) up to the constants\ns and t, we can ask if the Killing vectors ∂ψ and ∂β satisfy this relation. While\n∂ψ satisfies this condition, a quick calculation reveals that ∂β cannot correspond to\neither X or Y as when contracted into F it produces a term proportional to dr that\ncannot be sourced form d[e3λ+3A]. For similar reasons, it cannot correspond to the\ndifference X − Y when s = t.\nSo we summarise what we have learned in this section. When the Killing spinor\nansatz of LLM is generalised, one finds two Killing vectors and the naive expectation\nis that both of these are “R-symmetries”. By comparing with a typical example of\nthe GM class of geometries, we see that the U(1) of the Riemann surface cannot\ncorrespond to either of these Killing directions, thus making a direct connection\nbetween our work here and that of GM remote. The connection is then via LLM,\nsince it was shown in [23] that once the Killing vectors are proportional, then they\ncorrespond to the same U(1) and the LLM analysis follows. One is then free to\ninsert a global U(1) and recover the work of GM.\n10\n4 Timelike case\nNow that we have built up a picture of the spinors in terms of spinor bilinears, we\ncan make a statement about the amount of supersymmetry. The warped S5 × S2\nansatz already means that we have a large amount of supersymmetry, notably 16\nsupercharges in the case of LLM [21]. Recall from LLM that the spinors ǫ± are\nassumed to be directly related through (2.6), so there is only a single spinor. Then\nif one imposes the projection conditions of LLM [21] one finds a one component\nspinor with a phase that depends only on the R-symmetry7 .\nNow, more generally, we have to incorporate two charges for the spinors, one for\neach vector X and Y . From (2.5) we have a relationship between the spinors, so they\nare both charged and we can just focus on one of them. Labeling these vectors as\n∂τ and ∂ψ, without loss of generality we can take ǫ+ to be a four-component spinor\nwith one component carrying a phase of the form eiτ . Now, if we have another\nvector ∂ψ with respect to which ǫ+ is also charged, there are only two options.\nEither this phase multiples the original component of the spinor, in which case it is\nindistinguishable from the phase in τ , or it is forced to reside in another component\nof the four-component spinor. Thus, unless ∂τ and ∂ψ are the same vector, as in\nLLM, then supersymmetry is automatically doubled as we have one more component\nin the spinor. In other words, we have to have maximal supersymmetry.\nThen with maximal supersymmetry in D = 11, it is a well-known theorem [36]\nthat the only solutions are of the Freund-Rubin [40], Kowalski-Glikman [41] or flat\nspacetime type. There is however a noticeable caveat. We have assumed the spinors\nare charged to deduce that flat spacetime and the maximally supersymmetric pp-\nwave are solutions! Indeed, it is precisely for these cases that the spinors are not\ncharged, or only charged under one vector, and this argument does not apply. We\nwill remedy this in subsequent sections.\nIndeed, the conclusion that beyond LLM there are only maximally supersym-\nmetric solutions is already hinted at in (3.9) and (3.10). To see this note from\nthe appendix that X ≡ K1 must have a temporal component otherwise the sum\nof the norms of the spinors becomes zero, so we will assume it is aligned solely\nalong the temporal direction. Then Y becomes spacelike when they are orthogonal.\nSo, we see that if s = 0 (an extreme s 6= t case), then the flux is not along the\ntemporal direction, i.e. the solution is AdS7 × S4, and when t = 0 the solution is\nAdS4 × S7. Then when both s = t = 0, we see that the flux is independent of both\nthe Killing directions and depends on the remaining two transverse directions. This\n7See discussion in [21] immediately below (F.48).\n11\nis already suggestively saying that the flux term does not exist and that the solution\ncorresponds to flat spacetime.\nIn the rest of this section we address the timelike solutions in turn starting with\nflat spacetime where our argument does not apply. We thus single out the flat\nspacetime case where we integrate the differential conditions on the spinor bilinears.\nIndeed, only in the flat spacetime case does it look manageable to solve for the\nKilling spinors directly given the spinor bilinears. For AdS spacetimes, we see\nlater by decomposing the Killing spinors from D = 11 using the gamma matrix\ndecomposition of LLM [21, 23] that the form of ǫ± is more complicated.\n4.1 Flat spacetime\nIn this section we show that flat spacetime follows from the requirement that both\nof the constants s and t are set to zero. To do this we make use of an explicit\ndecomposition of the gamma matrices in the appendix (A.7).\nWe begin with the facts. s = t = 0 implies the following additional spinor\nbilinears are zero through (2.14): S3, T2, K\n3 and ℜ(K7). From (3.14) and (3.18) we\nalso see that X , Y and K4 are mutually orthogonal. Also, we note that X , Y and\nℑ(K8) are also mutually orthogonal from (3.16) and (3.20). Then, it is possible to\nuse the Fierz identity to confirm that the inner product of K4 and ℑ(K8) is\nK4 · ℑ(K8) = 2(t2 − s2)meA, (4.1)\nwhich vanishes for the case at hand. As such, these four vectors define an orthonor-\nmal frame, so we choose to orient X along e0, ℑ(K8) along e1, Y along e2 and K4\nalong e3 in accordance with our choice of gamma matrices (A.7). As this simply\namounts to a choice of frame, we are always at liberty to do this.\nThen, noting that the gamma matrices are themselves tensor products, we further\ndecompose the spinors as8\nǫ± = θ± ⊗ η±. (4.2)\nSince we can always rescale η± relative to θ±, without any loss of generality we will\ntake θ†±θ± = 1. Plugging these expressions into K\n3\n1 = K\n3\n2 = K\n4\n1 = K\n4\n2 = 0, and\nrecalling that K43 is, by assumption, non-zero, we arrive at\nθ\n†\n±σiθ± = 0, i = 2, 3. (4.3)\nBearing in mind the unit-norm of θ±, this leaves overall phases\nǫ+ =\n1√\n2\neiβ+\n(\n1\n1\n)\n⊗ η+, ǫ− = 1√\n2\neiβ−\n(\n1\n−1\n)\n⊗ η−, (4.4)\n8Note only the Killing spinors of flat spacetime can be broken down in such a simple form.\n12\nwhere the final signs in θ± have been set using S3 = 0 with Y non-zero. The overall\nphases, β±, we can now absorb into η± through a redefinition. We now turn to\ndetermining the form of η±.\nFrom s = 0, K1 ·K2 = 0 (via Fierz), X being only along e0 and K8 not being\nalong e0, it is possible to infer the following forms for η±\nη+ =\n(\nx1e\niθ1\nx2e\niθ2\n)\n, η− =\n(\nx1e\niθ3\nx2e\niθ4\n)\n, (4.5)\nwith xi, θi ∈ R and one angular constraint θ1 − θ4 = θ2 − θ3. Then by ensuring K8\nis imaginary along e1, but real along e2 - where it corresponds to Y - we can narrow\ndown the form of η± to\nη+ = e\niθ1\n(\nx1\n−ix2\n)\n, η− = −ieiθ1\n(\nx1\nix2\n)\n. (4.6)\nWe can now introduce coordinates.\nIn this setting, as many scalar bilinears are zero, the norms of X and Y simplify\nto\n|X|2 = −|Y |2 = − [S21 + ℜ(T3)2] . (4.7)\nAt this point it is also useful to document the norms of the other two vectors making\nup the orthonormal frame\n|K4|2 = S21 + (t2 − s2)4m2e2A, (4.8)\n|ℑ(K8)|2 = S21 + (t2 − s2). (4.9)\nThen introducing the vectors ∂τ and ∂ψ for X and Y respectively, we can deter-\nmine part of the orthonormal frame. The remaining coordinates come from using\n(2.7) and (2.9), and observing that the RHS of these differential equations are closed.\nThus, we can determine the orthonormal frame in terms of a single bilinear\ne0 = (η†+σ\n3η+)dτ, e\n1 =\ne−3λ\n2(η†+σ\n3η+)\ndr5, e\n2 = (η†+σ\n3η+)dψ, e\n3 = − e\n2A\n(η†+σ\n3η+)\ndr2.\n(4.10)\nWe can now integrate (2.7) and (2.9) to establish that\nr2 = e\n−A(η†+σ\n3η+), r5 = e\n3λ(η†+σ\n3η+). (4.11)\nNow, by looking at the differential conditions for X (3.7) and Y (3.8), we can\ninfer that\n(η†+η+)(η\n†\n+σ\n3η+) = r\n−1\n5 , (4.12)\n13\nwhich may be solved in terms of another function β\nx21 = r\n−1/2\n5 cosh β, x\n2\n2 = r\n−1/2\n5 sinh β. (4.13)\nFurthermore, from the fact that the RHS of (2.8) and (2.10) are closed, we can\ndeduce that β is a constant. Finally, if one absorbs various factors involving β in\nthe various coordinates and then rescales, r2 → r−12 , r5 → r25, one recover the usual\nform of flat spacetime from the D = 11 spacetime ansatz (2.1),\nds2 = −dτ 2 + dψ2 + dr25 + r25ds2(S5) + dr22 + r22ds2(S2), (4.14)\nwhere the warp factors and the spacetime M4 become\neλ = r5, e\nA =\nr2\nr5\n,\nds2(M4) = 1\nr25\n[−dt2 + dx2 + dr25 + dr22] . (4.15)\nAs one final consistency check, one can confirm using [23]\ndK4 = m\n2\n[ǫ¯+γµνǫ− + ǫ¯−γµνǫ+] dx\nµν − e−3λ−2Aℜ(T3)F , (4.16)\ndℑ(K7) = im\n2\n[ǫ¯+γ5γµνǫ+ + ǫ¯−γ5γµνǫ−] dx\nµν − e−3λ−2AS1F , (4.17)\nthat indeed F = 0 since despite S1 and ℜ(T3) being non-zero, all other terms in\nthese differential equations are trivial.\nWe can also obtain the same result from D = 11 by simply decomposing the\nKilling spinor. Since we repeat the process later for AdS7×S4, here we simply state\nresults and omit various details. Note since there is no four-form flux, the Killing\nspinors are covariantly constant and may be written as\nη = e−\nα1\n2\nΓα1r5 · · · e−α52 Γα5α4e−φ12 Γφ1r2e−φ22 Γφ2φ1η0, (4.18)\nwhere η0 is a constant spinor and we have parameterised flat spacetime as in (4.14).\nWhen one decomposes the spinors in terms of the ansatz of LLM [21]\nη = ψ ⊗ eλ/2 [χ+ ⊗ ǫ+ + χ− ⊗ ǫ−] , (4.19)\none can proceed to read off the components,\nǫ+ =\n1\n2\ne−λ/2(1− iγ3γ5)ǫ0,\nǫ− =\n1\n2\ne−λ/2(γ3γ5 − i)ǫ0, (4.20)\nwhere ǫ0 is subject to the projector γ1γ5ǫ0 = iǫ0. Observe that, in contrast to\nAdS7 × S4, the simple form of the spinors means that ǫ+ = γ1γ5ǫ−. Observe also\nthat this relationship is a direct consequence of (2.2), when the two-form flux is\nset to zero, and is expected. Using this condition it is easy to see that s = t = 0,\nanother signal that everything is consistent.\n14\n4.2 AdS7 × S4\nIn this subsection we look in detail at the decomposition of the Killing spinors from\nD = 11 to extract out the form of ǫ±. The final form of the spinors are quite\ncomplicated and it is not recommendable to solve the Killing spinor equations this\nway via spinor bilinears. However, for completeness we determine ǫ± for AdS7× S4\nand AdS4 × S7.\nThe AdS7 × S4 solution of D = 11 supergravity may be expressed as\nds2 = ds2(AdS7) +\n1\n4\nds2(S4),\nG4 =\n3\n8\nvol(S4), (4.21)\nwhere we have adopted the usual normalisations Rµν = −6gµν and Rmn = 3gmn for\nthe curvature of AdS7 and S\n4 respectively. We can now rewrite both AdS7 and S\n4\nas fibrations involving both S5 and S2 respectively\nds2(AdS7) = − cosh2 ρdτ 2 + dρ2 + sinh2 ρds2(S5),\nds2(S4) = cos2 θdψ2 + dθ2 + sin2 θds2(S2). (4.22)\nThis makes the Killing directions, ∂τ and ∂ψ, manifest.\nNow we plan to derive the form of ǫ± for AdS7×S4 by taking the known Killing\nspinors from D = 11 and decomposing them using the LLM gamma matrices de-\ncomposition [21]:\nΓa = ρa ⊗ σ3 ⊗ γ5,\nΓα = 1⊗ σα ⊗ γ5,\nΓµ = 1⊗ 1⊗ γµ, (4.23)\nwhere a = 1, ..., 5 denotes S5 directions, α = 1, 2 denotes S2 directions and µ =\n0, . . . , 3 labels the remaining directions. Making use of the coordinates αi, i = 1, ..., 5\nfor S5 and φi, i = 1, 2 for S\n2, one can solve the D = 11 Killing spinor equation\n∇Mη + 1\n288\n[\nΓ NPQRM − 8δ NM ΓPQR\n]\nGNPQRη = 0, (4.24)\nleading to the solution\nη = e−\nρ\n2\nγΓρe−\nτ\n2\nγΓ0e−\nα1\n2\nΓα1ρe−\nα2\n2\nΓα2α1 · · · e−α52 Γα5α4 η˜,\nη˜ = e−\nθ\n2\nγΓθe−\nψ\n2\nγΓψe−\nφ1\n2\nΓφ1θe−\nφ2\n2\nΓφ2φ1η0, (4.25)\nwhere η0 is a constant spinor and we have defined\nγ = Γψθφ1φ2 . (4.26)\n15\nBefore proceeding further, it is prudent to keep one eye on the final form of the\nKilling spinor of LLM (4.19) where now eλ = sinh ρ is the warp factor, ψ denotes\nthe Killing spinor on S5 and χ± are Killing spinors on S\n2 satisfying\n∇αχ± = ± i\n2\nσαχ±, χ− = iσ3χ+. (4.27)\nIn terms of our choice of coordinates, these may be expressed as\nχ± = e\n±\nφ1\n2\niσ1e\nφ2\n2\niσ3χ\n(0)\n± , (4.28)\nwhere χ\n(0)\n± denotes constant spinors. Observe that the second condition in (4.27)\nmeans that we cannot have the same constant Killing spinor and instead require\nχ\n(0)\n− = iχ\n(0)\n+ .\nTo proceed, we decompose the constant spinor as\nη0 ≡ ψ0 ⊗ χ(0)+ ⊗ ǫ0. (4.29)\nThen making use of the relationships\n1\n2\n(χ+ − iχ−) = cos φ1\n2\nei\nφ2\n2\nσ3χ\n(0)\n+ ,\n− i\n2\n(χ+ + iχ−) = sin\nφ1\n2\nσ1e\ni\nφ2\n2\nσ3χ\n(0)\n+ , (4.30)\none can determine\nη˜ = ψ0 ⊗\n[\nξ+ ⊗ e−i θ2γψei\nψ\n2\nγθǫ0 − iξ− ⊗ γθγ5ei θ2γψei\nψ\n2\nγθǫ0\n]\n, (4.31)\nwhere we have momentarily redefined\nξ± =\n1\n2\n(χ+ ∓ iχ−), so that σ3ξ± = ±ξ±. (4.32)\nTo complete the Killing spinor, we impose the projector\nγργ5ǫ0 = iǫ0, (4.33)\nso that\nη = ψ ⊗\n[\nξ+ ⊗ e\nρ\n2\nγ0γ5e−i\nθ\n2\nγψei\nψ\n2\nγθei\nτ\n2 ǫ0\n− iξ− ⊗ γθγ5e\nρ\n2\nγ0γ5ei\nθ\n2\nγψei\nψ\n2\nγθei\nτ\n2 ǫ0\n]\n, (4.34)\nwith ψ now denoting the Killing spinor on S5 satisfying ∇aψ = i2ρaψ. Imposing\nthe projector (4.33) ensures that the Killing spinor fits into the required form of\n16\nLLM. Observe also that this is one projector less than the number imposed to get\nthe LLM class of solutions (see appendix F of [21]) and, as a result, the geometry\nhas maximal supersymmetry, instead of sixteen supersymmetries. Throughout we\nhave defined\nγ5 = iγ0ρψθ. (4.35)\nSubstituting back in for χ± and finally comparing with (4.19), it is easy to read off\nthe eventual form of the Killing spinors\nǫ+ =\n1\n2\ne−λ/2\n[\ne\nρ\n2\nγ0γ5e−i\nθ\n2\nγψ − iγθγ5e\nρ\n2\nγ0γ5ei\nθ\n2\nγψ\n]\nei\nψ\n2\nγθei\nτ\n2 ǫ0\nǫ− =\n1\n2\ne−λ/2\n[\nγθγ5e\nρ\n2\nγ0γ5ei\nθ\n2\nγψ − ie ρ2γ0γ5e−i θ2γψ\n]\nei\nψ\n2\nγθei\nτ\n2 ǫ0. (4.36)\nIt is possible to see that in agreement with expectations that s = 0. It is also\npossible to show that these Killing spinors satisfy the differential conditions for the\nscalar and vector bilinears presented in generality in [23].\n4.3 AdS4 × S7\nThe AdS4 × S7 solution may be written as\nds2 = ds2(AdS4) + 4ds\n2(S7),\nF (4) = 3 vol(AdS3), (4.37)\nwhere we have normalised Rµν = −3gµν for AdS4 and Rmn = 6gmn for S7. Rewriting\nthe solution in terms of the ansatz (2.1),\nds2(AdS4) = − cosh2 ρdτ 2 + dρ2 + sinh2 ρds2(S2),\nds2(S7) = cos2 θdψ2 + dθ2 + sin2 θds2(S5), (4.38)\nthe solution to the D = 11 KSE (4.24) is\nη = e−\nρ\n2\nγΓρe−\nτ\n2\nγΓ0e−\nφ1\n2\nΓφ1ρe−\nφ2\n2\nΓφ2φ1 η˜,\nη˜ = e−\nθ\n2\nγΓθe−\nψ\n2\nγΓψe−\nα1\n2\nΓα1θ · · · e−α52 Γα5α4η0, (4.39)\nwhere η0 is a constant spinor and here\nγ = Γτρφ1φ2 . (4.40)\nIn decomposing down to spinors living on M4 we repeat as before to get\nǫ+ =\n1\n2\ne−λ/2\n[\ne\nθ\n2\nγψγ5ei\nρ\n2\nγ0 − iγργ5e θ2γψγ5e−i\nρ\n2\nγ0\n]\nei\nτ\n2\nγρei\nψ\n2 ǫ0\nǫ− =\n1\n2\ne−λ/2\n[\nγργ5e\nθ\n2\nγψγ5e−i\nρ\n2\nγ0 − ie θ2γψγ5ei ρ2γ0\n]\nei\nτ\n2\nγρei\nψ\n2 ǫ0, (4.41)\n17\nwith ǫ0 a constant spinor satisfying γθγ5ǫ0 = iǫ0 where γ5 is defined in (4.35). Again\none can check that the expected algebraic and differential conditions are satisfied\nand that in this case t = 0.\n5 Null case\nAs noted earlier when s = t, we have two options. Either X = Y , in which case\nwe return to LLM [23], or we can take the vector X − Y to be null. At this\npoint significant questions still remain concerning supersymmetry and the expected\nspacetimes in this class. While on one hand we may expect the Kowalski-Glikman\n[41] solution to solve our differential conditions since it fits into the SO(6)× SO(3)\nansatz, on the other hand, as the Killing spinors only depend on the combination\nX+Y , we cannot argue that supersymmetry is maximal and it is possible that there\nare spacetimes with 16 supersymmetries. Indeed, simply in the class of pp-waves,\nwe can expect solutions other than Kowalski-Glikman, since it is a well-known fact\nthat all pp-waves preserve at least 16 supersymmetries.\nSo to get a better grasp on the geometries in this null class, here we opt to inte-\ngrate the supersymmetry conditions. In the process we look for other null spacetime\nsolutions which are not pp-waves. As emphasised above, even in the class of pp-wave\nsolutions, there are numerous options in D = 11 between half-maximal and maximal\nsupersymmetry [46].\n5.1 Kowalski-Glikman\nFrom our earlier analysis we know that X−Y is a null vector when s = t, so we can\nintroduce the coordinates x+, x− and associated Killing vectors ∂+, ∂−, through\ndefining\nX − Y = −C∂+,\nX + Y = A∂− + B∂+, (5.1)\nwhere as X and Y commute, the functions A and B are independent of x+, and C\nis taken to be a constant.\nIt is now easy to see from (2.7) - (2.10) and (3.13) - (3.20) that S1 and ℜ(T3) are\nindependent of X − Y , so these directions only depend on x−. It is also clear from\nthe same equations that we can introduce the following ansatz for S1,\nS1 = f cos(κx\n−), (5.2)\n18\nwhere f now depends only on the, yet to be determined, transverse directions and\nκ is a constant. This in turn determines\nℜ(T3) = −Aκf\n4s\nsin(κx−). (5.3)\nSubstituting back into (2.8), (3.15) and (3.19), we can then determine A to be a\nconstant\nA = 4s\nκ\n, (5.4)\nso S1 and ℜ(T3) are now related up to trigonometric functions. For simplicity, we\nnow set A = C through the choice κ = 4sC−1.\nIn contrast to the timelike flat case, X, Y,K4 and ℑ(K8) are no longer orthogonal,\nbut it is easy to define an orthonormal frame by shifting K4 and ℑ(K8) appropri-\nately,\nK˜4 = K4 +\n2seAℜ(T3)\nS21 + ℜ(T3)2\n(X − Y ),\nℑ(K˜8) = ℑ(K8) + sℜ(T3)\nS21 + ℜ(T3)2\n(X − Y ). (5.5)\nIt is easy to check using (3.14), (3.16), (3.18) and (3.20) that these new directions\nare orthogonal to the plane spanned by X and Y . Observe also that there is no\ndifference between the norm of K4 and K˜4, or alternatively ℑ(K8) and ℑ(K˜8), as\nthe shift is along a null direction.\nUsing the fact that the RHS of (2.7) and (2.9) are closed, we can now introduce\ncoordinates, r2 and r5, through defining\ne−Af =\n1\nr2\n, (5.6)\ne3λf = r25. (5.7)\nIn turn, this means that K4 and ℑ(K8) become\nK4 = −eAf\n[\ncos(κx−)\ndr2\nr2\n+ κ sin(κx−)dx−\n]\n,\nℑ(K8) = f\n[\ncos(κx−)\ndr5\nr5\n− 1\n2\nκ sin(κx−)dx−\n]\n. (5.8)\nWe have chosen the powers in (5.6) and (5.7) appropriately so that the metric\ntakes a familiar form, though it should be stressed that closure allows us to do this.\nIndeed, we can go further and choose the form f . From K4 · dλ, calculated directly\nfrom (2.2), we see that λ is independent of the coordinate r2. Then by rescaling the\ncoordinate r5 appropriately we can take\nf =\n1\nr5\n, eA =\nr2\nr5\n. (5.9)\n19\nNote, we can also determine the form of f by calculating the quantity (X + Y ) ·\nd(X − Y ) as prescribed in appendix B. Observe that when s = t the second term in\n(B.5) disappears and if one follows the calculation through (with m = 1), one finds\nthat f = r−15 .\nNow, using the norms (4.8) and (4.9) we can determine gr2r2 and gr5r5 , compo-\nnents of the inverse metric. Similarly from (3.5) and (3.6) we can work out the rest\nof the metric. The form of the spacetime then becomes\nds2(M4) = 4\nC2r25\n[\ndx+dx− −\n(\ns2(r25 + 4r\n2\n2) +\nB\nC\n)\n(dx−)2\n]\n+\n1\nr25\n(dr22 + dr\n2\n5). (5.10)\nAt this point it is worth observing that the overall D = 11 spacetime is of the\nform of a pp-wave since eλ = r5. It is also looking suggestive that the pp-wave in\nquestion may be the maximally supersymmetric pp-wave. To confirm this we can\ndetermine the flux term F by contracting in the vector X + Y and using (3.9) and\n(3.10). The two-form flux term of the D = 11 ansatz (2.1) may be determined to\nbe of the form\nF = 12\nC\nsr22dx\n− ∧ dr2. (5.11)\nThe Kowalski-Glikman solution (5.13) then simply corresponds to the choice9\nC =\n√\n2, s =\nµ\n6\n√\n2\n, B = 0. (5.12)\nSo, in summary, we have identified the null spacetime that arises from the LLM\nansatz uniquely. Not only is it a pp-wave, but it is the maximally supersymmetric\npp-wave, or Kowalski-Glikman solution [41]. For completeness we decompose the\nKilling spinors from D = 11 in the next subsection to work out the Killing spinors\nǫ±.\n5.2 Decomposition\nHere we derive the Killing spinor for the Kowalski-Glikman solution [41], using\nspherical coordinates to make the SO(6)×SO(3) isometry manifest. Essentially our\nanalysis parallels that of [45] modulo this change in coordinates. The KG solution\n9Here we have set B = 0 by hand. However, more generally if it is assumed to be of the usual\nform B = Bijxixj in Cartesian coordinates, where Bij is a real constant symmetric matrix, (19) of\n[46] tells us that for greater than sixteen supersymmetries we require\n∑\nj BijΓ\njχ = 0. Therefore,\nwe either have maximal supersymmetry when B = 0, or half the supersymmetry when B 6= 0.\n20\nmay be written as\nds2 = 2dx+dx− − µ\n2\n36\n(\n4r22 + r\n2\n5\n)\n(dx−)2 + dr22 + r\n2\n2ds\n2(S2) + dr25 + r\n2\n5ds\n2(S5),\nF (4) = µr22dx\n− ∧ dr2 ∧ vol(S2). (5.13)\nWe introduce the vielbein\ne− = dx−,\ne+ = dx+ − µ\n2\n72\n(4r22 + r\n2\n5)dx\n−,\ne1 = dr2, e\n2 = r2dφ1, e\n3 = r2 sinφ1dφ2,\ne4 = dr5, e\n5 = r5dα1, . . . , e\n9 = r5 sinα1 . . . sinα4dα5, (5.14)\nwhere we have used the usual nested expressions for coordinates on the respective\nspheres.\nWriting the Killing spinor equation as\n∇Mη + ΩMη = 0, (5.15)\nexpressions for the various ΩM take the form\nΩ+ = 0,\nΩ− = − µ\n12\n(Γ+Γ− + 1) I,\nΩi =\nµ\n6\nΓ+IΓi, i = 1, 2, 3,\nΩi =\nµ\n12\nΓ+IΓi, i = 4, . . . , 9, (5.16)\nwhere I = Γ123.\nIt is easy to solve for the standard Killing spinors, namely those in the kernel of\nΓ+, with the only difference in moving from cartesian to spherical coordinates being\nthat one has more spin connection expressions which enter the analysis. As always\nthe Killing spinors are independent of x+ as both Ω+ and the spin connection in\nthis direction vanish. The standard Killing spinors are thus\nηstan = e\nµ\n4\nIx−e−\nφ1\n2\nΓ21e−\nφ2\n2\nΓ32e−\nα1\n2\nΓ54 · · · e−α52 Γ98ψ+, (5.17)\nwhere ψ+ is a constant spinor satisfying Γ+ψ+ = 0. Up the the presence of the x\n−\ndependence, this is just the Killing spinor equation in flat spacetime. This is entirely\nexpected as the flux terms all come with an x− component, which when lowered,\nkills ψ+.\n21\nOur task now is to find the remaining supernumerary Killing spinors, a task\nthat is complicated somewhat by the Ωi terms not immediately vanishing. Using\nΩiΩj = 0 it is possible to show that the supernumerary Killing spinors are linear in\njust r2 and r5 with the final form of the D = 11 Killing spinor being\nη = (1− r2Ω1 − r5Ω4)\n[\ne\nµ\n4\nIx−ψ˜+ + e\nµ\n12\nIx−ψ˜−\n]\n, (5.18)\nwhere in ψ˜± we have absorbed all the angular dependence. These spinors are subject\nto the projectors Γ±ψ˜± = 0.\nThen, proceeding as before, we can decompose the D = 11 Killing spinor and\nextract out ǫ± from the LLM ansatz:\nǫ+ =\n1\n2\ne−λ/2\n[\n(1− iγr2γ5)ei\nµ\n4\nγr2x\n−\nψ+ + (1− iγr2γ5)ei\nµ\n12\nγr2x\n−\nψ−\n− ir2µ\n6\nγ+(1 + iγr2γ5)e\ni µ\n12\nγr2x\n−\nψ− − ir5 µ\n12\nγ+(1− iγr2γ5)ei\nµ\n12\nγr2x\n−\nψ−\n]\n,\nǫ− =\n1\n2\ne−λ/2\n[\n(γr2γ5 − i)ei\nµ\n4\nγr2x\n−\nψ+ + (γr2γ5 − i)ei\nµ\n12\nγr2x\n−\nψ−\n+ ir2\nµ\n6\nγ+(γr2γ5 + i)e\ni µ\n12\nγr2x\n−\nψ− + ir5\nµ\n12\nγ+(γr2γ5 − i)ei\nµ\n12\nγr2x\n−\nψ−\n]\n. (5.19)\nHere in addition to Γ±ψ± = 0, the constant spinors ψ± also satisfy γr5γ5ψ± = iψ±.\nNotice here that when we take µ→ 0 we recover the Killing spinors for flat spacetime\n(4.20), so we can have some degree of confidence in this result. Going further one\ncan determine the form of the two constants s, t. Once the constant spinors are\nscaled correctly, in terms of the mass parameter µ they take the form\ns = t = µ, (5.20)\nthus giving a physical meaning to these constants. Again, using the explicit form of\nthe spinors, one can check that the expected geometric conditions on the bilinears\nare satisfied.\n6 Discussion\nIn this work we have attempted to address a notable loose-end in the analysis of\n[23]. While this earlier work did rule out the existence of an additional flux term in\nthe context of the earlier LLM ansatz [21], when one generalised the Killing spinor\nansatz, two Killing vectors were found. As geometries dual to N = 2 SCFTs only\nrealise SU(2)×U(1) R-symmetry, this raised a pertinent question about the nature\n22\nof the mysterious second isometry direction. Thus, the goal of this paper was to\nidentify solutions beyond LLM in which these two Killing directions are manifest.\nSo, in this paper we have performed a further study of these two Killing di-\nrections. By using general techniques we have shown that they always commute\nand that their inner product is proportional to the product of two fundamental\nscalar bilinears. In addition, we have confirmed expectations that the isometry di-\nrections correspond to R-symmetries and shown that the connection to the work of\nGaiotto-Maldacena is through LLM. We have then argued that the presence of two\nindependent R-symmetries means that supersymmetry will be enhanced beyond the\nsixteen supersymmetries of LLM leading to geometries with maximum supersym-\nmetry. Where this argument fails to hold, namely for flat spacetime and pp-waves,\nwe have integrated the supersymmetry conditions directly.\nInterestingly, through our work here, we see that constant scalar bilinears play\na central role in determining the final form of the geometry. While these scalars are\ntypically normalised to unity, we observe that when one of the two is set to zero\nwe find an AdS spacetime, whereas if both are set to zero, flat spacetime is the\nonly outcome. Moreover, when both constants are equal and there is a null Killing\nvector, we have shown that these constants correspond to the mass parameter in the\nKowalski-Glikman solution. Therefore, our overarching description allows us to put\nall the maximally supersymmetric solutions on the same footing as LLM. However,\nwe must caution that supersymmetric interpolating flows from AdS7 × S4 to LLM,\ngeneralising those based on dimensional reduction [47], are not expected as the end-\npoints correspond to different values of the fundamental constants. In other words,\nif interpolating solutions exist, we can expect them to be non-supersymmetric, or\nto not include one of the end-points.\nEchoing the introduction, we stress that the identification of the isometries with\nthose of the maximally supersymmetric geometries brings the more general form of\nthe Killing spinor ansatz of LLM to its logical conclusion. A similar outcome was\nnoted in [35] where, an LLM-type ansatz in type IIB proved to be inconsistent with\nthe existence of a U(1) R-symmetry, and in the process, AdS5 × S5 was recovered.\nAs such, the SU(2) should be non-geometric for N = 2 SCFT duals in type IIB.\nThe work here suggests that new geometries dual to N = 2 SCFTs may be found\nin type IIB supergravity by searching for an extra U(1) in the classification of [48].\nIt remains to be seen if any of them are regular.\n23\nAcknowledgements\nWe are grateful to P. Galli, J. B. Wu and H. Yavartanoo for early collaboration. In\nparticular, we thank H. Yavartanoo for useful and timely insights. In addition, we\nwould like to thank Y. Lozano, J. Figueroa O’Farrill and K. Sfetsos for discussion.\nWe would like to acknowledge the hospitality of the CERN theory group where this\ndraft came together. This research is partially supported by the research grants\nMICINN-09-FPA2009-07122 and MEC-DGI-CSD2007-00042.\nA Conventions\nWe will be borrowing our conventions from [21] where we refer the reader for de-\ntails. Here we provide a brief summary. On the external space M4 with signature\n(−,+,+,+) we will take ǫ0123 = 1. As a result, defining γ5 = iγ0123, we have\nγ25 = +1. We will then adopt\n(γ0)\n† = −γ0, (γi)† = γi, (A.1)\nAlso from LLM [21], we see that the intertwiners A and C are given by\nA ≡ γ0, C ≡ γ2. (A.2)\nFrom (A.1) this means that\nAγµA\n−1 = −γ†µ. (A.3)\nIn LLM γ2 is antisymmetric and γ0, γ1, γ3 symmetric so that\nC−1γTµC = −γµ. (A.4)\nNote that subject to these choices\nγ\n†\n5 = γ5, γ\nT\n5 = −γ5. (A.5)\nThen defining D = CAT in the usual fashion, we can define the conjugate spinor\nto ǫ as ǫc = Dǫ∗ = γ2γ0ǫ∗. This implies that ǫ¯c = −ǫTγ2. Note also that D = γ2γ0\nand that DD∗ = +1, so that we have the freedom to take ǫ to be a Majorana spinor\nprovided we impose ǫc = ǫ.\nGiven spinors χ, ξ and spinor bilinears constructed from p antisymmetrised gamma\nmatrices γ(p) ≡ γµ1···µp , we have the following symmetry properties for the spinor\nbilinears\n(χ¯γ(p)ξ)† = (−1)\np(p+1)\n2\n+1ξ¯γ(p)χ,\n(χ¯cγ(p)ξ)T = (−1)\np(p+1)\n2\n+1ξ¯cγ(p)χ. (A.6)\n24\nFinally, an explicit representation of the above γ matrices may be written:\nγ0 = 1⊗ iσ3, γ1 = 1⊗ σ1, γ2 = σ1 ⊗ σ2, γ3 = σ2 ⊗ σ2. (A.7)\nEmploying this choice γ5 ≡ iγ0123 = σ3 ⊗ σ2.\nThe D = 4 Fierz identity is\nǫ¯1ǫ2ǫ¯3ǫ4 =\n1\n4\n[\nǫ¯3ǫ2ǫ¯1ǫ4 + ǫ¯3γ5ǫ2ǫ¯1γ5ǫ4 + ǫ¯3γρǫ2ǫ¯1γ\nρǫ4\n− ǫ¯3γ5γρǫ2ǫ¯1γ5γρǫ4 − 1\n2\nǫ¯3γρσǫ2ǫ¯1γ\nρσǫ4\n]\n. (A.8)\nA.1 Bilinear zoo\nS1 =\ni\n2\n(ǫ¯+ǫ+ + ǫ¯−ǫ−), S2 =\ni\n2\n(ǫ¯+ǫ+ − ǫ¯−ǫ−), S3 = ǫ¯+ǫ−,\nT1 =\n1\n2\n(ǫ¯+γ5ǫ+ + ǫ¯−γ5ǫ−), T2 =\n1\n2\n(ǫ¯+γ5ǫ+ − ǫ¯−γ5ǫ−), T3 = ǫ¯+γ5ǫ−,\nU1 = ǫ¯\nc\n+ǫ−, U2 = ǫ¯\nc\n+γ5ǫ−, (A.9)\nK1µ =\n1\n2\n(ǫ¯+γµǫ+ + ǫ¯−γµǫ−), K\n2\nµ =\n1\n2\n(ǫ¯+γµǫ+ − ǫ¯−γµǫ−)\nK3µ =\n1\n2\n(ǫ¯+γ5γµǫ+ + ǫ¯−γ5γµǫ−), K\n4\nµ =\n1\n2\n(ǫ¯+γ5γµǫ+ − ǫ¯−γ5γµǫ−),\nK5µ =\n1\n2\n(ǫ¯c+γµǫ+ + ǫ¯\nc\n−γµǫ−), K\n6\nµ =\n1\n2\n(ǫ¯c+γµǫ+ − ǫ¯c−γµǫ−),\nK7µ = ǫ¯+γµǫ−, K\n8\nµ = ǫ¯+γ5γµǫ−,\nK9µ = ǫ¯\nc\n+γµǫ−, K\n10\nµ = ǫ¯\nc\n+γ5γµǫ−. (A.10)\nA.2 Useful stuff\nHere we record some relationships derived via Fierz identity. They relate to con-\ntractions between vector bilinears:\nǫ¯+γµǫ+ǫ¯+γ\nµǫ+ = (ǫ¯+ǫ+)\n2 − (ǫ¯+γ5ǫ+)2 = −ǫ¯+γ5γµǫ+ǫ¯+γ5γµǫ+,\nǫ¯−γµǫ−ǫ¯−γ\nµǫ− = (ǫ¯−ǫ−)\n2 − (ǫ¯−γ5ǫ−)2 = −ǫ¯−γ5γµǫ−ǫ¯−γ5γµǫ−,\nǫ¯+γµǫ−ǫ¯+γ\nµǫ− = (ǫ¯+ǫ−)\n2 − (ǫ¯+γ5ǫ−)2 = −ǫ¯+γ5γµǫ−ǫ¯+γ5γµǫ−,\nǫ¯−γµǫ+ǫ¯−γ\nµǫ+ = (ǫ¯−ǫ+)\n2 − (ǫ¯−γ5ǫ+)2 = −ǫ¯−γ5γµǫ+ǫ¯−γ5γµǫ+, (A.11)\n1\n2\n(ǫ¯+γµǫ+ǫ¯−γ\nµǫ− − ǫ¯+γ5γµǫ+ǫ¯−γ5γµǫ−) = ǫ¯−ǫ+ǫ¯+ǫ− − ǫ¯−γ5ǫ+ǫ¯+γ5ǫ−,\n1\n2\n(ǫ¯+γµǫ−ǫ¯−γ\nµǫ+ − ǫ¯+γ5γµǫ−ǫ¯−γ5γµǫ+) = ǫ¯−ǫ−ǫ¯+ǫ+ − ǫ¯−γ5ǫ−ǫ¯+γ5ǫ+.(A.12)\n25\nB Details of Fierz calculations\nIn this section we give some details of how to calculate the following\n(X + Y ) · (dX − dY ). (B.1)\nFirst note that in the text we have already stated that X · dY − Y · dX , i.e. that\nthe vectors commute. This result we got by similar methods to below, so accepting\nthis result, (B.1) reduces to calculating\nX · dX − Y · dY. (B.2)\nUsing (3.7), (3.8) and the Fierz identity, after a number of cancellations, it is possible\nto show that\n(X · dX − Y · dY )ν = m\n8\n[\n−24 (S1ℑ(K8) + ℜ(T3)K2)ν\n− 4K4ρ (ǫ¯+γρνǫ− + ǫ¯−γρνǫ+)− 4iℑ(K7)ρ (ǫ¯+γ5γρνǫ+ + ǫ¯−γ5γρνǫ−)\n]\n.(B.3)\nApplying a second round of Fierz identities to the lower line, we can replace the\ncontractions\n4K4ρ (ǫ¯+γ\nρνǫ− + ǫ¯−γ\nρνǫ+) + 4iℑ(K7)ρ (ǫ¯+γ5γρνǫ+ + ǫ¯−γ5γρνǫ−)\n= − 2\nm\n(X · dX − Y · dY )ν − 12(S3K3 + T2ℜ(K7))ν , (B.4)\nleading to\n(X · dX − Y · dY )ν = m\n6\n[\n−24 (S1ℑ(K8) + ℜ(T3)K2)ν\n+ 24me2A(s2 − t2)(d(3λ+ A))ν\n]\n. (B.5)\nHere we have used (2.14) to rewrite the last expression.\nReferences\n[1] J. M. Maldacena, “The Large N limit of superconformal field theories and\nsupergravity,” Adv. Theor. Math. Phys. 2, 231 (1998) [hep-th/9711200].\n[2] J. M. Maldacena and C. Nu´n˜nez, “Supergravity description of field theories on\ncurved manifolds and a no go theorem,” Int. J. Mod. Phys. A 16, 822 (2001)\n[hep-th/0007018].\n26\n[3] B. S. Acharya, J. P. Gauntlett and N. Kim, “Five-branes wrapped on associative\nthree cycles,” Phys. Rev. D 63, 106003 (2001) [hep-th/0011190].\n[4] J. P. Gauntlett, N. Kim and D. Waldram, “M Five-branes wrapped on super-\nsymmetric cycles,” Phys. Rev. D 63, 126001 (2001) [hep-th/0012195].\n[5] J. P. Gauntlett, N. Kim, S. Pakis and D. Waldram, “Membranes wrapped on\nholomorphic curves,” Phys. Rev. D 65, 026003 (2002) [hep-th/0105250].\n[6] J. P. Gauntlett and N. Kim, “M five-branes wrapped on supersymmetric cycles.\n2.,” Phys. Rev. D 65, 086003 (2002) [hep-th/0109039].\n[7] J. P. Gauntlett, O. A. P. Mac Conamhna, T. Mateos and D. Waldram,\n“AdS spacetimes from wrapped M5 branes,” JHEP 0611, 053 (2006)\n[hep-th/0605146].\n[8] O. A. P. Mac Conamhna and E. O´ Colga´in, “Supersymmetric wrapped mem-\nbranes, AdS(2) spaces, and bubbling geometries,” JHEP 0703, 115 (2007)\n[hep-th/0612196].\n[9] P. Figueras, O. A. P. Mac Conamhna and E. O´ Colga´in, “Global geometry of\nthe supersymmetric AdS(3)/CFT(2) correspondence in M-theory,” Phys. Rev.\nD 76, 046007 (2007) [hep-th/0703275 [HEP-TH]].\n[10] I. Bah, C. Beem, N. Bobev and B. Wecht, “AdS/CFT Dual Pairs from M5-\nBranes on Riemann Surfaces,” Phys. Rev. D 85, 121901 (2012) [arXiv:1112.5487\n[hep-th]].\n[11] I. Bah, C. Beem, N. Bobev and B. Wecht, “Four-Dimensional SCFTs from\nM5-Branes,” JHEP 1206, 005 (2012) [arXiv:1203.0303 [hep-th]].\n[12] N. Kim, “The Backreacted Ka´hler Geometry of Wrapped Branes,”\narXiv:1206.1536 [hep-th].\n[13] J. P. Gauntlett and S. Pakis, “The Geometry of D = 11 killing spinors,” JHEP\n0304, 039 (2003) [hep-th/0212008].\n[14] J. P. Gauntlett, J. B. Gutowski and S. Pakis, “The Geometry of D = 11 null\nKilling spinors,” JHEP 0312, 049 (2003) [hep-th/0311112].\n[15] D. Martelli and J. Sparks, “G structures, fluxes and calibrations in M theory,”\nPhys. Rev. D 68, 085014 (2003) [hep-th/0306225].\n27\n[16] N. Kim and J. -D. Park, “Comments on AdS(2) solutions of D=11 supergrav-\nity,” JHEP 0609, 041 (2006) [hep-th/0607093].\n[17] H. Kim, K. K. Kim and N. Kim, “1/4-BPS M-theory bubbles with SO(3) x\nSO(4) symmetry,” JHEP 0708, 050 (2007) [arXiv:0706.2042 [hep-th]].\n[18] E. O´ Colga´in, J. B. Wu and H. Yavartanoo, “Supersymmetric AdS3 X S2\nM-theory geometries with fluxes,” JHEP 1008, 114 (2010) [arXiv:1005.4527\n[hep-th]].\n[19] M. Gabella, D. Martelli, A. Passias and J. Sparks, “N=2 supersymmetric AdS4\nsolutions of M-theory,” arXiv:1207.3082 [hep-th].\n[20] J. P. Gauntlett, D. Martelli, J. Sparks and D. Waldram, “Supersymmet-\nric AdS(5) solutions of M theory,” Class. Quant. Grav. 21, 4335 (2004)\n[hep-th/0402153].\n[21] H. Lin, O. Lunin and J. M. Maldacena, “Bubbling AdS space and 1/2 BPS\ngeometries,” JHEP 0410 (2004) 025 [arXiv:hep-th/0409174].\n[22] O. Aharony, A. Fayyazuddin and J. M. Maldacena, “The Large N limit of N=2,\nN=1 field theories from three-branes in F theory,” JHEP 9807, 013 (1998)\n[hep-th/9806159].\n[23] E. O´ Colga´in, J. B. Wu, H. Yavartanoo, “On the generality of the LLM geome-\ntries in M-theory,” JHEP 1104, 002 (2011). [arXiv:1010.5982 [hep-th]].\n[24] D. Gaiotto, “N=2 dualities,” JHEP 1208, 034 (2012) [arXiv:0904.2715 [hep-\nth]].\n[25] D. Gaiotto and J. Maldacena, “The Gravity duals of N=2 superconformal field\ntheories,” arXiv:0904.4466 [hep-th].\n[26] R. A. Reid-Edwards and B. Stefanski, jr., “On Type IIA geometries dual to N\n= 2 SCFTs,” Nucl. Phys. B 849, 549 (2011) [arXiv:1011.0216 [hep-th]].\n[27] O. Aharony, L. Berdichevsky and M. Berkooz, “4d N=2 superconformal linear\nquivers with type IIA duals,” arXiv:1206.5916 [hep-th].\n[28] V. Pestun, “Localization of gauge theory on a four-sphere and supersymmetric\nWilson loops,” Commun. Math. Phys. 313, 71 (2012) [arXiv:0712.2824 [hep-\nth]].\n28\n[29] J. G. Russo and K. Zarembo, “Large N Limit of N=2 SU(N) Gauge Theories\nfrom Localization,” arXiv:1207.3806 [hep-th].\n[30] S. -J. Rey and T. Suyama, “Exact Results and Holography of Wilson Loops\nin N=2 Superconformal (Quiver) Gauge Theories,” JHEP 1101, 136 (2011)\n[arXiv:1001.0016 [hep-th]].\n[31] F. Passerini and K. Zarembo, “Wilson Loops in N=2 Super-Yang-Mills from\nMatrix Model,” JHEP 1109, 102 (2011) [Erratum-ibid. 1110, 065 (2011)]\n[arXiv:1106.5763 [hep-th]].\n[32] B. Fraser and S. P. Kumar, “Large rank Wilson loops in N=2 superconformal\nQCD at strong coupling,” JHEP 1203, 077 (2012) [arXiv:1112.5182 [hep-th]].\n[33] J. E. Bourgine, “A Note on the integral equation for the Wilson loop in N =\n2 D=4 superconformal Yang-Mills theory,” J. Phys. A A 45, 125403 (2012)\n[arXiv:1111.0384 [hep-th]].\n[34] A. Gadde, E. Pomoni and L. Rastelli, “The Veneziano Limit of N = 2 Super-\nconformal QCD: Towards the String Dual of N = 2 SU(N(c)) SYM with N(f)\n= 2 N(c),” arXiv:0912.4918 [hep-th].\n[35] E. O´ Colga´in and B. Stefanski, Jr., “A search for AdS5 X S2 IIB supergravity\nsolutions dual to N = 2 SCFTs,” JHEP 1110, 061 (2011) [arXiv:1107.5763\n[hep-th]].\n[36] J. M. Figueroa-O’Farrill and G. Papadopoulos, “Maximally supersymmetric so-\nlutions of ten-dimensional and eleven-dimensional supergravities,” JHEP 0303,\n048 (2003) [hep-th/0211089].\n[37] O. Lunin, “1/2-BPS states in M theory and defects in the dual CFTs,” JHEP\n0710, 014 (2007) [arXiv:0704.3442 [hep-th]].\n[38] E. D’Hoker, J. Estes, M. Gutperle and D. Krym, “Exact Half-BPS Flux Solu-\ntions in M-theory. I: Local Solutions,” JHEP 0808, 028 (2008) [arXiv:0806.0605\n[hep-th]].\n[39] M. Spalinski, “Some half-BPS solutions of M-theory,” Phys. Lett. B 634, 315\n(2006) [hep-th/0506247].\n[40] P. G. O. Freund and M. A. Rubin, “Dynamics of Dimensional Reduction,”\nPhys. Lett. B 97, 233 (1980).\n29\n[41] J. Kowalski-Glikman, “Vacuum States in Supersymmetric Kaluza-Klein The-\nory,” Phys. Lett. B 134, 194 (1984).\n[42] R. S. Ward, “Einstein-Weyl spaces and SU(infinity) Toda fields,” Class. Quant.\nGrav. 7, L95 (1990).\n[43] A. Donos and J. Simon, “The electrostatic view on M-theory LLM geometries,”\nJHEP 1101, 067 (2011) [arXiv:1010.3101 [hep-th]].\n[44] B. Chen, E. O´ Colga´in, J. -B. Wu and H. Yavartanoo, “N = 2 SCFTs: An\nM5-brane perspective,” JHEP 1004, 078 (2010) [arXiv:1001.0906 [hep-th]].\n[45] J. M. Figueroa-O’Farrill and G. Papadopoulos, “Homogeneous fluxes, branes\nand a maximally supersymmetric solution of M theory,” JHEP 0108, 036 (2001)\n[hep-th/0105308].\n[46] J. P. Gauntlett and C. M. Hull, “Pp-waves in 11 dimensions with extra super-\nsymmetry,” JHEP 0206, 013 (2002) [hep-th/0203255].\n[47] M. T. Anderson, C. Beem, N. Bobev and L. Rastelli, “Holographic Uniformiza-\ntion,” arXiv:1109.3724 [hep-th].\n[48] J. P. Gauntlett, D. Martelli, J. Sparks and D. Waldram, “Supersymmetric\nAdS(5) solutions of type IIB supergravity,” Class. Quant. Grav. 23, 4693 (2006)\n[hep-th/0510125].\n30\n",
    "Link": "https://core.ac.uk/download/pdf/71849496.pdf"
}