{
    "Title": "How Can I Support My Adolescent’s Development as a Writer?",
    "Authors": "The Meadows Center for Preventing Educational Risk",
    "Year": "No year available",
    "Abstract": "Educatio",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "How Can I  Support My Adolescent’s Development  as a Writer? 2.  When giving feedback on your adolescent’s writing during the planning, drafting, and revising stages, focus on the ideas, development, and organization of the piece. Later, during the editing stage, focus on spelling, grammar, and punctuation. • Acknowledge the planning and ideas that went into creating the draft, being sure to offer praise and encouragement.• Ask your adolescent to explain the purpose, planning process, and ideas before offering suggestions or criticism. • Encourage your adolescent to self-assess the writing before offering your own assessment. 3.  Frequently read, write, and discuss something of interest at home, using a variety of texts. Ideas include reading books, taking notes, writing about a hobby or special interest, collecting and compiling sports information, planning a trip and keeping a travel journal, and writing family stories.4.  Reinforce the idea that writing is a tool for learning. Encourage your adolescent to take notes, write summaries, and keep journals for a variety of purposes and topics.• Demonstrate how you use writing in your everyday life by pointing out when you make lists, write notes, and communicate with others.• Point out opportunities for your adolescent to write as they come up in everyday life, such as writing notes, making lists, or keeping a journal. 5.  Encourage your adolescent to work on both handwriting and typing skills. • Research shows that handwriting and typing activate different areas of the brain. Effective handwriting has been shown to increase the quantity and quality of writing and improve content learning.• Learning to type effectively ensures that your adolescent can use technology without being slowed down by looking at the keys. PLUSThis work was supported by the U.S. Department of Education through Grant H326M150016 to The University of Texas at Austin and the University of Maryland. The opinions expressed are those of the authors and do not represent the views of the U.S. Department of Education.1.  Understand that writing is a process. Writers do not arrive immediately at polished work. Instead, they go through a process of planning, drafting, revising, editing, and publishing. Consider where in the process your adolescent is when you review your adolescent’s writing and offer ideas or suggestions.The Writing Process PHASE and STEPS HELPFUL FEEDBACKPLANNINGDetermining the purpose, audience, and writing formBrainstorming topics and ideas related to the purpose for writingSelecting a topicResearching to gather informationOrganizing ideas and information“Tell me the purpose for this piece of writing.”“Who is the audience?”“What are your favorite ideas for this piece?”“I love these ideas. This will be an interesting piece of writing.”“Let’s write three ideas that might work for this purpose.”DRAFTINGUsing ideas developed during the planning stage to write an initial version Reading and rereading to check that the writing makes sense“Let’s look back at your topic and ideas to remind us of what you planned.”“Did you reread to see whether your writing is making sense?”“I like how you are using your writing plan while you write.”REVISINGFocusing on the content of the draft Adding or changing content to clearly communicate ideas or accomplish the purposeChanging the wording, phrasing, or sentences to clarify or enhance the meaningReorganizing content to improve the flow of ideas“Let’s read it together to see whether you got all your good ideas in.”“Let’s read it together and think about whether it makes sense.”“I really love [an idea or the overall content] about this writing.” “How can you change or add something to make it more clear?”EDITINGCorrecting spelling, punctuation, and capitalization“Great job catching some spelling errors. Now I see two more words that need to be fixed.”“Let’s read through it and see whether any words might be spelled wrong.” If your adolescent does not find a misspelled word, point it out and ask, “This word is not quite right; can you see what needs to be fixed?”“Let’s look at each sentence and see whether it has capital letters and correct punctuation.”PUBLISHINGCreating a finished product with polished handwriting or typingSharing writing with othersReflecting on accomplishments, including self-evaluation, and setting goals for future writing“This piece of writing is [interesting, informative, helpful, etc.].”“This is a piece that you can feel good about sharing!”“How do you feel about this piece of writing? How does it compare to something you wrote a month ago?”“How do you think you have improved as a writer? I see that you have gotten better at ______.”",
    "Link": "https://core.ac.uk/download/226942279.pdf"
}