{
    "Title": "Accelerating the Translation of Nanomaterials in Biomedicine",
    "Authors": "Anderson, Daniel Griffith, Chen, Xiaoyuan, Chow, Edward K., Gu, Zhen, Ho, Dean, Kabanov, Alexander V., Karp, Jeffrey M., Kataoka, Kazunori, Mirkin, Chad A., Mitragotri, Samir, Petrosko, Sarah Hurst, Shi, Jinjun, Stevens, Molly M., Sun, Shouheng, Teoh, Sweehin, Venkatraman, Subbu S., Wang, Shutao, Xia, Younan, Xu, Chenjie",
    "Year": "No year available",
    "Abstract": "Due to their size and tailorable physicochemical properties, nanomaterials are an emerging class of structures utilized in biomedical applications. There are now many prominent examples of nanomaterials being used to improve human health, in areas ranging from imaging and diagnostics to therapeutics and regenerative medicine. An overview of these examples reveals several common areas of synergy and future challenges. This Nano Focus discusses the current status and future potential of promising nanomaterials and their translation from the laboratory to the clinic, by highlighting a handful of successful examples",
    "Keywords": "No keywords available",
    "Publisher": "'American Chemical Society (ACS)'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Accelerating the Translation of Nanomaterials in Biomedicine\nSamir Mitragotri†,*, Daniel G. Anderson‡, Xiaoyuan Chen§, Edward K. Chow||, Dean Ho⊥, \nAlexander V. Kabanov#, Jeffrey M. Karp¶, Kazunori Kataoka□, Chad A. Mirkin■, Sarah Hurst \nPetrosko■, Jinjun Shi○, Molly M. Stevens●, Shouheng Sun△, Sweehin Teoh▽, Subbu S. \nVenkatraman▲, Younan Xia▼, Shutao Wang , Zhen Gu⬢,††,‡‡,*, and Chenjie Xu▽,*\n†Center for Bioengineering, Department of Chemical Engineering, University of California, Santa \nBarbara, California 93106, United States\n‡Department of Chemical Engineering, Massachusetts Institute of Technology, Cambridge, \nMassachusetts 02139, United States\n§National Institute of Biomedical Imaging and Bioengineering, National Institutes of Health, \nBethesda, Maryland 20892, United States\n||Cancer Science Institute of Singapore, Yong Loo Lin School of Medicine, National University of \nSingapore, Singapore 119077\n⊥Division of Oral Biology and Medicine, UCLA School of Dentistry, Los Angeles, California 90095, \nUnited States\n#Division of Molecular Pharmaceutics and Center for Nanotechnology in Drug Delivery, Eshelman \nSchool of Pharmacy, University of North Carolina at Chapel Hill, Chapel Hill, North Carolina \n27599, United States\n¶Department of Medicine, Brigham and Women’s Hospital, Harvard Medical School, Boston, \nMassachusetts 02115, United States\n□Departments of Materials Engineering and Bioengineering, University of Tokyo, Tokyo 113-8654, \nJapan\n■Department of Chemistry and International Institute for Nanotechnology, Northwestern \nUniversity, Evanston, Illinois 60208, United States\n○Laboratory for Nanoengineering & Drug Delivery, Department of Anesthesiology, Brigham and \nWomen’s Hospital, Harvard Medical School, Boston, Massachusetts 02115, United States\n●Department of Materials, Department of Bioengineering, Institute for Biomedical Engineering, \nImperial College London, London SW7 2AZ, U.K\n△Department of Chemistry, Brown University, Providence, Rhode Island 02912, United States\n▽School of Chemical and Biomedical Engineering, Nanyang Technological University, Singapore \n639798\n*Address correspondence to: samir@engr.ucsb.edu, zgu@email.unc.edu, cjxu@ntu.edu.sg. \nConflict of Interest: The authors declare the following competing financial interest(s): S.M. is a Scientific Advisor to Sebacia Inc. \nJ.M.K. is part owner of and consultant to Gecko Biomedical.\nHHS Public Access\nAuthor manuscript\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nPublished in final edited form as:\nACS Nano. 2015 July 28; 9(7): 6644–6654. doi:10.1021/acsnano.5b03569.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\n▲School of Materials Science and Engineering, Nanyang Technological University, Singapore \n639798\n▼The Wallace H. Coulter Department of Biomedical Engineering, Georgia Institute of Technology \nand Emory University, Atlanta, Georgia 30322, United States\nTechnical Institute of Physics and Chemistry, Chinese Academy of Sciences, Beijing 100190, \nChina\n⬢Joint Department of Biomedical Engineering, University of North Carolina at Chapel Hill and \nNorth Carolina State University, Raleigh, North Carolina 27695, United States\n††Division of Molecular Pharmaceutics and Center for Nanotechnology in Drug Delivery, \nEshelman School of Pharmacy, University of North Carolina at Chapel Hill, Chapel Hill, North \nCarolina 27599, United States\n‡‡Department of Medicine, University of North Carolina School of Medicine, Chapel Hill, North \nCarolina 27695, United States\nAbstract\nDue to their size and tailorable physicochemical properties, nanomaterials are an emerging class of \nstructures utilized in biomedical applications. There are now many prominent examples of \nnanomaterials being used to improve human health, in areas ranging from imaging and diagnostics \nto therapeutics and regenerative medicine. An overview of these examples reveals several common \nareas of synergy and future challenges. This Nano Focus discusses the current status and future \npotential of promising nanomaterials and their translation from the laboratory to the clinic, by \nhighlighting a handful of successful examples.\nAdvances in medicine in the areas of genomics, proteomics, tissue engineering, and \nregenerative medicine are occurring at a rate that was previously unthinkable. The \ndevelopment of new materials resulting from these breakthroughs, such as those that can be \nused to replace blood vessels, to promote tissue growth, to monitor blood glucose levels, or \nto improve the bioavailability of drugs, has been equally rapid and diverse.1,2 One of the \nmost exciting frontiers is the development of nanomaterials for biomedical applications.3,4 \nNanomaterials have size-, shape-, and composition-dependent physical, chemical, optical, \nand electronic properties, among others, that can be designed and tuned, and they are \nshowing great promise for the diagnosis, treatment, monitoring, and control of disease.5–8 A \nrecent survey found that more than 247 nanomaterial-based medical products have been \napproved by the Food and Drug Administration (FDA) and are currently in various stages of \nclinical study.9 Their intended uses range from the treatment of clinically unresectable \ncancers to the preparation of antibacterial hand gels to the regeneration of heart tissue. At the \nsame time, common themes emerge when discussing nanomaterials in medicine. Indeed, one \nof the biggest issues is how to translate nanomaterials from the laboratory to the clinic \neffectively.\nAt the 2015 Materials Research Society (MRS) Spring Meeting in San Francisco (April 6–\n10), a special symposium focusing on translational research involving nanomaterials in the \nbiomedical field was held. Researchers from all over the world gathered to exchange ideas \nMitragotri et al. Page 2\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nand to discuss criteria for the selection, development, synthesis, and utilization of \nnanomaterials. In this Nano Focus, we highlight these discussions, which fall into three \ncategories: nanotherapeutics, imaging and diagnostics, and tissue regeneration.\nEnhancing Efficacy in Nanotherapeutics\nAmong the numerous nanomaterials explored in therapeutic applications, those often found \nin clinical trials are gold nanoparticles, polymeric nanoparticles, liposomes, and carbon-\nbased nanomaterials. By sharing expertise across fields, researchers can accelerate the \nutilization of nanomaterials in addressing the challenges faced by traditional therapeutic \nagents.\nSince the development of gold-nanoparticle-based spherical nucleic acids (SNAs) in 1996,10 \nthe Mirkin group at Northwestern University has exploited the properties of this class of \nnanostructures in many areas of biomedicine. Spherical nucleic acids typically consist of a \nnanoparticle core and a highly oriented and densely packed shell of oligonucleotides.11 The \nproperties of SNAs emerge from the orientation and arrangement of oligonucleotides on the \nsurfaces of these particles. For example, SNAs are taken up into many different cell types \n(over 60 tested to date) at high levels and rates without the need for transfection agents,12 \nhave high affinities for nucleic acid targets (100 times greater than linear DNA of the same \nsequence),13 and cross both the blood–brain barrier14 and the epidermis15 to reach dificult-\nto-target tissues in therapeutic applications. Success in the utilization of SNAs for \nintracellular mRNA detection has led to the commercialization of NanoFlare technology16,17 \nunder the trade name SmartFlares (Merck Millipore in partnership with AuraSense, LLC, \nSkokie, Illinois), and SNAs have also been applied as agents in gene regulation as \ntherapeutics for a host of cancers, including glioblastoma multiforme (an aggressive form of \nbrain cancer), and skin disorders, among others. The Mirkin group has made progress in \nusing SNAs as immunomodulatory agents.18 Spherical nucleic acids functionalized with \noligonucleotides displaying toll-like receptor (TLR)-agonist or TLR-antagonist activity were \nshown to be capable of either stimulating or modulating the activity of the immune system, \nrespectively. Such structures do so with potencies up to several orders of magnitude higher \nthan the conventional linear nucleic acids from which they are composed. This discovery \npaves the way for the development of SNAs as therapeutic cancer vaccines. Mirkin’s \ndemonstration of the ability of SNAs to reduce tumor burden and to enhance survival in \nvivo, in mouse models of lymphoma, proved that immunomodulatory SNAs can be directed \nto activate the response of the immune system to destroy tumors in an antigen-specific \nmanner (Figure 1).\nA fundamental challenge is the delivery of therapeutic molecules inside target cells in the \nbody. Nanoparticles have shown immense promise as vehicles for intracellular delivery, with \nproof-of-principle experiments in humans being completed with small interfering RNA \n(siRNA).19 However, there are many barriers to achieving safe and effective delivery \nsystems (Figure 2), and potential delivery systems must have multiple functionalities to \nallow in vivo delivery, making the design criteria dificult to define for nanoparticles capable \nof accomplishing intracellular delivery. To accelerate the design and discovery process, the \nAnderson group at the Massachusetts Institute of Technology has pioneered combinatorial \nMitragotri et al. Page 3\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nmethods for nanoparticulate drug delivery. Combinatorial chemical methods have been \ndeveloped to enable the rapid synthesis and characterization of a range of nanoformulations \nbased on biodegradable polymers, lipid-like materials, and other materials.20–22 These have \ngenerated new formulations with particular promise as delivery vehicles for RNA and other \nnucleic acids;23 these formulations have the potential to be used as therapies for many \ndiseases, including cancer.24\nFurthermore, Shi at Brigham and Women’s Hospital/Harvard Medical School described the \nrational design and development of lipid–polymer hybrid nanoparticle platforms to address \nthe bottlenecks faced in the delivery of RNA interference (RNAi) therapeutics, such as \nsiRNA.25–27 Specifically, the clinical applications of RNAi in cancer therapy are currently \nhindered by the challenge of achieving the effective systemic in vivo delivery of siRNA to \ntumors. Multiple physiological barriers, such as enzymatic degradation, rapid elimination by \nrenal excretion or the mononuclear phagocyte system, and poor cellular uptake and \nendosomal escape, must be overcome. By utilizing hybrid nanoparticles, Shi achieved \nsustained gene silencing, and prolonged circulation of siRNA in the blood for high tumor \nextravasation and accumulation. The successful application of these RNAi nanoparticles to \nvalidate the therapeutic role of Prohibitin1 in non-small cell lung cancer treatment27 \nindicates the significant potential of this platform for the validation of many other potential \ncancer targets and for the clinical development of novel cancer therapies.\nKataoka at the University of Tokyo has pioneered the synthesis and development of \n“polymeric micelle drugs”, which have proven useful for targeting a variety of drugs to \ntissues and organs and to tumors in particular. There has been significant recent progress in \nthe clinical development of polymeric micelles loaded with a variety of cytotoxic reagents. \nNotably, five different micellar formulations have already been explored in clinical trials in \nAsia and the United States.28 A version loaded with paclitaxel is in the final stage of a Phase \nIII clinical trial in Japan for the treatment of recurrent breast cancer, and it is expected to \nproceed into the application for approval within a year. More recently, Kataoka and \ncolleagues have been active in developing a second generation system of polymeric micelles \ninstalled with ligand moieties at their peripheries. Particularly, cRGD-conjugated polymeric \nmicelles were able to cross the blood–brain tumor barrier via a transcytosis mechanism, \nachieving high efficacy in treating intractable orthotopic glioblastoma in animal \nexperiments.29 Antibody fragments can also be conjugated to polymeric micelles. In this \nway, higher drug payloads can be achieved without antibody precipitation or impaired \nbinding compared to when drugs are directly conjugated to antibody molecules using more \nconventional approaches.30\nIn 1989, the Kabanov group at the University of North Carolina at Chapel Hill investigated \nthe use of polymeric micelles for targeted drug delivery.31 They discovered that Pluronic \nblock copolymers can be used in the sensitization of multi-drug-resistant (MDR) cancer and \ncancer stem cells and elucidated the mechanisms responsible for these effects.32 This \nresearch led to first-in-man polymeric micelle drug candidates for the treatment of cancer \n(SP1049C) that show high efficacy against advanced esophageal cancer in Phase II trials.33 \nRecently, they discovered polymeric micelles based on amphiphilic poly(2-oxazoline) \nblocks with unprecedented high capacities for poorly soluble, uncharged drugs (e.g., \nMitragotri et al. Page 4\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\ntaxanes) and drug combinations, enabling increasing therapeutic indices compared to current \ndrug formulations.34,35\nLiposomes are another popular nanomaterial used in preclinical and clinical studies, but it is \ndificult to sustain release from these structures for more than a few days. The Venkatraman \ngroup at Nanyang Technological University has developed a subconjunctivally injected \nnanoliposome drug delivery system for the long-term (3–5 months) delivery of latanoprost \nthat can be used in glaucoma treatment, which went from concept to clinic in less than 5 \nyears (Figure 3).36,37 Glaucoma is a chronic progressive optic neuropathy that is \ncharacterized by optic nerve changes and visual field loss. Elevated intraocular pressure \n(IOP) is the main modifiable risk factor. The chronic instillation of daily eye drops to lower \nIOP is the primary treatment of choice, although this regimen requires patient adherence and \ncorrect performance. Hence, a sustained-delivery system would be a big boon to patients \nwith glaucoma. Venkatraman’s group also explored the nanoparticle-mediated sustained \ndelivery of siRNA for preventing fibrosis following surgery.38 This method has applications \nin ocular and other types of surgeries/implantations. They have shown sustained efficacy of \naction with a siRNA-incorporated nanoparticle. As shown in the above two examples, the \npremise of their work rests on the ability of nanoparticles to sustain drug/protein/siRNA \nrelease.\nThe Chow and Ho groups at the National University of Singapore and the University of \nCalifornia, Los Angeles (UCLA), respectively, study nanodiamonds, which are an emerging \nclass of carbon-based nanomaterials, due to their advantageous surface characteristics. \nNanodiamond facets mediate electrostatic properties that have resulted in potent and scalable \nanthracycline drug binding as well as marked enhancements in magnetic resonance imaging \n(MRI) efficiency.39,40 With regard to drug delivery, nanodiamond–doxorubicin compounds \n(NDX) were administered to treat drug-resistant breast and liver tumors in mouse models. \nThis study demonstrated the nanodiamond-mediated improvement of drug tolerance; lethal \ndosages of doxorubicin delivered as NDX resulted in the smallest tumors observed \n(compared to saline controls and unmodified drug administration), and all of the treated \nmice survived the full duration of the study.41 The active targeting of triple-negative breast \ntumors in vivo using nanodiamond–epirubicin complexes functionalized with the epidermal \ngrowth factor receptor (EGFR) antibody resulted in complete tumor regression.42 More \nrecently, nanodiamond–anthracycline agents have been used to treat hepatic cancer stem \ncells.43\nToward the further enhancement of the potency and safety of cancer therapies, a prevalent \nchallenge in the field of nanomedicine is the ability to move beyond monotherapies toward \ncombinatorial cancer treatments. Using phenotypic instead of genotypic profiling to drive \ncombinatorial optimization, Ho and colleagues developed a powerful mechanism-\nindependent engineering optimization platform, termed Feedback System Control.II \n(FSC.II), to identify globally optimized nanodiamond–anthracycline drug combinations \nrapidly.44 FSC.II does not require the use of feedback, and instead, it utilizes a selected set \nof experimental validation assays to formulate phenotypic profiles from which drug \ncombinations can rapidly be pin-pointed.\nMitragotri et al. Page 5\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nMitragotri at the University of California, Santa Barbara, also translated nanomaterials to \nclinical applications (Figure 4). Specifically, he used gold-coated silica nanoparticles for the \ntreatment of acne. These 150 nm, poly(ethylene glycol)-coated, silica–gold nanoparticles are \ndesigned to absorb near-infrared light and produce localized heating. The delivery of these \nnanoparticles into skin is a major hurdle due to the skin’s barrier properties. Mitragotri and \ncolleagues showed that these nanoparticles can be delivered deep into the skin’s sebaceous \nglands using low-frequency ultrasound.45 Ultrasound induces cavitation on the surface of the \nskin, which produces microjets and shock waves that open transport pathways into the \nglands.46 Once delivered deep into the glands, the thermal activation of the nanoparticles \nusing near-infrared light caused thermolysis and the inactivation of overactive sebaceous \nglands, the underlying pathology of acne. This nanoparticle-based technology provides \nseveral advantages over standard treatments for acne; for instance, systemic side effects are \navoided with this treatment.\nThe Stevens group at the Imperial College of London and collaborators at the Houston \nMethodist Research Institute have recently reported engineering a platform of mesoporous \nsilicon nanoneedles for the delivery of nanoparticle and other therapeutic payloads to cells \nand tissues (Figure 5A, B).47,48 This technology could prove transformative in the fields of \ndrug delivery, regenerative medicine, and biosensing. The dynamics of the nanoneedle entry \nto the cell and study of the nanoneedle–cell interface have been elucidated and pave the way \nfor highly controlled delivery of a range of nanoparticle payloads intracellularly.47 \nFurthermore, the nanoneedle array can simultaneously deliver both DNA and siRNA with \nhigh efficiency (over 90%) and in vivo proved successful in upregulating blood vessel \nformation in muscle by delivery of the VEGF-165 gene (Figure 5C–E).48 The Stevens group \nhas also developed several other notable nanomaterials-based technologies, particularly \nenzyme-response nanoparticle systems that have a wide range of important impacts in the \nfield of biosensing.8,49,50\nFrom the above discussion of a variety of nanomaterials as nanotherapeutic agents for \nenhancing treatment efficacy, we conclude that successful translation of nanomaterials relies \non the identification of a clinical problem and innovative ideas to solve it through rational \ndesign. In addition, more and more versatile nanomaterials are being exploited in emerging \nresearch themes, areas such as cancer vaccines51 and genome editing.19\nImaging and Diagnostics with High Sensitivity and Selectivity\nBesides their use as therapeutic agents, nanomaterials are also being used for imaging and \ndiagnostics purposes. The most well-known examples include silica nanoparticles, quantum \ndots, magnetic nanoparticles, and microbubbles. These nanostructures have been used to \ndetect small molecules (like H2O2), cells including circulating tumor cells (CTCs), and \ntumor tissues.\nThe Sun group at Brown University is interested in monitoring cellular H2O2, which is an \nimportant reactive oxygen species generated via oxygen metabolism; it is actively involved \nin cell signaling and cell growth.52 Unfortunately, its uncontrolled overproduction can cause \nthe detrimental oxidation of biomolecules and lead to aging, cancer, and other diseases.53 \nMitragotri et al. Page 6\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nSun recently developed dumbbell (Au–Fe3O4 and PdPt–Fe3O4) and core/shell (Au/MnO) \nmagnetic nanoparticles as sensitive probes for H2O2 detection.54,55 Dumbbell magnetic \nnanoparticles were prepared by the controlled nucleation and growth of Fe3O4 on \npresynthesized noble metal nanoparticles, while the core/shell Au/MnO nanoparticles were \nmade by the controlled oxidation of AuMn alloy nanoparticles. Both dumbbell and core/\nshell nanoparticles are active for the electrochemical reduction of H2O2 with detection limits \nreaching as low as 5 nM. Highly sensitive electrochemical sensors have been used to \nmonitor H2O2 concentration levels released from living cells; tumorigenic cells were found \nto have higher levels of H2O2 than nontumorigenic ones. These composite nanoparticle \nprobes can be used in high-sensitivity cancer detection schemes and may also help to \nincrease the efficacy of cancer therapies.\nThe Chen group at the National Institute of Biomedical Imaging and Bioengineering of the \nNational Institutes of Health uses nanomaterials as platforms to provide imaging contrast in \npositron emission tomography (PET). In medical imaging, PET can provide a direct, highly \nsensitive, and quantitative readout of organ/tissue targeting efficiency and pharmacokinetics. \nCompared with radiolabeled antibodies, proteins, peptides, and other biologically relevant \nmolecules, radiolabeled nanoparticles represent a new frontier in molecular imaging probe \ndesign because they can combine different imaging modalities and targeting ligands in a \nsingle vector, synergistically improving the imaging quality.56 However, the applications of \nradiolabeled nanoparticles are based on the premise that the radioisotopes are stably attached \nto the nanomaterials. Chen has developed general rules for selecting appropriate isotopes for \ngiven types of nanoparticles as well as adjusting the labeling reaction according to specific \napplications. The stability (colloidal and radiochemical) of the radiolabeled nanoparticles as \nwell as their biological fate must be assessed; special attention should be paid to labeling \nstrategies as they affect the stability of radiolabeled nanoparticles and might cause \ndiscrepancies in the interpretation of PET data (owing to the distribution of nanoparticles).\nWang’s group at the Chinese Academy of Sciences is interested in creating nano–bio \ninterfaces with controllable adhesion properties. The cell-adhesive biointerfaces are based on \nthe cooperative effects of multiscale structural matching and molecular recognition.57 They \nexplore the relationship between cell-specific adhesion and surface structure (with \nnanowires,21 nanofibers,58 nanofractals,59 and soft nanotubes60). Also, they developed a \nseries of biointerfaces with specific recognition and stimuli-responsive capture and release \nproperties (i.e., temperature,61 electric,59 enzymatic,21 and pH62). They have made progress \nin the isolation of viable rare CTCs from the blood via their designed cell-adhesive \nbiointerfaces and developed adhesion-based CTC isolation approaches as cancer diagnostics \nwith high efficiencies (>97%).63 In particular, these biointerfaces with controlled cell \nadhesion are capable of capturing rare viable CTCs for early cancer detection and the \nmonitoring of cancer therapy, single-cell gene analysis,64 and other purposes.\nBiomimetic and Bio-Inspired Scaffolds for Tissue Engineering\nNanomaterials for tissue engineering involve a broad spectrum of nanoscale formulations \nand structures developed to mimic tissue complexity and to modulate cellular function to \nyield therapeutic benefits.\nMitragotri et al. Page 7\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nThe Xia group at the Georgia Institute of Technology and Emory University has been \ndeveloping practical nanomaterials for medical applications. They use electrospun \nnanofibers in tissue engineering.65 Electrospinning has been widely explored to process \npolymeric materials into nanofibers with tunable and controllable compositions, diameters, \nporosities, and surface properties. Owing to its small feature size, high porosity, and large \nsurface area, a nonwoven mat of electrospun fibers can serve as a superb scaffold that \nmimics the extracellular matrix (ECM), which is critical to cell attachment and spreading. \nThe nanofibers themselves can also be functionalized through the encapsulation or \nattachment of bioactive species, such as ECM proteins, enzymes, and growth factors. In \naddition, the nanofibers can be readily assembled into a wide variety of arrays or \nhierarchical structures by manipulating their alignment, stacking, or folding. All these \nattributes make electrospinning a powerful tool for generating nanostructured materials for a \nbroad range of biomedical applications, including controlled release, drug delivery, and \ntissue engineering. Xia highlighted the use of aligned nanofibers to control the \ndifferentiation of embryonic stem cells into different types of neural lineages and to guide \nthe outgrowth of neurites for peripheral nerve repair.66 He also pointed out that nanofiber \nscaffolds could be designed for repairing injuries to the flexor tendon and the tendon-to-\nbone insertion site;67 they could also be used as wound dressings for brain surgery.68\nKarp from Brigham and Women’s Hospital suggests that different approaches are required \nfor solving medical problems versus solving basic science problems. He asserts that one \nmust develop design criteria relevant to solving the problem in animal models, while \nconsidering the multiple steps required to bring a technology from the laboratory to the \nclinic. One must think through scale-up, manufacturing, regulatory issues, and patent \nstrategy and then impose these criteria to advance toward a potential solution. In particular, \nturning to nature for solutions can aid in the problem-solving process, recognizing that \neverything living has overcome challenges, and thus we are surrounded by solutions. \nThrough elucidating mechanisms behind these solutions with state-of-the-art tools, he \nasserts that we can identify ideas to help overcome even the most challenging of problems. \nKarp has created tissue adhesives using inspiration from slugs and snails,69 spiny-headed \nworms,70 porcupine quills,71 and spider webs. One of the adhesive technologies led to the \nformation of a company, Gecko Biomedical (Paris, France), and is on track to be tested for \nvascular graft applications in humans in late 2015. Of note is that, in these developments, \nfailure should be embraced as part of the problem-solving process and is likely a prerequisite \nto success. In this work, it was important to build highly functional and multi-disciplinary \nteams that know what resources are available in their environment and how to access them.\nTeoh from Nanyang Technological University is interested in processing biomaterials in an \nenvironmentally friendly way.72,73 To this end, his group has unearthed a solvent-free \napproach known as cryomilling, where biomaterials are processed at near cryogenic \ntemperatures. Polymer particle size reduction has been achieved due to the high-energy \ncollision process, which occurs below the glass transition temperature. Particle sizes may be \nreduced to the nanoscale, where surface thermodynamics play critical roles in determining \ntheir behavior, particularly the interactions between two chemically distinct phases, as in the \ncase of composite biomaterials. Notably, there is also a significant challenge in obtaining \nreproducible, well-distributed composites. They have demonstrated that a variety of \nMitragotri et al. Page 8\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\ncomposite biomaterials that incorporate second phases, such as inorganic elements, trace \nelements, and even drugs, may be processed efficiently via cryomilling.73 This technique \nalso addresses second phase distribution issues that plague many other processing \ntechniques, such as solvent-casting, electrospinning, and melt extrusion.\nFUTURE OUTLOOK\nTremendously exciting advances in nanomaterials-based medical treatments, from cancer \ntherapies, diabetes administration, and vaccine development to molecular diagnostics, tissue \nrepair, and regeneration, are both underway and yet to come. The confluence of \nnanomaterials and emerging biomedical science provides vast commercial opportunities. \nWhile fundamental science has been fueled with numerous innovations over the past decade, \nas evidenced by the number of nanomaterial-associated formulations and devices in clinical \ndevelopment, the number of marketed products is still small, compared to traditional \nmedications. Remaining challenges include effectively improving efficacy, while minimizing \npotential concerns, through the rational design and thorough evaluation of nanomaterials.\nIn oncology nanomedicine, for example, the acceleration of the translation process relies \nprofoundly on a thorough understanding of how nanocarriers interact with the physiological \nenvironment. In addition to general evaluations based on the enhanced permeability and \nretention effect, biodistribution, and clearance mechanisms, more precise details should be \ntaken into account, such as how the particles pass through the tumor microenvironment and \nenter cells to reach active sites.74,75,76 Moreover, in designing stimuli-responsive or \nprogrammable nanocarriers,77,78 a current theme in nanomedicine, closer investigations of \nthe dynamic relationships between the phase transitions of materials and the relevant \ngradients in the biological environment, such as pH, redox, glucose, ATP, and enzyme \nactivity, should enable more precise targeting and release.79–82\nSecond, a major stumbling block in the translation of nanomaterials for biomedical \napplications is safety concerns, especially for invasive administration. On one hand, clinical \nuse requires the careful, prolonged evaluation of the local and systemic toxicity of \nnanomaterials as well as their potential immunogenicity.83 On the other hand, there is an \nurgent need to invent and to tailor new materials with excellent biocompatibility. Ideas \ninspired by nature, mimicking the structures and composites of natural particles, including \nviruses, vesicles, and cells, have attracted increasing interest and brought promising \noutcomes.\nThird, regarding the rational design of nanomaterials with specific physicochemical \nproperties84 for clinical applications, it is important to set uniformity in preclinical trials. \nVariability in particle size, surface properties, and stability as well as differences in cell \nlines, tumor properties, therapeutic doses, and pharmacokinetics/pharmacodynamics \nanalysis have prevented the systematic comparison of relevant nanomaterials and have been \nan impediment to creating design rules for optimizing a specific formulation or device.\nLast but not least, the design, development, and ultimately commercialization of clinically \nused nanomaterials require seamless collaboration and commitment between a broad range \nMitragotri et al. Page 9\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nof research investigators, investors, and regulatory authorities. Key to these activities are \nplatforms for fusing ideas to shepherd emerging technologies further along safe and effective \npipelines.\nOverall, given the progress that has been made so far, we are optimistic that nanomaterials-\nbased clinical development will continue to be exciting, with growing numbers of \ninnovations as well as those currently garnering FDA approval entering the clinic soon. We \nhope the ideas and concepts presented in this Nano Focus will be useful in the development \nof “ideal” nanomaterials features, the expansion of design criteria, and the enlightenment of \nresearch opportunities for evolving the next generations of biomedical materials.85,86,87\nREFERENCES AND NOTES\n1. Ratner, BD.; Hoffman, AS.; Schoen, FJ.; Lemons, JE. Biomaterials Science: An Introduction to \nMaterials in Medicine. Elsevier Academic Press; Amsterdam: 2004. \n2. Lee, S.; Henthorn, D. Materials in Biology and Medicine. CRC Press/Taylor & Francis Group; Boca \nRaton, FL: 2012. \n3. Langer R. Drug Delivery and Targeting. Nature. 1998; 392:5–10. [PubMed: 9579855] \n4. Farokhzad OC, Langer R. Nanomedicine: Developing Smarter Therapeutic and Diagnostic \nModalities. Adv Drug Delivery Rev. 2006; 58:1456–1459.\n5. Doshi N, Mitragotri S. Designer Biomaterials for Nanomedicine. Adv Funct Mater. 2009; 19:3843–\n3854.\n6. Mitragotri S, Lahann J. Physical Approaches to Biomaterial Design. Nat Mater. 2009; 8:15–23. \n[PubMed: 19096389] \n7. Dobrovolskaia MA, McNeil SE. Immunological Properties of Engineered Nanomaterials. Nat \nNanotechnol. 2007; 2:469–478. [PubMed: 18654343] \n8. Howes PD, Chandrawati R, Stevens MM. Colloidal Nanoparticles as Advanced Biological Sensors. \nScience. 2014; 346:1247390. [PubMed: 25278614] \n9. Etheridge ML, Campbell SA, Erdman AG, Haynes CL, Wolf SM, McCullough J. The Big Picture \non Nanomedicine: The State of Investigational and Approved Nanomedicine Products. \nNanomedicine. 2013; 9:1–14. [PubMed: 22684017] \n10. Mirkin CA, Letsinger RL, Mucic RC, Storhoff JJ. A DNA-Based Method for Rationally \nAssembling Nanoparticles into Macroscopic Materials. Nature. 1996; 382:607–609. [PubMed: \n8757129] \n11. Cutler JI, Auyeung E, Mirkin CA. Spherical Nucleic Acids. J Am Chem Soc. 2012; 134:1376–\n1391. [PubMed: 22229439] \n12. Rosi NL, Giljohann DA, Thaxton CS, Lytton-Jean AK, Han MS, Mirkin CA. Oligonucleotide-\nModified Gold Nanoparticles for Intracellular Gene Regulation. Science. 2006; 312:1027–1030. \n[PubMed: 16709779] \n13. Lytton-Jean AK, Mirkin CA. A Thermodynamic Investigation into the Binding Properties of DNA \nFunctionalized Gold Nanoparticle Probes and Molecular Fluorophore Probes. J Am Chem Soc. \n2005; 127:12754–12755. [PubMed: 16159241] \n14. Jensen SA, Day ES, Ko CH, Hurley LA, Luciano JP, Kouri FM, Merkel TJ, Luthi AJ, Patel PC, \nCutler JI. Spherical Nucleic Acid Nanoparticle Conjugates as an RNAi-Based Therapy for \nGlioblastoma. Sci Transl Med. 2013; 5:209ra152.\n15. Zheng D, Giljohann DA, Chen DL, Massich MD, Wang XQ, Iordanov H, Mirkin CA, Paller AS. \nTopical Delivery of siRNA-Based Spherical Nucleic Acid Nanoparticle Conjugates for Gene \nRegulation. Proc Natl Acad Sci US A. 2012; 109:11975–11980.\n16. Seferos DS, Giljohann DA, Hill HD, Prigodich AE, Mirkin CA. Nano-Flares: Probes for \nTransfection and mRNA Detection in Living Cells. J Am Chem Soc. 2007; 129:15477–15479. \n[PubMed: 18034495] \nMitragotri et al. Page 10\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\n17. Halo TL, McMahon KM, Angeloni NL, Xu Y, Wang W, Chinen AB, Malin D, Strekalova E, Cryns \nVL, Cheng C. NanoFlares for the Detection, Isolation, and Culture of Live Tumor Cells from \nHuman Blood. Proc Natl Acad Sci US A. 2014; 111:17104–17109.\n18. Radovic-Moreno AF, Chernyak N, Mader CC, Nallagatla S, Kang RS, Hao L, Walker DA, Halo \nTL, Merkel TJ, Rische CH. Immunomodulatory Spherical Nucleic Acids. Proc Natl Acad Sci US \nA. 2015; 112:3892–3897.\n19. Yin H, Kanasty RL, Eltoukhy AA, Vegas AJ, Dorkin JR, Anderson DG. Non-viral Vectors for \nGene-Based Therapy. Nat Rev Genet. 2014; 15:541–555. [PubMed: 25022906] \n20. Sahay G, Querbes W, Alabi C, Eltoukhy A, Sarkar S, Zurenko C, Karagiannis E, Love K, Chen D, \nZoncu R. Efficiency of siRNA Delivery by Lipid Nanoparticles Is Limited by Endocytic \nRecycling. Nat Biotechnol. 2013; 31:653–658. [PubMed: 23792629] \n21. Lovell JF, Jin CS, Huynh E, Jin H, Kim C, Rubinstein JL, Chan WC, Cao W, Wang LV, Zheng G. \nPorphysome Nanovesicles Generated by Porphyrin Bilayers for Use as Multimodal Biophotonic \nContrast Agents. Nat Mater. 2011; 10:324–332. [PubMed: 21423187] \n22. Dahlman JE, Barnes C, Khan OF, Thiriot A, Jhunjunwala S, Shaw TE, Xing Y, Sager HB, Sahay \nG, Speciner L. In Vivo Endothelial siRNA Delivery Using Polymeric Nanoparticles with Low \nMolecular Weight. Nat Nanotechnol. 2014; 9:648–655. [PubMed: 24813696] \n23. Dong Y, Love KT, Dorkin JR, Sirirungruang S, Zhang Y, Chen D, Bogorad RL, Yin H, Chen Y, \nVegas AJ. Lipopeptide Nanoparticles for Potent and Selective siRNA Delivery in Rodents and \nNonhuman Primates. Proc Natl Acad Sci US A. 2014; 111:3955–3960.\n24. Yin H, Xue W, Chen S, Bogorad RL, Benedetti E, Grompe M, Koteliansky V, Sharp PA, Jacks T, \nAnderson DG. Genome Editing with Cas9 in Adult Mice Corrects a Disease Mutation and \nPhenotype. Nat Biotechnol. 2014; 32:551–553. [PubMed: 24681508] \n25. Shi J, Xiao Z, Votruba AR, Vilos C, Farokhzad OC. Differentially Charged Hollow Core/Shell \nLipid–Polymer– Lipid Hybrid Nanoparticles for Small Interfering RNA Delivery. Angew Chem, \nInt Ed. 2011; 123:7165–7169.\n26. Shi J, Xu Y, Xu X, Zhu X, Pridgen E, Wu J, Votruba AR, Swami A, Zetter BR, Farokhzad OC. \nHybrid Lipid–Polymer Nanoparticles for Sustained siRNA Delivery and Gene Silencing. \nNanomedicine. 2014; 10:897–900. [PubMed: 24650883] \n27. Zhu X, Xu Y, Solis LM, Tao W, Wang L, Behrens C, Xu X, Zhao L, Liu D, Wu J, et al. Long-\nCirculating siRNA Nanoparticles for Validating Prohibitin1-Targeted Non-Small Cell Lung Cancer \nTreatment. Proc Natl Acad Sci USA. 2015; doi: 10.1073/pnas.1505629112\n28. Cabral H, Kataoka K. Progress of Drug-Loaded Polymeric Micelles into Clinical Studies. J \nControlled Release. 2014; 190:465–476.\n29. Miura Y, Takenaka T, Toh K, Wu S, Nishihara H, Kano MR, Ino Y, Nomoto T, Matsumoto Y, \nKoyama H. Cyclic RGD-Linked Polymeric Micelles for Targeted Delivery of Platinum Anticancer \nDrugs to Glioblastoma through the Blood–Brain Tumor Barrier. ACS Nano. 2013; 7:8583–8592. \n[PubMed: 24028526] \n30. Ahn J, Miura Y, Yamada N, Chida T, Liu X, Kim A, Sato R, Tsumura R, Koga Y, Yasunaga M. \nAntibody Fragment-Conjugated Polymeric Micelles Incorporating Platinum Drugs for Targeted \nTherapy of Pancreatic Cancer. Biomaterials. 2015; 39:23–30. [PubMed: 25477168] \n31. Kabanov AV, Chekhonin V, Alakhov VY, Batrakova E, Lebedev A, Melik-Nubarov N, Arzhakov S, \nLevashov A, Morozov G, Severin E. The Neuroleptic Activity of Haloperidol Increases after Its \nSolubilization in Surfactant Micelles: Micelles as Microcontainers for Drug Targeting. FEBS Lett. \n1989; 258:343–345. [PubMed: 2599097] \n32. Alakhova DY, Kabanov AV. Pluronics and MDR Reversal: An Update. Mol Pharmaceutics. 2014; \n11:2566–2578.\n33. Valle JW, Armstrong A, Newman C, Alakhov V, Pietrzynski G, Brewer J, Campbell S, Corrie P, \nRowinsky EK, Ranson M. A Phase 2 Study of SP1049C, Doxorubicin in P-Glycoprotein-Targeting \nPluronics, in Patients with Advanced Adenocarcinoma of the Esophagus and Gastroesophageal \nJunction. Invest New Drugs. 2011; 29:1029–1037. [PubMed: 20179989] \n34. Han Y, He Z, Schulz A, Bronich TK, Jordan R, Luxenhofer R, Kabanov AV. Synergistic \nCombinations of Multiple Chemotherapeutic Agents in High Capacity Poly(2-oxazoline) Micelles. \nMol Pharmaceutics. 2012; 9:2302–2313.\nMitragotri et al. Page 11\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\n35. He Z, Schulz A, Wan X, Seitz J, Bludau H, Alakhova DY, Darr DB, Perou CM, Jordan R, Ojima I. \nPoly(2-oxazoline) Based Micelles with High Capacity for 3rd Generation Taxoids: Preparation, In \nVitro and In Vivo Evaluation. J Controlled Release. 2015; 208:67–75.\n36. Natarajan JV, Ang M, Darwitan A, Chattopadhyay S, Wong TT, Venkatraman SS. Nanomedicine \nfor Glaucoma: Liposomes Provide Sustained Release of Latanoprost in the Eye. Int J Nanomed. \n2012; 7:123–131.\n37. Natarajan JV, Darwitan A, Barathi VA, Ang M, Htoon HM, Boey F, Tam KC, Wong TT, \nVenkatraman SS. Sustained Drug Release in Nanomedicine: A Long-Acting Nanocarrier-Based \nFormulation for Glaucoma. ACS Nano. 2014; 8:419–429. [PubMed: 24392729] \n38. Tan YF, Mundargi RC, Chen MHA, Lessig J, Neu B, Venkatraman SS, Wong TT. Layer-by-Layer \nNanoparticles as an Efficient siRNA Delivery Vehicle for SPARC Silencing. Small. 2014; \n10:1790–1798. [PubMed: 24510544] \n39. Huang H, Pierstorff E, Osawa E, Ho D. Active Nanodiamond Hydrogels for Chemotherapeutic \nDelivery. Nano Lett. 2007; 7:3305–3314. [PubMed: 17918903] \n40. Manus LM, Mastarone DJ, Waters EA, Zhang XQ, Schultz-Sikma EA, MacRenaris KW, Ho D, \nMeade TJ. Gd(III)-Nanodiamond Conjugates for MRI Contrast Enhancement. Nano Lett. 2010; \n10:484–489. [PubMed: 20038088] \n41. Chow EK, Zhang XQ, Chen M, Lam R, Robinson E, Huang H, Schaffer D, Osawa E, Goga A, Ho \nD. Nanodiamond Therapeutic Delivery Agents Mediate Enhanced Chemoresistant Tumor \nTreatment. Sci Transl Med. 2011; 3:73ra21.\n42. Moore L, Chow EKH, Osawa E, Bishop JM, Ho D. Diamond-Lipid Hybrids Enhance \nChemotherapeutic Tolerance and Mediate Tumor Regression. Adv Mater. 2013; 25:3532–3541. \n[PubMed: 23584895] \n43. Wang X, Low XC, Hou W, Abdullah LN, Toh TB, Mohd Abdul Rashid M, Ho D, Chow EKH. \nEpirubicin-Adsorbed Nanodiamonds Kill Chemoresistant Hepatic Cancer Stem Cells. ACS Nano. \n2014; 8:12151–12166. [PubMed: 25437772] \n44. Wang H, Lee DK, Chen KY, Chen JY, Zhang K, Silva A, Ho CM, Ho D. Mechanism-Independent \nOptimization of Combinatorial Nanodiamond and Unmodified Drug Delivery Using a \nPhenotypically Driven Platform Technology. ACS Nano. 2015; 9:3332–3344. [PubMed: \n25689511] \n45. Paithankar D, Hwang BH, Munavalli G, Kauvar A, Lloyd J, Blomgren R, Faupel L, Meyer T, \nMitragotri S. Ultrasonic Delivery of Silica–Gold Nanoshells for Photothermolysis of Sebaceous \nGlands in Humans: Nanotechnology from the Bench to Clinic. J Controlled Release. 2015; \n206:30–36.\n46. Tezel A, Mitragotri S. Interactions of Inertial Cavitation Bubbles with Stratum Corneum Lipid \nBilayers during Low-Frequency Sonophoresis. Biophys J. 2003; 85:3502–3512. [PubMed: \n14645045] \n47. Chiappini C, Martinez JO, De Rosa E, Almeida CS, Tasciotti E, Stevens MM. Biodegradable \nNanoneedles for Localized Delivery of Nanoparticles in Vivo: Exploring the Biointerface. ACS \nNano. 2015; 9:5500–5509. [PubMed: 25858596] \n48. Chiappini C, De Rosa E, Martinez J, Liu X, Steele J, Stevens M, Tasciotti E. Biodegradable Silicon \nNanoneedles Delivering Nucleic Acids Intracellularly Induce Localized In Vivo \nNeovascularization. Nat Mater. 2015; 14:532–539. [PubMed: 25822693] \n49. De La Rica R, Stevens MM. Plasmonic ELISA for the Ultrasensitive Detection of Disease \nBiomarkers with the Naked Eye. Nat Nanotechnol. 2012; 7:821–824. [PubMed: 23103935] \n50. Chapman R, Lin Y, Burnapp M, Bentham A, Hillier D, Zabron A, Khan S, Tyreman M, Stevens \nMM. Multivalent Nanoparticle Networks Enable Point-of-Care Detection of Human \nPhospholipase-A2 in Serum. ACS Nano. 2015; 9:2565–2573. [PubMed: 25756526] \n51. Dewitte H, Verbeke R, Breckpot K, De Smedt SC, Lentacker I. Nanoparticle Design To Induce \nTumor Immunity and Challenge the Suppressive Tumor Microenvironment. Nano Today. 2014; \n9:743–758.\n52. Gough DR, Cotter TG. Hydrogen Peroxide: A Jekyll and Hyde Signalling Molecule. Cell Death \nDis. 2011; 2:e213. [PubMed: 21975295] \nMitragotri et al. Page 12\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\n53. Lobo V, Patil A, Phatak A, Chandra N. Free Radicals, Antioxidants and Functional Foods: Impact \non Human Health. Pharmacogn Rev. 2010; 4:118–126. [PubMed: 22228951] \n54. Sun X, Guo S, Liu Y, Sun S. Dumbbell-like PtPd–Fe3O4 Nanoparticles for Enhanced \nElectrochemical Detection of H2O2. Nano Lett. 2012; 12:4859–4863. [PubMed: 22924986] \n55. Zhu H, Sigdel A, Zhang S, Su D, Xi Z, Li Q, Sun S. Core/Shell Au/MnO Nanoparticles Prepared \nthrough Controlled Oxidation of AuMn as an Electrocatalyst for Sensitive H2O2 Detection. \nAngew Chem, Int Ed. 2014; 53:12508–12512.\n56. Sun X, Cai W, Chen X. Positron Emission Tomography Imaging Using Radiolabeled Inorganic \nNanomaterials. Acc Chem Res. 2015; 48:286–294. [PubMed: 25635467] \n57. Liu X, Wang S. Three-Dimensional Nano-Biointerface as a New Platform for Guiding Cell Fate. \nChem Soc Rev. 2014; 43:2385–2401. [PubMed: 24504119] \n58. Ma L, Yang G, Wang N, Zhang PC, Guo FY, Meng JX, Zhang FL, Hu ZJ, Wang ST, Zhao Y. Trap \nEffect of Three-Dimensional Fibers Network for High Efficient Cancer-Cell Capture. Adv \nHealthcare Mater. 2015; 4:838–843.\n59. Zhang P, Chen L, Xu T, Liu H, Liu X, Meng J, Yang G, Jiang L, Wang S. Programmable Fractal \nNanostructured Interfaces for Specific Recognition and Electrochemical Release of Cancer Cells. \nAdv Mater. 2013; 25:3566–3570. [PubMed: 23716475] \n60. Liu X, Chen L, Liu H, Yang G, Zhang P, Han D, Wang S, Jiang L. Bio-Inspired Soft Polystyrene \nNanotube Substrate for Rapid and Highly Efficient Breast Cancer Cell Capture. NPG Asia Mater. \n2013; 5:e63.\n61. Liu H, Liu X, Meng J, Zhang P, Yang G, Su B, Sun K, Chen L, Han D, Wang S, Jiang L. \nHydrophobic Interaction-Mediated Capture and Release of Cancer Cells on Thermoresponsive \nNanostructured Surfaces. Adv Mater. 2013; 25:922–927. [PubMed: 23161781] \n62. Liu HL, Li YY, Sun K, Fan JB, Zhang PC, Meng JX, Wang ST, Jiang L. Dual-Responsive Surfaces \nModified with Phenylboronic Acid-Containing Polymer Brush To Reversibly Capture and Release \nCancer Cells. J Am Chem Soc. 2013; 135:7603–7609. [PubMed: 23601154] \n63. Wang S, Liu K, Liu J, Yu ZTF, Xu X, Zhao L, Lee T, Lee EK, Reiss J, Lee YK, et al. Highly \nEfficient Capture of Circulating Tumor Cells by Using Nanostructured Silicon Substrates with \nIntegrated Chaotic Micromixers. Angew Chem, Int Ed. 2011; 50:3084–3088.\n64. Duan R, Zuo X, Wang S, Quan X, Chen D, Chen Z, Jiang L, Fan C, Xia F. Lab in a Tube: \nUltrasensitive Detection of MicroRNAs at the Single-Cell Level and in Breast Cancer Patients \nUsing Quadratic Isothermal Amplification. J Am Chem Soc. 2013; 135:4604–4607. [PubMed: \n23445447] \n65. Liu W, Thomopoulos S, Xia Y. Electrospun Nanofibers for Regenerative Medicine. Adv Healthcare \nMater. 2012; 1:10–25.\n66. Xie J, Liu W, MacEwan MR, Bridgman PC, Xia Y. Neurite Outgrowth on Electrospun Nanofibers \nwith Uniaxial Alignment: The Effects of Fiber Density, Surface Coating, and Supporting \nSubstrate. ACS Nano. 2014; 8:1878–1885. [PubMed: 24444076] \n67. Smith L, Xia Y, Galatz LM, Genin GM, Thomopoulos S. Tissue-Engineering Strategies for the \nTendon/Ligament-to-Bone Insertion. Connect Tissue Res. 2012; 53:95–105. [PubMed: 22185608] \n68. Xie J, MacEwan MR, Ray WZ, Liu W, Siewe DY, Xia Y. Radially Aligned, Electrospun \nNanofibers as Dural Substitutes for Wound Closure and Tissue Regeneration Applications. ACS \nNano. 2010; 4:5027–5036. [PubMed: 20695478] \n69. Lang N, Pereira MJ, Lee Y, Friehs I, Vasilyev NV, Feins EN, Ablasser K, O’Cearbhaill ED, Xu C, \nFabozzo A, et al. A Blood-Resistant Surgical Glue for Minimally Invasive Repair of Vessels and \nHeart Defects. Sci Transl Med. 2014; 6:218ra6.\n70. Yang SY, O’Cearbhaill ED, Sisk GC, Park KM, Cho WK, Villiger M, Bouma BE, Pomahac B, \nKarp JM. A Bio-Inspired Swellable Microneedle Adhesive for Mechanical Interlocking with \nTissue. Nat Commun. 2013; 4:1702. [PubMed: 23591869] \n71. Cho WK, Ankrum JA, Guo D, Chester SA, Yang SY, Kashyap A, Campbell GA, Wood RJ, Rijal \nRK, Karnik R, et al. Microstructured Barbs on the North American Porcupine Quill Enable Easy \nTissue Penetration and Dificult Removal. Proc Natl Acad Sci US A. 2012; 109:21289–21294.\n72. Liu Y, Lim J, Teoh SH. Review: Development of Clinically Relevant Scaffolds for Vascularised \nBone Tissue Engineering. Biotechnol Adv. 2013; 31:688–705. [PubMed: 23142624] \nMitragotri et al. Page 13\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\n73. Lim J, Chong MSK, Chan JKY, Teoh SH. Polymer Powder Processing of Cryomilled \nPolycaprolactone for Solvent-Free Generation of Homogeneous Bioactive Tissue Engineering \nScaffolds. Small. 2014; 10:2495–2502. [PubMed: 24740849] \n74. Peer D, Karp JM, Hong S, Farokhzad OC, Margalit R, Langer R. Nanocarriers as an Emerging \nPlatform for Cancer Therapy. Nat Nanotechnol. 2007; 2:751–760. [PubMed: 18654426] \n75. Chow EKH, Ho D. Cancer Nanomedicine: From Drug Delivery to Imaging. Sci Transl Med. 2013; \n5:216rv4.\n76. Godwin H, Nameth C, Avery D, Bergeson LL, Bernard D, Beryt E, Boyes W, Brown S, Clippinger \nAJ, Cohen Y, et al. Nanomaterial Categorization for Assessing Risk Potential to Facilitate \nRegulatory Decision-Making. ACS Nano. 2015; 9:3409–3417. [PubMed: 25791861] \n77. Mura S, Nicolas J, Couvreur P. Stimuli-Responsive Nanocarriers for Drug Delivery. Nat Mater. \n2013; 12:991–1003. [PubMed: 24150417] \n78. Pacardo DB, Ligler FS, Gu Z. Programmable Nanomedicine: Synergistic and Sequential Drug \nDelivery Systems. Nanoscale. 2015; 7:3381–3391. [PubMed: 25631684] \n79. Lu Y, Sun W, Gu Z. Stimuli-Responsive Nanomaterials for Therapeutic Protein Delivery. J \nControlled Release. 2014; 194:1–19.\n80. Gu Z, Aimetti AA, Wang Q, Dang TT, Zhang Y, Veiseh O, Cheng H, Langer RS, Anderson DG. \nInjectable Nano-network for Glucose-Mediated Insulin Delivery. ACS Nano. 2013; 7:4194–4201. \n[PubMed: 23638642] \n81. Mo R, Jiang T, DiSanto R, Tai W, Gu Z. ATP-Triggered Anticancer Drug Delivery. Nat Commun. \n2014; 5:3364. [PubMed: 24618921] \n82. Gu Z, Dang TT, Ma M, Tang BC, Cheng H, Jiang S, Dong Y, Zhang Y, Anderson DG. Glucose-\nResponsive Microgels Integrated with Enzyme Nanocapsules for Closed-Loop Insulin Delivery. \nACS Nano. 2013; 7:6758–6766. [PubMed: 23834678] \n83. Godwin H, Nameth C, Avery D, Bergeson LL, Bernard D, Beryt E, Boyes W, Brown S, Clippinger \nAJ, Cohen Y, et al. Nanomaterial Categorization for Assessing Risk Potential to Facilitate \nRegulatory Decision-Making. ACS Nano. 2015; 9:3409–3417. [PubMed: 25791861] \n84. Mitragotri S, Burke PA, Langer R. Overcoming the Challenges in Administering \nBiopharmaceuticals: Formulation and Delivery Strategies. Nat Rev Drug Discovery. 2014; 13:655–\n672. [PubMed: 25103255] \n85. Chertok B, Webber MJ, Succi MD, Langer R. Drug Delivery Interfaces in the 21st Century: From \nScience Fiction Ideas to Viable Technologies. Mol Pharmaceutics. 2013; 10:3531–3543.\n86. Hammond PT. A Growing Place for Nano in Medicine. ACS Nano. 2014; 8:7551–7552. [PubMed: \n25154926] \n87. Khademhosseini A, Peppas NA. Micro- and Nanoengineering of Biomaterials for Healthcare \nApplications. Adv Healthc Mater. 2013; 2:10–12. [PubMed: 23299936] \nMitragotri et al. Page 14\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nFigure 1. \nIn vivo activity of immunomodulatory SNAs as cancer vaccines.\nMitragotri et al. Page 15\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nFigure 2. \nBarriers to successful in vivo delivery of nucleic acids using nonviral vectors. Reprinted with \npermission from ref 19. Copyright 2014 Macmillan Publishers Ltd.\nMitragotri et al. Page 16\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nFigure 3. \nSubconjunctival instillation of nanocarriers incorporating latanoprost lowers eye pressure in \nglaucoma patients for up to 3 months. Reproduced from ref 37. Copyright 2014 American \nChemical Society.\nMitragotri et al. Page 17\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nFigure 4. \nSchematic for the nanoparticle-based treatment of acne. Silica–gold nanoparticles are \ndelivered into sebaceous glands using low-frequency ultrasound. Nanoparticles are then \nactivated using near-infrared light to induce thermolysis. Reprinted with permission from ref \n45. Copyright 2015 Elsevier.\nMitragotri et al. Page 18\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nFigure 5. \nNanoneedle for the delivery of VEGF-165 to upregulate blood vessel formation in muscle. \n(A) Scanning electron microscope (SEM) micrographs showing the morphology of porous \nsilicon nanoneedle arrays with pitches of 2 μm. Scale bars, 2 μm. (B) High-resolution SEM \nmicrographs of nanoneedle tips showing the nanoneedles’ porous structure and the tunability \nof tip diameter from less than 100 nm to over 400 nm. Scale bars, 200 nm. (C) Intravital \nbright-field (top) and confocal (bottom) microscopy images of the vasculature of untreated \n(left) and hVEGF-165-treated muscles with either direct injection (center) or nanoinjection \n(right). The fluorescence signal originates from systemically injected FITC–dextran. Scale \nbars, bright-field 100 μm; confocal 50 μm. (D, E) Quantification of the fraction of \nfluorescent signal (dextran) (D) and the number of nodes in the vasculature per mm2 (E) \nwithin each field of view acquired for untreated control, intramuscular injection (IM) and \nnanoinjection. *p = 0.05, **p < 0.01, ***p < 0.001. Error bars represent the SD of the \naverages of five areas taken from three animals. Reprinted with permission of figure and \ncaption text from ref 48. Copyright 2015 Macmillan Publishers Ltd.\nMitragotri et al. Page 19\nACS Nano. Author manuscript; available in PMC 2017 January 12.\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\nA\nuthor M\nan\nu\nscript\n",
    "Link": "https://core.ac.uk/download/83231697.pdf"
}