{
    "Title": "The Public Option: Government-Provided Off-Street Parking In Downtown Philadelphia",
    "Authors": "Caskey, John P.",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Swarthmore College Works Economics Faculty Works Economics Spring 2010 The Public Option: Government-Provided Off-Street Parking In Downtown Philadelphia John P. Caskey Swarthmore College, jcaskey1@swarthmore.edu This work is brought to you for free and open access by . It has been accepted for inclusion in Economics Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. Follow this and additional works at: https://works.swarthmore.edu/fac-economics  Part of the Economics Commons Let us know how access to these works benefits you  Recommended Citation John P. Caskey. (2010). \"The Public Option: Government-Provided Off-Street Parking In Downtown Philadelphia\". William & Mary Policy Review. Volume 1, Issue 1. 1-23. https://works.swarthmore.edu/fac-economics/280   The Public Option: Government-Provided Off-Street Parking in Downtown Philadelphia  John P. Caskey*  As of late 2009, the Philadelphia Parking Authority (PPA) owned and operated eight off-street parking facilities in downtown Philadelphia. At the same time, there were 134 private-sector commercial parking facilities in downtown. This paper argues that there is no economic rationale for PPA’s presence in the market, because PPA’s exit would lead to almost no detectable effect on either the supply or pricing of off-street parking. Thus, one can only understand the presence of the public option by taking an historical and political perspective. The City entered the off-street parking market in the 1950s because the automobile was undermining the competitiveness of downtown businesses and these business interests complained that the private sector was not meeting the need quickly or cheaply enough. Their political clout and the desire by the City to halt the relative decline of downtown property values led the City to enter this market. The City used a public authority to carry out this policy because a parking authority could be fiscally independent of the City and, it was argued, would be apolitical. Shortly after its creation, however, local—and later state—politicians recognized that the PPA could be used for patronage employment, something that early advocates of parking authorities apparently had not foreseen. Over time, this political calculation became the rationale for the PPA to continue to operate off-street parking facilities in competition with the private sector.   INTRODUCTION  As of late 2009, The Philadelphia Parking Authority (PPA) owned and operated eight off-street parking facilities—garages and lots—in downtown Philadelphia, an area known as Center City.1 At the same time, there were 134 commercial private-sector parking facilities in Center City.2 For economists, this is puzzling.3 Why is the public sector competing with the  * Professor of Economics, Swarthmore College; Ph.D., Stanford University; B.A., Harvard University. I am grateful  to  Jonathan  Hum,  Swarthmore  ’11, for outstanding research assistance. I regret that this paper had to be written without the cooperation of the PPA. I asked the management of the PPA to provide me with background information about its operations and motives and to comment on an earlier draft of this paper, but it did not respond. There are no publicly available archives from the PPA from the mid-1960s onward.  2 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   private sector in this market? Does the presence of the PPA lots and garages affect the market for off-street parking in Center City, or would the market function more or less the same without them? If the presence of publicly-owned parking facilities has little impact on the downtown parking market, why then does the PPA remain in this business?   In this paper I seek to answer these questions. I ask initially whether the presence of publicly-owned off-street parking facilities has a significant effect on the supply or pricing of off-street parking. My conclusion is that it does not. So why is the public sector competing with the private sector in this business? I argue that one must take an historical and political perspective  to  answer  this  question.  In  brief,  Philadelphia’s  government entered the off-street parking market shortly after the end of World War II as it became apparent that the widespread use of the automobile was undermining the competitiveness of central city businesses, especially retail firms. The City also worried that the deterioration of Center City property values would reduce property tax revenues. Private entrepreneurs recognized the demand for off-street central city parking and began to retrofit or create structures to meet this need as early as the 1920s, but downtown business interests thought that the private sector was not meeting the need quickly or cheaply enough. Certainly, the Great Depression and war-time supply restrictions during the 1940s and early 1950s hampered the ability of the private sector to build off-street parking structures. Once these constraints were lifted, the private sector could respond, but the political advocacy of downtown business interests and the desire by the City of Philadelphia to halt or slow the relative decline of Center City business activity and property values led the City to begin building off-street public parking facilities in the early 1950s.  The City used a public authority to carry out this policy because a parking authority could be fiscally independent of the City, and its advocates argued that an authority would be apolitical and business-like. Shortly after its creation, however, local—and later state—politicians recognized that the PPA could be used for patronage employment and to support economic development goals of local politicians, something that early advocates of parking authorities either had either not foreseen or had ignored. In any case, I argue that there is no economic rationale for the contemporary PPA to operate off-street parking facilities, but there is a historical explanation for how it got into the business and a political rationale for it to continue.   I. WHAT ROLE DO THE PPA’S GARAGES AND LOTS PLAY IN THE CENTER CITY PARKING MARKET?  In  this  section,  I  ask whether  the PPA’s Center City parking  facilities have a detectable impact on the downtown parking market.4 Before doing 2010] OFF-STREET PARKING IN PHILADELPHIA 3  so, however, I note that the PPA’s current rationale for being in the Center City off-street parking market is unspoken and unclear. There are no contemporary studies arguing that there is a shortage of off-street parking in Center City, nor are there recent studies arguing that market failures prevent the private sector from meeting the need for off-street parking. In fact, the prevailing view seems to be just the opposite. Richard Voith, for example, provides a careful economic analysis making the case that too much off-street parking can damage the economic productivity of a central business district (CBD), as well as its attractiveness to many workers and residents, by destroying its unique feature—a dense collection of office workers and residents who interact for business and leisure.5 These interactions foment and disseminate new ideas, sometimes serendipitously, which raise the productivity and excitement of the CBD. Abundant off-street parking is antithetical to density and can diminish the productivity and vibrancy of a CBD. Inga Saffron, the Philadelphia  Inquirer’s architecture and urban planning critic, wrote a strident article supporting the view that Center City Philadelphia has more than enough off-street parking.6 In  any  case, my  review  (in August  2009) of PPA’s website did not find any explanation of why it operates downtown parking facilities.7   To keep this section reasonably brief, I do not delve further into the question of whether Center City has too little or too much parking, nor do I discuss whether the pricing of Center City off-street parking is optimal for the development of the downtown.8 Rather, I simply ask whether the supply or pricing of Center City off-street parking is detectably different because the PPA operates eight facilities there.   As of late 2009, PPA’s facilities accounted for about 13 percent of the off-street parking slots in Center City (see Table 1). It is of course, impossible to answer the counterfactual: If PPA had never existed, how many fewer slots might exist in the City? As I discuss in the section on the history of the PPA, there were no obvious market failures that prevented the private sector from supplying off-street parking, so it is reasonable to think that the private sector would have supplied a roughly equivalent number of aggregate Center City parking spots with or without the PPA. In any case, it is clear that if the PPA were to exit the business, it could presumably sell its eight facilities to private operators who would almost certainly continue to use them for parking in the foreseeable future since it would be very costly to convert them for another use. Alternatively, the PPA could retain ownership of the facilities and lease them to private-sector operators, ensuring that they remain parking facilities for the term of the leases. Under either approach, the supply of Center City parking would be unaffected or barely affected for many years to come.   It is not clear what effects PPA’s parking facilities might have on prices in Center City. It depends on what the PPA is trying to accomplish with its off-street parking facilities (which it does not explain) and, in some cases, 4 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   how private-sector parking facilities react to its policies. The PPA might, for example, set its prices below the prices prevailing at private facilities. If the private facilities do not match the PPA prices, then the PPA’s facilities would offer a lower-cost alternative for off-street parkers. If the operators of private-sector parking facilities match, or nearly match  the  PPA’s parking rates, then the PPA might reduce general parking prices in Center City, or at least in the facilities near those of the PPA.  Alternatively, the PPA could set its prices to maximize profits. If so, its prices should be similar to those of nearby private facilities, which are presumably doing the same thing. Since the PPA transfers its revenues, beyond those it judges necessary to support its long-term operations, to the City of Philadelphia and the Philadelphia School District, it might maximize profits in an effort to maximize this fiscal transfer.9  Finally, if the PPA is seen primarily as a source of patronage employment (something I discuss later in the paper), it might seek to maximize its employment positions. In this case it would operate its own parking facilities rather than lease them to private-sector firms and would operate them with unnecessarily high levels of staffing or supervision. Under this scenario, it would set market-level prices but have below-market rates of return due to the featherbedding.    In order to compare prices at PPA facilities to those at private facilities, between July 22 and August 5 of 2009, I collected parking prices at all off-street parking facilities in Center City Philadelphia, which I defined as reaching from the north side of South Street to south side of Vine Street and between Front Street and the Schuylkill River. During this time, I also collected  data  from  the  PPA’s website  and  from  the websites  of  private-sector operators on the number of parking slots in each parking facility. In the relatively few cases in which data on the number of parking slots were not available for private-sector facilities, I made my own estimate while visiting the facility. Table 1 presents data on the market share of the PPA and the largest private-sector operators.10 Table 2 presents the average prices for three types of parking situations for the PPA facilities and for the private-sector parking facilities.11   As indicated in Table 1, the Center City off-street parking market is moderately concentrated. The three largest operators (one of which is the PPA) control slightly over half of the Center City parking slots.12 As shown in Table 2, the average price for parking at a PPA facility is below the average for parking at a private facility in all three pricing categories. This could mean that the PPA sets its prices below its competitors or that PPA facilities have less desirable locations or amenities. Certainly, prices for off-street parking vary by the location of the facilities.    As shown in Table 3, average prices vary across Center City geographical quadrants, but there is no consistent pattern. The quadrants 2010] OFF-STREET PARKING IN PHILADELPHIA 5  that are the most expensive for commuters can be the least expensive for evening parkers. As indicated in the bottom of the table, facilities that are located farther away from City Hall (the geographical central point of Center City) are on average less expensive than those that are close to City Hall. While this pattern is consistent across all three parking price categories, it does not hold for individual facilities. A facility that is far from City Hall but close to popular theaters, for example, might have a higher evening parking rate than one that is close to City Hall.   Table 1: Parking Market Share in Center City Parking Firm  Number of Center City Parking Slots Market Share Central Parking  7,331  20.2% Parkway  6,809  18.7% Phil. Parking Authority  4,626  12.7% Interpark  3,289  9.0% Park America  2,872  7.9% FiveStar Parking  2,750  7.6% Patriot Parking  2,234  6.1% Expert Parking  1,921  5.3% EZ Park  1,551  4.3% Other parking firms  2,965  8.2% Total                     36,348        Table 2: Average Parking Prices in Center City   All‐day rate   One‐hour mid‐day rate Peak evening rate (6–10 pm) PPA Average  $12.97  $8.06  $9.11 Average for Private Facilities $13.44  $10.77  $13.81     Table 3: Parking Prices by Location Within Center City Average for:  All‐day rate for typical commuter One‐hour rate mid‐day Peak evening rate (6–10 pm)  NE quadrant  $11.93  $10.98  $14.39 NW quadrant  $15.24  $10.13  $10.22 SE quadrant  $12.07  $10.03  $13.66 SW quadrant  $14.72  $11.18  $14.47 ≤ 4 blocks  from City Hall $15.55  $11.99  $14.87 ≥ 6 blocks  from City Hall $12.59  $9.98  $12.96 6 WILLIAM & MARY POLICY REVIEW [Vol. 1:25    Given such variation in the pricing of parking by location, I examined the locations of the eight Center City PPA facilities and contrasted the prices for parking at these facilities to those at private facilities located within three blocks of the PPA locations. My analysis of these data leads me to the following conclusions.  In all eight cases, the commuter rates charged at the PPA facilities are similar to those charged in nearby private garages. In seven out of eight cases, the one-hour mid-day rates at the PPA facilities are similar to those found in nearby private facilities. In one case, the PPA garage next to a Center City  shopping mall  (“The Gallery Mall”),  PPA’s  rate  is markedly lower than those at nearby private facilities. Finally, in half of the eight cases,  the  PPA’s  evening  parking  rates  are  similar  to  those  prevailing  in nearby private facilities. The four exceptions are the PPA rate at the Gallery Mall, the PPA rates at its two facilities at 15th and Arch, and the PPA evening rate at this garage at 1540 Spring Street. In these cases, PPA rates are modestly lower than those in nearby private facilities.   What do these pricing patterns suggest that the PPA is trying to accomplish with its parking facilities? The answer is unclear. Certainly the pricing for day-long  commuters’  parking  and  the  pricing  (with  one exception) for mid-day short term parking suggest that the prices for parking at PPA facilities are similar to those at nearby private facilities. It is theoretically possible that the PPA is setting its prices below those that would prevail near  its  facilities were  the PPA’s  facilities not present,  and that the private-sector facilities are lowering their prices to match approximately the PPA’s prices. But a comparison of the prices at private facilities near PPA facilities with the prices at private facilities at a significant distance from the PPA facilities does not support this hypothesis. Rather, it appears that the PPA sets its parking prices similarly to the way the private-sector facilities set theirs. This is consistent with the notion that the PPA is trying to maximize its earnings in order to maximize its fiscal transfers to the City and School District. It is also consistent with the notion that the PPA is maximizing earnings in order to create revenue to support the greatest number of patronage employment opportunities at the PPA. It could also be some combination of these two objectives.   In the case of peak evening parking rates, about half of the time the PPA rates are generally modestly below those prevailing in the surrounding private lots. This could suggest that the PPA is consciously setting somewhat lower rates in order to promote evening economic activity in Center City. It could also suggest that its facilities have a disadvantage in terms of location, perceived security, or amenities compared to the nearby lots, and that the lower prices are intended to offset such disadvantage. This latter view strikes me as likely to be correct, given that the PPA facilities 2010] OFF-STREET PARKING IN PHILADELPHIA 7  with the lower evening prices tend to be very large garages, underground garages, and/or old unadorned concrete garages.   There is a second striking pattern in the data: the wide variation in the prices for parking at nearby parking facilities. To some extent, this may reflect differences in the visibility, convenience, amenities, or perceived security of the facilities, but I strongly suspect that it also reflects information  problems  in  the market.  In  the  case  of  PPA’s  facility  at  the Gallery, at the time of my survey it charged $3 per hour for mid-day short-term parking, which is less than a third of what most of the surrounding parking facilities were charging. Moreover, at the time of my survey this PPA garage (with 850 parking slots) appeared to have substantial numbers of open parking spaces. It is difficult to believe that the small differences in location or nature of the facilities justify such a large price differential. Rather, I speculate that most of the people paying $10 per hour or more were unaware that a nearby facility was charging $3 per hour.   In an ideal market, consumers have full information about the quality and prices of the goods or services that they are comparing. In choosing off-street parking, however, drivers have traditionally obtained pricing information, especially for short-term parking or infrequent parking, by driving from facility to facility and reading the posted pricing information, which is sometimes inconveniently posted. Given the associated search costs, owners of parking facilities have some pricing power. For instance, an owner of a facility that is nearly identical to another will still get some customers when he or she charges a somewhat higher price than its competitor.13   In any case, the data strongly suggest that PPA’s parking facilities have no significant impact on either the general price level or supply of parking in Center City parking market. If the PPA were to sell the facilities and exit the parking business, taking care to select buyers that would not create much more concentrated ownership in the market, most people parking in Center City would certainly not notice any difference. It is therefore puzzling why the PPA continues to own and operate Center City parking facilities.14 In what follows, I argue that one needs an historical and political perspective to provide the answer to this puzzle. Only an interdisciplinary perspective can lead to an understanding of contemporary public policy toward Philadelphia's downtown off-street parking market.   II. WHEN AND WHY DID CITIES START TO PROVIDE  OFF-STREET PARKING?  The very first automobiles were built at the turn of the 20th century, but by 1910 there were only about 468,000 automobiles and trucks registered across the nation.15 By 1913, however, Henry Ford had largely perfected the mass production of the Model T and other manufacturers were building far more reliable cars than they had just a few years earlier. As indicated in 8 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   Figure 1 below, the number of registered automobiles and trucks grew explosively between the early 1910s and 1929.16 In 1929, there were 26.5 million registered cars and trucks in the country.      Although motor vehicle registrations declined somewhat in the face of the Great Depression, it resumed its growth after 1933. By the 1930s, it was common for many office workers and downtown shoppers—who a few years earlier would have taken a streetcar—to drive their cars to downtown locations. As Richard Seltzer noted in his 1942 study of trends in Philadelphia, “While the number of people entering and leaving the central district in the year 1938 is 11% less than in 1928, the total number of vehicles transporting these passengers has increased 30%.”17  The explosive growth in car ownership created tremendous congestion in the dense urban centers of large American cities. Certainly, these cities had struggled with congestion before, especially as streetcars and delivery wagons competed for use of city streets in the late 1800s. But the arrival of the automobile introduced a new problem that cities had not faced with streetcars: where to park them when people drove into dense urban centers. When cars were rare in the 1910s, they could generally be easily accommodated parked alongside city streets. By the mid-1920s, this was increasingly problematic.   From the beginning of the development of the automobile, car owners had to store them. In their book, Lots of Parking: Land Use in a Car Culture, John Jakle and Keith Sculle explain that the automobiles of the early 1910s were ill-equipped to function in winter and their owners often sought to store them in a building during inclement weather.18 05,00010,00015,00020,00025,00030,00035,000190319051907190919111913191519171919192119231925192719291931193319351937Number in ThousandsFigure 1: Number of Registered Motor Vehicles in the United States2010] OFF-STREET PARKING IN PHILADELPHIA 9  Entrepreneurs responded by leasing space in livery stables or other such structures and by constructing parking garages in urban areas:  By 1915, most cities contained at least a few garages purposely built for car parking. Early storage garages, irrespective of their origin, were used primarily for long-term parking, especially winter storage in cities where open or unenclosed cars precluded year-round use.19   In the late 1910s and early 1920s, the streets in large cities were becoming crowded with parked cars and, since the cars were winterized by that time, this was a year-round phenomenon. In many cases, downtown parking was haphazard, with some cars parallel parking, some parked at angles, some on sidewalks, some in medians, etc. This greatly impeded the flow of traffic and led to two reactions. First, municipal governments began to regulate curbside parking.20 Second, entrepreneurs began to build facilities for off-street parking: By 1920, every large city had dozens of small business entrepreneurs variously experimenting with parking as a profit making enterprise. …In Philadelphia, W.W. Smith started with a single lot in 1921, rapidly expanding in 5 years to 20 lots and 8 garages. … Philadelphia’s downtown parking operations occupied lots cleared of buildings, with corner lots being preferred.21  The destruction of old buildings and the conversion of the cleared land into parking lots accelerated in the 1930s. With the onset of the Great Depression, many landlords found that they could not rent their office space or residential properties, or that they had to rent the space at much reduced rates. Municipal governments, however, did not reduce property taxes commensurately. Landlords responded by demolishing their buildings and replacing them with parking lots. Property taxes on land without structures were much lower and the cleared lots could earn revenue meeting the demand for off-street parking.22  This situation certainly applied to Philadelphia. The Philadelphia Evening Bulletin reported the results from a City of Philadelphia study that found 178 parking lots in Center City covering 38 acres.23 Most were created through the destruction of old buildings, including some historical landmarks. The study estimated that the City lost at least $400,000 a year in tax revenue from such land use conversions.   Beginning in the 1930s, cities began to permit some municipally-owned land to be used for parking. In all cases that I have found, the cities provided parking lots—not garages—and the cities apparently either rented the land to a private-sector operator who charged customers to park their cars or simply permitted free parking on the land. As Orin Nolting and Paul Opperman noted in 1938: Off-street parking lots are a new municipal activity. Thirty-three cities in at least 17 states, or about one-fourth of the cities covered in this study, have established such facilities, while several additional cities are considering plans for developing municipal 10 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   parking areas….In most instances the land was already owned by the city and was not acquired specifically for parking purposes…. Only two of the 33 cities charge a fee for parking. The charge at the Grant Park area near Michigan Boulevard in Chicago is 25 cents for 24 hours.24   In the case of Philadelphia, it is unclear when the city first began to use city-owned land for parking. In a Philadelphia Evening Bulletin article of 1935, however, it is evident that the city was already leasing some of its land to private-sector operators of parking lots at that time.25   There is no careful economic analysis that I could find, from the 1930s through the 1950s, to explain why municipal governments had to provide a service that the private sector was also providing. The common explanation of the era was that downtown businesses were suffering relative to those in the newly developing suburbs because of an absence of low-cost parking in central business districts. In addition, tax revenues from the central business districts were declining relative to revenues from outlying areas due to falling relative property values. But no analyst provided a theoretical rationale for why the private sector would not provide sufficient downtown parking.26 Typically, analysts of the era would write that downtown land was too expensive to justify use as parking facilities. In other words, advocates for downtown municipal parking facilities wanted government-subsidized parking, though they rarely stated this explicitly.   Nolting and Opperman, for example, argued in 1938 that the lack of downtown parking was a major factor behind the decentralization of cities:  It is easier in these days of excessive traffic to get to where you are going than to dispose of your automobile at its destination—if the terminal point is in the central business district. Universal ownership of automobiles has created a demand for terminal facilities in central business districts that is of great concern not only to municipal officials but to business interests and above all to the drivers of motor vehicles. Not many years ago these parking  requirements were met without great difficulty….Unless improvements are forthcoming shoppers who arrive in autos will tend to seek sections possessing greater convenience, and the trend toward decentralization will be still further augmented.27  Based on this analysis, the authors concluded: Many traffic authorities argue that the provision of adequate parking space in or near business districts is a public responsibility and that only through municipal ownership can adequate provision be made for permanent terminal parking facilities. Merchants realize that parking facilities are essential to business and that if the problem is not solved a costly decentralization of business will result.28  2010] OFF-STREET PARKING IN PHILADELPHIA 11   In a 1942 study planning for the post-World War II redevelopment of Philadelphia, Richard Seltzer made the same point.29 He argued that parking difficulties in Center City encouraged businesses to locate outside of the central business district, The difficulties encountered in parking leads many prospective purchasers to buy in outlying districts and, due to the limited time permitted on the streets for parking, the number of purchases made by many others is curtailed.30  Anne Alpern reached a similar conclusion in her analysis of the issue in Pittsburgh, stating that the movement of business toward the suburbs had made downtown business interests acutely aware of the “close relationship between adequate parking and economic survival of the central business districts.”31   Another, related rationale that advocates for municipal parking facilities provided was the decline in downtown tax revenues. Alpern, for example, in her law review article advocating municipal off-street parking facilities, wrote of  the “tremendous  tax  losses” due  to “the exodus  from  the city  to suburban areas because of traffic congestion and the unavailability of parking  space”.32 Similarly, Edward Mogren, writing in 1953 for the automobile-industry-funded Eno Foundation, stated:  Municipalities, large and small throughout the country, are experiencing the same deterioration in downtown area tax paying potentiality….There are other contributing causes, but parking deficiencies are one of the most important reasons for the substantial declines of these various city district tax revenues.33  In addition, while Mogren did not claim that the private sector could not provide the proper amount of off-street parking, he argued that for unexplained reasons the private sector was responding too slowly:34 Many municipalities have taken action to ease their parking problems. Leadership has been assumed by municipal administrators who believe implicitly in private enterprise but feel that their city cannot and should not go without this service because private interest has lagged in providing it.35  Beyond the arguments that municipal governments had to enter the off-street parking business either to save downtown business districts or to prevent the decline in tax revenues, there were other rationales advanced for why municipal governments were especially suitable for this purpose. Mogren, for example, argued that there could be coordination and planning problems if the provision of off-street parking were left to the private sector: Curb parking regulations are administered by the municipality. Most effective regulation of curb parking cannot be obtained unless a coordinated agency controls off-street parking as well....  Reasonably complete parking relief cannot be realized through the undirected and sporadic efforts of private initiative alone. Long-range solutions must contemplate both short-time 12 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   (shopper) and long-time (worker) parking needs and follow comprehensive plans for facility development and location.36   The problem with Mogren’s  rationale  is  that he does not explain why there would be such coordination problems if off-street parking were left to the private sector, especially given that local governments have zoning powers. It is not sufficient, to cite a hypothetical example, to argue that the local government must construct downtown office buildings because it already has the responsibility for the adjacent public streets. One must explain why the private sector and the government cannot divide these responsibilities without significant coordination problems.   These authors of the 1930s through 1950s did not openly call for subsidized off-street parking in central business districts. Jakle and Sculle, however, recognized that this was the implication if the public sector was to build off-street parking that would be low-cost for the customers:  Private interests might finance peripheral lots, but government subsidy was necessary for truly close-in parking, given that land costs remained high in downtown cores. Center-core parking, and certainly free or even low-cost parking located there, absolutely required municipal subsidy.37  To economists, these explanations for why municipal governments should enter the downtown off-street parking market are puzzling. Traditionally, economists argue for government intervention in a market if there are natural monopolies, externalities, or public goods. In the case of off-street parking, none of these classic market failures seems to be present. None of the authors argued that private monopolies controlled the market, and none argued that externalities led to an undersupply of parking. Off-street parking is certainly not a public good; it is easy to exclude those who do not pay for the service.38  Not all analysts of downtown parking problems called for municipalities to build and operate facilities. Writing in 1927 about the growing need for downtown off-street parking, Hawley Simpson argued that:  Private capital should be given every encouragement to establish storage garages, and cities should refrain from entering a field in which there appears no logical reasons for municipal operation. Even operation of sub-surface garages under public property is not necessarily a municipal function, and private operation with its greater potential economics, will better serve the public good.39  Similarly, Richard Seltzer, writing in 1942, blamed inadequate parking for the relative decline of Center City Philadelphia, but he did not call for a public sector solution. Rather, Seltzer recommended that Center City stores form cooperatives to operate parking lots and garages and that they subsidize the parking for their customers.40  2010] OFF-STREET PARKING IN PHILADELPHIA 13  It is…recommended that merchant groups lease or otherwise obtain possession of vacant lots in proximity to their places of business and operate them on a co-operative basis whereby a person entering the store, or those making purchases, may park free of charge, or at little expense, for a limited time.41   One can argue, of course, that the residents of outlying areas benefit if a city’s CBD is healthy. Certainly, studies have found that the prosperity of suburban communities is linked to the prosperity of the central cities they surround.42 Thus, there could be externalities to any activity that benefits the CBD. This could justify state- or metropolitan-level subsidies for economic development initiatives in the CBD. It is far from clear, however, that parking is the activity that is most deserving of subsidies. It could be, for example, that reducing CBD property taxes or subsidizing the arts would have a larger impact on CBD development than would building municipally-operated parking facilities. Moreover, if the government determines that it should subsidize parking, it could simply subsidize parking in privately-owned facilities.   In summary, although not all public policy analysts who focused on downtown parking issues prior to the 1950s called for the creation of subsidized public parking facilities, the majority did. Their explicit or implicit reasoning—and  that  reasoning’s  consequences—was as follows. By the 1920s, automobiles became a major means of transportation for the middle class. Because storing automobiles takes enormous amounts of space, dense CBDs were not compatible with cars. Many businesses that traditionally located in CBDs, especially large retail stores, moved to outlying locations that were built to accommodate the automobile. This led to a decline in CBD property values and a general awareness that the CBD was losing its regional preeminence. Given the demand for parking in CBDs and the decline in property values, private-sector developers began to build parking facilities in downtowns. But since many important institutions and venues, such as government buildings, public transit hubs, and cultural venues, were located in the CBD, downtown land remained more expensive than outlying land. Thus, private-sector parking operators had to charge more for parking downtown than their competitors in the newly-developing outlying areas who, in fact, often offered abundant free parking.43 This further encouraged decentralization and a slow relative decline in property values in the CBD. Downtown property owners resented this and argued for government-subsidized parking to reverse or offset the trend. In other words, there was not a valid economic justification for building government-subsidized off-street parking, but there was a political rationale.   III. WHY A PARKING AUTHORITY?  Regardless of whether it was good policy for municipal governments to begin to build and operate CBD off-street parking facilities, many were 14 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   doing so by the late 1930s. This continued after World War II ended, but with a twist. After the war, municipal governments began to ask their state legislatures  to allow  them  to create parking “authorities”  to undertake  the work. In fact, Pennsylvania was the first state to enact legislation allowing a municipal government to create an authority to build and operate off-street parking facilities.44 The state passed the legislation in 1947, and Pittsburgh immediately used this law to create its parking authority. Numerous other states enacted similar legislation in the next few years.45   There were several rationales for creating authorities to build and operate parking facilities. The authorities were empowered to acquire land for parking and to issue their own bonds to raise money for the land acquisition and to build the facilities. They could pledge future parking fee revenues to repay the bonds. As Alpern explained in 1950, this was a key motivation for the creation of the authorities: Decreased assessed valuations and limitations on borrowing power have placed most cities in a financial strait jacket from which they have been able to extricate themselves by means of the “authority” device. Parking authorities are able  to defray the cost of construction by the issuance of bonds payable out of revenues. Authorities provide a speedy method for the solution of the traffic problem without imposing an additional burden upon the taxpayers.46  The authorities could function similarly to private businesses because their actions did not need the approval of a city council or a state legislature. They were governed by a board of directors whose members were generally appointed by state or municipal politicians, but the board could function in a very business-like fashion and was expected to be somewhat isolated from political pressures since the members did not stand for direct election. Thus, the authorities were expected to be relatively more efficient and apolitical than a city department charged with building and operating parking facilities.  As Mogren explained in his 1953 book on parking authorities,  “Because of their autonomous nature, parking authorities are free of political pressures often found in municipal government …. Being dependent on their own earnings for continuation, there is an incentive to develop high management and personnel efficiency.”47 The state legislation creating the parking authorities generally gave them the power of eminent domain, so they could force the sale of privately-owned property in order to assemble land for parking purposes. Alpern argued that this power was critical to their effectiveness: “One of the most important powers given to parking authorities by legislative enactment is the power to condemn property for parking purposes.”48   In the case of Pennsylvania, however, this power was apparently rarely used in the ten years that followed the 1947 legislation. In a 1957 study of that state’s parking authorities, Nelson Guild reported,  2010] OFF-STREET PARKING IN PHILADELPHIA 15  The power of eminent domain granted to parking authorities by the enabling legislation, is generally used only as a last resort. Of the 25 authorities reporting in this survey, only two exercised this power in acquiring all properties. Five authorities condemned 10 per cent or less of their sites and 14 authorities did not resort to condemnation proceedings at all.49  Not surprisingly, some private-sector interests—especially those that owned off-street parking facilities—objected to the creation of government authorities that could build and operate parking facilities that would compete with private businesses. Advocates of parking authorities, such as Mogren, argued that parking authorities would not threaten private-sector interests since, according to him, their purpose was:  [N]ot to exclude private enterprise from the parking field. Rather, where substantial services are rendered by privately developed facilities, parking authority activity is aimed at supplementing such operation and stimulating extension of private installations. In areas where private initiative in parking is ineffective or non-existent, authority activities are directed toward coordinating city-sponsored facilities into a comprehensive system. Merchant and businessmen cooperation in the development of attractive, serviceable parking areas is possible under authority parking management.50  Nevertheless, Pennsylvania’s 1947 law allowing parking authorities to use the power of eminent domain was challenged in court. A Pittsburgh resident sued that city’s  parking  authority,  arguing  that  the  purpose  for which the land was seized did not constitute a proper public use. The plaintiff  was  joined  in  the  proceedings  by  the  “Downtown  Parking Association, a voluntary association of owners and operators of parking facilities in the downtown area...” of Pittsburgh.51   The case went to the Supreme Court of Pennsylvania, which ruled in favor of the Parking Authority without offering an explanation for why the private sector alone could not meet the need for off-street parking. In its ruling, the court explained:  Those attacking the constitutionality of such a law…obviously labor under the mistaken assumption that its purpose is merely to cater to the convenience of the owners and operators of motor vehicles…its real purpose is to promote larger and more general good of the community by freeing the streets of the impediments and perils arising from dangerous and often intolerable conditions of traffic congestion….It  is no constitutional objection to the statute, nor does it derogate from the public character of its objective, that the Authority will to some extent conduct what may heretofore have been regarded as a private enterprise…52  As this section indicates, public parking authorities were created to isolate from city budgets the fiscal impact of building parking facilities. They were expected to be apolitical, business-like organizations. They were given the power of eminent domain but, at 16 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   least in Pennsylvania in the early years, this power was rarely used. They competed with private-sector parking facilities, but generally did so gingerly. In Pennsylvania, the courts supported this public/private competition, but did not provide an economic rationale for why the private sector alone could not meet the need for off-street downtown parking.   IV. THE PPA AND OFF-STREET PARKING IN CENTER CITY  In Philadelphia’s  case, the creation of the PPA generally follows the factors outlined above, except for the PPA's growing role as a patronage employer. In the early 1950s, there was a widespread perception that Center City did not have enough off-street parking and that this was hurting its regional competitiveness. The state believed that a public authority was the best means for building off-street parking facilities, and the City used this mechanism to respond to downtown business interests that worried that insufficient, low-cost parking was hurting their sales. Very soon after the creation of the PPA, however, local—and later state—politicians began to view it as a source of patronage employment. Over time, this political role clearly became the main rationale for the public sector to maintain ownership and operation of off-street parking in competition with the private sector.  In January of 1950, the Philadelphia City Council organized the PPA under  the state’s parking authority  law. One would expect  that downtown property owners (other than owners of private parking facilities) and commercial interests would see this as a step toward the construction of favorable government-subsidized parking. One would also expect owners of private parking facilities to oppose it. News accounts of the time suggest that this was indeed the case.  Philadelphia’s City Council last Thursday passed the Philadelphia Parking Authority Ordinance, a measure opposed by most of the city’s  parking  lot  and  garage  operators.  What  swayed  the councilmen were much more influential voices—those of mercantile, industrial and financial organizations whose interests are intertwined with the business health of the city. The Chamber of Commerce, the Philadelphia Merchants Association, the City Planning Commission, the Keystone Automobile Club and the American Automobile Association, the Redevelopment Authority, the Philadelphia Highway Traffic Board, and the City Traffic Engineer all agreed with the need for action.53  Contemporary news accounts also suggested that a strong factor behind the push to have a government-owned parking authority construct parking facilities was the perception that the private sector had not met the need. The Philadelphia Inquirer reported that,  “[B]etween 28,000 and 30,000 [people driving cars] have business in the teeming, congested blocks that 2010] OFF-STREET PARKING IN PHILADELPHIA 17  lay between Walnut and Arch Streets, stretching from 4th to 18th. And they want to park their cars not too far away.”54 It went on to note that this area had only 3,500 off-street parking places and that the Philadelphia Highway Traffic Board estimated that this created a deficiency of 23,000 spaces.   Shortage of parking spaces in Center City in the early 1950s was not a universal perception. Certainly, garage owners, who opposed the creation of the PPA, argued that there was no shortage. But it is reasonable to think that a lack of construction during the Great Depression, the rationing of materials for civilian use during the 1940s and early 1950s, and increasing rates of automobile usage would have created a shortage of downtown parking. If so, one would expect the private sector to respond by building more parking as soon as these constraints eased. In other words, the problem would likely have been solved by a bit of patience since there were no fundamental market failures that prevented the private sector from responding. Indeed, news accounts indicate that the private sector was anxious to build new facilities. In 1952, for example, promoters of a 500-space private parking garage sued the PPA (unsuccessfully) to try to prevent it from building a competing nearby public parking garage. The backers of the private garage explained that they were delayed with their project only because “[d]emolition of existing buildings has been delayed...because of the national emergency and government restrictions on critical materials.”55    In launching a parking authority whose mission was to build off-street parking facilities, government officials were clearly sensitive to the charge that the government was entering a market that was traditionally served by the private sector. As the Philadelphia Inquirer reported within a few days of the City Council’s approval of the agency:  Everyone connected with the decision to put the city into the parking business, at least as a “silent partner” to private operators, has expressed regret that it must be done, but private industry, they  declare,  has  failed  to  find  an  answer,  and  so  it’s  up  to  the city.56 According to the New York Times the new chairman of the PPA announced that “the authority had no intention of competing against the privately operated garages.”57   Once the PPA was operational, it decided to focus on Center City because this is where it believed there was the greatest need and because its limited initial staffing and funding ($150,000 in loans from the City) permitted it to undertake a very small number of projects.58 The PPA settled on two initial projects: a  parking  garage  facing  one  of  the  city’s most elegant small parks, Rittenhouse Square, and a second garage several blocks away on Chestnut Street between 10th and 11th. In neither case did the PPA use its power of eminent domain to acquire land. Both garages were designed to hold approximately 500 cars.59 Despite some delays due to steel shortages during the Korean War, the Walnut Street garage opened 18 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   at the end of 1953 and the Chestnut Street garage in 1954. In the ensuing years, the PPA added eight other Center City parking facilities to its original two and, in 1985, sold the one it built across from Rittenhouse Square to an insurance company.60 As noted, the PPA leases one of its facilities to a private sector firm, so the PPA currently operates eight parking facilities in Center City.   Once war-time constraints eased, the private sector also began to respond to the need for Center City parking. By 1957, one news account noted that the PPA was losing money on its two original garages and cited a survey that found a surplus of spaces around these facilities.61 It explained that downtown retail interests wanted still more public parking based on the theory that “where there is parking, there will be parkers—and shoppers.” It noted, however, that private sector investors had a different view: “[D]emand must be present and accounted for before a parking facility—private or public—can be justified.”62   Once it was decided, rightly or wrongly, that the public sector should build garages, one of the rationales for creating parking authorities was that such agencies would be subject to far less political pressure than would a department of city government. In the case of the PPA, however, astute Philadelphia politicians, and later Pennsylvania state politicians, quickly took advantage of their ability to appoint the PPA’s board members, PPA’s exemption from civil service hiring requirements, and its ability to award some no-bid contracts to favored businesses. In 1950, when the PPA was created, a Republican political machine had long controlled Philadelphia’s government.  The Republican mayor appointed five men, with staggered terms, to the PPA board. The chair, who had a five-year term, was Francis. J. Chesterman, a retired president of the Bell Telephone Company of Pennsylvania. The board hired a former Republican deputy city treasurer to be the managing director.63 At the same time, a group of young Democrats was laying the groundwork to gain control of city council and the mayor’s office.64 In late 1951, the city elected a Democrat, Joseph S. Clark, as mayor. Within two years of Clark’s assuming office, Chesterman resigned as chair of the PPA, telling the mayor, “[Y]ou have decided to yield to long term pressure by the Democratic city organization to treat the authority as a political plum”.65 The mayor denied this, but he did acknowledge  that,  “I had been urged to reconstitute the board of the Parking Authority with individuals who were sympathetic to the aims of my administration and who would retain as executives and counsel men who did not owe their primary allegiance to the Republican city organization…”66  As the Democratic machine began to dominate Philadelphia politics from the mid-1950s onward, the PPA became a part of that very machine, providing employment positions to Democratic ward leaders, committee members, and out-of-office politicians.67 In a gentlemen’s agreement with 2010] OFF-STREET PARKING IN PHILADELPHIA 19  the Republican Party, the PPA also hired a smaller number of Republican ward leaders and committee members.   This situation was relatively stable between the late 1950s and 2001, but as the Parking Authority added new responsibilities—especially when it took on the job of enforcing on-street parking regulations—employment at the agency ballooned. In 1972, the PPA reportedly had just seven full-time employees.68 By 1977, it had taken the responsibility of providing security for the public parking facilities at the airport and had approximately 77 full-time workers, 32 of whom were retired or disable policemen hired under Mayor Rizzo’s administration. Mayor Rizzo was the former Police Commissioner of Philadelphia. The most highly paid employees tended to be politically active Democrats or relatives of such people. But the same news article that reported these facts also noted that “the authority has taken the position that it is only a quasipublic agency and is independent of the city government. As a result, authority records often are  difficult  to  get.”69 Rizzo was not apologetic about using the PPA to employ his supporters.  As  he  explained,  “There’s  not  much  patronage around anymore with everything civil service and (the authority) is the only area  where  you  can  help  people  who  help  politically…Patronage  always has been a way of life  in America….It’s even done in private industry.”70 By 1982, employment at the PPA had grown to 215.71 In the next year, it was scheduled to double, as the PPA was given responsibility for enforcing on-street parking regulations as well as managing its off-street parking facilities. Over the next two decades, PPA employment and responsibilities continued to grow.   In 2001, the Republicans shocked the Democrats and the City by using their control of the state legislature and governor’s office to take control of the PPA. The state legislature passed a law that gave the governor the right to appoint the PPA’s board. The law also temporarily increased the number of board members from five to eleven. The governor promptly appointed six Republicans to the board, giving them a voting majority.72 The previous five board members’ positions phased out as  their six-year terms expired, and the board continued with just the six new members, who were given ten-year terms. Although this gave the Republicans firm control of the PPA for  a period of  time,  the Republicans  continued  to honor  the gentlemen’s agreement with the Democrats that the PPA would provide patronage positions to both Democrats and Republicans. As the Philadelphia Inquirer reported, Six Philadelphia ward leaders—five Republican, one Democrat—and at least 174 city Republican and Democratic committee members  were  on  the  Authority’s  payroll  as  of  August [2007]…\"When  the  Republicans took over, they did a smart thing: They sat down with the people in the leadership over there and said, ‘We’re not going to commandeer this place,’” said City Councilman Frank Rizzo, a Republican.73 Before the state 20 WILLIAM & MARY POLICY REVIEW [Vol. 1:25   takeover, the informal agreement between  the  city’s Democratic and Republican bosses was that about one of every three patronage jobs at the Parking Authority would go to Republicans. That ratio has roughly reversed since the Republicans took command.74   In 2004, the state legislature designated the PPA to enforce taxi cab regulations in the City and gave it some other minor new responsibilities. Employment at the agency continued to expand. According to an independent report  for  the City of Philadelphia’s Office of  the Controller on the PPA, as of mid-2009 the PPA employed nearly 1,100 full- and part-time personnel.75 The off-street parking division employed 11, on-street parking employed 639, and airport parking employed 187.76 70 people are employed in administration and 19 in strategic planning.    In addition to its role as a patronage employment agency, the PPA has been used by local politicians to subsidize business development initiatives in the City and, in one case, to help recover from a failed private-sector development initiative. In the 1970s, for example, the PPA built its garage adjacent to a new Center City shopping mall (“The Gallery”) as part of an agreement  with  the  mall’s  developer.77 In 2001, a failed private-sector effort to develop a site at 8th and Market into an entertainment complex left a huge hole in  the ground along one of Center City’s main thoroughfares. Since City politicians had been major advocates of this project and had committed public subsidies for the project, the gaping hole was evidence of a glaring failure. The PPA stepped in, bought the site for $12 million, paved it over, and turned it into a parking lot.78   CONCLUSION  There appears to be no good economic rationale for the public off-street parking option in Center City Philadelphia. The PPA could exit the business and there would be almost no detectable effect on the price or supply of downtown off-street parking. Answering the  question,  “If  not, why does it then exist?” requires an historical and political perspective.   In the early 1950s, it was widely perceived that there existed a shortage of off-street parking in Center City and that this shortage hurt downtown business interests, downtown growth, and property values. This perception was probably justified given the increasing rates of automobile ownership and limited private-sector construction of all types during the Great Depression, World War II, and the Korean War. It was in this period that the PPA was created and began to build public parking facilities in response to political pressures from downtown retail business interests and in an effort to halt or slow the relative decline in Center City property values. At the same time, as the constraints eased for the private sector, it also built new facilities since there were no fundamental market failures that prevented it from doing so. Simply put, the PPA may have accelerated 2010] OFF-STREET PARKING IN PHILADELPHIA 21  the supply response, but left to its own devices, there was no reason that the private sector would not have met the need.   Shortly after the PPA was created local—and later state—politicians realized that the parking authority could be used to provide patronage jobs and support for favored regional development projects. That is, whatever the historical merit for the public sector to enter the downtown off-street parking market, once it did, the rationale for remaining in that market over the decades became political rather than economic.   1 The PPA also owns and operates a parking facility at 19th and Callowhill, which is outside of the geographic boundaries that I use to define “Center City.” In addition, it owns a parking garage at 8th and Arch, but it leases this to a private-sector operator, so I include this as a private garage in my analysis.  2 This only counts private facilities that are open to the general public.  3Although as far as I am aware, contemporary economists have not analyzed public provision of downtown off-street parking, I am not the first to note that it is a curious phenomenon. Indeed, a 1952 news article in the Philadelphia Evening Bulletin noted that the 1952 Municipal Year Book reported that 465 of the 1,137 American cities with populations over 10,000 owned and operated off-street parking facilities. Another 19 of these cities owned such facilities but leased them to private operators. The article stated, “These are curious figures in a land supposedly dedicated to the prin-ciple of private enterprise.” City Parking Lots, PHILA. EVENING BULL., July 29, 1952, at 3. 4 I should note that, since many cities have publicly-owned parking facilities, some of my analysis applies more broadly than just to Philadelphia. But cities have their unique histories and local struc-tures, so one should be cautious in extrapolating the lessons from Philadelphia to other cities. In addition, the PPA operates parking facilities outside of Center City, such as around the Philadelphia Airport. One should not automatically assume that the conclusions I reach for the PPA’s role in the downtown parking market apply to such other geographic contexts. 5 Richard Voith, The Downtown parking Syndrome: Does Curing the Illness Kill the Patient? FED. RES. BANK OF PHILA. BUS. R. (January/February 1998). 6 Inga Saffron, Heading toward Garage City? PHILADELPHIA INQUIRER, May 21, 2000, at 1. 7 The PPA does not produce any publicly-distributed material on its operations, such as an annual report or data on its performance.  8 A second justification for not tackling these issues is that the City could address these concerns using zoning laws, taxes, and subsidies as an alternative to a public-sector parking option.  9 The agreement about the transfer of PPA’s “profits” to the City and School District is actually more nuanced than this sentence conveys, but the details are not important to the fundamental point.  10 I assumed that parking facilities that are operated under different names have different ownership. Since most of these firms are privately-held and do not release information about their ownership, this need not be the case, i.e. the owners of “Park-a-Lot” could also be the owners or partial owners of “Best Deal Parking.” Of the listed private parking firms in Center City, Central Parking is a public company and Interpark is a subsidiary of GE Capital, a public company. 11 The peak evening rate is usually the rate for parking on a Friday or Saturday night. Table 2 presents simple unweighted averages. An alternative approach would be to weight the price data by the size of the facility. I did not do this because I did not always have an accurate measure of the size of the facility. In addition, some facilities are rarely filled, and it is not clear that consistently unused spaces should receive the same weight as a frequently used space.  12 Based on the data in the table, the Herfindahl Index for the market is 1,270, but this is a slight overestimate since several firms operate in the category of “other parking firms.” In my calculation of the Herfindahl Index, I treated the small firms in this category as one firm. An index of 1,270 indicates that the market is moderately concentrated but, since the third largest firm is a public-sector firm, it is not clear that a traditional Herfindahl Index is meaningful. 13 That is, the parking industry is monopolistically competitive, where the parking facilities are diffe-rentiated by location and amenities. This means that each parking facility has some local monopoly power and sets its price above its marginal cost. Significant customer search costs increase a loca-tion’s monopoly  power.  The  parking  facilities may  engage  in  complex  strategic  interactions  over prices and locations. Richard Arnott presents an analysis and theoretical model that captures some of 22 WILLIAM & MARY POLICY REVIEW [Vol. 1:25                                                                                                                              the complexity. Richard Arnott, Spatial Competition between Parking Garages and Downtown Parking Policy, 13 TRANS. POL’Y 458 (2006). A truly general model would probably be intractable.  14 Someone might argue that the PPA should keep its Center City parking facilities because it makes profits from them that it transfers to the City and School District. A private-sector operator, however, should be able to make similar profits from the facilities and in a competitive bidding process should pay the PPA the present discounted value of those future profits. Moreover, if the private sector can operate the facilities more efficiently than the PPA, these potential efficiency gains would enable the PPA to sell the facilities for more than the present discounted value of the PPA’s profits.  15 UNITED STATES DEPARTMENT OF COMMERCE, BUREAU OF THE CENSUS, HISTORICAL STATISTICS OF THE UNITED STATES, 1789–1945, 197 (1949). 16 Id. 17 RICHARD J. SELTZER, URBAN LAND INSTITUTE, PROPOSALS FOR DOWNTOWN PHILADELPHIA 30 (1942). 18 John A. Jakle and Keith Sculle, LOTS OF PARKING: LAND USE IN A CAR CULTURE (University of Virginia Press 2004). 19 Id. at 47. 20 Id. at 74 (“After World War I, literally every American city came to regulate curbside parking at their centers….Curbside parking, when not eliminated as a traffic hindrance, was carefully ra-tioned…”). 21 Id. at 50. 22 ORIN F. NOLTING AND PAUL OPPERMANN, PUBLIC ADMINISTRATION SERVICE, THE PARKING PROB-LEM IN CENTRAL BUSINESS DISTRICTS: WITH SPECIAL REFERENCE TO OFF-STREET PARKING 1 (1938). 23 Laura Lee, Parking Trend Cuts City Income, PHILA. EVENING BULL., Apr. 3, 1937. 24 Nolting & Oppermann, supra note 22, at 3. 25 City Leases Parking Lots, PHILA. EVENING BULLETIN, Dec. 23, 1935. 26 Some might wonder if the private sector could not meet the need for downtown parking because it lacks the power of eminent domain. But, as with acquiring land for downtown office buildings, this power is not necessary to build off-street parking facilities since such facilities do not require large amounts of contiguous land. Consistent with this observation, I note later that Pennsylvania parking authorities in their early years rarely acquired land for parking via eminent domain.  27 Nolting & Oppermann, supra note 22, at 1. 28 Id. at 1–2. 29 SELTZER, supra note 17, at 35. 30 Id. 31 Anne X. Alpern, Unsnarling the Traffic Jam by Use of Parking Authorities, 36 VA. L. REV. 1029, 1038 (1950). 32 Id. at 1029. 33 EDWARD G. MOGREN, THE ENO FOUNDATION FOR HIGHWAY TRAFFIC CONTROL, PARKING AUTHORI-TIES 12 (1953). 34 One might guess that the private sector businesses, lacking the power of eminent domain, could not assemble the necessary land as quickly as a municipal government. As discussed later, however, government agencies in Pennsylvania that built parking facilities in the time that Mogren was writ-ing rarely acquired the land via eminent domain.  35 MOGREN, supra note 33, at 13. 36 Id. at 12–13. 37 JAKLE AND SCULLE , supra note 18, at 74.  38 I suspect that part of the reason for the lack of economic analysis is that, from the 1920s through the 1930s, most cities apparently turned to municipal traffic engineers to address parking problems. That certainly was the case in Philadelphia, where Robert A. Mitchell was the Chief of the Bureau of Traffic Engineering in 1940s and was very active in analyzing parking needs for the City.  39 Hawley S. Simpson, Downtown Storage Garages, 133 ANNALS OF THE AM. ACAD. OF POL. SCI. 82, 88 (1927). 40 Seltzer also recommended, preposterously in my view, that the City build a three-deck highway down Sansom Street, a small street running East/West through Center City. The top level was to be used for West-bound traffic, the lower below-ground level for East-bound, and the middle level for local traffic. “Triple deck parking areas should be arranged to correspond with the three levels of the highway…This will not only provide additional parking areas in close proximity to the central pur-2010] OFF-STREET PARKING IN PHILADELPHIA 23                                                                                                                             chasing area, but also a high speed highway for ingress and egress to and from the center of the City. The parking areas and highway should be located so that no large structure would be demolished or seriously affected.” SELTZER, supra note 17, at 38. 41 Id. at 48. 42 See generally Richard Voith, Do Suburbs Need Cities? 38 J. OF REGIONAL SCI. 445 (1998). 43 DONALD SHOUP, AMERICAN PLANNING ASSOCIATION, THE HIGH COST OF FREE PARKING (2005). 44 Nelson P. Guild, Parking Authorities in Pennsylvania 1 (May 2, 1957) (unpublished Ph.D. disser-tation at Pennsylvania State University). 45 JAKLE AND SCULLE , supra note 18, at 82. 46 Id. note 31, at 1029. 47 MOGREN, supra note 33, at 17–18. 48 Alpern, supra note 31, at 1030. 49 Guild, supra note 44, at 3–4. 50 MOGREN, supra note 33, at 16. 51 McSorley vs. Fitzgerald et al., 59 A.2d 142, 143 (Pa. 1948). 52 Id. at 145. 53 Saul Schraga, Merchants Stir Parking Action, Fear Midcity Congestion Will Ruin Business Fu-ture, PHILA. INQUIRER, Jan. 9, 1950. 54 Saul Schraga, 23,000 Lacking Place to Park, Garages Planned at 14 Sites Called Enough for Daily Peak, PHILA. INQUIRER, Jan. 10, 1950. 55 Garage Promoters Sue to Halt Parking Authority Project, PHILA. EVENING BULL., Nov.4, 1952. 56 Saul Schraga, Authority Plan to Aid Parking, 14 Garages are Proposed for Midcity, PHILA. INQUIRER, Jan. 12, 1950. 57 William G. Weart, Quaker City Maps $2,000,000 Garage, N. Y. TIMES, Sept. 3, 1951, at A5. 58 MOGREN, supra note 33, at 84. 59 Id. 60 Bob Warner, $10M Bid for City Parking Lot, DAILY NEWS (Philadelphia), Aug. 28, 1985. 61 Joseph M. Guess, Shall the City Build More Parking Garages? PHILA. EVENING BULL., Nov. 17, 1957, at 3. 62 Id. 63 $75,000 Paid Secretly to LaBrum by Parking Board, Mayor Charges, PHILA. INQUIRER, Dec. 29, 1953, at 1. 64 JOSEPH S. CLARK, JR. & DENNIS J. CLARK, Rally and Relapse, 1946–1968, in PHILADELPHIA: A 300-YEAR HISTORY 69 (Russel F. Weigley, ed., W.W. Norton 1982). 65 Chesterman Sees Political Use of Agency, PHILA. EVENING BULL., Dec. 28, 1953. 66 $75,000 Paid Secretly, supra note 63, at 1.  67 Mark Manoff, Authority’s Where Jobless Democrats Park, DAILY NEWS (Philadelphia), Dec. 15, 1982, at Local 8. 68 A. W. Geiselman Jr., Rizzo Helps Parking Authority Staff Grow, PHILA. EVENING BULL., Feb. 13, 1977, at 5. 69 Id.  70 A. W. Geiselman Jr., Rizzo Criticizes ADA, Defends Patronage, PHILA. EVENING BULL., March 12, 1977, at 1. 71 Manoff, supra note 67, at Local 8. 72 Washington Linn Jr., GOP Takes Over the Parking Authority, THE PHILA. TRIB., July 24, 2001, at 1. 73 Councilman Frank Rizzo is the son of the former mayor Frank Rizzo, referred to earlier. 74 Patrick Kerkstra, “Running Amok” at the PPA, PHILA. INQUIRER, Oct. 28, 2007, at A1. 75 MILLIGAN AND COMPANY, LLC., REPORT TO THE PHILADELPHIA OFFICE OF THE CONTROLLER, RE-PORT ON LIMITED REVIEW OF CERTAIN OPERATIONS OF THE PHILADELPHIA PARKING AUTHORITY 10 (2009). 76 It is unclear how the PPA classifies its employees by division and it seems odd that it would em-ploy only 11 people in the off-street parking division since it operates 9 garages and lots in and around Center City, and several of these are open long hours.  77 Thomas Ferrick, Jr., City Subsidies for Gallery Garage Have Exceeded $1 Million, PHILA. INQUIR-ER, Dec. 3, 1981, at B01. 78 Henry J. Holcomb, Philadelphia to Buy Proposed Site of High-Tech Entertainment Center, PHILA. INQUIRER, Apr. 12, 2001, at A01.  ",
    "Link": "https://core.ac.uk/download/76218104.pdf"
}