{
    "Title": "Allergic rhinitis",
    "Authors": "Choices Allergic Rhinitis, National Institute for Health and Care Excellence. Allergic Rhinitis",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Mark Allen Group'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "ArticleAllergic rhinitisNuttall, DilyseAvailable at http://clok.uclan.ac.uk/20417/Nuttall, Dilyse ORCID: 0000­0002­0561­5229 (2017) Allergic rhinitis. Nurse Prescribing, 15 (10). pp. 480­481. ISSN 1479­9189  It is advisable to refer to the publisher’s version if you intend to cite from the work.10.12968/npre.2017.15.10.480For more information about UCLan’s research in this area go to http://www.uclan.ac.uk/researchgroups/ and search for <name of research Group>.For information about Research generally at UCLan please go to http://www.uclan.ac.uk/research/ All outputs in CLoK are protected by Intellectual Property Rights law, includingCopyright law.  Copyright, IPR and Moral Rights for the works on this site are retained by the individual authors and/or other copyright owners. Terms and conditions for use of this material are defined in the http://clok.uclan.ac.uk/policies/CLoKCentral Lancashire online Knowledgewww.clok.uclan.ac.ukCalculation Skills: Allergic Rhinitis Allergic Rhinitis is the term used to describe inflammation of the membranes lining the nose, as a result of sensitivity to allergens and which affects approximately 1in 5 individuals in the UK (NHS Choices, 2016). The most common allergens which result in allergic rhinitis include mould spores; dust / dust mites; pollen from grass, trees and weeds; work related allergens such as wood dust and latex; and animal allergens (NICE, 2015). Symptoms include a blocked and/or itchy nose, nasal discharge and sneezing (NICE, 2015). Question 1  Birmingham has a population of 1.1 million.  (i) What percentage of people in Birmingham are likely to suffer from allergic rhinitis? (ii) How many people in Birmingham are likely to suffer from allergic rhinitis?  Question 2 NICE (2015) refers to a selection of potential first line treatment options for allergic rhinitis, which have varying response times and dosing schedules. These are summarised in the table below: Treatment option Action within: Dose frequency Oral non-sedating antihistamine 1 hour Available as once daily Intranasal corticosteroids 12 hours Available as once daily Intranasal antihistamine 15 minutes 2-4 times daily  (i) How many times more would intranasal antihistamine have to be administered (if the median dosage frequency was used) than an intranasal corticosteroid? (ii) How many times longer for the action of an intranasal corticosteroid to that of intranasal antihistamine?   Question 3  John is a 52 year old recruitment officer, who has been suffering from persistent allergic rhinitis. He is to be commenced on intranasal corticosteroids. The available once-daily intranasal treatments are summarised in the table below. Treatment  Daily dose Dose per nasal spray Budesonide 200 micrograms per nostril 64 micrograms Fluticasone 100 micrograms per nostril 50 micrograms Mometasone furoate 100 micrograms per nostril 50 micrograms Triamcinolone acetonide 110 micrograms per nostril 55 micrograms  (i) Which drug or drugs would require the least sprays to deliver the daily dose? (ii) If John was prescribed Fluticasone, how many sprays would he administer over a 28 day period? (iii) Mometasone furoate can be increased to 200 micrograms per nostril daily. It is available in 140 dose bottles. How many bottles would John need for the duration of May? Question 4 Jack, a 23 year old carer, is on the maximum dose of his intranasal corticosteroid but his symptoms persist. He is to combine this treatment with an oral anthystamine and is prescribed cetirizine hydrochloride 10 mg daily. He is unable to take tablets and is prescribed an oral solution with a strength of 1mg/ml. It is available as a 200ml bottle, at a cost of £1.79. (i) How many days treatment will Jack get from the bottle? (ii) How much does one dose cost (to the nearest pence)?  Question 5 Sandra, a 50 year old teacher, presented with severe allergic rhinitis and impairing her ability to work. She is prescribed oral prednisolone, 30mg daily for 5 days. Tablets are available in strengths of 1mg, 5mg and 25mg.  (i) How many tablets will need to be prescribed if she is to be given tablets of only one strength? Calculate this based on using the fewest tablets. (ii) If Sandra is prescribed a mixture of strength of tablets, what is the minimum number of tablets that she can be prescribed?    Answers Question 1  Birmingham has a population of approximately 1.1 million: (2) What percentage of people in Birmingham are likely to suffer from allergic rhinitis 1 in 5 = 20% (2) How many people in Birmingham are likely to suffer from allergic rhinitis? 20% of 1.1 million = 1100,000 ÷ 5 = 220,000  Question 2 (i) How many times more would intranasal antihistamine have to be administered (if the median dosage frequency was used) than an intranasal corticosteroid?  Median dose frequency of intranasal antihistamine = 3 Intranasal corticosteroid frequency = 1  Median dose frequency of intranasal antihistamine is 3 times that of an intranasal corticosteroid  (ii) How many times the time for action of an intranasal antihistamine is that of intranasal corticosteroid?   Intranasal antihistamine 15 minutes Intranasal corticosteroid 12 hours (720 minutes) 720 ÷ 15 = 48 times longer  Question 3  (i) Which drug or drugs would require the least sprays to deliver the daily dose? Fluticasone, mometasone and triamcinolone, all require 2 sprays per nostril. (ii) If John was prescribed Fluticasone, how many sprays would he administer over a 28 day period? Daily dose = 2 x 2 sprays = 4 28 x 4 = 112  (iii) Mometasone furoate can be increased to 200 micrograms per nostril daily. It is available in 140 dose bottles. How many bottles would John need for the duration of May at 200 micrograms a day? Daily dose = 2 x 4 sprays = 8 sprays Total dose for May = 31 x 8 sprays = 248                       2 bottles would be required  Question 4 (i) How many days treatment will Jack get from the bottle?                       Daily dose = 10ml                       200 ÷ 10 = 20 doses (ii) How much does each dose cost to the nearest pence? £1.79 ÷ 20 = 8.95p  9p (rounded up)  Question 5 (i) How many tablets will need to be prescribed if she is to be given tablets of only one strength? Calculate this based on using the fewest tablets.  Either 1mg or 5mg tablets could be used to get the required dose with tablets of one strength. Using 5mg tablets would require the fewest tablets.  6 tablets x 5 days = 30 tablets  (ii) If Sandra is prescribed a mixture of strength of tablets, what is the minimum number of tablets that she can be prescribed?  1 x 25mg + 1 x 5mg = 30mg (daily dose) = 2 tablets 5 days x 2 tablets = 10 tablets    References NICE (2015) Allergic Rhinitis, Clinical Knowledge Summaries, Available online at: https://cks.nice.org.uk/allergic-rhinitis#!topicsummary NHS Choices (2016) Allergic Rhinitis, NHS Choices, Available online at: http://www.nhs.uk/Conditions/Rhinitis---allergic/Pages/Introduction.aspx  ",
    "Link": "https://core.ac.uk/download/109962078.pdf"
}