{
    "Title": "Evaluation of a school-based health education program for urban Indigenous young people in Australia",
    "Authors": "Alison Nelson, Claire Malseed, Robert Ware",
    "Year": "No year available",
    "Abstract": "Abstract:&nbsp;The aim of this study was to investigate the effectiveness of a school-based health promotion and education program in improving knowledge, attitudes, self-efficacy and behaviours of urban Indigenous young people regarding chronic disease and associated risk factors. A mixed methods approach was adopted for this evaluation; however, this paper will focus on the quantitative aspect of the study. The Deadly Choices™ health education program was delivered weekly at six education facilities in Brisbane, Australia to participants from years seven to 12 over seven weeks. One school that received the Deadly Choices program the following term acted as the control group. Questionnaire data was collected immediately pre and post intervention to assess program impact. As self-reported by participants there were mostly significant improvements over time for questions relating to knowledge, attitudes and self-efficacy regarding leadership, chronic disease and risk factors within the intervention group. There were also significant changes within the intervention group regarding breakfast frequency (P = 0.002), physical activity frequency (P ≤ 0.001), fruit (P = 0.004) and vegetable (P ≤ 0.001) intake. Overall, there were few significant differences between the control and intervention groups regarding health attitudes and behaviours; however, there were considerably more improvements relating to self-efficacy and knowledge of chronic disease and associated risk factors between groups. The program also facilitated 30 Aboriginal and Torres Strait Islander health checks for participants. Deadly Choices is an innovative and comprehensive school-based program which has great potential to improve the health outcomes of Indigenous young people in urban areas by providing education in leadership and chronic disease prevention; engaging students in physical activity participation; and collaborating with health services to facilitate health checks",
    "Keywords": "No keywords available",
    "Publisher": "Health",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Health, 2014, 6, 587-597 \nPublished Online March 2014 in SciRes. http://www.scirp.org/journal/health \nhttp://dx.doi.org/10.4236/health.2014.67077  \nHow to cite this paper: Malseed, C., Nelson, A. and Ware, R. (2014) Evaluation of a School-Based Health Education Program \nfor Urban Indigenous Young People in Australia. Health, 6, 587-597. http://dx.doi.org/10.4236/health.2014.67077 \n \n \nEvaluation of a School-Based Health \nEducation Program for Urban Indigenous \nYoung People in Australia \nClaire Malseed1,2*, Alison Nelson1,2, Robert Ware1,3 \n1The Institute for Urban Indigenous Health, Brisbane, Australia \n2Aboriginal and Torres Strait Islander Studies Unit, The University of Queensland, Brisbane, Australia \n3School of Population Health, The University of Queensland, Brisbane, Australia \nEmail: *clairemalseed@gmail.com \n \nReceived 20 January 2014; revised 26 February 2014; accepted 5 March 2014 \n \nCopyright © 2014 by authors and Scientific Research Publishing Inc. \nThis work is licensed under the Creative Commons Attribution International License (CC BY). \nhttp://creativecommons.org/licenses/by/4.0/ \n  \n \n \n \nAbstract \nThe aim of this study was to investigate the effectiveness of a school-based health promotion and \neducation program in improving knowledge, attitudes, self-efficacy and behaviours of urban In-\ndigenous young people regarding chronic disease and associated risk factors. A mixed methods \napproach was adopted for this evaluation; however, this paper will focus on the quantitative as-\npect of the study. The Deadly Choices™ health education program was delivered weekly at six \neducation facilities in Brisbane, Australia to participants from years seven to 12 over seven weeks. \nOne school that received the Deadly Choices program the following term acted as the control \ngroup. Questionnaire data was collected immediately pre and post intervention to assess program \nimpact. As self-reported by participants there were mostly significant improvements over time for \nquestions relating to knowledge, attitudes and self-efficacy regarding leadership, chronic disease \nand risk factors within the intervention group. There were also significant changes within the in-\ntervention group regarding breakfast frequency (P = 0.002), physical activity frequency (P ≤ \n0.001), fruit (P = 0.004) and vegetable (P ≤ 0.001) intake. Overall, there were few significant dif-\nferences between the control and intervention groups regarding health attitudes and behaviours; \nhowever, there were considerably more improvements relating to self-efficacy and knowledge of \nchronic disease and associated risk factors between groups. The program also facilitated 30 Abo-\nriginal and Torres Strait Islander health checks for participants. Deadly Choices is an innovative \nand comprehensive school-based program which has great potential to improve the health out-\ncomes of Indigenous young people in urban areas by providing education in leadership and \nchronic disease prevention; engaging students in physical activity participation; and collaborating \nwith health services to facilitate health checks. \n \n \n*Corresponding author. \nC. Malseed et al. \n \n 588 \nKeywords \nSchool-Based Health Promotion; Chronic Disease; Indigenous Health; Young People; Australia \n \n \n1. Introduction \nIndigenous Australian1 people continue to experience a disproportionately high burden of chronic disease com-\npared to other Australians [1]. Chronic disease and related factors account for 70% of the health gap between \nIndigenous and non-Indigenous Australians [2]. Indigenous young people experience an excess burden of pre-\nventable and treatable disease such as ear disease, poor oral health and recurrent infections [3] and have high \nrates of risk factors for the development of chronic diseases in adulthood [4]. Data shows that the onset of \nchronic disease is likely to occur at a much younger age among Indigenous Australians than non-Indigenous \nAustralians [5]. These chronic diseases have common risk factors including smoking, poor nutrition, alcohol \nmisuse, inadequate physical activity and overweight and obesity [6]. Economic and social determinants of poor \nIndigenous health further contribute to the high burden of chronic disease in the Indigenous Australian popula-\ntion [7]. \nSchools are widely recognised as important settings for the delivery of health education to young people [8] \n[9]. Schools have continuous, intensive contact with large numbers of young people, providing the ideal setting \nto shape the health knowledge, attitudes, self-efficacy and behaviours of young people [10] [11]. According to \nthe World Health Organisation’s “Health Promoting Schools Framework”, positive health outcomes for youth \ncan be achieved when schools adopt a whole-of-school approach to health initiatives [12]. However, some stud-\nies suggest that for disadvantaged or minority groups, targeted interventions may also be required to provide ad-\nditional support for young people to improve health behaviours [11] [13]. For Indigenous young people, re-\nsearch suggests that the adoption of a strengths-based approach, which focuses on the abilities, knowledge, ca-\npacities, and cultural resources of participants, is essential in health promotion programs targeting this group [14] \n[15]. \nNationally and internationally, numerous small and large-scale school-based health education interventions \nhave been evaluated [16]-[18]. However, studies vary considerably in terms of the study design used to conduct \nthe evaluation, characteristics of the study participants, and measures used to assess participants’ outcomes. A \nconsequence of these differences in study design and participants is that findings can only be cautiously gener-\nalised in determining what makes an effective intervention for a targeted population group. More specifically, \nfew school-based health education programs which target Indigenous Australian students have been evaluated \n[12], making it difficult to determine which are most appropriate and effective for improving knowledge and \nmodifying the attitudes, self-efficacy and behaviours of Indigenous young people. The few evaluations con-\nducted have largely focused on drugs and alcohol and most have targeted Indigenous young people in rural or \nremote schools [19]. As the majority of Indigenous young people live in non-remote areas of Australia [5], and \nchronic diseases are the main contributor to the health gap between Indigenous and non-Indigenous Australians \n[2], school-based health education programs, that seek to educate large numbers of Indigenous young people \nabout chronic disease risk factors within an urban context, have considerable potential to contribute to the pre-\nvention of chronic disease in the Indigenous population.  \nThe aim of this study was to investigate the effectiveness of a school-based program in improving knowledge, \nattitudes, self-efficacy and behaviours of urban Indigenous young people regarding chronic disease and associ-\nated risk factors. Both qualitative and quantitative data were collected; however, the focus of this paper is on the \nquantitative aspect of the research. \n2. Methods \nThis study investigated the effectiveness of a school-based health program for Indigenous Australian students in \nBrisbane, Australia, between April and October 2013. The Deadly Choices™ program is a school-based chronic \ndisease promotion and education program that encourages Indigenous young people to be positive role models \n \n \n1In Australia the term “Indigenous” is used to refer to both Aboriginal and Torres Strait Islander peoples. \nC. Malseed et al. \n \n 589 \nin reshaping health, lifestyle and physical activity choices among family, friends and networks. In an Indigenous \ncontext, a “Deadly Choice” is a healthy choice. The program is based on the principle of empowering young \npeople to make healthy choices and uses a strengths-based approach to reinforce to Indigenous young people \nthat chronic diseases are not inevitable [15]. This approach is also informed by recent research that suggests \nprograms seeking to promote healthy lifestyle behaviours in Indigenous youth must go beyond just telling young \nIndigenous people to make healthy choices, towards encouraging and supporting them with tools to actually \nmake them [20]. The Deadly Choices program was developed in partnership with urban-Indigenous healthy life-\nstyle officers and since 2010 has been delivered to more than 250 Indigenous students across 20 schools and \ntraining centres throughout South East Queensland.  \n2.1. Ethics \nEthical approval for the study was obtained from The University of Queensland and The Education Queensland \nHuman Research Ethics Committee. Gatekeeper approval was received from school principals prior to approa- \nching students to be involved in the research. Informed consent was obtained from students and their guardians \nfor their involvement in the research project. \n2.2. Study Setting and Participants \nThe Deadly Choices health education program was delivered in the greater Brisbane area at four schools, one \ntraining academy and one education and training centre located within a youth detention centre. All students \nwho received the program were from years 7 to 12 and aged 11 to 18. One of the secondary schools who were \ndue to receive the Deadly Choices program the following term acted as a control group, before having post- \nprogram data collected for inclusion in pre/post analyses. The schools and training centres were selected due to \nthe high number of Indigenous students attending these schools and their expressed interest in receiving the \nDeadly Choices program. Schools and centres were located in Brisbane areas with low to high levels of socio- \neconomic disadvantage according to Socio-Economic Indexes for Areas (SEIFA) data [21].  \nBrisbane is the capital of Queensland and the third most populous city in Australia, with a population of 2.1 \nmillion people. There are over 50,000 Aboriginal and Torres Strait Islander people living in Brisbane, making it \nthe largest Indigenous community in Australia. This comprises 38% of the state’s share of Aboriginal and Torres \nStrait Islander people in Queensland [22]. The unemployment rate in Brisbane is 5.6% and the economy has \ngrown consistently in recent years [23].  \n2.3. Intervention \nThe Deadly Choices program was delivered once a week over a seven-week period. Each session was approxi-\nmately 90 minutes in duration and involved an ice-breaker activity, an education component and participation in \nphysical activity. The education component covered seven modules including leadership, chronic disease, phy- \nsical activity, nutrition, smoking, harmful substances and health services. Information was presented using the \nMicrosoft PowerPoint computer program, in addition to interactive activities. A summary of the Deadly Choices \neducation component is presented in Table 1. Following the final session, participants were encouraged to have \nan Aboriginal and Torres Strait Islander health check (MBS item 715). At some schools a medical van utilising \nlocal Indigenous health clinic staff was organised so participants could have a health check at school. At other \nschools health checks were organised at the local Indigenous health clinic and necessary transport arrangements \nwere made for students. \nThe physical activity component of the program primarily focused on participation, increasing self-efficacy \nand teamwork. At some physical activity sessions, participants were exposed to traditional Indigenous games, \nwhich offered an opportunity to experience cultural traditions in sport-related activities, focusing on the cultural \nassets of these young people [24]. Young Indigenous healthy lifestyle workers who were considered role models \nin the community facilitated all sessions. Facilitators remained with the same school for the duration of the pro-\ngram to build trust and rapport. To reward participants for their efforts and encourage program attendance, par-\nticipants who attended all sessions received a Deadly Choices shirt. \n2.4. Outcome Measures \nA questionnaire across four key domains was used to evaluate the effectiveness of the Deadly Choices program.  \nC. Malseed et al. \n \n 590 \nTable 1. Description of intervention components.                                                              \nWeek Module Brief description of key factors addressed \n1 Leadership \n• The “Closing the gap” initiative \n• Determining features of good leadership \n• Identifying leaders in the community \n2 Chronic Disease \n• Explanation of Chronic Disease \n• Common types of Chronic Diseases \n• Chronic Disease risk factors \n3 Physical Activity \n• Benefits of physical activity \n• Identifying types of physical activity \n• Physical activity guidelines \n4 Nutrition \n• The five food groups and portion sizes \n• Decreasing sugary drinks \n• Energy Balance \n• Importance of breakfast \n• Healthy meal options \n5 Smoking \n• Substances in a cigarette \n• Smoking’s impact on the body \n• Environmental tobacco smoke \n• Benefits of not smoking \n6 Harmful Substances \n• Explanation of harmful substances \n• Drug and alcohol effects on the body \n• Risks associated with drinking \n• Support available \n7 Health Services \n• Health checks \n• Medicare \n• Registering for “Close the gap” services \n• Local Indigenous health services \n \nThe questionnaire built upon an existing questionnaire used previously for program evaluation. The question-\nnaire was piloted on 30 Indigenous students from a school who completed the Deadly Choices program the term \nprior, to identify the time required to complete it, any ambiguous questions and any difficulties faced during \ncompletion. Minor changes were made to the language, content and clarity of the questionnaire so that it could \nbe more easily read and understood by the Indigenous young people.  \nThe four questionnaire domains included demographics, knowledge, attitudes/self-efficacy and behaviours. \nDemographic questions included age, gender, identity, suburb and school. Knowledge questions focused on \nchronic diseases, associated risk factors, health conditions caused by smoking, sugar content of soft-drinks, \ntypes of physical activity, elements of good leadership and health check components. Attitudes/self-efficacy \nquestions related to leadership, chronic disease prevention, health checks and the importance of health promot-\ning behaviours. Behaviour questions focused on leadership, physical activity participation, eating habits, smok-\ning habits, use of alcohol, tobacco and other drugs, and engagement with health services.  \n2.5. Procedure \nParticipants completed the questionnaire twice, immediately prior to the first session and following the final ses-\nsion. Participants in the control group completed the pre- and post-questionnaire at intervals concurrent with \nparticipants in the intervention group, as well as following the final session of their Deadly Choices program \nwhen it was delivered the following term. Questionnaires were completed in classrooms under supervision of \nDeadly Choices facilitators and research staff. All participants completed the questionnaire in pen/paper format \nand were able to access literacy support from Deadly Choices and research staff if and when required. Ques-\ntionnaires were matched using a randomly assigned identification number.  \n2.6. Data Analysis \nDescriptive statistics are reported as mean (standard deviation) for continuous data and frequency (percentage) \nfor categorical data. Program effectiveness was investigated using linear mixed-effects regression for continuous \nC. Malseed et al. \n \n 591 \noutcomes and logistic mixed-effects regression for binary outcomes. In all models intervention group (education \nprogram/control) and time (pre/post-program) were included as main effects, as well as an intervention-by-time \ninteraction term. All models were adjusted for repeated measures at the individual level. The significance and \ncorrelation of the Deadly Choices program with knowledge, attitudes/self-efficacy and behaviours was also in-\nvestigated. Analysis was undertaken using Stata statistical software v 12.0 (StataCorp, College Station, TX, \nUSA). \n3. Results \n3.1. Description of the Sample \nA total of 103 students participated in at least one session of the Deadly Choices program across all six groups. \nThe study population consisted of 65 participants in the intervention group and 14 participants in the control \ngroup. Demographic data was available for all participants in the study population.  \nThe control group participants were from grade eight, compared with the intervention group who ranged from \ngrade seven to 12. As shown in Table 2, the mean age for participants in the intervention group was 14.8, com-\npared with 12.9 years in the control group. For the intervention group, 67.7% of participants were male and \n32.3% were female; for the control group, 37.5% of participants were male and 62.5% were female. The Deadly \nChoices program was targeted at Indigenous students, however at some education facilities, non-Indigenous par-\nticipants also participated in the program. Therefore, the majority of participants were of Indigenous identity. \n3.2. Exploring Health Knowledge, Attitudes and Self-Efficacy \nBaseline comparability between the intervention and control schools was examined, with no significant differ-\nence found between groups for any knowledge questions. For questions relating to attitudes and self-efficacy, \nthe intervention group was significantly more confident in having a health check, at baseline (P ≤ 0.001). As de-\ntailed in Table 3, for the intervention group, the majority of scores relating to knowledge significantly improved \nbetween baseline and follow-up. For questions relating to attitudes and self-efficacy, there was a significant in-\ncrease for all outcome variables post-program for the intervention group.  \nPost-program, the intervention group had significantly higher knowledge than the control group for questions \nregarding types of chronic disease (P ≤ 0.001), chronic disease risk factors (P = 0.045), health conditions caused \nby smoking (P = 0.006) and the sugar content of soft-drink (P = 0.009). In addition, the intervention group was \nsignificantly more confident in preventing chronic disease (P = 0.005) and having a health check (P ≤ 0.001) \ncompared with the control group participants. \n3.3. Self-Reported Health Behaviours \nThere were no statistically significant differences between the control and intervention group at baseline for all \n \nTable 2. Baseline participant characteristics.                              \n Intervention (n = 65) Control (n = 16) \nAge in years (mean; standard deviation) 14.8 (1.9) 12.9 (0.5) \nGender (%)   \nMale 67.7% 37.5% \nFemale 32.3% 62.5% \nIdentity (%)   \nAboriginal 84.6% 87.5% \nTorres Strait Islander 1.5% 6.3% \nBoth 0% 6.3% \nOther 13.8% 0% \nNote: Due to rounding, not all percentages add up to 100%. \nC. Malseed et al. \n \n 592 \nTable 3. Knowledge, attitudes and self-efficacy scores.                                                          \nVariable Pre-Program; mean (SD) \nPost-Program\n; mean (SD) \nWithin group change; \nmean difference (95% CI) \nBetween group change; mean difference \n(95% CI) \nKnowledge1     \nElements of Good leadership     \nControl 7.3 (1.0) 7.4 (0.8) 0.06 (−0.47 to 0.58); P = 0.828  \nIntervention 7.5 (0.9) 7.7 (0.7) 0.17 (−0.07 to 0.41); P = 0.174 0.35 (−0.13 to 0.83); P = 0.153 \nTypes of Chronic Diseases     \nControl 8.1 (2.5) 9.5 (2.3) 1.37 (0.18 to 2.56); P = 0.024*  \nIntervention 9.0 (2.1) 12.1 (2.2) 2.88 (2.30 to 3.47); P ≤ 0.001** 2.56 (1.31 to 3.82); P = < 0.001** \nChronic Disease Risk Factors     \nControl 8.1 (1.8) 7.9 (2.0) −0.13 (−1.45 to 1.19); P = 0.848  \nIntervention 8.3 (2.0) 9.1 (1.8) 0.65 (0.03 to 1.28); P = 0.040* 1.13 (0.23 to 2.23); P = 0.045* \nHealth Conditions caused \nby smoking     \nControl 7.1 (1.0) 7.2 (1.3) 0.16 (-0.59 to 0.91); P = 0.671  \nIntervention 7.2 (1.5) 8.4 (1.2) 0.96 (0.57 to 1.35); P ≤ 0.001** 1.10 (0.32 to 1.87); P = 0.006** \nTypes of Physical Activities     \nControl 8.1 (1.6) 12.2 (1.8) 4.17 (3.02 to 5.31); P ≤ 0.001**  \nIntervention 7.4 (2.5) 12.5 (2.1) 3.95 (3.15 to 4.75); P ≤ 0.001** 0.20 (−1.10 to 1.50); P = 0.765 \nComponents of a health check     \nControl 6.3 (1.1) 6.3 (1.05) 0.04 (−0.65 to 0.74); P = 0.906  \nIntervention 6.1 (1.1) 6.9 (1.0) 0.54 (0.18 to 0.89); P = 0.003** 0.58 (−0.03 to 1.19); P = 0.061  \nSugar in Soft-drink     \nControl (%) 33.3 46.7 OR = 1.75 (0.40 to 7.66); P = 0.46  \nIntervention (%) 38.5 81.8 OR = 8.11 (2.95 to 22.30); P ≤ 0.001** OR = 5.14 (1.51 to 17.49); P = 0.009** \nAttitudes and Self-efficacy2     \nLeadership confidence     \nControl 3.3 (0.8) 3.3 (1.0) 0.067 (−0.44 to 0.58); P = 0.797  \nIntervention 3.3 (1.0) 3.9 (0.7) 0.48 (0.25 to 0.72); P ≤ 0.001** 0.42 (−0.07 to 0.93); P = 0.093 \nConfidence in preventing \nChronic Disease     \nControl 3.5 (0.9) 3.5 (1.2) −0.07 (−0.69 to 0.56); P = 831  \nIntervention 3.3 (1.1) 4.3 (0.8) 0.96 (0.65 to 1.27); P ≤ 0.001** 0.81 (0.24 to 1.37); P = 0.005** \nComfortable having \na health check     \nControl 2.9 (0.96) 3.4 (1.0) 0.46 (−0.09 to 1.01); P = 0.100  \nIntervention 3.9 (1.1) 4.4 (0.7) 0.50 (0.23 to 0.76); P ≤ 0.001** 0.99 (0.46 to 1.52); P ≤ 0.001** \nImportance of healthy eating     \nControl 9.0 (1.5) 8.5 (1.6) −0.50 (−1.40 to −0.41); P = 0.280  \nC. Malseed et al. \n \n 593 \nContinued \nIntervention 8.5 (2.2) 9.4 (1.1) 0.81 (0.36 to 1.25); P ≤ 0.001** 0.86 (−0.11 to 1.83); P = 0.081 \nImportance of physical activity     \nControl 9.0 (1.5) 9.1 (1.0) 0.03 (−0.59 to 0.65); P = 0.929  \nIntervention 9.0 (1.5) 9.5 (1.0) 0.45 (0.15 to 0.74); P = 0.003** 0.42 (−0.32 to 1.16); P = 0.264 \n**Significant at 0.01; *significant at 0.05. OR = Binary outcomes assessed using odds ratios. 1Knowledge questions 1 - 6 were scored out of 8, 14, 10, \n10, 14 and 8 respectively; a higher score denotes better results. Question 7 was multiple-choice. 2Attitudes/self-efficacy questions 1 - 3 were scored on \na 5-point Likert scale; questions 4 and 5 were scored on a 10-point numerical scale. For both scales, a higher score denotes better results. \n \nbehaviour questions. As detailed in Table 4, for the control group, there was a significant decrease in breakfast \nfrequency per week (P = 0.047). For the intervention group there was a significant increase in breakfast (P = \n0.002) and physical activity frequency per week (P ≤ 0.001), and fruit (P = 0.004) and vegetable (P ≤ 0.001) \nconsumption per day between baseline and follow-up.  \nResults were also obtained regarding smoking status and alcohol, cannabis and sniffing behaviours in the past \nmonth. For the control group, all participants indicated they were non-smokers and did not consume alcohol or \nuse harmful substances in the past month, at both stages of evaluation. Within the intervention group, 18.5% of \nparticipants smoked cigarettes pre-program, compared with 10.3% post-program (P = 0.22); 11.4% used canna-\nbis pre-program, compared with 7.6% post-program (P = 0.44); 32.9% consumed alcohol (within the past month) \npre-program, compared with 32.8% post program (P = 0.80); and 1.3% engaged in sniffing pre-program, com-\npared with 3.0% post-program (P = 0.47). Regarding health checks, 49% of participants from the intervention \ngroup reported not having a health check prior to participating in the program; post program 36.7% of these par-\nticipants had engaged in a health check. In total, 30 participants received a health check as part of the Deadly \nChoices program.  \nFollowing the intervention, there was a significant difference between the control and intervention group re-\ngarding breakfast frequency (P = 0.042). However, no significant difference was seen between the intervention \nand control group post-program, regarding sharing health information with others, physical activity, takeaway \nand soft-drink frequency, daily fruit and vegetable intake, activity levels at school or on the weekends and active \nmode of transport to school. However some outcomes were in the hypothesized direction (Table 4). \n4. Discussion \nThe Deadly Choices program was successful in improving knowledge, attitudes and self-efficacy regarding \nleadership, chronic disease and risk factors, with a number of significant changes observed in these domains \namong students who undertook the Deadly Choices program. There were also significant post-program differ-\nences between the control and intervention groups for a number of questions regarding knowledge and self-effi- \ncacy. Within the intervention group, participants increased their confidence regarding leadership ability which is \nimportant; as empowering young Indigenous people to be strong health leaders and agents of change is vital for \nwider community health and development [25]. Changes between the start and end of the program suggest the \nprogram was very promising in terms of improving the health behaviours of these young people, particularly in \nthe areas of diet (breakfast, fruit and vegetables), physical activity and the uptake of health checks. Another en-\ncouraging finding of the study was the reduction in smoking rates from 18.5% to 10.3%, given the reported dif-\nficulties in reducing adolescent smoking behaviours in other Australian studies [26]. The positive quantitative \nfindings from this study regarding improved knowledge, attitudes, self-efficacy and behaviours are also sup-\nported by the qualitative interview data which is described elsewhere.  \nDespite these positive within-group behavioural changes, the study showed few significant differences be-\ntween the control and intervention group regarding behavioural outcomes. Overall, these results are consistent \nwith other school-based studies reported nationally and internationally; that have found significant increases in \nthe health knowledge, attitudes or self-efficacy of students, however mostly low to modest improvements re-\ngarding health behaviours [18] [26] [27]. Regardless of this, the findings provide important baseline information \nregarding health behaviours, which is currently lacking in health research for urban-dwelling Indigenous young \npeople [4]. Results indicate scope for improving a number of health behaviours, for example, the consumption \nof alcohol and noncore food/drink such as soft drink and take-away foods. To achieve more substantial changes  \nC. Malseed et al. \n \n 594 \nTable 4. Behaviour scores.                                                                                 \nVariable Pre-Program; mean (SD) \nPost-Program; \nmean (SD) \nWithin group change; \nmean difference (95% CI) \nBetween group change; \nmean difference (95% CI) \nBehaviours     \nSharing health \ninformation with others1     \nControl 2.1 (0.7) 2.3 (0.6) 0.2 (−0.16 to 0.59); P = 0.259   \nIntervention 2.3 (0.9) 2.1 (0.8) −0.1 (−0.28 to 0.05); P = 0.179 −0.2 (−0.64 to 0.27); P = 0.431 \nBreakfast (days/week)     \nControl 4.7 (2.5) 3.4 (2.4) −1.1 (−2.14 to −0.01); P = 0.047*  \nIntervention 4.5 (2.9) 5.3 (2.4) 0.7 (0.27 to 1.14); P = 0.002** 1.5 (0.05 to 2.98); P = 0.042* \nTake-away food (days/week)     \nControl 0.8 (0.8) 0.8 (0.8) 0.1 (−0.62 to 0.81); P = 0.791  \nIntervention 1.4 (1.3) 1.6 (1.6) 0.2 (−0.18 to 0.49); P = 0.365 0.68 (−0.13 to 1.49); P = 0.098 \nSoft-drink (days/week)     \nControl 1.7 (1.8) 1.5 (1.5) 0.20 (−0.68 to 1.07); P = 0.657  \nIntervention 2.6 (2.3) 2.6 (2.2) −0.04 (−0.50 to 0.42); P = 0.862 0.78 (−0.40 to 1.96); P = 0.197 \nFruit intake (serves/day)     \nControl 2.2 (1.3) 2.3 (1.4) 0.23 (−0.47 to 0.93); P = 0.521  \nIntervention 2.4 (1.5) 2.9 (1.4) 0.45 (0.15 to 0.76); P = 0.004** 0.49 (−0.29 to 1.27); P = 0.220 \nVegetable intake \n(serves/day)     \nControl 2.6 (1.6) 3.3 (1.3) 0.59 (−0.14 to 1.32); P = 0.116  \nIntervention 2.7 (1.6) 3.8 (1.3) 1.09 (0.73 to 1.45); P ≤ 0.001** 0.63 (−0.18 to 1.45); P = 0.127 \nPhysical activity \n(days/week)     \nControl 3.9 (1.9) 3.8 (1.6) 0.002 (−0.87 to 0.87); P = 0.997  \nIntervention 3.3 (2.1) 4.2 (2.0) 0.77 (0.38 to 1.16); P ≤ 0.001** 0.32 (−0.82 to 1.46); P=0.577  \nActive mode of transport \nto school %     \nControl 12.5 28.6 OR = 16.65 (0.40 to 697.47); P = 0.140  \nIntervention 34.9 42.6 OR = 1.28 (0.39 to 4.22); P = 0.681 OR = 7.03 (0.20 to 253.70); P = 0.286 \nVery active at school %     \nControl 31.2 14.3 OR = 0.08 (0.004 to 1.70); P = 0.106  \nIntervention 39.1 50.0 OR = 1.97 (0.68 to 5.71); P = 0.214 OR = 73.35 (2.01 to 2673.10); P = 1.019 \nVery active on weekends %     \nControl 20.0 26.7 OR = 1.59 (0.21 to 11.91); P = 0.651  \nIntervention 45.3 52.7 OR = 1.68 (0.72 to 3.92); P = 0.229 OR = 4.48 (0.78 to 25.57); P = 0.092 \n**Significant at 0.01; *significant at 0.05. OR = Binary outcomes assessed using odds ratios. 1Scored out of 4; 1 = every-day, 4 = never. \n \nregarding health behaviours a longer or more intensive intervention may have been required. In addition, when \ninterpreting these results it is important to consider the various barriers that may impact on the health behaviours \nC. Malseed et al. \n \n 595 \nof Indigenous young people at school and home such as family, financial pressures, racism and other personal \nfactors [14] [28] [29]. \nThe significant increase in physical activity levels within the intervention group indicates the effectiveness of \nthe physical activity component of the program, suggesting the activities were meaningful, relevant and cultur-\nally appropriate for this group of young people. Similar to the current study, the Australian Football League’s \nKickstart program aimed to deliver positive lifestyle messages to Indigenous young people though the promo-\ntion of physical activity in a school based program. Qualitative results were positive, with improvements found \nin the education, attitudes and lifestyle choices of participants [30], suggesting that school-based health educa-\ntion programs which provide opportunities for involvement in physical activity have the potential to engage \nstudents and promote positive health and lifestyle choices for Indigenous young people. However it is also im-\nportant to note that the Deadly Choices program focussed its physical activities on participation rather than ex-\npertise, recognising that not all Indigenous young people engage in or enjoy sports and physical activity [29]. \nTherefore school-based health promotion initiatives should offer a diverse range of opportunities to convey \nthese health messages, based on the assets and strengths of young people. \nOne innovative feature of the Deadly Choices program is that participants were given the opportunity to have \na health check at the conclusion of the program, and as a direct result 30 participants completed a health check. \nHealth checks for Indigenous people offer a comprehensive physical and psychosocial health assessment and \nhave the potential to diagnose and address undetected diseases, and provide better treatment of existing diseases \n[31]. Given the current poor uptake of health assessment items for Australian Indigenous people [32], this ap-\nproach not only offers a valuable method of encouraging and normalising health checks, but may also help to \nreduce health inequalities through early identification of health issues. To our knowledge, the Deadly Choices \nprogram is the first in Australia to collaborate with local Aboriginal and Torres Strait Islander health services to \nprovide Indigenous health checks in a school-based program. Such partnerships have the potential to maximise \nhealth outcomes and chronic disease prevention efforts for Indigenous young people involved in school-based \nprograms. \nA number of limitations need to be taken into account when drawing study conclusions and in planning for \nfuture programs and evaluations. The limitations of this study include the small sample size, particularly for the \ncontrol group, resulting in limited statistical power to detect changes between the intervention and control group. \nAnother limitation was the relatively short time period of evaluation; a follow-up study after a number of years \nwould provide more specific insights into the long-term impact of the Deadly Choices program on knowledge, \nattitudes, self-efficacy and behaviours. The use of a non-validated tool to evaluate the quantitative component of \nthe study also provides challenges with the rigour of this evaluation. In addition, self-completion questionnaires \nwere used and thus may be affected by social desirability bias [33]. Research suggests that ensuring anonymity \ncan enhance the accuracy of self-reporting data [34], thus in the present study, researchers used unique identifi-\ncation numbers to ensure participant anonymity. In addition, the baseline characteristics of the control group \nwere dissimilar to the intervention group, and therefore this affected the comparability of responses, particularly \nfor questions relating to harmful substances and smoking where younger participants may not yet be engaging in \nthese activities.  \nIt should be noted that the data was collected from urban Indigenous young people, and therefore cannot be \ngeneralised to Indigenous people living in rural or remote communities, or urban Indigenous adults. In addition \nit is important to note that this data is not truly representative of all urban Indigenous young people, given the \nheterogeneity of urban Indigenous young people and the circumstances in which they live. However the use of \nschools and education centres from a range of socio-economic indexes in this paper allows for greater generali-\nsation.  \n5. Conclusion \nAs chronic diseases remain a major public health concern for Indigenous people in Australia [35], health promo-\ntion programs that target the risk factors for chronic disease at a young age have huge potential to improve the \noverall health of Indigenous Australians and reduce health inequalities. Results from this study indicate that \ncomprehensive school-based programs, which include education in leadership and chronic disease prevention; \nengage students in physical activity participation; and facilitate health checks, have great potential to improve \nthe health knowledge, attitudes, self-efficacy and behaviours of young people. However, it is essential that fu-\nC. Malseed et al. \n \n 596 \nture health promotion initiatives aimed at Indigenous young people utilise a strengths-based approach and con-\nsider the wider contexts and environments which may prevent the uptake of health promoting behaviours. \nAcknowledgements \nThis research project was supported by a Lowitja Institute Cooperative research centre small grant. \nReferences \n[1] O’Dea, K. (2005) Preventable Chronic Diseases among Indigenous Australians: The Need for a Comprehensive Na- \ntional Approach. Heart, Lung and Circulation, 14, 167-171. http://dx.doi.org/10.1016/j.hlc.2005.06.004 \n[2] Vos, T., Barker, B., Begg, S., Stanley, L. and Lopez, A.D. (2009) Burden of Disease and Injury in Aboriginal and \nTorres Strait Islander Peoples: The Indigenous Health Gap. International Journal of Epidemiology, 38, 470-477.  \nhttp://dx.doi.org/10.1093/ije/dyn240 \n[3] Australian Health Ministers’ Advisory Council (2012) Aboriginal and Torres Strait Islander Health Performance \nFramework 2012 Report. AHMAC, Canberra. \n[4] Azzopardi, P.S., Kennedy, E.C., Patton, G.C., Power, R., Roseby, R.D., Sawyer, S.M., Brown, A.D. (2013) The Qual- \nity of Health Research for Young Indigenous Australians: Systematic Review. Medical Journal of Australia, 199, \n57-63. http://dx.doi.org/10.5694/mja12.11141 \n[5] AIHW (2011) The Health and Welfare of Australia’s Aboriginal and Torres Strait Islander People: An Overview: 2011. \nAustralian Institute of Health and Welfare, Canberra. \n[6] Taggart, J., Williams, A.M., Dennis, S.M., Newall, A.T., Shortus, T.D., Zwar, N.A., Denney-Wilson, E. and Harris, \nM.F. (2012) A Systematic Review of Interventions in Primary Care to Improve Health Literacy for Chronic Disease \nBehavioral Risk Factors. BMC Family Practice, 13, 49. http://dx.doi.org/10.1186/1471-2296-13-49 \n[7] Carson, B., Dunbar, T., Chenhall, R.D. and Baillie, R. (2007) Social Determinants of Indigenous Health. Allen & Un- \nwin, Sydney. \n[8] Mũkoma, W. and Flisher, A.J. (2004) Evaluations of Health Promoting Schools: A Review of Nine Studies. Health \nPromotion International, 19, 357-368. http://dx.doi.org/10.1093/heapro/dah309 \n[9] Rowling, L. (2009) Strengthening “School” in School Mental Health Promotion. Health Education, 109, 357-368.  \nhttp://dx.doi.org/10.1108/09654280910970929 \n[10] Fung, C., Kuhle, S., Lu, C., Purcell, M., Schwartz, M., Storey, K. and Veugelers, P.J. (2012) From “Best Practice” to \n“Next Practice”: The Effectiveness of School-Based Health Promotion in Improving Healthy Eating and Physical Ac- \ntivity and Preventing Childhood Obesity. International Journal of Behavioral Nutrition and Physical Activity, 9, 27.  \nhttp://dx.doi.org/10.1186/1479-5868-9-27 \n[11] Wyn, J., Cahill, H., Holdsworth, R., Rowling, L. and Carson, S. (2000) Mind Matters, a Whole-School Approach Pro- \nmoting Mental Health and Wellbeing. Australian and New Zealand Journal of Psychiatry, 34, 594-601.  \nhttp://dx.doi.org/10.1080/j.1440-1614.2000.00748.x \n[12] McCuaig, L. and Nelson, A. (2012) Engaging Indigenous Students through School-based Health Education. Australian \nInstitute of Health and Welfare, Canberra. \n[13] Lubans, D., Morgan, P., Dewar, D., Collins, C., Plotnikoff, R., Okely, A., Batterham, M., Finn, T. and Callister, R. \n(2010) The Nutrition and Enjoyable Activity for Teen Girls (NEAT girls) Randomized Controlled Trial for Adolescent \nGirls from Disadvantaged Secondary Schools: Rationale, Study Protocol, and Baseline Results. BMC Public Health, 10, \n652. http://dx.doi.org/10.1186/1471-2458-10-652 \n[14] Priest, N., Mackean, T., Davis, E., Waters, E. and Briggs, L. (2012) Strengths and Challenges for Koori Kids: Harder \nfor Koori Kids, Koori Kids Doing Well-Exploring Aboriginal Perspectives on Social Determinants of Aboriginal Child \nHealth and Wellbeing. Health Sociology Review, 21, 165-179. http://dx.doi.org/10.5172/hesr.2012.21.2.165 \n[15] Brough, M., Bond, C. and Hunt, J. (2004) Strong in the City: Towards a Strength-Based Approach in Indigenous \nHealth Promotion. Health Promotion Journal of Australia, 15, 215-220. \n[16] Katz, D.L., O’Connell, M., Njike, V.Y., Yeh, M.C. and Nawaz, H. (2008) Strategies for the Prevention and Control of \nObesity in the School Setting: Systematic Review and Meta-Analysis. International Journal of Obesity, 32, 1780-1789.  \nhttp://dx.doi.org/10.1038/ijo.2008.158 \n[17] Brown, T. and Summerbell, C. (2009) Systematic Review of School-Based Interventions That Focus on Changing Di- \netary Intake and Physical Activity Levels to Prevent Childhood Obesity: An Update to the Obesity Guidance Produced \nby the National Institute for Health and Clinical Excellence. Obesity Reviews, 10, 110-141.  \nhttp://dx.doi.org/10.1111/j.1467-789X.2008.00515.x \nC. Malseed et al. \n \n 597 \n[18] De Bourdeaudhuij, I., Van Cauwenberghe, E., Spittaels, H., Oppert, J.M., Rostami, C., Brug, J., Van Lenthe, F., Lob- \nstein, T. and Maes, L. (2011) School-Based Interventions Promoting Both Physical Activity and Healthy Eating in Eu- \nrope: A Systematic Review within the HOPE Project. Obesity Reviews, 12, 205-216.  \nhttp://dx.doi.org/10.1111/j.1467-789X.2009.00711.x \n[19] Clifford, A., Pulver, L.J., Richmond, R., Shakeshaft, A. and Ivers, R. (2011) Smoking, Nutrition, Alcohol and Physical \nActivity Interventions Targeting Indigenous Australians: Rigorous Evaluations and New Directions Needed. Australian \nand New Zealand Journal of Public Health, 35, 38-46. http://dx.doi.org/10.1111/j.1753-6405.2010.00631.x \n[20] Nelson, A., Macdonald, D. and Abbott, R. (2012) A Risky Business? Health and Physical Activity from the Perspec- \ntives of Urban Australian Indigenous Young People. Health, Risk & Society, 14, 325-340.  \nhttp://dx.doi.org/10.1080/13698575.2012.680949 \n[21] Australian Bureau of Statistics (2011) Census of Population and Housing: Socio-Economic Indexes for Areas (SEIFA), \nAustralia. http://www.abs.gov.au/ausstats/abs@.nsf/mf/2033.0.55.001/  \n[22] Australian Bureau of Statistics (2011) Greater Brisbane (GCCSA).  \nhttp://www.censusdata.abs.gov.au/census_services/getproduct/census/2011/quickstat/3GBRI  \n[23] Brisbane City Council (2013) Economic Development.  \nhttp://www.brisbane.qld.gov.au/about-council/governance-strategy/economic-development/index.htm  \n[24] Parker, E., Meiklejohn, B., Patterson, C., Edwards, K., Preece, C., Shuter, P. and Gould, T. (2006) Our Games Our \nHealth: A Cultural Asset for Promoting Health in Indigenous Communities. Health Promotion Journal of Australia, 17, \n103-108. http://dx.doi.org/10.1093/her/cyf048 \n[25] CoA (2010) Community Matters Draft 2010.  \nhttp://www.mindmatters.edu.au/verve/_resources/Community_Matters_complete_draft_manuscript_v1.pdf  \n[26] Schofield, M.J., Lynagh, M. and Mishra, G. (2003) Evaluation of a Health Promoting Schools Program to Reduce \nSmoking in Australian Secondary Schools. Health Education Research, 18, 678-692.  \nhttp://dx.doi.org/10.1093/her/cyf048 \n[27] Kerr, J.C., Valois, R.F., Farber, N.B., Vanable, P.A., Di Clemente, R.J., Salazar, L., et al. (2013) Effects of Promoting \nHealth among Teens on Dietary, Physical Activity, and Substance Use Knowledge and Behaviors for African Ameri- \ncan Adolescents. American Journal of Health Education, 44, 191-202.  \nhttp://dx.doi.org/10.1080/19325037.2013.798218 \n[28] Abbott, R., Jenkins, D., Haswell-Elkins, M., Fell, K., MacDonald, D. and Cerin, E. (2008) Physical Activity of Young \nPeople in the Torres Strait and Northern Peninsula Region: an Exploratory Study. Australian Journal of Rural Health, \n16, 278-282. http://dx.doi.org/10.1111/j.1440-1584.2008.00979.x \n[29] Nelson, A. (2009) Sport, Physical Activity and Urban Indigenous Young People. Australian Aboriginal Studies, 2, \n101-111. \n[30] Dinan-Thompson, M., Sellwood, J. and Carless, F. (2008) A Kickstart to Life: Australian Football League as a Me- \ndium for Promoting Life Skills in Cape York Indigenous Communities. Australian Journal of Indigenous Education, \n37, 152-164. \n[31] Digiacomo, M., Abbott, P., Davison, J., Moore, L. and Davidson, P.M. (2010) Facilitating Uptake of Aboriginal Adult \nHealth Checks through Community Engagement and Health Promotion. Quality in Primary Care, 18, 57-64. \n[32] Jennings, W., Spurling, G.K. and Askew, D.A. (2013) Yarning about Health Checks: Barriers and Enablers in an Ur- \nban Aboriginal Medical Service. Australian Journal of Primary Health. http://dx.doi.org/10.1071/PY12138 \n[33] Brener, N.D., Billy, J.O. and Grady, W.R. (2003) Assessment of Factors Affecting the Validity of Self-Reported \nHealth-Risk Behavior among Adolescents: Evidence from the Scientific Literature. Journal of Adolescent Health, 33, \n436-457. http://dx.doi.org/10.1016/S1054-139X(03)00052-1 \n[34] Winchester, L., Rissel, C., Bauman, A. and Dobbinson, S. (1996) Anonymous Record Linkage Using Respondent- \nGenerated Identification Codes—A Tool for Health Promotion Research. Health Promotion Journal of Australia, 6, \n52-54. \n[35] Aspin, C., Brown, N., Jowsey, T., Yen, L. and Leeder, S. (2012) Strategic Approaches to Enhanced Health Service De- \nlivery for Aboriginal and Torres Strait Islander People with Chronic Illness: A Qualitative Study. BMC Health Services \nResearch, 12, 143. http://dx.doi.org/10.1186/1472-6963-12-143 \n",
    "Link": "https://core.ac.uk/download/pdf/30674913.pdf"
}