{
    "Title": "Hepatocyte growth factor gene therapy reduces ventricular arrhythmia in animal models of myocardial ischemia.",
    "Authors": "Aoki, Motokuni, Hashimoto, Katsushi, Kaneda, Yasufumi, Kusano, Kengo Fukushima, Morishita, Ryuichi, Nakamura, Kazufumi, Ohe, Tohru, Yumoto, Akihisa",
    "Year": "No year available",
    "Abstract": "It was recently reported that gene therapy using hepatocyte growth factor (HGF) has the potential to preserve cardiac function after myocardial ischemia. We speculated that this HGF gene therapy could also prevent ventricular arrhythmia. To investigate this possibility, we examined the antiarrhythmic effect of HGF gene therapy in rat acute and old myocardial infarction models. Myocardial ischemia was induced by ligation of the left descending coronary artery. Hemagglutinating virus of Japan (HVJ)-coated liposome containing HGF genes were injected directly into the myocardium fourteen days before programmed pacing. Ventricular fibrillation (VF)was induced by programmed pacing. The VF duration was reduced and the VF threshold increased after HGF gene therapy ( p&#60; 0.01). Histological analyses revealed that the number of vessels in the ischemic border zone was greatly increased after HGF gene injection. These findings revealed that HGF gene therapy has an anti-arrhythmic effect after myocardial ischemia.</p",
    "Keywords": "No keywords available",
    "Publisher": "Okayama University Medical School",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Acta Medica OkayamaVolume 59, Issue 3 2005 Article 1JUNE 2005Hepatocyte growth factor gene therapy reducesventricular arrhythmia in animal models ofmyocardial ischemia.Akihisa Yumoto∗ Kengo Fukushima Kusano† Kazufumi Nakamura‡Katsushi Hashimoto∗∗ Motokuni Aoki†† Ryuichi Morishita‡‡Yasufumi Kaneda§ Tohru Ohe¶∗Okayama University,†Okayama University,‡Okayama University,∗∗Okayama University,††&#xFEFF;Geriatric Medicine,‡‡Okayama University,§Okayama University,¶Okayama University,Copyright c©1999 OKAYAMA UNIVERSITY MEDICAL SCHOOL. All rights reserved.Hepatocyte growth factor gene therapy reducesventricular arrhythmia in animal models ofmyocardial ischemia.∗Akihisa Yumoto, Kengo Fukushima Kusano, Kazufumi Nakamura, KatsushiHashimoto, Motokuni Aoki, Ryuichi Morishita, Yasufumi Kaneda, and TohruOheAbstractIt was recently reported that gene therapy using hepatocyte growth factor (HGF) has the po-tential to preserve cardiac function after myocardial ischemia. We speculated that this HGF genetherapy could also prevent ventricular arrhythmia. To investigate this possibility, we examinedthe antiarrhythmic effect of HGF gene therapy in rat acute and old myocardial infarction models.Myocardial ischemia was induced by ligation of the left descending coronary artery. Hemaggluti-nating virus of Japan (HVJ)-coated liposome containing HGF genes were injected directly into themyocardium fourteen days before programmed pacing. Ventricular fibrillation (VF)was inducedby programmed pacing. The VF duration was reduced and the VF threshold increased after HGFgene therapy ( p< 0.01). Histological analyses revealed that the number of vessels in the ischemicborder zone was greatly increased after HGF gene injection. These findings revealed that HGFgene therapy has an anti-arrhythmic effect after myocardial ischemia.KEYWORDS: ventricular arrhythmia, HGF (hepatocyte growth factor), ischemia, HVJ (hemag-glutinating virus of Japan)∗PMID: 16049559 [PubMed - indexed for MEDLINE]Copyright (C) OKAYAMA UNIVERSITY MEDICAL SCHOOLHepatocyte Growth Factor Gene Therapy Reduces Ventricular Arrhythmia in Animal Models of Myocardial Ischemia Akihisa Yumoto??, Kengo Fukushima Kusano?, Kazufumi Nakamura?,Katsushi Hashimoto?, Motokuni Aoki?, Ryuichi Morishita?,Yasufumi Kaneda?, and Tohru Ohe??Department of Cardiovascular Medicine, Okayama University Graduate School of Medicine and Dentistry, Okayama 700-8558, Japan,?Department of Geriatric Medicine, ?Division of Clinical Gene Therapy, and?Division of Gene Therapy Science, Osaka University Graduate School of Medicine,Suita, Osaka 565-0871, Japan It was recently reported that gene therapy using hepatocyte growth factor(HGF)has the potential to preserve cardiac function after myocardial ischemia. We speculated that this HGF gene therapy could also prevent ventricular arrhythmia. To investigate this possibility, we examined the anti-arrhythmic eﬀect of HGF gene therapy in rat acute and old myocardial infarction models.Myocardial ischemia was induced by ligation of the left descending coronary artery. Hemagg-lutinating virus of Japan (HVJ)-coated liposome containing HGF genes were injected directly into the myocardium fourteen days before programmed pacing. Ventricular ﬁbrillation(VF)was induced by programmed pacing. The VF duration was reduced and the VF threshold increased after HGF gene therapy( ＜0.01). Histological analyses revealed that the number of vessels in the ischemic border zone was greatly increased after HGF gene injection. These ﬁndings revealed that HGF gene therapy has an anti-arrhythmic eﬀect after myocardial ischemia.Key words:ventricular arrhythmia, HGF (hepatocyte growth factor), ischemia, HVJ (hemagglutinating virus of Japan)T he mortality rates of patients with coronary artery disease of new or recurrent myocardial infarction(MI) are high. Various strategies, including medical treatment and revascularization therapy to limit residual ischemia, have been used to try to reduce the clinical consequences of the loss of cardiac muscle mass.Intramyocardial gene therapy using genes encoding angiogenic cytokines has been proposed as an alternative strategy for treating coronary artery disease of new or recurrent MI［1, 2］. This strategy is designed to promote the development of supplemental collateral blood vessels that will constitute endogenous bypass conduits around occluded native arteries to prevent cardiac is-chemia and to potentially restore myocardial function. It has also been reported that basic ﬁbroblast growth factor(b-FGF)or vascular endothelial growth factor (VEGF)gene transfer may have a favorable eﬀect on the recovery of myocardial ischemia in humans［3］, and there are indications that this may be associated with an increase in myocardial performance［4, 5］.Hepatocyte growth factor(HGF)has also been pos-tulated to be a potent angiogenic growth factor, since it is Received October 25,2004;accepted December 13,2004.?Corresponding author.Phone:＋81-86-235-7351;Fax:＋81-86-235-7353 E-mail:ayumoto-circ＠umin.ac.jp(A.Yumoto)http://www.lib.okayama-u.ac.jp/www/acta/Acta Med. Okayama, 2005 Vol. 59 , No. 3, pp. 73-78 Original Article Copyright?ｃ2005by Okayama University Medical School.1Yumoto et al.: Hepatocyte growth factor gene therapy reduces ventricularProduced by The Berkeley Electronic Press, 2005a mitogen for various endothelial cells［6, 7］and is also a potent inducer of tube formation. HGF gene therapy can induce angiogenesis and reduce the infarct size after myocardial ischemia［8, 9］.The existence of malignant ventricular arrhythmia(ventricular ﬁbrillation or ventricular tachycardia) is an important factor in addition to left ventricular dysfunction for predicting prognosis after myocardial infarction［10-12］. However, the relationship between angiogenesis induced by HGF gene transfection and the inhibition of ventricular arrhythmia has not been elucidated. We hypothesized that angiogenesis induced by HGF gene transfection can reduce ventricular vulnerability in animals with acute myocardial infarction, and the ventricular ﬁbrillation duration time in animals with old myocardial infarction.The aim of this study, therefore,was to determine the eﬀects of the direct injection of the HGF gene on the inhibition of ventricular arrhythmias in acute or chronic myocardial ischemia.Materials and Methods All animal experiments were carried out in accordance with the Guidelines for Animal Experiments at Okayama University Medical School, Japanese Government Ani-mal Protection and Management Law(No. 105)and the Japanese Government Notiﬁcation on the Feeding and Safekeeping of Animals(No. 6). All eﬀorts were made to minimize animal suﬀering.To produce a HGF expression vector, human HGF cDNA(2.2 kb)was inserted into the EcoRI and NotI sites of the pUC-SRαexpression of the vector plasmid. In this plasmid, the transcription of HGF cDNA was under the control of the SRαpromoter.We previously reported a high eﬃcacy of transfection with HVJ-coated liposomes［13］. Brieﬂy, phosphatidyl-serine, phosphatidylchorine, and cholesterol were mixed at a weight ratio of 1:4.8:2 in tetrahydrofuran. The lipid mixture(10 mg)was deposited on the sides of a ﬂask by removal of the solvent in a rotary evaporator. The high mobility group(HMG)-1 puriﬁed from calf thymus was mixed with plasmid DNA(300μg)in a 200μl balanced salt solution(BSS;133 mM NaCL, 5.4 mM KCL, 10 mM Tris-HCL, pH 7.6)at 20°C for 1 h, and then the mixture was added to the dried lipid. The liposome-DNA-HMG 1 complex suspension was mixed by vortex,sonication for 3 sec, and shaking for 30 min. Puriﬁed HVJ (Z strain)was inactivated by UV irradiation (110 erg/mm?/s) for 3 min immediately before use. The liposome suspension(0.5 ml, containing 10 mg lipid)was mixed with HVJ(20000 hemagglutinating units)in a total volume of 4 ml BSS. The mixture was incubated for 10 min at 4°C and then for 30 min with gentle shaking at 37°C. Free HVJ was removed from the HVJ-liposome by sucrose density gradient centrifugation. The top layer of the sucrose gradient containing the HVJ-liposome-DNA complex was collected and used immediately.The HVJ-liposome complex was injected into the rats’hearts using the method reported previously［13］.Brieﬂy, HVJ-liposome complex containing the human HGF gene or a control vector (100 ng/10μl in each liposome)was injected directly into the apex of each rat’s heart with a 27 G needle.The antiarrhythmic eﬀects were evaluated by measurement of the ventricular ﬁbrillation duration time in the old MI model and the ventricular ﬁbrillation threshold (VFT) in an acute MI model.Twenty male Wistar rats (weighing 200-300 g)were divided into an HGF vector transfected (MI＋HGF)group (n＝10)and an empty vector transfected (MI＋Cont)group(n＝10). The rats were anesthetized with an intraperitoneal injection of sodium pentobarbital(50 mg/kg). The animals were intubated, and ventilation was performed with room air (1.2 ml/100 g, 65 bpm). The heart of each animal was quickly exteriorized through a left lateral thoracotomy. The left anterior descending artery(LAD)was ligated 3 mm from the aortic root.Immediately after ligation, 10μl HVJ-liposome complex was injected into the apex of the myocardium in a non-infarcted area using the method described previously［13］. Then the thorax was enclosed by the layer method,and a catheter was cannulated to prevent pneumothorax.Fourteen days after surgery, the rats were anesthet-ized again with an intraperitoneal injection of urethane(1.1 mg/kg). A lead II surface electrocardiogram(ECG)was recorded. The rats were intubated and connected to a ventilator. After mediasternal thoracotomy, 2 needle electrodes were placed on the right ventricular (RV)epicardial surface outside the margin of the infarct area with a distance of 3 mm between the electrodes. The hearts were stimulated with rectangular pulses at a fre-quency of 25 Hz, impulse length of 8 ms and stimulation Yumoto et al. Acta Med. Okayama Vol. 59 , No. 3 742Acta Medica Okayama, Vol. 59 [2005], Iss. 3, Art. 1http://escholarship.lib.okayama-u.ac.jp/amo/vol59/iss3/1 duration of 500 ms with a current intensity of 10 mA.The duration of ventricular ﬁbrillation(VF)was measured in an ECG.Thirty male Wistar rats (weighing 200-300 g)were divided into three groups:a non-infarcted myocardium transfected empty vector (Sham) group (n＝10), an infarcted myocardium transfected empty vector (Cont＋MI)group(n＝10), and an infarcted myocardium trans-fected HGF vector (HGF＋MI) group (n＝10). The animals were anesthetized with an intraperitoneal injection of sodium pentobarbital(50 mg/kg). The animals were then intubated and connected to a ventilator. The heart of each animal was quickly exteriorized through a left lateral thoracotomy. Ten μl of HVJ-liposome complex was injected into the apex of the myocardium using a method described previously. The thorax was enclosed by the layer method, and a catheter was cannulated to prevent pneumothorax.Fourteen days after the injection of the HVJ-liposome complex into the non-infarcted myocardium, the rats were anesthetized again with an intraperitoneal injection of urethane(1.1 g/kg). The rats were ventilated with room air using a respirator, and the ECG was recorded. In the HGF＋MI and Cont＋MI groups, LAD was ligated for 30 min after mediasternal thoracotomy, and reperfusion was performed for 3 h. In the Sham group, only mediasternal thoracotomy was performed. Two needle electrodes were placed on the RV free wall outside the infarcted area. VF was induced by a.c. stimulation using a previously reported method［14］that was modiﬁed on the basis of the results of the preliminary experiments in the control and infarcted rats(n＝30). Brieﬂy, the hearts were stimulated with rectangular pulses at a frequency of 25 Hz, impulse length of 8 ms, and stimulation duration of 500 ms. The current intensity was increased in incre-ments of 0.1 mA until VF was attained. Two minutes after stabilization, another stimulus was given with the same current intensity. The ventricular ﬁbrillation thresh-old(VFT)was determined as the lowest current intensity at which two consecutive stimuli precipitated VF.Hematoxylin and eosin(HE)staining was performed to assess the angiogenesis of the vessels in the Cont＋HGF and MI＋HGF groups.The hearts were arrested with potassium chloride,removed, and rinsed in saline solution. After dissection of the atria and great vessels, the heart weights were determined. Transverse sections of each heart at 2 mm intervals between the left ventricular base to the apex were obtained. The specimens were ﬁxed in 10 formalin and embedded in paraﬃn. Transverse sections were subse-quently stained with HE in a standard manner. Slides were observed with a Zeiss Axioskop 2 plus light microscope equipped with a polarized set and analyzed with Studio Lite software.HGF Gene Therapy Reduces Arrhythmia June 2005 Fig.1  Electrocardiogram of the old infarction model.MI＋cont, empty vector transfected group. MI＋HGF, HGF vector transfected group. The VF in a representative case in the MI＋HGF group is shorter than that in the MI group.Fig.2  Ventricular ﬁbrillation duration in OMI model.VF duration was reduced when the HGF gene was induced. Data are given as means±S.E.M.753Yumoto et al.: Hepatocyte growth factor gene therapy reduces ventricularProduced by The Berkeley Electronic Press, 2005 The tubular-shaped small vessels(diameter＜100μm)were counted under light microscopy (magniﬁcation,×100)in a blind manner. The total number of vessels in each section was summed and expressed as the number of vessels per section. At least 8 sections for each heart were examined. Areas in which angiogenesis was quantiﬁed in the injected site and around the injected site were randomly selected.All values are expressed as means±SEM. Statistical analysis of variance with paired Student’s t test was used to determine signiﬁcant diﬀerences in the VF durations and numbers of vessels.Fisher’s protected least signiﬁcant diﬀerence test was used for comparison of the VFTs. Statistical signiﬁcance was deﬁned as P＜0.05.Results To examine the arrythmogenecity of HGF gene induction,we ﬁrst measured ventricular ﬁbrillation duration in the old myocardial infarction model. A current intensity of 10 mA was suﬃcient to induce ventricular arrhythmia. VF was inducible by any programmed stimulations, but was not sustained, and terminated spontaneously in all hearts.The VF duration was signiﬁcantly reduced in the HGF vector transfected (MI＋HGF) group (1.0±0.27 sec)compared to that in the empty vector transfected(MI＋Cont)group(3.7±0.90 sec)(P＜0.01)(Fig. 1, Fig. 2).The acute myocardial infarction model was used to evalu-ate VFT. In all rats, VF was precipitated by program-med stimulation until the current intensity reached 10 mA.VFT was lower in the MI group(0.63±0.17 mA)than in the Sham group (3.4±0.52 mA) (P＜0.01) and HGF＋MI group(3.8±0.49 mA)(P＜0.01)(Fig. 3).The angiogenesis was enhanced in the border zone around the infarcted myocar-dium in the MI＋HGF group(Fig. 4). The number of Fig.4  Hematoxylin and eosin staining in the OMI model. Bar indicate 50μm.Fig.3  Ventricular ﬁbrillation threshold in the AMI model.VFT was decreased after coronary ligation when the HGF gene was not injected. In the MI＋HGF group, VFT was signiﬁcantly increased.Data are given as means±S.E.M.Yumoto et al. Acta Med. Okayama Vol. 59 , No. 3 764Acta Medica Okayama, Vol. 59 [2005], Iss. 3, Art. 1http://escholarship.lib.okayama-u.ac.jp/amo/vol59/iss3/1 vessels in the myocardium around the infarct area was greater in the rats in the MI＋HGF(53±4.8)group than in the rats in the MI＋Cont group(19±1.8)(P＜0.01)(Fig. 5).Discussion Recently, several new strategies, including gene ther-apy and cellular transplantation, have been successful in reducing the clinical consequences of the loss of cardiac muscle mass after myocardial ischemia［8］. However,the feasibility and safety of these new methods have not yet been determined. Some studies using autologous skeletal myoblast transplantation in patients with severe ischemic cardiomyopathy suggested an arrhythmogenic potential in such patients［15］. Actually, it has been reported that the existence of arrhythmic events, espe-cially ventricular ﬁbrillation/tachycardia associated with ventricular remodeling, is a major factor in determining the mortality after myocardial infarction［12］. Therefore,it is important to evaluate the arrhythmogenic potential before starting a human trial.Intramyocardial gene delivery using genes encoding angiogenic cytokines has been proposed as a strategy for patients with ischemic heart disease to promote the development of supplemental collateral vessels around the occluded native arteries in order to prevent cardiac is-chemia and to restore cardiac function［5, 8, 9］. We previously reported that HGF gene delivery using the HVJ-liposome method has a favorable eﬀect on the recovery of myocardial ischemia in animal models of myocardial ischemia［13］. The present study was carried out to determine whether this gene therapy prevents or increases arrhythmic events after myocardial ischemia.We found that the duration of induced VF after chronic ischemia was signiﬁcantly decreased in the MI＋HGF group. Similar results were obtained using the VF threshold after acute ischemia in the HGF＋MI group.The present study showed a marked fall in the VFT after coronary artery ligation, which agrees with the results of an earlier study［16］. Similar methods have been applied before［17, 18］. We cannot completely explain the mechanism of these results, but these favorable outcomes may lead to improvement in the survival rate after HGF gene therapy. It is known that infarcted myocardial volume can be reduced by means of HGF gene induction［19］. In the present study, the number of vessels was increased after HGF gene transfection. This angiogenesis eﬀect might reduce the ischemic myocardial volume after myocardial infarction and lead to reduction of the arrhyth-mic property of the HGF gene-transfected myocardium.We previously reported that HGF gene delivery using the HVJ-liposome method has a favorable eﬀect on the recovery of myocardial ischemia in animal models of myocardial ischemia by means of pleiotropic eﬀects on various cells［6］. Ueda et al.reported that the c-Met/HGF receptor is expressed in cardiomyocytes, and that HGF prevents myocyte death due to oxidative stress［20］. Nakamura et al. also reported that HGF gene transfection before myocardial ischemia attenuates reper-fusion injury after releasing the coronary artery［9］.Taniyama et al. reported that local HGF expression is involved in the prevention of myocardial injury by an-giotensin II blockade through its antiﬁbrotic action［21］.In this study, we observed a large increase in the number of vessels in the border zone of ischemia. We speculate that this eﬀect reduces ﬁbrosis and is related to the negative remodeling after myocardial ischemia. It is known that infarct size can be reduced by means of HGF gene induction［19］. However, we did not measure the infarcted myocardial volume in the present study. Further investigation is needed to determine whether the infarcted myocardium volume after HGF gene transfection is associated with an arrhythmic response. It would also be interesting to include a Sham＋HGF group in a VFT experiment in order to evaluate the arrhythmogenic response of HGF gene therapy.In conclusion, HGF gene therapy has a favorable anti-arrhythmic eﬀect after acute or chronic myocardial ischemia. Although further study is needed to determine Fig.5  Number of vessels.The number of small vessels increased when the HGF vector was transfected. Data are given as means±S.E.M.77 HGF Gene Therapy Reduces Arrhythmia June 20055Yumoto et al.: Hepatocyte growth factor gene therapy reduces ventricularProduced by The Berkeley Electronic Press, 2005 the mechanism by which this occurs, it has been shown that HGF gene therapy could be a safe treatment after myocardial ischemia.References 1. Isner JM and Asahara T:Angiogenesis and vasculogenesis as thera-peutic strategies for postnatal neovascularization. J Clin Invest(1999)103:1231-1236.2. Isner JM:Vascular endothelial growth factor:gene therapy and thera-peutic angiogenesis. Am J Cardiol(1998)82:63S-64S.3. Losordo DW, Vale PR, Hendel RC, Milliken CE, Fortuin FD, Cum-mings N, Schatz RA, Asahara T, Isner JM and Kuntz RE:Phase 1/2 placebo-controlled, double-blind, dose-escalating trial of myocardial vascular endothelial growth factor 2 gene transfer by catheter delivery in patients with chronic myocardial ischemia. Circulation(2002)105:2012-2018.4. Vale PR, Losordo DW, Milliken CE, McDonald MC, Gravelin LM,Curry CM, Esakof DD, Maysky M, Symes JF and Isner JM:Random-ized, single-blind, placebo-controlled pilot study of catheter-based myocardial gene transfer for therapeutic angiogenesis using left ventricular electromechanical mapping in patients with chronic myocar-dial ischemia. Circulation(2001)103:2138-2143.5. Vale PR, Isner JM and Rosenﬁeld K:Therapeutic angiogenesis in critical limb and myocardial ischemia. J Interv Cardiol(2001)14:511-528.6. Matsumoto K and Nakamura T. Hepatocyte growth factor(HGF)as a tissue organizer for organogenesis and regeneration:Biochem Bio-phys Res Commun(1997)239:639-644.7. Nakamura Y, Morishita R, Higaki J, Kida I, Aoki M, Moriguchi A,Yamada K, Hayashi S, Yo Y, Nakano H, Matsumoto K, Nakamura T and Ogihara T:Hepatocyte growth factor is a novel member of the endothelium-speciﬁc growth factors:additive stimulatory eﬀect of hepatocyte growth factor with basic ﬁbroblast growth factor but not with vascular endothelial growth factor. J Hypertens(1996)14:1067-1072.8. Ueda H, Sawa Y, Matsumoto K, Kitagawa-Sakakida S, Kawahira Y,Nakamura T, Kaneda Y and Matsuda H:Gene transfection of he-patocyte growth factor attenuates reperfusion injury in the heart. Ann Thorac Surg (1999)67:1726-1731.9. Nakamura T, Mizuno S, Matsumoto K, Sawa Y and Matsuda H:Myocardial protection from ischemia/reperfusion injury by endogenous and exogenous HGF. J Clin Invest(2000)106:1511-1519.10. Volpi A, Maggioni A, Franzosi MG, Pampallona S, Mauri F and Tognoni G:In-hospital prognosis of patients with acute myocardial infarction complicated by primary ventricular ﬁbrillation. N Engl J Med(1987)317:257-261.11. Bigger JT, Jr., Fleiss JL, Kleiger R, Miller JP and Rolnitzky LM:The relationships among ventricular arrhythmias, left ventricular dysfunc-tion, and mortality in the 2 years after myocardial infarction. Circula-tion(1984)69:250-258.12. St John Sutton M, Lee D, Rouleau JL, Goldman S, Plappert T,Braunwald E and Pfeﬀer MA:Left ventricular remodeling and ventricular arrhythmias after myocardial infarction. Circulation(2003)107:2577-2582.13. Aoki M, Morishita R, Taniyama Y, Kida I, Moriguchi A, Matsumoto K,Nakamura T, Kaneda Y, Higaki J and Ogihara T:Angiogenesis induced by hepatocyte growth factor in non-infarcted myocardium and infarcted myocardium:up-regulation of essential transcription factor for angiogenesis, ets. Gene Ther(2000)7:417-427.14. Svorc P, Bracokova I and Podlubny I:Relation of ventricular ﬁbrillation threshold to heart rate during normal ventilation and hypoventilation in female Wistar rats:a chronophysiological study. Physiol Res (2000)49:711-719.15. Menasche P, Hagege AA, Vilquin JT, Desnos M, Abergel E, Pouzet B, Bel A, Sarateanu S, Scorsin M, Schwartz K, Bruneval P,Benbunan M, Marolleau JP and Duboc D:Autologous skeletal myob-last transplantation for severe postinfarction left ventricular dysfunc-tion. J Am Coll Cardiol(2003)41:1078-1083.16. Marshall RJ, Muir AW and Winslow E:Development of a severe model of early coronary artery ligation-induced dysrhythmias in the anaesth-etized rat. Br J Pharmacol(1981)73:951-959.17. Hong K, Kusano KF, Morita H, Fujimoto Y, Wang X, Yamanari H and Ohe T:Attenuation of conduction delay by ischemic preconditioning reduces ischemia-induced ventricular arrhythmias. Acta Med Okayama(1999)53:233-238.18. Hong K, Kusano KF, Morita H, Fujimoto Y, Nakamura K, Yamanari H and Ohe T:Involvement of Ca (2＋) in antiarrhythmic eﬀect of ischemic preconditioning in isolated rat heart. Jpn J Physiol(2000)50:207-213.19. Kondo I, Ohmori K, Oshita A, Takeuchi H, Fuke S, Shinomiya K,Noma T, Namba T and Kohno M:Treatment of acute myocardial infarction by hepatocyte growth factor gene transfer:the ﬁrst demon-stration of myocardial transfer of a“functional”gene using ultrasonic microbubble destruction. J Am Coll Cardiol(2004)44:644-653.20. Ueda H, Nakamura T, Matsumoto K, Sawa Y and Matsuda H:A potential cardioprotective role of hepatocyte growth factor in myocar-dial infarction in rats. Cardiovasc Res (2001)51:41-50.21. Taniyama Y, Morishita R, Nakagami H, Moriguchi A, Sakonjo H,Shokei K, Matsumoto K, Nakamura T, Higaki J and Ogihara T:Potential contribution of a novel antiﬁbrotic factor, hepatocyte growth factor, to prevention of myocardial ﬁbrosis by angiotensin II blockade in cardiomyopathic hamsters. Circulation(2000)102:246-252.Yumoto et al. Acta Med. Okayama Vol. 59 , No. 3 786Acta Medica Okayama, Vol. 59 [2005], Iss. 3, Art. 1http://escholarship.lib.okayama-u.ac.jp/amo/vol59/iss3/1",
    "Link": "https://core.ac.uk/download/12547902.pdf"
}