{
    "Title": "The Philadelphia School District’s Ongoing Financial Crisis",
    "Authors": "Caskey, John P., Kuperberg, Mark",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Swarthmore College Works Economics Faculty Works Economics Fall 2014 The Philadelphia School District’s Ongoing Financial Crisis John P. Caskey Swarthmore College, jcaskey1@swarthmore.edu Mark Kuperberg Swarthmore College, mkuperb1@swarthmore.edu Follow this and additional works at: https://works.swarthmore.edu/fac-economics  Part of the Economics Commons Let us know how access to these works benefits you  Recommended Citation John P. Caskey and Mark Kuperberg. (2014). \"The Philadelphia School District’s Ongoing Financial Crisis\". Education Next. Volume 14, Issue 4. 20-27. https://works.swarthmore.edu/fac-economics/354 This work is brought to you for free and open access by . It has been accepted for inclusion in Economics Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. 20 EDUCATION NEXT / F A L L  2 0 1 4  educationnext.orgPHOTO / AP PHOTO / MATT ROURKE / FIGURE / BRUCE SANDERS DESIGNFiscal Crisis  (Figure 1)After climbing steadily for nearly a decade, a dramatic decline in per pupil revenue in 2012 sent the Philadelphia school district reeling.  NOTE: Inflation-adjusted revenue per student includes charter school students and revenue paid out to charter schools.SOURCE: School District of Philadelphia, Comprehensive Financial Report, June 30, 2013Dollars10,000Fiscal yearRevenue per student in 2013 prices2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013THE Philadelphia  School District’s  Ongoing Financial Crisiseducationnext.org  F A L L  2 0 1 4  /  EDUCATION NEXT  21featureby JOHN CASKEY and MARK KUPERBERGEach year, as predictably as classes end in June, the School District of Philadelphia faces a budget crisis for the coming school year. In 2014, the School Reform Commission, the school dis-trict’s state-imposed governing body, for the first time and in violation of the city charter, refused to pass a budget, arguing that there were insufficient funds to run the schools responsibly. Philadelphia’s mayor Michael Nutter said, “It is a sad day in public service that we find children being held on the rail-road tracks awaiting some rescue to come from somewhere.” And yet, casting the school children of Philadelphia in the Perils of Pauline has become a yearly ritual. In the summer of 2013, the dis-trict superintendent announced that schools might not open on time, as severe budget cuts had led to insufficient staffing. The budgets of many individual schools allowed for no counselors, no secretar-ies to assist principals or answer telephones, and no arts or sports programs. With a last-minute financial-aid pledge from the city, some laid-off personnel were recalled, and schools opened on time. But the district was still in such dire straits that Philadelphia’s newspapers launched a drive to obtain pencils, paper, and other basic supplies. This is no way to run a school system, much less the eighth largest in the United States.We investigate why these school crises keep recurring. The most recent spate of crises actually started in the 2012 school year  (herein school years are referenced by the spring in which the school year ended). Between 2011 and 2012, the district cut almost 17 percent of its workforce, including nearly 2,000 teachers. How did the district get into this mess? Some people blame managers for failing to look ahead and budget carefully, in particular, for failing to plan for the predictable end of federal stimu-lus funds. Structural factors have also been cited: It may be that the State of Pennsylvania does too little for public education. The City of Philadelphia may either tax itself too lightly or allocate too much money to other city services at the expense of the school district. Some of the financial burden may be the result of student flight to charter schools, whose share of Philadelphia students has grown dramatically in recent years. We find supporting evidence for all of these explanations. We also find that the crisis was certainly not due to excessive spending relative to that of surrounding districts (see sidebar on page 24 for details on city support, charter Why the  district  has a money problem22 EDUCATION NEXT / F A L L  2 0 1 4  educationnext.orgschool enrollments, district spending, and teacher salaries). We conclude that the unwieldy process for financing the district mean that such crises are bound to recur unless that process is changed.Funding the Philadelphia SchoolsThree specific events triggered the 2012 crisis: an abrupt reduction in federal and state funding (see Figure 1), the inability of the district to cut many of its costs, and political pressures on the district to spend available revenues in a given year. In response to an earlier financial crisis, in 2001, the State of Pennsylvania took control of the Philadelphia school district. The Republican governor at the time worked with the Democratic mayor of Philadelphia to arrange a “friendly” takeover, which replaced the local school board with a five-member School Reform Commission (SRC). Three members are appointed by the governor and two by the mayor. With no independent taxing authority, the district depends for funding on annual allocations from the city, state, and federal governments. Of the district’s $2.7 billion in revenues in 2013, 50 percent came from the state and 14 percent from the federal government; city and local contributions made up the remainder. In a typical year, the governor presents a draft state budget to the legislature in February, including allocations for K–12 education. In April, the district uses the governor’s proposed budget and estimates what it will get from the city to prepare its own draft budget. Much of the funding the School District of Philadelphia gets from the city is fairly predictable, but it must nevertheless appear before the city council in May to present a request for funds. From the perspective of the district, multiple sources of funding create three significant planning problems. First, the state legislature can alter the governor’s proposed budget. Second, the city council may not grant the district’s request for funds, especially any requests that go beyond its typical allocations. When the allocations from the state and city deviate from what the district expects, it must adjust its bud-get. Third, there is a “who goes first?” problem. In years when the district appeals to the state and city for additional funding, each is reluctant to pledge new funds without knowing how much the other will commit. If one governmental entity steps up, this reduces the burden on the laggard. Such gaming between the city and state can leave the district uncertain about its exact funding until well into its fiscal year. When the recession began in late 2007, it severely reduced tax revenues at all levels of government. In order to preserve jobs and maintain educational spending, the federal govern-ment in early 2009 initiated an economic stimulus program. About $113 million a year in 2010 and 2011 came directly from the federal government to the school district, mainly as supplemental grants to enhance educational services for disadvantaged students. Other stimulus funds went to the state to allocate to school districts. In 2010, the state faced reduced revenues and cut its own support for K–12 education but used the stimulus funds to increase overall allocations to school districts. For Philadelphia, combined state and federal funding grew by 10.2 percent. Local funding for the district declined by 0.7 percent, but given the large share of state and federal funding, overall district revenues still grew by 6.7 percent. The subsequent fiscal year was similar, but the growth in revenues was more constrained. Funding to the district from state-generated revenues was essentially flat, but federal funding increased by 13.3 percent, largely due to the stimulus package. Local funding fell by 2 percent. On net, the district’s total revenues grew by 2 percent. This modest increase created budget pressures for the school district that required some midyear cuts, but the district managed to end the fiscal year with a small surplus. District administrators clearly understood that the district’s budget was heavily dependent on the state’s basic education subsidy, and that the state had increased this subsidy in fiscal years 2010 and 2011 by using federal stimulus funding. In 2010 and early 2011, district management warned repeatedly that severe cuts would have to be made if the state or the city did not increase support for K–12 education once the federal stimulus funding ended in 2011. Arlene Ackerman, Of the district’s $2.7 billion in revenues in 2013, 50 percent came from the state and  14 percent from the federal government; city and local contributions made up the remainder.Pennsylvania governor Tom Corbett signs the 2013–14 state budget on June 30, 2013PHOTO / AP IMAGES / THE PATRIOT-NEWS-PENNLIVE.COM, DAN GLEITEReducationnext.org  F A L L  2 0 1 4  /  EDUCATION NEXT  23featurePHILADELPHIA SCHOOLS  CASKEY & KUPERBERGwho became superintendent in 2008 but would be forced out in 2011, emphasized two factors that she thought might win over legislators who were demanding greater school choice and more accountability from traditional schools. Ackerman pointed to the district’s support for the growing numbers of students selecting charter schools and to rising test scores by district students on the state’s standardized tests. Spending CutsPolitical developments did not provide much hope for addi-tional state funding, however. In November 2010, voters elected Tom Corbett, a Republican, as governor, replacing Ed Rendell, a Democrat. In addition, the Republican Party gained control of both houses of the state legislature. Corbett and many Republican state legislators had run on a “no new tax” pledge. With the state still mired in the recession and the end of federal stimulus funding, Corbett clearly had to cut state spending to balance the budget.The school district could not know exactly what Corbett planned to do with the education budget, but it recognized that a big increase in state funding to offset the elimination of federal stimulus funding was unlikely. Almost immediately after Corbett’s election, the School District of Philadelphia began to make plans for how it might adjust to major budget cuts. But the governor surprised the district (and school districts throughout the state) in March 2011 when he proposed a state budget that cut support for basic education by nearly 10 percent. The termination of almost $1 billion in federal stimulus funding for education in Pennsylvania was to be offset by only a very modest replacement by the state. After heavy lobbying by school districts around the state, Corbett and the state legislature settled on a 7 percent cut in the basic education subsidy, but they also made deep cuts to other state grants for education. Reductions in state funding fell disproportionately on Philadelphia. The district, which educates about 10 percent of the state’s children, shouldered about 30 percent of the state cuts. For Philadelphia, the end of the stimulus and the state’s decision to offset only a small share of the federal cuts meant a 14 percent drop in state and federal education funding between 2011 and 2012. As the magnitude of the coming funding cuts materialized, the district appealed to the city for Local revenue State revenue Federal revenue TotalMillions of dollars3,5003,0002,5002,0001,5001,0005000Fiscal yearFunding sources and revenues, 2003–20132003 2004 2005 2006 2007 2008 2009 2010 2011 2012 20132,7701,390980400Revenue Shortfall  (Figure 2)Despite rising over the decade, district revenues fell by 7 percent in 2012 when other funding failed to fully replace federal funds provided by the stimulus package.SOURCE: School District of Philadelphia, Comprehensive Financial Report, June 30, 201324 EDUCATION NEXT / F A L L  2 0 1 4  educationnext.orgPhiladelphia’s Support for EducationMany observers argue that the district is underfunded relative to its needs. This raises the question, is the City of Philadelphia doing its fair share to fund its schools? Figure S1 plots “local tax effort” as a function of “economic capacity” for the district and surrounding suburban districts. We use suburban Philadelphia as the comparison group because labor costs are the overwhelming component of a school district’s expenditures, and labor markets in education are local. We also include Pittsburgh, the state’s second-largest city. Pittsburgh has more than double the economic capacity of Philadelphia ($320,844 vs. $150,776 per student).Philadelphia’s position in Figure S1 indicates that its tax effort for education is about average for the metropolitan region, and is similar to Pittsburgh’s. But Philadelphia’s relatively large distance from the line indicates that its financial support for education is low compared to most other low-wealth districts. Had the city funded the district according to what would be predicted by the regression line, Philadelphia’s contribution would have been 25.3 percent higher, generating $237 million in 2012, enough to have offset 80 per-cent of the decline in state and federal funding that year. Charter SchoolsGrowing enrollment in charter schools is another factor in the district’s financial woes. State law requires districts to give charter schools the same amount per pupil, roughly speaking, that traditional schools spent per pupil in the previous year, adjusted for the difference between spending on regular and special education students. As the recession began, total enroll-ment in the city’s public schools had been declining for several years from enroll-ment of about 212,000 in 2003. While by 2009 total enrollment had hit a plateau at just under 200,000, district school enroll-ment continued to decline as increasing numbers of students chose to attend charter schools. Charter school enroll-ment rose from 30,350 in 2007 to 61,740 in 2013, as district school enrollment fell from 169,697 to 136,929. Charter schools currently educate 30 percent of public school students in the district.In theory, charter schools are cost-neutral because they remove students from the district and the associated operating costs in equal measure. In reality they are not. Students rarely leave a traditional public school in a quantity and grade level that allows for the elimination of a class-room, so it may be impossible in the short run to lower teacher costs in line with the reduction in students. And some operating expenses, such as those for principals and building maintenance, cannot be reduced unless an entire school is eliminated, which is also difficult to achieve in the short run.   Equalized mills3025201510Economic capacityLocal tax effort 2011–120 200,000PittsburghPhiladelphia400,000 600,000 800,000 1,000,000 1,200,000Tax Effort in Philadelphia, Its Suburbs, and Pittsburgh  (Figure S1)In 2012, Philadelphia’s local tax effort was less than what would be predicted by its economic capacity and below average relative to most other low-wealth districts. NOTES: Equalized mills is a measure of local tax effort that reflects all locally generated tax revenue divided by the district’s total property market value. Economic capacity is measured as a weighted average of a district’s total personal income and property market value per student; 60 percent of the weight is determined by market value of taxable property per student and the remaining 40 percent by personal income.SOURCE: Pennsylvania Department of Educationeducationnext.org  F A L L  2 0 1 4  /  EDUCATION NEXT  25featurePHILADELPHIA SCHOOLS  CASKEY & KUPERBERGDistrict SpendingFigure S2 compares per-pupil current expenditures in Philadelphia, Pittsburgh, and Philadelphia’s Pennsylvania sub-urbs. It shows that Philadelphia spends far less than the suburban districts, but roughly in line with its economic capacity. Only a handful of suburban districts spend less than Philadelphia. Pittsburgh spends far more per pupil than Philadelphia—in fact, Pittsburgh is the second-highest-spending school district in the comparison group.  The contract approved in early 2010 gave teachers a 3 percent raise in Sep-tember 2010 and a 3 percent raise in January 2012, in addition to a 4 percent raise received in March 2009. These increases raise the question of whether district teachers are overpaid. As Table S1 shows, in 2013 the average teacher salary in Philadelphia was 5.3 percent lower than the average in surrounding suburbs, and 3.6 percent lower than in Pittsburgh, where the cost of living is substantially less. Philadelphia does pay its administrators more, but they are managing a school district that is 7 times larger than Pittsburgh’s and 10 times larger than the largest suburban school district.Differences in employment benefits close some of the compensation gap. In Philadelphia, teachers do not con-tribute anything toward the cost of health insurance for themselves and their dependents. Available data for surrounding suburbs from a National Council on Teacher Quality report, Teacher Quality Roadmap: Improving Policies and Practices in the School District of Philadelphia, indicate that it was common for suburban teachers to pay $1,000 to $2,000 in 2013 for family health insurance. Spending (dollars)20,00018,00016,00014,00012,00010,0008,000Economic capacityCurrent expenditure per student 2011–120 200,000Pittsburgh Regression linePhiladelphia400,000 600,000 800,000 1,000,000 1,200,000Average Teacher Salaries Exceed $70,000 in 2012–13  (Table S1)But Philadelphia teachers’ pay is below the average of the surrounding suburbs and below the average in Pittsburgh.Note: Current expenditures include spending on instruction, support services, and operations of non-instructional services but exclude facilities acquisitions and debt financing.SOURCE: Pennsylvania Department of EducationSOURCE: Authors’ calculations based on data from the Pennsylvania Department of Education Administrators TeachersOther  Professional StaffAll  Professional StaffSuburban  Philadelphia $122,279 $74,706 $80,485 $77,635Pittsburgh $109,058 $73,483 $83,233 $76,274Philadelphia $129,574 $70,790 $74,143 $73,548School Spending in Philadelphia, Its Suburbs, and  Pittsburgh  (Figure S2)Spending per student in Philadelphia is lower than in most of its suburbs, and far lower than in Pittsburgh.26 EDUCATION NEXT / F A L L  2 0 1 4  educationnext.orgadditional revenues to help it head off drastic disruptions to its educational program. The city responded by increasing its funding and other local revenue to the district by 11.3 percent. The net result, however, was an almost 7 percent decline in district revenue (see Figure 2). Limited OptionsThe school district had to cut spending, but much of the district’s budget is fixed in the short run. Collective bargaining agreements set the scale for salaries and benefits. The federal government mandates certain levels of special education ser-vices. State law and enrollments govern how much the district must transfer to charter schools. School buildings must be heated and maintained. Bond issuances determine required debt payments. In fact, the district estimates that between 66 and 80 percent of its expenses are predetermined from one year to the next, and many of these costs, such as negotiated wage contracts, increase automatically. Thus, the 7 percent decline in total operating revenues in fiscal year 2012 fell heavily on a small portion of the overall budget. The largest component of educational expenditure is person-nel, so it is not surprising that the district looked to the workforce for potential cuts. Between 2003 and 2009, district employment of classroom teachers had declined, but the student-to-teacher ratio had held relatively stable as the district lost students to charters and other schools. In 2010 and 2011, the district added teachers while continuing to lose students, and student-to-teacher ratios dropped dramatically. But when the stimulus funding ended and the state failed to replace those funds, the district decided to cut its workforce by almost 17 percent (see Figure 3), which would save more than $300 million annually. The district also netted one-time savings of well over $100 million, mainly from a debt refinancing, and it pushed some expenses into the subsequent fiscal year. It delayed $42 mil-lion in payments into a union health plan and borrowed $35 million from the regional transportation authority. Such measures simply postponed the need for additional cuts. The tight financial situation continued into 2013, but the district avoided significant cuts that year by borrowing $302 million in the bond market. Much of this went to cover the short-term debts the district had incurred in the previous year. Recognizing that it could not continue to borrow to cover operating costs, the SRC announced that it would close almost 10 percent of the district’s 240 schools in 2013. For several years, the SRC had been closing schools, but well below the rate the schools were losing students. Every announced school closing was vociferously contested by supporters of that school. Students per classroom teacher Classroom teachersStudents per classroom teacherClassroom teachers1817161514131214,00012,00010,0008,0006,0004,0002,0000Fiscal year2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 201314.49,498Workforce Cuts  (Figure 3)Fiscal constraints and declining enrollments forced a 15 percent reduction in the teaching force in 2012, but student-to-teacher ratios remained below 2009 levels.SOURCE: School District of Philadelphia, Comprehensive Financial Report, June 30, 2013The largest component of educational expenditure is personnel,  so it is not surprising that the district looked to the workforce for potential cuts.educationnext.org  F A L L  2 0 1 4  /  EDUCATION NEXT  27featurePHILADELPHIA SCHOOLS  CASKEY & KUPERBERGIn 2013 the relatively new superintendent, William R. Hite, announced that schools might not open on time if they could not be adequately staffed. Committed to a balanced budget, Hite and the SRC put forth a “doomsday” budget that severely cut the number of noontime aides, counselors, and teachers, and created “split” classrooms, that is, classrooms with two grade levels in the same room. That summer, the district mailed layoff notices to nearly 3,800 employees. At the same time, the SRC asked the city for $60 million in additional funding, the state for $120 million, and its unions for $133 million in labor concessions. The city pledged to find $50 million in additional revenue for the schools. Exactly how the city would come up with this money was still to be determined, but the pledge was sufficient for the district to reinstate 1,600 laid-off employees and open on schedule. Could the Crisis  Have Been Avoided? Critics of the district management argue that the administration should have cut costs in order to conserve resources and prepare for the pre-dictable end of the stimulus money, even when, relatively speaking, fund-ing was flush. It certainly did not do this. When the district had sufficient funds prior to 2011, it agreed to a series of wage increases for union employees, added remedial summer-school classes, reduced class sizes, operated underutilized buildings, and devoted extra resources to improve poorly performing schools. Some of these measures could be quickly reversed, but some created ongoing commitments.  People who defend the district’s spending prior to the crisis point to a number of institutional and political realities. For one, the fed-eral stimulus funding that came directly to the district had to be used for program enhancements, that is, the district had very limited legal ability to “bank” the funds. Moreover, graduation rates in the district are strikingly low, as is student performance on standardized tests. SRC members and state and local politicians naturally pushed the district to improve these metrics. The school district’s response was to spend available funds on initiatives that might help in the short run, even if it left the district vulnerable in the long run. And, as noted earlier, the district must approach the state and city each year with its hat in hand to ask for resources. If it did so while banking previously appropriated funds, this would undermine its case. Finally, prior to the November 2010 election, the district assumed that the state would largely replace the federal funding that the state used to maintain its support for K–12 education during the recession. It did not anticipate that the state would continue its reduced level of funding and cut state grants to the district. But once federal stimulus funding ended and the state and city refused to step up, the district was, like the Coyote in the Road Runner cartoon, standing on thin air. ConclusionDespite a vibrant downtown, Philadelphia is a much poorer city than many people realize. With one-quarter of its residents living below the poverty level, Philadelphia is the ninth-poorest U.S. city with a population over 250,000. Relative to Pittsburgh and the Philadelphia suburbs, the school district is sig-nificantly underfunded by the state and its city government, especially when one adjusts for the compara-tively large percentages of special education, English language learn-ers, and low-income students. In short, the district faces huge chal-lenges with limited resources.  In addition to this fundamen-tal fiscal weakness, the district is undermined by its governance structure. With no independent taxing authority, every year the district administration must plead for funding from the state and city. As with the boy who cried wolf, the politicians who hear the message repeatedly become skeptical. In addition, the city and state have an incentive to delay committing funds as long as possible in the hope that the other will take the lead.In the summer of 2014, the district once again faces a dire fiscal situation and is appealing to the city and state to rescue the schools. The danger is that the district may have entered a vicious cycle in which persistent financial crises encour-age more parents to leave the city or move their children to charter schools, further undermining the district’s financing and reinforcing the exodus of students.   John Caskey and Mark Kuperberg are professors in the department of economics at Swarthmore College. Erica Kouka provided research assistance.Philadelphia school district superintendent William R. Hite speaks about the proposed fiscal year 2015 operating budget at a press conference on April 25, 2014PHOTO / AP PHOTO / PHILADELPHIA INQUIRER, RACHEL WISNIEWSKI",
    "Link": "https://core.ac.uk/download/76218154.pdf"
}