{
    "Title": "Investment In Human Capital: Review Of  The State And The Family: A Comparative Analysis Of Family Policies In Industrialized Countries  By A.H. Gauthier",
    "Authors": "Magenheim, Ellen B.",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Swarthmore College Works Economics Faculty Works Economics Winter 1999 Investment In Human Capital: Review Of \"The State And The Family: A Comparative Analysis Of Family Policies In Industrialized Countries\" By A.H. Gauthier Ellen B. Magenheim Swarthmore College, emagenh1@swarthmore.edu This work is brought to you for free and open access by . It has been accepted for inclusion in Economics Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. Follow this and additional works at: https://works.swarthmore.edu/fac-economics  Part of the Economics Commons Let us know how access to these works benefits you  Recommended Citation Ellen B. Magenheim. (1999). \"Investment In Human Capital: Review Of \"The State And The Family: A Comparative Analysis Of Family Policies In Industrialized Countries\" By A.H. Gauthier\". Forum For Applied Research And Public Policy. Volume 14, Issue 4. 110-110. https://works.swarthmore.edu/fac-economics/23 Investment in Human Capitalor most people, takingtheir children to thepediatrician, signingthem up for pianolessons, or making sure they dotheir homework are simply whatgood parents do—ways to manifest their love and desire for theirchildren to have successful andmeaningful lives. For an economist, such actions are investmentsin human capital, whether undertaken privately by the family orsupported by the government. Inother words, they are actionsintended to increase the odds ofproducing children who will growup to be responsible and productive members of society.From either perspective, that ofloving parent or analytical economist, we do know that the waychildren are treated today helps todetermine the adults they becometomorrow; specifically, childhoodexperiences may affect the level ofeducation they attain, theirproductivity in the labor force,and their contributions to society.In few countries are thesedecisions made without anygovernment involvement. Forexample, laws governing access toabortion, mandating parental leavebenefits, and providing cashbenefits to parents may influenceprivate decision making aboutchildbearing, family formation,and investments in children. Theappropriate division of responsibility between the family and theBY ELLEN MIAGENHEIMgovernment for providing financialsecurity, human capital development, time, and caring of children,has varied over time and acrosscountries. In The State and theFamily, Anne Hélène Gauthierdoes an admirable job of documenting the range of governmentalapproaches in 22 industrializedcountries over the last century.The author uses a fairly broaddefinition of family policy—publicinitiatives targeted at families withdependent children. Componentsof family policy can include cashtransfers, such as tax relief fordependent children, and services tofamilies such as after-school care.While these and many otherdisparate policy initiatives are allincluded under the rubric of familypolicy, the author notes that theterm \"family policy\" connotes acomprehensiveness and integrationthat, in fact, do not characterizemost countries' family policypackages.The author offers an interestingcomparative analysis of howdifferent countries that sharesimilar demographic patterns andtransformations in family life haveresponded to these phenomena indifferent ways. For example,France and Britain have implemented divergent programs torespond to similar patterns ofoverall decline in fertility andincreased incidence of births tosingle mothers. Gauthier arguesthat a country's history, politicalstructure, and social values allinfluence whether or how governments respond to demographic andsocial change.The extremely ambitious scopeof this book is both its strengthand its weakness. Gauthier acknowledges the trade-off she facedby taking on a project with such abroad scope. In fact, the book isshort on details about particularpolicies and largely ignores broadareas of policy, including healthand education.While readers may find this afrustrating book in this regard, itwhets the reader's appetite forfurther detail and analysis.Gauthier's overview of child andfamily policy in this century mayserve as a starting point for thosewho want to pursue research onspecific policies and analysis in aparticular country and to explorethe relationship between investments in human capital duringchildhood and the results of thoseinvestments in the future.m.Anne Hélène Gauthier, TheState and the Family: A Comparative Analysis of Family Policies inIndustrialized Countries (Oxford,UK; Clarendon Paperbacks,Oxford University Press, 1998);248 pp; paper, $19.95.Ellen MagenheimDepartment ofEconomicsSwarthmore CollegeSwarthmore, Pennsylvania110 \" FoRUM for Applied Researchand Public Policy",
    "Link": "https://core.ac.uk/download/73342121.pdf"
}