{
    "Title": "Cloud Computing",
    "Authors": "Garanga, D. N., Isakova, M. L., Us, Oleksandra",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Oleksandra Us  D. N. Garanga, research supervisor M. L. Isakova, language adviser SHEI “National Mining University”, Dnepropetrovsk  Cloud Computing  Cloud computing is a new approach to the use of resources, in which the data storage and processing occur on the Internet. They allow you to reduce the complexity of  IT-systems through well managed and available on demand services, users of virtual infrastructure. Consumers of cloud computing can significantly reduce the cost of information technology infrastructure and to respond flexibly to changing computing needs, using the properties of elasticity of cloud computing services. In general services \"cloud\" computing are applications that can be accessed via the Internet through conventional Internet browser, or other network applications, such as, FTP-client. It can be entertaining, and service, and specialized business applications. The main difference from the usual method of working with the software is that the user does not use the resources of your PC, and computer resources and powers conferred upon him as an online service. The user has full access to their own data, and the ability to work with them, but can’t manage the same operating system, the software base, and processing power, etc., with which this work is going on. There are 4 types of clouds: 1. Private cloud is the infrastructure, for a single organization comprising multiple consumers 2. Public cloud is the infrastructure intended for free public use  3. Hybrid cloud is a combination of two or more distinct cloud infrastructures that remain unique entities, but connected by standardized or proprietary technology transfer 4. Public cloud is the type of infrastructure for the use of specific community of consumers from organizations with common objectives. Companies that use cloud computing are Yahoo Mail, Microsoft Word, Apple, Google. The cloud service is offered throughout the Internet and it is up to the user to decide to use it (and probably endanger his classified information) or to exploit the limited resources of his/her personal computer.    203",
    "Link": "https://core.ac.uk/download/132414129.pdf"
}