{
    "Title": "Evaluation of a rehabilitation support service after acute stroke: Feasibility and patient/carer benefit",
    "Authors": "Crichton, Margaret, Dickens, Julie, Jack, Cathy I. A, Leathley, Michael John, McAdam, Joanna, Watkins, Caroline Leigh",
    "Year": "No year available",
    "Abstract": "Background: Stroke survivors returning home after discharge from hospital and their carers require support to meet their rehabilitation needs (independence in Activities of Daily Living, exercise, psychosocial support). Voluntary or charitable care providers may be able to address some of these needs. \n\n\n\nObjective: To explore the feasibility of delivering and evaluating enhanced support to stroke survivors and their carers, with a Rehabilitation Support Worker (RSW). \n\n\n\nMethods: 16 consecutive stroke survivors and their carers were included. All participants received usual hospital care. Seven of these patients and their carers were also allocated an RSW from a charitable care provider. The RSW accompanied therapy training sessions with the patient, carer and therapist in hospital. On discharge, the RSW visited the patient and carer at home over the initial 6 week post-discharge period to support them in practising rehabilitation skills. Patient function (Barthel Index) and patient/carer confidence were independently assessed at discharge (Week 0). The above assessments and patient/carer mood (GHQ-12) and Carer Giver Strain were also assessed at Weeks 1, 6 and 12.  RSWs were interviewed for their views about the service. \n\n\n\nResults: Participants’ functional ability at Week 1 post-discharge was significantly higher in the RSW group. At 6 and 12 weeks post-discharge, functional ability was not significantly different between groups. Carers in the intervention group were less confident at all time points, however, this was not significant. There was no significant effect on carer strain or well-being. Interviews with RSWs highlighted areas of their training that could be enhanced and the need for greater clarity as to their role. \n\n\n\nConclusions: The results showed that a definitive trial of rehabilitation support is feasible. A number of obstacles however would need to be overcome including: difficulty in identifying suitable patients, clarity of the RSW role, and appropriate training content",
    "Keywords": "No keywords available",
    "Publisher": "'Scientific Research Publishing, Inc.'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Article\nEvaluation of a rehabilitation support service \nafter acute stroke: Feasibility and \npatient/carer benefit\nMcadam, Joanna, Leathley, Michael John, Crichton, Margaret, \nDickens, Julie, Jack, Cathy I. A and Watkins, Caroline Leigh\nAvailable at http://clok.uclan.ac.uk/9786/\nMcadam, Joanna, Leathley, Michael John, Crichton, Margaret, Dickens, Jul ie, Jack,  \nCathy I. A and Watkins, Caroline Leigh (2013) Evaluation of a rehabi l i tat ion support  \nservice after acute stroke: Feasibi l i ty and patient /carer benefit. Health, 05 (07). pp.  \n1124-1131. ISSN 1949-4998  \nIt is advisable to refer to the publisher’s version if you intend to cite from the work.\nhttp://dx.doi.org/10.4236/health.2013.57152\nFor more information about UCLan’s research in this area go to \nhttp://www.uclan.ac.uk/researchgroups/ and search for <name of research Group>.\nFor information about Research generally at UCLan please go to \nhttp://www.uclan.ac.uk/research/ \nAll outputs in CLoK are protected by Intellectual Property Rights law, including\nCopyright law.  Copyright, IPR and Moral Rights for the works on this site are retained \nby the individual authors and/or other copyright owners. Terms and conditions for use \nof this material are defined in the http://clok.uclan.ac.uk/policies/\nCLoK\nCentral Lancashire online Knowledge\nwww.clok.uclan.ac.uk\nVol.5, No.7, 1124-1131 (2013)                                                                         Health \ndoi:10.4236/health.2013.57152 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \nEvaluation of a rehabilitation support service after \nacute stroke: Feasibility and patient/carer benefit \nJoanna J. McAdam1, Michael J. Leathley1, Margaret S. Crichton2, Julie Dickens3, \nCathy I. A. Jack4, Caroline L. Watkins1 \n \n1School of Health, University of Central Lancashire, Preston, UK; *Corresponding Author: jmcadam@uclan.ac.uk  \n2Crossroads Care (Liverpool, Sefton and Warrington), Liverpool, UK \n3Therapies Directorate, The Royal Liverpool and Broadgreen University Hospitals NHS Trust, Liverpool, UK \n4Belfast Health and Social Care Trust, Belfast, Northern Ireland \n \nReceived 16 April 2013; revised 17 May 2013; accepted 17 June 2013 \n \nCopyright © 2013 Joanna J. McAdam et al. This is an open access article distributed under the Creative Commons Attribution Li-\ncense, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited. \nABSTRACT \nBackground: Stroke survivors returning home \nafter discharge from hospital and their carers \nrequire support to meet their rehabilitation \nneeds (independence in Activities of Daily Liv- \ning, exercise, psychosocial support). Voluntary \nor charitable care providers may be able to ad- \ndress some of these needs. Objective: To ex- \nplore the feasibility of delivering and evaluating \nenhanced support to stroke survivors and their \ncarers, with a Rehabilitation Support Worker \n(RSW). Methods: 16 consecutive stroke survi- \nvors and their carers were included. All partici- \npants received usual hospital care. Seven of \nthese patients and their carers were also allo- \ncated an RSW from a charitable care provider. \nThe RSW accompanied therapy training ses- \nsions with the patient, carer and therapist in \nhospital. On discharge, the RSW visited the pa- \ntient and carer at home over the initial 6 week \npost-discharge period to support them in prac- \ntising rehabilitation skills. Patient function \n(Barthel Index) and patient/carer confidence \nwere independently assessed at discharge \n(Week 0). The above assessments and pa- \ntient/carer mood (GHQ-12) and Carer Giver \nStrain were also assessed at Weeks 1, 6 and 12. \nRSWs were interviewed for their views about the \nservice. Results: Participants’ functional ability \nat Week 1 post-discharge was significantly \nhigher in the RSW group. At 6 and 12 weeks \npost-discharge, functional ability was not sig- \nnificantly different between groups. Carers in \nthe intervention group were less confident at all \ntime points, however, this was not significant. \nThere was no significant effect on carer strain or \nwell-being. Interviews with RSWs highlighted \nareas of their training that could be enhanced \nand the need for greater clarity as to their role. \nConclusions: The results showed that a defini- \ntive trial of rehabilitation support is feasible. A \nnumber of obstacles however would need to be \novercome including: difficulty in identifying suit- \nable patients, clarity of the RSW role, and ap- \npropriate training content. \n \nKeywords: Stroke; Rehabilitation; Activities of Daily \nLiving; Instrumental Activities of Daily Living \n1. INTRODUCTION \nStroke is the major cause of long-term neurological \ndisability in adults [1] with approximately half of all \nthose surviving living with severe functional problems \n[2]. The majority of stroke survivors (78%) return to \ntheir own homes either alone or with a carer, yet of those \nless than 30% receive formal therapy such as seeing a \nPhysiotherapist or Occupational Therapist [3]. Further- \nmore, skills developed in rehabilitation may be dimin- \nished as half of stroke survivors lose the ability to per- \nform at least one basic functional task within six weeks \nof discharge [4]. Providing informal rehabilitation sup- \nport upon discharge may help with these issues. In 2010, a \nsystematic review evaluated the impact of “stroke liaison \nworkers” and found that patients with mild to moderate \ndisability benefited from a reduction in death and disability \n[5]. However, it has also been reported that studies of family \nor social support have failed to have much effect on func- \ntional problems [6-9]. A recent study identified that reha- \nbilitation practice that addresses and supports autonomy, \nadaption and social connection may help commu- \nJ. J. McAdam et al. / Health 5 (2013) 1124-1131 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \n1125\nnity-dwelling stroke survivors regain personally valued \nactivities post-stroke [10]. Providing a targeted rehabili- \ntation support service designed to support promotion of \nactivities of daily living (ADL) may therefore be more \npertinent and effective. \nIn addition to patients’ rehabilitation needs post-dis- \ncharge from hospital, the needs of informal carers are \nalso significant following a patient’s return home, with \ncarers commonly experiencing emotional distress [11] \nand carer strain post-discharge [12,13]. In a study of pa- \ntients’ and carers’ rehabilitation needs, a group of five \ncarers identified the need to provide patients with physi- \ncal and mental stimuli as important [14]. In addition, the \nsame study also identified that the needs relating to \ntraining for family members in community living were \npartially fulfilled [14]. Another study interviewed family \ncare-givers of stroke survivors and suggested that im- \nplementing a family-centred model of care may better \nsupport caregivers [15]. There is therefore a clear re- \nquirement for more support for carers to address these \nissues in more detail. Previous studies providing family \nor social support have shown some benefit for carers in \nterms of satisfaction with practical information provision \n[6,9], emotional support [9], mood [6,8] and improved \nquality of life [6,7]. However, many have failed to im- \nprove carer mood [9,16,17] or carer strain [7,9,17]. It is \nclear that possibilities exist to address the unmet needs of \ncarers although it would appear that more could be done \nto improve carer strain particularly in regards to reha- \nbilitation stimulus and resuming community living. \nA rehabilitation support service provided by a locally \nbased and well-established charitable care organisation \nwas incorporated into a stroke service model. The service \nprovided stroke patients and carers with a Rehabilitation \nSupport Worker (RSW) whose role was to promote in- \ndependence through providing support in ADLs and of- \nfering an opportunity for exercise. The service was in- \ntended to integrate with existing stroke care services to \nhelp address the rehabilitation needs of patients and car- \ners post-discharge, such as practising ADLs and Instru- \nmental Activities of Daily Living (IADL). \nThe aim of this trial was to test the feasibility of deliv- \nering the rehabilitation support service support service \nincluding evaluation of any beneficial effects for patients \nand carers, ease of recruitment and any issues relating to \nthe role of an RSW. The trial was approved by the Liv- \nerpool Research Ethics Committee. \n2. METHODS \nSubjects were consecutive acute stroke patients who \nwere transferred to a stroke rehabilitation unit, and their \ncarers over an 18-month period. Patients were considered \nfor inclusion if they were over 18 years old, discharged \nhome to live with and be supported by a carer, had a re- \nsidual disability following stroke and required the assis- \ntance of one to transfer (confirmed by Multi-disciplinary \nTeam [MDT]). The exclusion criteria for the trial were: \npatients discharged to residential care or home alone, \npatients able to independently transfer, patients unable to \ntransfer or requiring the assistance of two, and patients \nwith cognitive difficulties that precluded consent. The \nfocus of the intervention was aimed at supporting the \ncarer in practising rehabilitation skills such as ADLs \n(transfers, mobility skills, grooming) and also IADLs \n(food preparation, housework) with the patient. The in- \nclusion/exclusion criteria therefore reflect a patient who \nhas residual deficit with one carer supporting them. \n2.1. Procedure \nPatients who met the criteria for inclusion were identi- \nfied by the stroke consultant and the ward team. For the \npurpose of this trial, we defined “carer” as the main per- \nson involved in every-day care of the patient other than a \nprofessional care worker. The ward manager approached \nthe patient and carer and informed them about the trial. \nWritten consent was obtained after 24 hours from those \nagreeing to participate. Consenting patient and carer \nunits were randomised (using sealed envelopes), two \nweeks prior to discharge, by a third party, to either Con- \ntrol or Intervention group (one to one ratio). \n2.2. Control Group \nThe patients in the Control group received the usual MDT, \nrehabilitative care, and discharge planning. Following dis- \ncharge, patients received a package of conventional post- \ndischarge support, which may have included outpatient \ntherapy and social services output dependent on need. \n2.3. Intervention Group \nUpon consent, the patients in the Intervention group, \nin addition to receiving the usual MDT rehabilitative care \nand discharge planning outlined above, were allocated an \nRSW from the charitable care organisation. The organi- \nsation’s usual role was to provide a carer support service, \nto meet the individual needs of carers and the person \nthey are caring for. In this role, the organisation provided \nmembers of their existing care staff to be trained as \nRSWs. In their new role as an RSW, they received spe- \ncialist stroke-relevant training with the hospital therapists, \ncovering the medical, physical and social aspects of \nstroke. Training sessions included stroke awareness, the \nrehabilitation approach to stroke and practical aspects of \nstroke patient care. They were not trained to provide spe- \ncific psychological support, however they were informed \nabout these aspects in order to augment their stroke \nawareness. Furthermore, RSWs were not trained to prac- \ntically assist in healthcare, for example hoisting the pa-\nJ. J. McAdam et al. / Health 5 (2013) 1124-1131 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \n1126 \ntient or using equipment. RSWs were reminded that they \nwere to work “with” rather than “for” the patient and \ncarer in achieving rehabilitation goals. Written informa-\ntion was provided to help explain the role of an RSW. \nOnce trained, the RSWs attended individual, patient \ncentred training sessions (two weeks prior to discharge) \nwith the therapist, patient and carer, where the patient’s \nrehabilitation goals were set. Rehabilitation activities \ntargeted at achieving those goals were then practised by \nthe patient in hospital, under supervision of a therapist, \nwith observation and assistance by both the carer and the \nRSW. Examples of the type of activities practised in- \nclude walking up and down the stairs, self-feeding and \ngrooming (e.g. shaving). Other instrumental activities \npractised included food preparation (making a cup of tea) \nand housework (washing up). Record sheets were used \nand signed by therapists to ensure that RSWs had com- \npleted basic training and the patient centred training. The \nRSW was therefore cognisant of the patient’s rehabilita- \ntion needs and was aware of the skills required by the \ncarer to promote the patient’s recovery. In order to achieve \nthis, RSWs spent approximately six hours with the pa- \ntient and carer while they were practising their rehabili- \ntation activities. \nSubsequent to discharge, the patient and carer were \nencouraged to continue practising the rehabilitation ac- \ntivities taught in hospital. They were supported in prac- \ntising these activities by the RSW, who visited the pa- \ntient’s home on mutually agreed occasions over the first \nsix weeks of discharge. These visits provided approxi- \nmately 24 hours of rehabilitation support on a gradually \nreducing basis over the six week period (i.e. Weeks 1 & 2 \n= six hours per week, Weeks 3 & 4 = four hours and \nWeeks 5 & 6 = two hours). RSWs were given these tim- \nings as guidelines and finished visiting the patient at the \nend of the 6 week period. In terms of usual care received, \npatients in the intervention group were not treated any \ndifferently to the control group. The trial took place be- \nfore primary care based rehabilitation was routinely \navailable to patients as part of their care package. \n2.4. Evaluation \n2.4.1. Patient \nThe focus of the intervention was aimed at supporting \nthe patient in rehabilitation skills, primarily ADLs. Func- \ntion was therefore our primary outcome, measured by the \nBarthel Index [18]. We were also interested in the confi- \ndence of patients in performing ADLs. We therefore \nmeasured the patient’s confidence of performing each \nitem on the Barthel (designed specifically for this trial, \nnot psychometrically tested); each item was scored 0 (not \nconfident) to 4 (extremely confident). Furthermore, we \nwere interested in patient well-being: measured by the \n12-item General Health Questionnaire (GHQ-12) [19]. \n2.4.2. Carer \nThe intervention was designed to support both patient \nand carer in practising rehabilitation skills. We were \ntherefore interested in carer well-being measured by the \nGHQ-12 and carer strain measured by Carer Strain Index \n[20]. We were also interested in the level of carer confi- \ndence in the patient’s ability to perform ADLs. We \nmeasured this by asking the carer to rate their confidence \nin the patient performing each item on the Barthel (de- \nsigned specifically for this trial, not psychometrically \ntested), each item scored 0 (not confident) to 4 (ex- \ntremely confident). \n2.4.3. Data Collection \nData were collected face-to-face (questionnaire was \nread to participant) by the research physiotherapist (blind \nto treatment group) upon discharge (baseline) and Weeks \n1, 6, and 12 post-discharge at the patient’s home. Carer \ndata were collected by leaving a questionnaire for the \ncarer to self-complete and post back. If necessary, assis- \ntance was available to complete the carer questionnaire. \n2.4.4. RSWs \nQualitative methods were employed to measure the \nRSWs’ perception of the service. We asked the RSWs if \nthey were willing to be interviewed after they had com- \npleted the intervention. Those who agreed were inter- \nviewed by a researcher on a one to one basis using a \nsemi-structured interview guide. The interviews were \ndesigned to explore their experiences in providing the \nservice, and areas they felt needed improvement. Inter- \nviews were transcribed verbatim and all comments were \nanonymised. \n2.5. Data Analysis \nScale data were described using means and 95% con- \nfidence intervals. Group comparisons were made using \nANOVA accounting for baseline score. \nInterview transcripts were read by a researcher and \nemergent themes were identified by coding. A second \nresearcher independently coded the interviews and com- \npared results to determine the reliability of themes iden- \ntified. \n3. RESULTS \nSixteen patients and carers were recruited over an 18 \nmonth period, nine (56%) in the Control group and seven \n(44%) in the Intervention group. Figure 1 shows the \nflow of patients through the trial and reasons for non- \ninclusion. The collection of patients’ data yielded a 100% \nresponse. Leaving the questionnaire for the carers to \ncomplete gave us a 94% response over the 12 weeks. \nPatients in the Control group were slightly older than \nJ. J. McAdam et al. / Health 5 (2013) 1124-1131 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \n1127\n \n Patients admitted to hospital with acute stroke during 18 \nmonth trial period (n=875) \nNon-inclusion (n=859) \n*patient died as an in-patient (n=203) \n*patient discharged home alone (n=202) \n*patient discharged to residential care (n=137) \n*patient discharged home with a companion   \n[independent transfer] (n=301) \n*patient discharged home with a companion \n[unable or need two to transfer] (n=13) \n*patient discharged home with a companion,  \nneeds one to transfer [cognitive difficulties](n=2) \n*patient non-consent (n=1) \nIntervention \n(n=7) \n1 week follow \nup (n=7) \n6 week follow \nup (n=7) \n12 week follow up \n(n=7) \nRandomised (n=16)\nControl (n=9) \n1 week follow \nup (n=9)\n12 week follow \nup (n=8) \n*1 refused to \ncomplete \nquestionnaire \n6 week follow \nup (n=8) \n*1 refused to \ncomplete \nquestionnaire \n \nFigure 1. Flow diagram of patients entering the trial and reasons for non-inclusion. \n \nthose in the Intervention group (Table 1). There were \nthree female patients in both the Intervention and Control \ngroup (43% and 33% respectively). Patients in both \ngroups were of similar functional ability (Table 1). All \npatients in the trial were recruited within one to four \nmonths post-stroke. No patients died during the trial. \n3.1. Patient and Carer Outcomes \nAfter controlling for baseline (discharge) Barthel score, \nthe score at week 1 (post-discharge) was significantly \nhigher for the Intervention group (mean difference [MD \n= 1.6, 95% confidence interval [CI] = 0.5 - 2.7). At \nWeeks 6 and 12 there were no significant differences \nbetween the groups. There were no significant differ- \nences between groups for the Barthel score, individual \nBarthel items for transfers and mobility or patient confi- \ndence in performing transfers and mobility (Table 2). \nPatient well-being improved between weeks 1 and 12 in \nthe Control group and deteriorated in the Intervention \ngroup; however this was not significant (Table 2). \nThere were no significant differences between groups \nfor carer well-being or carer strain (Table 3). Carers in \nthe Intervention group were less confident than the Con- \ntrol group at Weeks 1, 6 and 12; however, this was not \nsignificant (Table 3). \n3.2. Interview Data \nTwo RSWs agreed to be interviewed. The three main \nthemes identified from the interviews with the RSWs \nwere: training issues, content of the service they were \nJ. J. McAdam et al. / Health 5 (2013) 1124-1131 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \n1128 \n \nTable 1. Baseline characteristics of patients allocated to the Intervention group (RSW) and Control group. \n Intervention group (n = 7) Control group (n = 9) \nAge (years), mean \n63.7 SD = 14.2 (range 45 - 83) \nMedian 66.0 \n70.9 SD = 10.6 (range 60 - 91)  \nMedian 70.0 \nSex, % male 4 (57%) 6 (67%) \nBarthel Index score, mean \n15.8 SD = 4.3 (range 8 - 20) \nMedian 16.5 \n14.9 SD = 3.3 (range 9 - 18) \nMedian 16.0 \nStroke onset (days), mean \n70 SD = 34.9 (range 26 - 111) \nMedian 68.0 \n52 SD = 14.1 (range 30 - 82) \nMedian 51.0 \n \nTable 2. For patients in the two groups over time, mean difference (95% confidence intervals) for Barthel Index total, transfers and \nmobility, patient confidence in transfers and mobility and patient well-being. \n Week 1 Week 6 Week 12 \nBarthel Total    \nUsual Care 14.4 (13.7, 15.1) 15.6 (13.2, 17.9) 14.7 (12.1, 17.2) \nRSW 16.0 (15.2, 16.8) 15.0 (12.5, 17.6) 15.3 (12.6, 18.2) \nDifference in Means 1.6 (0.5, 2.7) í0.5 (í4.0, 3.0) 0.7 (í3.1, 4.5) \nBarthel Transfer    \nUsual Care 2.5 (2.2, 2.7) 2.7 (2.3, 3.0) 2.5 (2.0, 3.0) \nRSW 2.7 (2.4, 3.1) 2.6 (2.2, 3.0) 2.8 (2.2, 3.3) \nDifference in Means 0.3 (í0.2, 0.7) í0.1 (í0.6, 0.4) 0.3 (í0.5, 1.0) \nBarthel Mobility    \nUsual Care 2.4 (2.1, 2.8) 2.9 (2.6, 3.2) 2.8 (2.4, 3.2) \nRSW 2.1 (1.6, 2.5) 2.5 (2.2, 2.8) 2.4 (2.0, 2.9) \nDifference in Means í0.4 (í1.0, 0.2) í0.4 (í0.8, 0.1) í0.4 (í1.0, 0.3) \nPatient Confidence (Transfer)    \nUsual Care 2.9 (2.1, 3.7) 2.4 (1.6, 3.3) 2.5 (1.6, 3.4) \nRSW 3.5 (2.6, 4.5) 2.8 (1.9, 3.7) 2.4 (1.4, 3.5) \nDifference in Means 0.6 (í0.7, 2.0) 0.4 (í0.9, 1.7) í0.1 (í1.5, 1.4) \nPatient Confidence (Mobility)    \nUsual Care 2.4 (1.8, 3.0) 2.6 (1.9, 3.3) 2.6 (1.9, 3.3) \nRSW 3.2 (2.3, 4.2) 2.4 (1.5, 3.3) 2.6 (1.7, 3.4) \nDifference in Means 0.9 (í0.3, 2.1) í0.2 (í1.4, 1.0) í0.1 (í1.2, 1.1) \nGHQí12    \nUsual Care 5.0 (2.6, 7.5) 3.3 (1.3, 5.2) 3.5 (0.9, 6.1) \nRSW 4.1 (1.5, 6.8) 4.1 (0.4, 7.9) 6.1 (2.5, 9.8) \nDifference in Means 0.9 (í3.1, 4.8) í0.9 (í5.8, 4.0) í2.6 (í7.7, 2.4) \n \nproviding and confidence in their role. \n3.2.1. Training Issues \nIt emerged that the RSWs had only had limited contact \nwith therapists in their training period (one or two occa- \nsions) and would have been keen to have done more. \nThey were also eager to improve their knowledge of \nstroke, including awareness of the differing outcomes \nbetween strokes. \n3.2.2. Content of the Service \nRSWs’ perceptions of the service they were providing \noften conflicted with what actually happened during their \nvisits. As a result, elements of caring for the patient were \nintroduced to the visits. \n3.2.3. Confidence \nAs a consequence of the conflicts in the content of ser- \nvice, it was felt that more training should be provided \nJ. J. McAdam et al. / Health 5 (2013) 1124-1131 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \n1129\n \nTable 3. For carers in both groups over time mean difference (95% confidence intervals) for confidence in patient transfers, mobility \nand well-being. \n Week 1 Week 6 Week 12 \nCarer Confidence in Patient Transfer    \nUsual Care 2.4 (1.9, 3.0) 2.8 (2.1, 3.4) 2.3 (1.6, 3.0) \nRSW 2.2 (1.4, 3.0) 2.2 (1.3, 3.1) 1.7 (0.6, 2.7) \nDifference in Means í0.2 (í1.2, 0.8) í0.6 (í1.7, 0.6) í0.6 (í1.9, 0.6) \nCarer Confidence in Patient Mobility    \nUsual Care 2.3 (1.6, 3.0) 2.7 (2.1, 3.2) 2.5 (1.9, 3.0) \nRSW 2.1 (1.2, 2.9) 2.3 (1.6, 2.9) 1.7 (0.9, 2.4) \nDifference in Means í0.3 (í1.4, 0.9) í0.4 (í1.3, 0.4) í0.8 (í1.7, 0.2) \nCarer GHQ-12    \nUsual Care 2.3 (0.6, 4.0) 2.6 (1.0, 4.2) 2.5 (0.9, 4.1) \nRSW 4.3 (1.8, 6.8) 4.6 (2.6, 6.6) 3.3 (1.6, 5.0) \nDifference in Means í2.0 (í5.3, 1.4) í2.0 (í4.9, 1.0) í0.8 (í3.3, 1.8) \nCarer Giver Strain    \nUsual Care 3.3 (1.5, 5.1) 5.4 (2.9, 7.9) 5.8 (2.5, 9.1) \nRSW 5.0 (2.6, 7.5) 4.0 (1.2, 6.8) 3.7 (1.7, 5.7) \nDifference in Means í1.7 (í5.1, 1.7) 1.4 (í2.8, 5.5) 2.0 (í2.3, 6.4) \n \nregarding the content of each visit with the patient and \ncarer, including awareness of different exercises and \nother activities. RSWs explained that this would help to \nimprove their confidence in their role as an RSW. \n4. DISCUSSION \nThe trial demonstrated a significant effect on patient \nfunction for the Intervention group at Week 1 post-dis- \ncharge. However, this was not sustained at Weeks 6 or 12 \nand no other significant effects were reported for patient \nor carer outcomes. The trial showed that delivering a \nrandomised trial of rehabilitation support post-discharge \nis feasible. However, there are issues in regards to re- \ncruitment to this type of rehabilitation trial, content of \nthe intervention provided and staff training needs which \nneed to be considered. \nA significant effect was reported for the Intervention \ngroup’s Barthel score at Week 1. However, the results \nshowed no significant difference in patient’s functional \nability at 6 or 12 weeks post-discharge. The initial effect \nat Week 1 may therefore simply be reflecting the read- \njustment phase upon discharge that occurs to both the \nstroke survivor and carer. Previous studies of family \nsupport or carer training have also shown no significant \neffect on patient function [6-9]. The lack of effect in this \ntrial and elsewhere suggests that rehabilitation support of \nthis nature does not directly benefit patient function. \nHowever, this may be due to lack of a clearly defined \nrole for the RSW. Future studies of this nature should be \nclear about the type of rehabilitation activities being un- \nder taken and the process of providing support. \nThere was no significant effect on carer confidence, \ncarer strain or well-being. Similarly, studies of care mod- \nels after stroke, such as early supported discharge or \nfamily support have also failed to improve carer mood \n[9,16,17]. The lack of effect in the carers may be a con- \nsequence of the intervention being tailored to the reha- \nbilitation needs of the stroke survivor with no specific \nintervention to the carer. The intervention as such did not \nfocus on the needs of the carer. Future studies should \nconsider elements of the intervention designed specifi- \ncally to improve carer mood and well-being. \nThe interview findings suggested that RSWs required \nspecific training and development to improve their con- \nfidence in delivering the service and fulfilling their role. \nThe RSW comments suggest that the definition of their \nrole lacked precision. They felt that they needed more \nstroke-specific knowledge and a greater understanding of \nhow to use their time with the patient and carer to greatest \neffect. Training plans and the content of sessions with \npatients and carers need to be carefully identified and \nplanned so that the needs of RSWs, patients and carers \ncan be met. Supervision and guidance of RSWs during \nthe intervention period in the community may also be \nbeneficial in making sure that RSWs are cognisant of \ntheir expectations and comfortable in their role. \nInterviews also suggested that RSWs were acting in a \nJ. J. McAdam et al. / Health 5 (2013) 1124-1131 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \n1130 \ncaring role, rather than an enabling role. Although their \nrole was not designed to act for the patient and carer, \ninterviews revealed certain elements of “caring for” were \nintroduced. A previous study of family care workers \nsuggested that providing support rather than improving \npatients’ coping skills may have contributed to patients in \nthe treatment group being more helpless and possibly \ndepressed [8]. Future studies should include more train- \ning in the enabling philosophy of stroke rehabilitation \nand its supporting evidence. \nThe trial was hampered by the small number of par- \nticipants, a consequence of the difficulty in recruiting \nsuitable patients. Our inclusion/exclusion criteria were \ndesigned to reflect the needs of a patient with a residual \ndeficit returning home with a carer supporting them. \nConsequently, we excluded a large group of patients who \nwere discharged home with a companion and who could \nindependently transfer. Future studies of this nature \nshould consider widening the inclusion criteria to include \npatients who are more mobile but have other difficulties \nrelated to ADLs or IADLs. These patients and their car- \ners may seek benefit from an RSW service in addressing \nrehabilitation needs, e.g. doing housework. \n5. LIMITATIONS \nIn addition to the small number of participants which \nlimited this trial, further limitations became apparent. \nThe choice of primary outcome measure did not take into \nconsideration the full range of activities practised, e.g. \nIADLs. The rehabilitation skills practised may have been \nmore complex than those measured by the Barthel Index \n(e.g. meal preparation, housework) and therefore poten-\ntial benefit may not have been detected. Future work of \nthis nature should employ additional scales to account \nfor these methods. In addition, the nature of the commu- \nnity environment such as provision of other services (e.g. \noutpatient therapy, social input) meant that other factors \nmay have influenced outcomes. Future trials need to \nidentify these factors in their results. The method of col- \nlecting data face-to-face using standardized measures \nwas found to be feasible as in a previous trial of home \nrehabilitation [21]. However, this method may influence \npatients to provide socially desirable answers [22]. \n6. CONCLUSION \nAlthough this feasibility trial does not allow us to \ndraw any firm conclusions as to the effectiveness of a \nrehabilitation support service, it has been vital for in- \nforming further evaluations with regards to the format of \nintervention, i.e. a more clearly defined role (including \nenhanced training and support) for the RSWs. It has also \ninformed us of issues relating to the design of a trial of \nthis nature; the number of participants suitable and the \nuse of suitable outcome measures which accurately re- \nflect a rehabilitation intervention. \n7. CONFLICTS OF INTEREST \nMargaret Crichton is Chair of the local Crossroads or- \nganisation that provided the Rehabilitation Support Work- \ners. \n8. SOURCE OF FUNDING \nRoyal Liverpool & Broadgreen University Hospitals \nNHS Trust R&D support fund and Crossroads Care, Liv- \nerpool, Sefton and Warrington.\u0003 Liverpool Crossroads \nCaring for Carers Ltd is registered as a company limited \nby guarantee in England and Wales No 3334237. Regis- \ntered charity number 1065434 CQC Reg No F020000694. \n \nREFERENCES \n[1] Wolfe, C.D. (2000) The impact of stroke. British Medical \nBulletin, 56, 275-286. doi:10.1258/0007142001903120 \n[2] Walker, M.F., Leonardi-Bee, J., Bath, P., Langhorne, P., \nDewey, M. and Corr, S. (2004) Individual patient data \nmeta-analysis of randomized controlled trials of commu- \nnity occupational therapy for stroke patients. Stroke, 35, \n2226-2232. doi:10.1161/01.STR.0000137766.17092.fb \n[3] Watkins, C.L., Leathley, M.J. and Sharma, A.K. (2002) \nStroke interface audit: Pre/post discharge audit of stroke \nservices and care in Liverpool and Sefton: Delivery time- \nliness and targeting—36 month report. University of \nCentral Lancashire, Preston. \n[4] Garraway, W.M., Akhtar, A.J., Hockey, L. and Prescott, \nR.J. (1980) Management of acute stroke in the elderly: \nFollow-up of a controlled trial. British Medical Journal, \n281, 827-829. \ndoi:10.1136/bmj.281.6244.827 \n[5] Ellis, G., Mant, J., Langhorne, P., Dennis, M. and Winner, \nS. (2010) Stroke liaison workers for stroke patients and \ncarers: An individual patient data meta-analysis. Coch- \nrane Database of Systematic Reviews, 5, CD005066. \n[6] Kalra, L., Evans, A., Perez, I., Melbourn, A., Patel, A., \nKnapp, M. and Donaldson, N. (2004) Training carers of \nstroke patients: Randomised controlled trial. British \nMedical Journal, 328, 1099-1103. \ndoi:10.1136/bmj.328.7448.1099 \n[7] Mant, J., Carter, J., Wade, D.T. and Winner, S. (2000) \nFamily support for stroke: A randomised controlled trial. \nLancet, 356, 808-813. \ndoi:10.1016/S0140-6736(00)02655-6 \n[8] Dennis, M., O’Rourke, S., Slattery, J., Staniforth, T. and \nWarlow, C. (1997) Evaluation of a stroke family care \nworker: Results of a randomised controlled trial. British \nMedical Journal, 314, 1071-1076. \ndoi:10.1136/bmj.314.7087.1071 \n[9] Lincoln, N.B., Francis, V.M., Lilley, S.A., Sharma, J.C. \nand Summerfield, M. (2003) Evaluation of a stroke fam- \nJ. J. McAdam et al. / Health 5 (2013) 1124-1131 \nCopyright © 2013 SciRes.                                 Openly accessible at http://www.scirp.org/journal/health/ \n1131\nily support organiser: A randomized controlled trial. \nStroke, 34, 116-121. \ndoi:10.1161/01.STR.0000047850.33686.32 \n[10] Kubina, L.A., Dubouloz, C.J., Davis, C.G., Kessler, D. \nand Egan, M.Y. (2013) The process of re-engagement in \npersonally valued activities during the two years follow- \ning stroke. Disability and Rehabilitation, 35, 236-243. \ndoi:10.3109/09638288.2012.691936 \n[11] Dennis, M., O’Rourke, S., Lewis, S., Sharpe, M., Warlow, \nC. (1998) A quantitative study of the emotional outcome \nof people caring for stroke survivors. Stroke, 29, 1867- \n1872. doi:10.1161/01.STR.29.9.1867 \n[12] Bugge, C., Alexander, H. and Hagen, S. (1999) Stroke \npatients’ informal caregivers. Patient, caregiver and ser- \nvice factors that affect caregiver strain. Stroke, 30, 1517- \n1523. doi:10.1161/01.STR.30.8.1517 \n[13] Rouillard, S., De Weerdt, W., De Wit, L. and Jelsma, J. \n(2012) Functioning at 6 months post stroke following \ndischarge from inpatient rehabilitation. South African \nMedical Journal, 102, 545-548. \n[14] Talbot, L.R., Viscogliosi, C., Desrosiers, J., Vincent, C., \nRousseau, J. and Robichaud, L. (2004) Identification of \nrehabilitation needs after a stroke: An exploratory study. \nHealth and Quality of Life Outcomes, 2, 53-61. \ndoi:10.1186/1477-7525-2-53 \n[15] Cameron, J.I., Naglie, G., Silver, F.L. and Gignac, M.A.M. \n(2013) Stroke family caregivers’ support needs change \nacross the care continuum: A qualitative study using the \ntiming it right framework. Disability and Rehabilitation, \n35, 315-324. doi:10.3109/09638288.2012.691937 \n[16] Langhorne, P., Taylor, G., Murray, G., Dennis, M., An- \nderson, C., Bautz-Holter, E., Dey, P., Indredavik, B., Ma- \nyo, N., Power, M., Rodgers, H., Ronning, O.M., Rudd, A., \nSuwanwela, N., Widen-Holmqvist, L. and Wolfe, C. (2005) \nEarly supported discharge services for stroke patients: A \nmeta-analysis of individual patients’ data. Lancet, 365, \n501-506. \n[17] Tilling, K., Coshall, C., McKevitt, C., Daneski, K. and \nWolfe, C. (2005) A family support organiser for stroke \npatients and their carers: A randomised controlled trial. \nCerebrovascular Diseases, 20, 85-91. \ndoi:10.1159/000086511 \n[18] Wade, D.T. and Collin, C. (1988) The Barthel ADL index: \nA standard measure of physical disability? International \nDisability Studies, 10, 64-67. \ndoi:10.3109/09638288809164105 \n[19] Goldberg, D.P. and Hillier, V.F. (1979) A scaled version \nof the General Health Questionnaire. Psychological Me- \ndicine, 9, 139-145. doi:10.1017/S0033291700021644 \n[20] Robinson, B.C. (1983) Validation of a caregiver strain \nindex. The Journals of Gerontology, 38, 344-348. \ndoi:10.1093/geronj/38.3.344 \n[21] Anderson, C., Rubenach, S., Mhurchu, C.N., Clark, M., \nSpencer, C. and Winsor, A. (2000) Home or hospital for \nstroke rehabilitation? Results of a randomized controlled \ntrial: 1: Health outcomes at 6 months. Stroke, 31, 1024- \n1031. doi:10.1161/01.STR.31.5.1024 \n[22] Duffy, B., Smith, K., Terhanian, G. and Bremer, J. (2005) \nComparing data from online and face-to-face surveys. \nInternational Journal of Market Research, 47, 615-639. \n \n",
    "Link": "https://core.ac.uk/download/19901622.pdf"
}