{
    "Title": "Effect of insulin glargine on cardiovascular risk analysed by mean HRV",
    "Authors": "Apicella, G., Dalmaso, S., Marchitto, N., Marcinnò, M., Petrucci, A., Raimondi, G.",
    "Year": "No year available",
    "Abstract": "Type 2 diabetes mellitus is an insidious disease that is increasingly present in geriatric population [1]. The greatest difficulty is represented by glycaemic control in geriatric patients often not very compliant with diet therapy and drug therapy. A new insulin glargine 300 units/ml formulation seems im- prove patient compliance due to the lower volume of insulin to be injected and improved glycaemic control over 24 hours. The HRV signal, derived from digital electrocardiographic recording, is the simplest and most imme- diate analysis that consists in calculating some temporal parameters [2]. HRV is a simple statistics derived from beat-beat intervals of sinus origin expressed as units of time in milliseconds. Data in the literature indicate that a decrease in HRV, measured with time domain analysis, denotes a worse prognosis and/or an increased risk of mortality in patients with heart disease, especially in the elderly ones",
    "Keywords": "No keywords available",
    "Publisher": "'Scientific Research Publishing, Inc.'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Health, 2019, 11, 20-24 \nhttp://www.scirp.org/journal/health \nISSN Online: 1949-5005 \nISSN Print: 1949-4998 \n \nDOI: 10.4236/health.2019.111003  Jan. 11, 2019 20 Health \n \n \n \n \nEffect of Insulin Glargine on Cardiovascular \nRisk Analysed by Mean HRV \nMarchitto Nicola1*, Marcinnò Mariaconcetta2, Petrucci Alessia2, Apicella Giovanni2,  \nDal Maso Serenella Gioia1, Raimondi Gianfranco3  \n1Internal Medicine Department, Alfredo Fiorini Hospital, Terracina, Italy \n2Nursing Department, Sapienza University of Rome, Rome, Italy \n3Department of Medico-Surgical Sciences and Biotechnologies, Sapienza University of Rome, Rome, Italy  \n \n \n \nAbstract \nType 2 diabetes mellitus is an insidious disease that is increasingly present in \ngeriatric population [1]. The greatest difficulty is represented by glycaemic \ncontrol in geriatric patients often not very compliant with diet therapy and \ndrug therapy. A new insulin glargine 300 units/ml formulation seems im-\nprove patient compliance due to the lower volume of insulin to be injected \nand improved glycaemic control over 24 hours. The HRV signal, derived \nfrom digital electrocardiographic recording, is the simplest and most imme-\ndiate analysis that consists in calculating some temporal parameters [2]. HRV \nis a simple statistics derived from beat-beat intervals of sinus origin expressed \nas units of time in milliseconds. Data in the literature indicate that a decrease \nin HRV, measured with time domain analysis, denotes a worse prognosis \nand/or an increased risk of mortality in patients with heart disease, especially \nin the elderly ones.  \n \nKeywords \nInsulin Glargine, Diabetes, HRV, Cardiovascular Risk, Geriatry \n \n1. Background \nType 2 diabetes mellitus is increasingly present geriatric population [1]. Re-\ncently, a new 300 units/ml insulin glargine formulation has been introduced in \nclinical practice to improve patient compliance due to lower volume of insulin to \nbe injected and improved glycemic control within 24 hours. The HRV signal, \nderived from digital electrocardiographic recording, allows us to calculate some \ntemporal parameters [2]. Data in the literature indicate that a decrease in HRV, \nHow to cite this paper: Nicola, M., Ma-\nriaconcetta, M., Alessia, P., Giovanni, A., \nGioia, D.M.S. and Gianfranco, R. (2019) \nEffect of Insulin Glargine on Cardiovascu-\nlar Risk Analysed by Mean HRV. Health, \n11, 20-24. \nhttps://doi.org/10.4236/health.2019.111003 \n \nReceived: October 17, 2018 \nAccepted: January 8, 2019 \nPublished: January 11, 2019 \n \nCopyright © 2019 by author(s) and  \nScientific Research Publishing Inc. \nThis work is licensed under the Creative \nCommons Attribution International  \nLicense (CC BY 4.0). \nhttp://creativecommons.org/licenses/by/4.0/   \n  Open Access\nM. Nicola et al. \n \n \nDOI: 10.4236/health.2019.111003 21 Health \n \nmeasured by the analysis of the time domain, shows a worse prognosis in par-\nticular in the elderly. \n2. Aim \nThe aim of our study is to evaluate, through the Heart Rate Variability study, the \npossible influence of the new insulin glargine formulation 300 units/ml [3] on \nthe neurovegetative tone and on the arrhythmic cardiovascular risk. \n3. Materials and Methods \nIn the period between February 2018 and April 2018 we enrolled 30 patients. 5 \npatients (16.6%) are not compliant and therefore the real number of enrolled pa-\ntients is 25 (13 male and 12 female) with an average age of 75 ± 13 years with \ntype II diabetes mellitus. All patients gave their informed consent and ethical \napproval. In the enrolment phase, the patients underwent the evaluation of the \nglycaemic profile at 20.00 by means of glucostick and the subsequent digital \nelectrocardiographic recording by means of a Medixai electrocardiograph. Elegi-\nbility patient have diabetes mellitus treated with insulin glargine. Exclusion cri-\nteria are the presence of atrial fibrillation for BIAS in HRV evaluation. At the \nend of the enrolment, the patients were treated with the new insulin glargine \nformulation 300 units/ml at the same dosage as the old insulin glargine. After 1 \nhour from insulin administration, the patients were again subjected to the \nevaluation of the glycaemic profile by means of glucostick and to the subsequent \nrecording of digital control electrocardiography. The pre and post-treatment gly-\ncaemic values were used as a parameter to confirm the action of insulin glargine, \nadministered to patients. \nThe analysis of the HRV in the time domain was performed using the Kubios \nsoftware for Windows XP. For this study were used statistical parameters of STD \nvariability or standard deviation of the R-R intervals with respect to the mean; \nNN50 or number of consecutive intervals with difference > 50 msec; pNN50 or \npercentage of the NN50 intervals compared to the total of the measured intervals \n(a threshold of 20 msec can demonstrate superior discrimination between physio-\nlogical and pathological HRV) [4]; RMSSD or square root of the mean squared \ndifferences between adjacent R-R intervals; SDNN or calculation of the standard \ndeviation of a series of intervals NN, AR LF/HF or regression analysis of the \nLF/HF ratio. Statistical analysis was performed with Paired T-test for small group \nof the patients using the Sigmastat 3.5 software for windows XP. \n4. Results \nThe results of our study have shown that the new formulation of insulin glargine \n(300 units/ml) [5], even though it has determined a statistically significant re-\nduction in glycaemic values due to insulin glargine activity (Table 1) before the \nelectrocardiographic recording performed as a control, and a statistically signif-\nicant increase of the Heart Rate index of a reduction in heart rate frequencies  \nM. Nicola et al. \n \n \nDOI: 10.4236/health.2019.111003 22 Health \n \nTable 1. Descriptive statistics: RRvar STD (standard deviation of the R-R intervals com-\npared to the mean); NN50 (number of consecutive intervals with difference > 50 msec); \npNN50 (percentage of the NN50 intervals with respect to the total of the measured inter-\nvals, with a threshold of 20 msec); RMSSD (square root of the average of the squared dif-\nferences between adjacent R-R intervals); SDNN (calculation of the standard deviation of \na series of intervals NN); AR LF/HF (regression analysis of the LF/HF ratio). “*”: statisti-\ncally significant changes. \n Base ± DS Control ± DS Probability (P) \nGlucose (mg/dl) 242.500 ± 77.768 190.500 ± 72.109 P < 0.001* \nRR var (ms) 811.717 ± 176.049 839.942 ± 177.081 P = 0.035* \nNN50 (ms) 58.542 ± 66.835 61.833 ± 69.133 P = 0.691 \npNN50 23.242 ± 26.540 23.600 ± 26.317 P = 0.892 \nRMSSD 53.600 ± 46.600 57.508 ± 54.778 P = 0.577 \nSDNN 43.271 ± 36.614 43.500 ± 41.433 P = 0.961 \nAR LF/HF 1.457 ± 1.965 1.390 ± 2.208 P = 0.910 \n \n(Table 1), but does not establish any statistically significant changes in neurove-\ngetative tone, that would negatively affect the cardiovascular risk in geriatric pa-\ntients with multiple co-morbidities. \n5. Discussion \nInsulin glargine is a human insulin analog designed to have a low pH neutral \nsolubility while the solubility is highest for pH values equal to 4. After subcuta-\nneous injection, the acidic insulin solution is neutralized giving rise to the for-\nmation of precipitate insulin which gradually releases small amounts of insulin \nglargine. \nThe administration of the new insulin glargine formulation (300 units/ml) al-\nlows improving the glycaemic profile in 24 hours as reported by the pharmaco-\ndynamic studies that have shown how the insulin effect persists up to 36 hours, \ndue to the prolonged release of insulin glargine from the precipitate of this new \nformulation. This can be attributable to the reduction in injection volume of \nabout 2/3. Such reduction in injection volume leads to a decrease in the area of \nthe precipitate responsible for the release of soluble glargine insulin. The dosage \nof the new insulin glargine can be optimized by adding 10% - 20% of the usual \ndosage of the old-generation insulin glargine (100 units/ml) since the insulin \nglargine of the old generation (100 units/ml) and the new formulation of insulin \nglargine (300 units/ml) are not bioequivalent and are not directly interchangea-\nble. \nM. Nicola et al. \n \n \nDOI: 10.4236/health.2019.111003 23 Health \n \nAccording to the data sheet, the dosage of the new generation glargine insulin \n(300 units/ml) can be calculated with the formula 0.2 units/kg of body weight or \nincreasing the dosage of the new generation insulin by 10% - 20% (300 units/ml) \ncompared to the old glargine insulin dosage (100 units/ml). The new insulin \nglargine formulation ensure a good control of glycaemia [6] and ensure a neu-\ntrality in terms of effects on arrhythmic cardiovascular risk, which represent a \nhighly represented problem in the geriatric population affected by co-morbidities \nsuch as heart failure, atrial fibrillation and electrolyte disorders, concomitant \nwith chronic renal function abnormalities. \n6. Conclusion \nPreliminary data obtained from our study shown that the new insulin glargine \nformulation 300 units/ml represents a new therapeutic option that allows im-\nproving the glycaemic profile (Figure 1), given the best solubility in relation to \nthe minor surface of the precipitate [6] and improve with a statistically signifi-\ncant variation the RR-variability (confirmed by the data deriving from the analy-\nsis of the RR variability index) (Figure 2) without altering the neurovegetative \nstructure and therefore the cardiovascular risk (confirmed by the data deriving \nfrom the regression analysis of the LF/HF ratio). Our data give comfortable re-\nsults but further evaluations are needed to have conclusive results. \n \n \nFigure 1. Descriptive statistics about glucose value. “*”: statistically significant changes. \n \n \nFigure 2. Descriptive statistics about R-R variability index. “*”: statistically significant \nchanges. \nM. Nicola et al. \n \n \nDOI: 10.4236/health.2019.111003 24 Health \n \nAcknowledgements \nThe authors are particularly grateful to Petrucci Alessia for English translation \nand Marchitto Lino, Maisano Carla Maria and Marchitto Federica for organiza-\ntional aspects.  \nConflicts of Interest \nThe authors declare no conflicts of interest regarding the publication of this pa-\nper. \nReferences \n[1] Bellettiere, J., Healy, G.N., LaMonte, M.J., Kerr, J., Evenson, K.R., Rillamas-Sun, E., \nDi, C., Buchner, D.M., Hovell, M.F. and LaCroix, A.Z. (2018) Sedentary Behavior \nand Prevalent Diabetes in 6,166 Older Women: The Objective Physical Activity and \nCardiovascular Health Study. The Journals of Gerontology: Series A.  \nhttps://doi.org/10.1093/gerona/gly101  \n[2] Khandoker, A.H., Al-Angari, H.M., Khalaf, K., Lee, S., Almahmeed, W., Al Safar, \nH.S. and Jelinek, H.F. (2017) Association of Diabetes Related Complications with \nHeart Rate Variability among a Diabetic Population in the UAE. PLoS ONE, 12, \ne0168584. https://doi.org/10.1371/journal.pone.0168584 \n[3] Liu, W., Yang, X. and Huang, J. (2018) Efficacy and Safety of Insulin Degludec ver-\nsus Insulin Glargine: A Systematic Review and Meta-Analysis of Fifteen Clinical \nTrials. International Journal of Endocrinology, 2018, Article ID: 8726046. \n[4] Conde, C.A., Villa, M.M., Nino, C.A., Mojica, E. and Acevedo, J. (2016) Heart Rate \nVariability Parameters and the PNNX Family as Discriminators between Athletes \nand Sedentary People. Journal of Physical Education and Sport (JPES), 16, 1316-1325.  \n[5] Shields, A. and Sankaranarayanan, S. (2016) Basal Insulin Regime Change from \nLantus to Toujeo Resulted in Fewer Hypoglycaemic Episodes in a 28-Year-Old Man \nwith Diabetes Mellitus. BMJ Case Reports, 2016.  \nhttps://doi.org/10.1136/bcr-2016-215831 \n[6] Scheen, A.J. (2016) [INSULIN GLARGINE 300 U/mL (TOUJEO®)]. Revue médicale \nde Liège, 71, 101-107. (In French)  \n \n \n",
    "Link": "https://core.ac.uk/download/195777579.pdf"
}