{
    "Title": "Coastal Adaptation Technologies",
    "Authors": "Framework Convention on Climate Change,, Peake, Stephen",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Food and Agriculture Organization of the United Nations (FAO)'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Open Research OnlineThe Open University’s repository of research publicationsand other research outputsCoastal Adaptation TechnologiesOtherHow to cite:Framework Convention on Climate Change (1999). Coastal Adaptation Technologies. United Nations, Bonn.For guidance on citations see FAQs.c© 1999 United NationsVersion: Version of RecordLink(s) to article on publisher’s website:https://unfccc.int/resource/docs/tp/tp0199.pdfCopyright and Moral Rights for the articles on this site are retained by the individual authors and/or other copyrightowners. For more information on Open Research Online’s data policy on reuse of materials please consult the policiespage.oro.open.ac.ukUNITED NATIONSDistr.RESTRICTEDFCCC/TP/1999/125 May 1999ENGLISH ONLYTECHNICAL PAPERCoastal adaptation technologiesGE.99-FCCC/TP/1999/1Page 2CONTENTSParagraphs PageI. INTRODUCTION . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  1- 16 4A. Background  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1 - 3 4B. Context for adaptation technologies  . . . . . . . . . . . . . . . 4 - 8 4C. Objectives and scope of the technical paper  . . . . . . . . .   9 - 13 5D. Review process  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14 - 16 6II. INFORMATION ON THE IMPACTS OF SEA-LEVELRISE AS WELL AS ADAPTATION OPTIONS ANDTECHNOLOGIES REPORTED IN NATIONALCOMMUNICATIONS . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 17 - 18 7III. DESCRIPTION OF COASTAL ADAPTATION TECHNOLOGIES . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19 - 21 8IV. COASTAL ADAPTATION TECHNOLOGY NEEDS . . . . . . 22 - 44 9A. Technology needs are dynamic, incremental and unpredictable - like the coastal zone itself  . . . . . . . . . . 24 - 26 9B. Technology needs are determined by the relative scaleof the problem and availability of resources . . . . . . . . . 27 - 32 10C. Technology needs are influenced by differing nationaland regional circumstances  . . . . . . . . . . . . . . . . . . . . . . 33 - 39 10D. Status of relevant institutional capacity and availability of appropriate training  . . . . . . . . . . . . . . . . . . . . . . . . . . 40 - 42 12E. Coastal adaptation technologies research anddevelopment needs . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 43 - 44 13V. DEVELOPMENT AND TRANSFER OF COASTALADAPTATION TECHNOLOGIES  . . . . . . . . . . . . . . . . . . . . . 45 - 59 15A. How coastal adaptation technologies are developed . . . 45 15B. National coastal construction and maintenanceprogrammes  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 46 - 49 15C. Publicly funded coastal engineering research  and development  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 50 - 52 16D. How coastal adaptation technologies are transferred . . . 53 17FCCC/TP/1999/1Page 3CONTENTSParagraphs PageE. Coastal projects carried out by internationally operatingprivate sector coastal consulting engineers andconstruction companies . . . . . . . . . . . . . . . . . . . . . . . . . 54 - 56 17F. Training engineers from developing countries at centresof excellence in countries with a coastal engineeringtradition . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 57 - 59 20  VI. BARRIERS TO THE DEVELOPMENT AND TRANSFEROF COASTAL ADAPTATION TECHNOLOGIES  . . . . . . . . 60 - 63 20A. Sectoral barriers to the development and transfer ofcoastal adaptation technologies . . . . . . . . . . . . . . . . . . . 61 - 62 21B. Specific barriers to the transfer of coastal adaptationtechnologies to developing countries . . . . . . . . . . . . . . . 63 24VII. OPTIONS TO ACCELERATE AND SUSTAIN THE DEVELOPMENT AND TRANSFER OF COASTALADAPTATION TECHNOLOGIES . . . . . . . . . . . . . . . . . . . . . 64 - 74 25 REFERENCES . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 31AnnexesI. UNFCCC Expert Meeting on Coastal Adaptation Technologies 33II. Information on the impacts of sea-level rise as well as adaptationoptions and technologies reported in national communications 35III. Description of coastal adaptation technologies . . . . . . . . . . . . . 38IV. Overview of coastal zone management and engineeringcentres:  a pilot survey  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 48FCCC/TP/1999/1Page 4I.  INTRODUCTIONA.   Background1. At its second and third sessions, the Conference of the Parties requested the secretariat toprepare reports on adaptation technologies and to continue its work on the synthesis anddissemination of information on environmentally sound technologies and know-how conduciveto mitigating, and adapting to, climate change (FCCC/CP/1996/15/Add.1, decision 7/CP.2 andFCCC/CP/1997/7/Add.1, decision 9/CP.3).2. At its eighth session, the Subsidiary Body for Scientific and Technological Advice(SBSTA), encouraged the secretariat to continue its work on different adaptation topics  (FCCC/SBSTA/1998/6, para. 58 (h)).  These topics were identified at a UNFCCC expert meetingon adaptation technologies held in conjunction with an Intergovernmental Panel on ClimateChange (IPCC) meeting on adaptation in Amsterdam from 20 to 22 March 1997(FCCC/SB/1997/3, annex II) and are the subject of a series of technical reports on adaptationtechnology in accordance with the work programme (FCCC/CP/1997/INF.1).3. An earlier technical paper provided on overview on adaptation technologies (FCCC/TP/1997/3).  This technical paper expands upon the overview paper, focusing on variousaspects of the development and transfer of coastal adaptation technologies in the context of thespecific circumstances and special situations of small island states and countries with low-lyingcoastal areas. B.  Context for adaptation technologies4. Human and ecological systems adapt to the negative effects of climate change, includingchanges in climate extremes and  climate variability, through a combination of technological andbehavioural adjustment.  The IPCC Second Assessment Report describes the three basic responsestrategies to sea-level rise:  retreat (managed), accommodation and protection.  The SAR alsoidentifies the six main biophysical adverse effects of sea-level rise as:  increased flood frequency,erosion, inundation, rising water-tables, salt-water intrusion and biological effects.5. Technologies which help reduce the impacts of climate change can themselves causeother problems.  Coastal zone adaptation technologies are a good example.  Many of thetechnologies incorporated within, or needed to implement, managed retreat from,accommodation of, or protection against, rising sea levels can have adverse social, economic orenvironmental consequences, often even when diligently executed (most hard structures such assea walls have deleterious effects upon local ecosystems, including, in the case of many smallislands, for example, fisheries and coral reefs).  Few, if any, coastal adaptation technologies haveno negative side-effects.  Under certain circumstances these unintended side-effects canoutweigh the benefits of a particular coastal adaptation technology.FCCC/TP/1999/1Page 56. Where possible, the paper attempts to highlight the drawbacks of particular technologies.The consideration and selection of appropriate coastal adaptation technologies is part of thewider context of the assessment of coastal adaptation options such as those described in thecoastal zone chapter of the United Nations Environment Programme (UNEP) Handbook onMethods for Climate Change Impacts Assessment and Adaptation Strategies (Klein and Nicholls,1998) and other relevant literature (e.g., Klein et al., 1999).7. None of the coastal adaptation technologies described in this paper are in any wayendorsed as appropriate or sustainable.  The suitability of a particular adaptation technology ishighly sensitive to local conditions, priorities and choices.  In turn, as this paper stresses, coastalzone planning and decision-making require adequate institutional capacity. 8. Nevertheless, the development and transfer of appropriate coastal adaptation technologiescan potentially help lower the cost and expand the scope of options available to adapt to sea-levelrise and associated effects.C.  Objectives and scope of the technical paper9. The purpose of this paper is to identify options to accelerate and sustain the developmentand transfer of coastal zone adaptation technologies to assist countries in planning for, andadapting to, sea-level rise and its associated effects. 10. Possible users of the information provided in this technical paper include the range ofdifferent stakeholders making up the community active in making decisions relating to thesustainable management of the coastal zone. These stakeholders include development banks,other loan providers and aid agencies, intergovernmental organizations, government (national,regional and local), universities, the private sector (including insurance companies) andnon-governmental organizations (see section VII). 11. The paper seeks to address the following key questions:   • What technologies are available to respond to the problem of sea-level rise and itsassociated effects?• What new technologies are needed? • How are coastal adaptation technologies developed and transferred?• What are the barriers to the development and transfer of new technologies?• What options should be considered to accelerate the development and transfer ofsuch technologies?12. The paper:• Provides information on coastal impacts and adaptation options reported innational communications; • Describes a range of examples of coastal adaptation technologies that are in use orhave been demonstrated; FCCC/TP/1999/1Page 61     Chapter 7 of the Working Group I report, ‘Changes in Sea Level’, and chapter 9 of the Working Group IIreport ‘Coastal Zones and Small Islands’.2      In addition, the UNFCCC secretariat is grateful to the following experts who did not attend the expert meetingbut who were interviewed or provided written comments on various drafts of this paper:  William Allsop,Robert Dean, Chris Fleming, Jim Hall, Malcolm Hendry, Richard Klein, Jon McCue, Nobuo Mimura, RobertNicholls and Darren Price.  3     The aim of PICCAP to assist participating Pacific island developing countries to prepare nationalcommunications.  PICCAP has included a number of meetings and workshops and has generated considerableamounts of information relating to vulnerability and adaptation in the Pacific islands context.  The CPACC projectis an initiative of the Organization of American States (OAS) and the GEF to support Caribbean countries inpreparing to cope with the adverse effects of global climate change, particularly sea-level rise in coastal and marineareas, through vulnerability assessment, adaptation planning and capacity-building.• Identifies examples of coastal adaptation technology needs; • Describes how these technologies are developed and transferred; • Provides a preliminary review of the status of institutional capacity regardinginternational and regional coastal engineering and coastal zone management; and• Identifies barriers to and options for the  acceleration of the development andtransfer of coastal adaptation technologies. 13. The paper does not attempt to summarize the work of the IPCC on the science ofsea-level rise, or the impacts of sea-level rise in different regions.  The executive summaries ofthese topics can be found in the IPCC Second Assessment Report1 (IPCC, 1995a and 1995b).Further information is also contained in the IPCC report, Regional Impacts of Climate Change(IPCC, 1998). D.  Review process14. This paper draws significantly on information provided by experts.  A preliminary draftof this technical paper was peer-reviewed at a UNFCCC expert meeting on coastal adaptationtechnologies held at the Convention secretariat in Bonn, 22-23 March 1999 (referred to below asthe “UNFCCC coastal adaptation expert meeting”).  The current version has been prepared bythe secretariat and incorporates the comments and suggestions from participants at the expertmeeting (see annex I).215. The meeting was attended by experts from nine countries (Barbados, China, Fiji,Netherlands, Sierra Leone, the United Kingdom of Great Britain and Northern Ireland, theUnited Republic of Tanzania, the United States of America and Uruguay).  Three of the expertsattended as representatives of important regional and global initiatives relating to coastaladaptation.  The experts from Fiji and Barbados, respectively, represented the situations of islandstates participating in the Pacific Island Climate Change Action Programme (PICCAP), fundedby the Global Environment Facility (GEF), and the Caribbean Planning for Adaptation toClimate Change initiative (CPACC).3  These projects are examples of regional approaches which FCCC/TP/1999/1Page 74     This summary of information on coastal impacts and adaptation options contained in the nationalcommunications of the first 11 non-Annex I Parties is unlikely to be representative of the much larger group of over130 non-Annex I Parties, approximately half of which are coastal nations or small island states. have significantly contributed to information dissemination and capacity-building in relation tovulnerability and adaptation. 16. The expert from the United States of America attended as a lead author of the coastaladaptation technologies chapter of the IPCC Special Report on Methodological andTechnological Issues in Technology Transfer.  In some instances, the paper draws upon and citesinformation provided by IPCC lead authors who are also contributors to the coastal chapter ofthis IPCC special report, due to be completed in 2000.II.  INFORMATION ON THE IMPACTS OF SEA-LEVEL RISEAS WELL AS ADAPTATION OPTIONS AND TECHNOLOGIESREPORTED IN NATIONAL COMMUNICATIONS17. Annex II provides a summary of impacts and adaptation response measures reported inthe first national communications4 of 11 non-Annex I countries submitted (as of 1 April 1999),as well as the second national communications of 20 Annex I countries.18. The information provided in annex II may be synthesized as follows:• Six of the national communications of the 11 non-Annex I countries reportimpacts due to sea-level rise (inundation of low-lying coastal areas, loss of coastalecosystems), as well as associated response measures.  Among these, three (theFederated States of Micronesia, Senegal and Uruguay) cite adaptation measuresrelating to coastal adaptation technologies;• Two non-Annex I countries (Senegal and the Federated States of Micronesia)provide monetary estimates of the costs of protection using coastal adaptationtechnologies;• Twenty Annex I countries report impacts related to sea-level rise and itsassociated effects in their second national communications; the most frequentlycited impacts include increased likelihood of inundation of low-lying coastalareas, accelerated coastal erosion, changes in sediment budgets, saline intrusion,and damage to coastal structures; and• Nine Annex I countries report that they have already developed, or were in theprocess of developing, strategic approaches to the development of a coastal zoneadaptation strategy (Denmark, Greece, Iceland, Ireland, Netherlands, NewZealand, Poland, Portugal and the United States of America).  Three countriesprovide monetary estimates of the cost of protection (Ireland, Japan and Poland).FCCC/TP/1999/1Page 85     Coasts of Pacific Islands, SOPAC Miscellaneous Report 222, 1996. Coastal Protection in the Pacific Islands: Current Trends and Future Prospects, SOPAC Miscellaneous Report 177, 1993.III.  DESCRIPTION OF COASTAL ADAPTATION TECHNOLOGIES19. An array of technologies exists to support various adaptation options available to respondto different adverse effects of sea-level rise.  Technologies can be divided into three groups:• Technologies which enhance understanding of the basic geomorphologicalcharacteristics of the coast as well as its dynamic processes (annex III, table 1),including:  data gathering (gauges, sensors, remote sensing and monitoring),management and decision technologies (Geographic Information Systems,models, databases);• Technologies which are incorporated within, or required to carry out, theimplementation of the three main coastal adaptation options (annex III, table 2): managed retreat (e.g. movable structures, rolling easements, inland flooddefences, flood warning systems), accommodation (e.g. reservoir relocation, dunemanagement, rain/waste-water management) or protection (includes a wide arrayof technologies available to coastal engineers to stabilize a coastline, includingsoft technologies such as beach nourishment as well as hard structures such as seawalls, revetments, groynes) (e.g., Pilarczyk, 1990 and 1992; Scott et al., 1993;Tanimoto and Goda, 1992); and• Technologies which are new, unproven, and which have not yet reached maturity(annex III, table 3):  Examples include offshore reefs, berm breakwaters, bubblecurtains, floating breakwaters, and wave energy devices.  These are notnecessarily ‘heavy’ engineering, but certainly more sophisticated structures andsystems requiring careful attention to boundary conditions, advanced engineeringdesign and construction supervision (e.g., Pilarczyk, 1994).20. Tables 1-3 in annex III have been compiled with inputs from the UNFCCC coastaladaptation expert meeting as well as from a review of coastal engineering and protectionliterature (see bibliography), in particular the South Pacific Applied Geoscience Commission(SOPAC) reports5 Coasts of Pacific Islands  and Coastal Protection in the Pacific Islands: Current Trends and Future Prospects, and other sources.  The list also draws upon the workbeing undertaken by lead authors of the coastal adaptation technologies chapter of the IPCCSpecial Report on Methodological and Technological Aspects of Technology Transfer. 21. The tables provide a short description of each coastal adaptation technology and, whereappropriate, other information relating to applications, costs, drawbacks and otherconsiderations.  The coastal adaptation technologies covered in the tables vary widely in cost,sophistication, maintenance requirements and technical capacity needed to implement andmaintain them.FCCC/TP/1999/1Page 9IV.  COASTAL ADAPTATION TECHNOLOGY NEEDS22. A number of factors may influence the technology needs of coastal nations. The following four factors are discussed below:• The dynamic and incremental nature of the coastal zone itself;• The relative scale of the coastal zone problem and availability of resources;• Different national and regional circumstances; and• Status of relevant institutional capacity and availability of appropriate training.23. In addition, a number of specific gaps in relation to the research and development needsidentified by the UNFCCC coastal adaptation expert meeting are listed.A.  Technology needs are dynamic, incremental andunpredictable - like the coastal zone itself24. Coasts are narrow and fragile by nature, prone to fracture due to attacks from both theland and the sea.  Whether managed or not, the coastal zone is not static, but a dynamic,unpredictable, adaptive and interdependent set of subsystems.  While this idea is wellinternalized within the coastal zone engineering and management community, thesecharacteristics are frequently ignored in the planning, design and implementation of coastalprojects.  Identifying specific technologies needed to respond to sea-level rise is therefore acomplex task.  This partly explains why there is often no consensus about how to deal with thecomplexity of social and economic issues surrounding choices of appropriate coastal adaptationtechnologies.  25. The dynamism of the coastal zone is both a problem and an opportunity for coastalmanagers.  On the one hand, it can be difficult to model and predict the effectiveness of aparticular coastal adaptation technology, or indeed the positive or negative side-effects associatedwith the technology.  Moreover, most existing coastal zone problems are the result of acumulative set of maladaptive practices (e.g. development in hazardous zones, the use ofinappropriate coastal adaptation technologies and sand mining).  Coastal structures typically have design lives in the order of decades (UNEP, 1998).  Such structures can therefore havelong-term effects (positive and negative and in some cases irreversible) on the coast. 26. On the other hand, a series of positive incremental changes can result in cumulativereductions in the vulnerability of the coast to sea-level rise.  “No regrets”  (reversible/experimental/empirical) responses that maintain or enhance choices available in the future aretherefore important coastal adaptation technologies deserving particular priority (Klein andNicholls, 1998).FCCC/TP/1999/1Page 10B.  Technology needs are determined by the relativescale of the problem and the availability of resources27. The issue of climate change and sea-level rise is new to coastal engineering.  Changes inthe magnitude and frequency of storm surges, cyclones and coastal erosion are all likely. General and intuitive engineering assumptions include the idea that the direct effects of sea-levelrise will be that deep-water waves become more extreme, and that changes in wave and windregimes may also be accelerated/affected.  The development of new technologies or innovationsbased on combinations of existing technologies may help to expand the scope of sustainablecoastal adaptation options available.28. Is sea-level rise a difficult problem for the coastal engineering community to solve? At one level the answer is no, not particularly.  As Dean (1987) puts it:   “When not restrained by funding, availability of materials, or work force, construction ofalmost any conceivable protection against sea-level rise can be carried out in a very shorttime; short, that is, relative to the rate of sea-level rise” (National Research Council,1987, p. 124). 29. Of course, in practice, limited funds are available for coastal adaptation technologieswhich tend to be very expensive to build and maintain. 30. While the scale of the challenge that sea-level rise poses to the coastal scientists, plannersand engineers may indeed be much larger than past experience, on a site by site basis,  it isunlikely that problems will be encountered which are more severe than those faced at present.31. While the coastal science, planning and engineering community will be able  toincorporate sea-level rise into future plans and decisions, including the design bases of futurecoastal structures, the prospects for significant changes in the hard technologies used in thecoastal engineering community are not great.  This is partly because hard technologies are notscalable (see section VI below).  It is also unlikely that much can be done to reduce the cost ofconcrete and steel, pumps and dredgers.  However there may be significant opportunities toreduce the cost of many of the soft technologies.32. Today’s array of coastal adaptation technologies suggests it is infeasible to contemplateresponding to sea-level rise by relying on the coastal protection option alone.  However, whilenations continue to contemplate how best to respond, the coastal planning and engineeringcommunity may adapt by seeking incremental improvements in existing technologies as well asdeveloping innovative, low-cost and sustainable technologies. C.  Technology needs are influenced by differingnational and regional circumstances 33. Technology needs for coastal adaptation will vary according to national environmentalcircumstances and relevant capacities to adapt to sea-level rise.  A variety of characteristicsFCCC/TP/1999/1Page 11distinguish different national and regional contexts for coastal adaptation technologies,including:  natural resources, human resources/skills, equipment availability; environmentalfactors (and attitudes); public perception/education; legal restrictions; funding sources;requirements of funding sources;  time-scale over which justification for project is made(discount rates/risk perception frameworks); and political will.  34. Among developing countries, the coastal situation differs markedly.  It is therefore likelythat the coastal adaptation technology needs of developing countries will differ, in some casesmarkedly, from each other.  Many of these factors suggest that local expertise/participation isnecessary to identify and design appropriate coastal adaptation technologies as well as toimplement and maintain them.35. Engineering solutions developed in and for countries with coastal engineering traditions(e.g. Japan, Netherlands, the United Kingdom, the United States) cannot simply be transplantedto developing countries. Engineering solutions are sensitive to local geomorphological,ecological and botanical environments/contexts.  For example, the seabed around Japan is sandand hard rocks.  In many developing countries, the seabed consists of loose mud, coral sand orcoral reefs.  Appropriate or sustainable engineering solutions are necessarily different in eachcase. 36. However, ecosystems frequently traverse national boundaries.  Countries in the sameregion therefore often share similar coastal characteristics, climate conditions and ecosystems.Equally, some countries in different regions can also share similar coastal characteristics, climateconditions and ecosystems.  The IPCC Second Assessment Report identified four particularlyvulnerable coastal types:• Coral atolls (e.g. the Marshall Islands, Maldives); • Coastal wetland areas (e.g. in the United States, the Mediterranean, the AfricanAtlantic:   Senegal, Gambia, Sierra Leone, Nigeria, Cameroon, Gabon, Angolaand the coast of Australia and Papua New Guinea); • Large deltas (e.g. in Bangladesh, Nigeria, Egypt, China - though deltas themselves are barely comparable); and • Developed sandy shores (e.g. in the United States, Europe, the Caribbean,the Asian Pacific).37. In the case of small island states, the ecological and socio-economic risks associated witha projected increase in sea-level are particularly significant.  Many islands are likely toexperience increased coastal erosion and land loss as a consequence of sea-level rise (IPCC,1998).  In many cases, much of the land area of low-lying island states is only 3-4 metres abovethe present mean sea level (e.g. the Bahamas, Kiribati, Maldives and the Marshall Islands).  FCCC/TP/1999/1Page 12Islands at higher elevations are also in many cases vulnerable to sea-level rise due to significantsocio-economic dependencies (settlements, tourism, agriculture) on the coastal zone(IPCC, 1998; Leatherman, 1997).38. The numerous coastal adaptation options and technologies identified in this paper are inmany instances inappropriate for the particular conditions in small islands and atolls.  Inparticular, managed retreat in response to sea-level rise is rarely an option, as are many shoreprotection technologies, due to their prohibitive expenses as well as the ecological andenvironmental risks associated with their implementation.  The IPCC report on the regionalimpacts of climate change suggests that flexible, easily replaceable, traditional shore protectionmeasures could be further explored, while in some cases retreat may be the only availableadaptation option.39. The scope of adaptation options available to vulnerable island states and low-lyingcoastal nations is in some cases limited.  To expand the choices available, radically newtechnologies are needed. In turn, this implies a significant commitment to specific research anddevelopment programmes conducted at the national as well as international levels.D.  Status of relevant institutional capacity andavailability of appropriate training40. Annex IV provides results of a pilot survey to establish an overview of coastal zonemanagement and engineering centres.  The survey provides the following conclusions:   • There are few international or regional centres of coastal zone management,particularly in vulnerable regions, and consequently there are few regional orinternational coastal adaptation networks; • There is relatively little institutional capacity in the following regions: West Africa, East Africa, Southern Africa; the Caribbean and Latin America;the South Pacific; and Asia; • At the national level, a large number of government and university laboratoriesundertake activities in various aspects of coastal engineering and in some casescoastal zone management. Centres of coastal zone management generally havelittle interaction with institutions undertaking research, development and trainingin coastal engineering; • Few coastal zone centres have specific programmes on climate change, sea-levelrise and coastal adaptation and in many cases it is not clear which centres mighthave the capacity to conduct, for example, coastal vulnerability and adaptationassessments or specific training required to undertake these;  • The network for the diffusion of knowledge and the transfer of coastal adaptationtechnologies is piecemeal, underdeveloped or in some cases non-existent. In manyFCCC/TP/1999/1Page 13areas which are particularly vulnerable to sea-level rise, there is little, if any,institutional capacity specifically dedicated or available to adequately consider theproblem; and• There is significant potential to enhance information sharing andcapacity-building of the existing network of regional/international centres ofcoastal zone management and engineering.41. Greater linkages among and between coastal zone management and coastal engineeringcentres would help accelerate and sustain the development and transfer of effective andappropriate coastal adaptation technologies.  At the same time, the effective implementation ofcoastal adaptation technologies requires local scientific and technical expertise and intuition(e.g., McManus et al., 1998). 42. Options identified by the UNFCCC coastal adaptation expert meeting to build thecapacities of vulnerable island states and low-lying coastal nations to undertake appropriatecoastal adaptation therefore include:• Further strengthening of the existing networks of regional and internationalcentres for coastal zone management to consolidate regional information andstudies and pool resources (in some cases this could also include informationnetworks devoted to broader issues such as SIDSNet in the case of small islandstates);• Building and incorporating engineering capacities within the framework ofexisting coastal zone management centres; and• The identification of national focal centres for research and monitoring of coastaladaptation.  Such centres could integrate coastal zone management and the coastalengineering resources available in the particular country or region.  These focalcentres could provide the linkage between the networks of national publiclaboratories and universities and the network of international/regional centres.E.  Coastal adaptation technologies research and development needs43. Among the coastal adaptation technologies described in the tables in annex III, theUNFCCC coastal adaptation expert meeting identified a number of coastal adaptationtechnologies requiring further development/application including:• Technologies specifically designed to assist in the protection and stimulation ofcoral reefs;  • Temporary plant “bridging” technologies (e.g. to allow mangroves tore-establish);FCCC/TP/1999/1Page 14• Building with nature technologies (using local vegetation, species andgeomorphological processes to adapt); • Advanced building materials for coastal applications; • Tools to educate and raise awareness among stakeholders; • Specific research and development in the field of intuitive design (e.g. coconutleaves/hand-built sea walls); • Predictive modelling (sea-level rise, cyclones, but also in particular models thatcan downsize from global mean sea-level predictions); • Data collection and validation/remote sensing technologies;  • Establishment of wider, more effective national networks of wave and tidegauges;• Research and development into the specific needs of muddy intertidal areas; • Greater use and diffusion of geographical information systems to assessvulnerability and possible responses; and • Diffusion and application of remote monitoring technologies (e.g. embeddedsensors). 44. These are just some examples of coastal adaptation technologies which could be furtherdeveloped and applied to expand the scope of coastal technologies and options available, as wellas lowering their costs.  In many cases, vulnerable nations will require considerable furtherinformation and institutional capacities to adequately consider their particular coastal adaptationtechnology needs.  With this in mind, participants at the UNFCCC coastal adaptation expertmeeting also listed options which could help identify coastal adaptation technology needs,including:   • Enhancing education, training and raising the public awareness of theuncertainties of and linkages between extreme climate events and global climatechange;• Increasing education, training and awareness on which options and technologiesare effective and which are not;• Undertaking national coastal adaptation technology assessments;• Exploring the possibilities of standards for coastal technologies backed up bynecessary third party certification;FCCC/TP/1999/1Page 156     Accurate and systematic information on national expenditures on the construction and maintenance of coastalstructures is not available.• Further developing data gathering and decision support tools;• Implementing coastal adaptation technology demonstration programmes; • Developing more detailed scenarios of local coastal evolution (wind directions,etc); and • Ensuring a level of institutional capacity in line with the scale of the risks andchallenges associated with coastal vulnerability. V.  DEVELOPMENT AND TRANSFER OF COASTALADAPTATION TECHNOLOGIESA.  How coastal adaptation technologies are developed45. The development of coastal adaptation technologies takes place through two mainactivities:• National coastal construction and maintenance programmes; and• National and international publicly funded marine and coastal research anddevelopment programmes. B.  National coastal construction and maintenance programmes46. Many governments fund the construction and maintenance of coastal structures.6  Withina particular country, large numbers of different central and local government departments aretypically responsible for such expenditures.  Some of the more significant national programmesare carried out within developed countries with ‘coastal engineering traditions’ (Verhagen,1995).  Capital and maintenance expenditures are, however, relatively small compared, forexample, with national expenditures on other forms of civil engineering such as roads or energynetworks.47. The coastal engineering sector is generally characterized by a fragmented set of small andmedium enterprises (including construction engineers and consulting engineers) intenselycompeting for a relatively fixed, national, publicly funded market, and therefore typically lackingthe resources for research and development that are found in other sectors.  There is generally asmall national effort in developed countries to support research and development to enhance thedevelopment and competitiveness of the sector. FCCC/TP/1999/1Page 1648. Many projects are small-scale and do not provide long-term contract continuity orfinancial security.  Firms compete and operate in conditions of generally high uncertainty.  Inaddition,  there are generally low expectations of significant growth potential of expenditures oncoastal projects in both developed and developing countries. 49. Accordingly, profit margins in the industry are generally relatively low.  Consequentlyrelatively few resources are available for investment in research and development programmes. C.  Publicly funded coastal engineering research and development50. Coastal engineering research and development is primarily carried out at the nationallevel and mainly in the public sector.  Just as expenditures on coastal construction andmaintenance are themselves difficult to establish, so too are coastal engineering research anddevelopment expenditures.  The Netherlands, for example, supports a national coastal researchand development programme of approximately US$ 30 million, which supports basic research. The research has enabled Netherlands companies to gain an international reputation in thecompetition for overseas coastal contracts.  Dredging is a good example.  For the last 15 years orso, dredging companies have collaborated to improve the efficiency of the ‘pump ladder’ and thecutter heads.  The cost/unit volume of material pumped has been significantly reduced in recentyears.  The main costs are in mobilization and ensuring that the right dredger is in the right place. The United States recently implemented a multi-year dredging research programme.  The UnitedStates Army Corps of Engineers operates one of the largest programmes for river and coastalengineering research and development (Hammer, 1998).  51. However, there are few examples of international collaborative approaches to coastalengineering research and development.  One exception is the European Marine Science andTechnology (MAST) programme, which brings together inter alia elements dealing with coastalmorphodynamics and coastal structures.  The MAST programme, part of the European Union(EU) framework programme on research, technological development and demonstration, aims tofoster scientific knowledge and technological development necessary to understand how marinesystems relate to global change. Established in 1989, the programme includes a number ofactivities relating to global change and coastal zone protection.52. At both the national and the international level, research and development programmestend to emphasize coastal sciences and the sound understanding of coastal processes.  There arerelatively few activities undertaken directly on the applied ‘solutions’ side, for example relatingto the spectrum of soft to hard coastal adaptation technologies.  There are also almost noactivities to demonstrate and verify performance and evaluate coastal adaptation technologies. The concept of coastal adaptation technologies is relatively new and has yet to attract theattention of the mainstream coastal engineering research community.  Consequently the coastalresearch and development programmes typically do not include specific activities to address thecoastal adaptation technology needs of developing countries.FCCC/TP/1999/1Page 177     There are also pathways within and between developing countries.  A comprehensive analysis of the variouspathways will be included in the IPCC Special Report on Methodological and Technological Issues in TechnologyTransfer, due to be published in 2000.D.  How coastal adaptation technologies are transferred53. There are two main pathways for the transfer of coastal zone adaptation technologiesfrom developed to developing countries:7• Bilaterally and multilaterally funded coastal projects carried out by multinationalprivate sector coastal consulting engineers and construction companies; and• The training of engineers from developing countries at institutions in countrieswith a coastal engineering tradition. E.  Coastal projects carried out by internationally operating private sector coastal consulting engineers and construction companies54. The diffusion and transfer of coastal engineering practices/knowledge is mainly throughcoastal projects, involving foreign, internationally operating consulting and constructionengineering companies.  Many of the major coastal engineering projects in developing countriesare carried out by consulting and construction engineers from developed countries.  Part of themarket for coastal projects is therefore global.  More precisely, firms tend to dominate in theirhome markets - much of the work in the Netherlands is undertaken by firms based there etc. In the case of the United States, much of the market for coastal work remains in the public sectorbecause the United States Army Corps of Engineers is responsible for river and coastalengineering. 55. The international market for construction in developing countries is greater.  Firms fromEurope, North America and Japan may all compete for the same coastal project, for example, inWest Africa.  Multinational private enterprise constitutes an important pathway for the transferof technology - appropriate and otherwise.  There is always a risk that invited coastal  consultantsand construction engineers from developed countries apply engineering methods alreadydeveloped for other contexts.  In some cases this may not be the most appropriate solution.  Therisk is greatest where maintenance considerations and local inputs are underemphasized in theproject cycle.  Other factors may also contribute to the transfer of the suboptimal solution(see section VI). 56. The project planning and implementation cycle is an important pathway via which coastaladaptation technologies are transferred in practice.  Participants at the expert meetingcharacterized the typical project tendering process in developing countries by the following:  • Project funding is supplied through loans or bilateral aid (often provided in thereturn periods after severe weather events); FCCC/TP/1999/1Page 18• Following the request for tenders, projects are in many cases awarded toconsultants and construction companies from the donor country (in the case ofbilateral aid); • During the planning, design and, in some cases, implementation, localexperts/engineering firms may be ignored and may not be invited to participate inthe process; • In turn, this tends to encourage the reproduction of existing designs, in some casesnot optimized or even suitable for local conditions; and• Most projects do not include maintenance of the structure and training ofengineers in their proposals.  The result is a project left behind where, ifsomething technical goes wrong, it cannot be addressed by local expertise. The table below provides examples of different agencies involved in grants, loans and aidas well as providing assistance for studies identified at the UNFCCC coastal adaptation expertmeeting. Examples of agencies/countries providing grants, loans or aid for coastal projects in different regionsFunding Africa Asia Caribbean Latin America PacificBilateral aid Canada (CIDA);Denmark (DANIDA);Netherlands (DGIS);Germany (GTZ/BMZ);Sweden (SIDA-SAREC);Norway (NORAD);European Union;United States (USAID). Canada (CIDA); Denmark (DANIDA);Germany (GTZ/BMZ);Netherlands (DGIS); Norway (NORAD);Sweden (SIDA-SAREC).Canada (CIDA);France (IFREMER/ IRD);Netherlands;United States(USAID).United States (USAID).Australia (AUSAID); China; France; Japan (JICA);United Kingdom (DIFID);  United States (SEAGRANT (USAID); United NationsDevelopment Programme; Commonwealth Secretariat. MultilateralloansAfrican DevelopmentBank; World Bank.Asian Development Bank. IADB; Organizationof American States;World Bank.IADB;World Bank.Asian Development Bank;World Bank.National Thailand(Asian Institute ofTechnology); Japan CaribbeanDevelopment Bank.Local and regionalgovernments; South PacificForum Secretariat.Funding forstudies Netherlands (NCCAP);United Kingdom (DFID);United States (UCSP);GEF; AfricanDevelopment Bank.Netherlands (NCCAP);United States (USCSP).GEF; Inter-AmericanDevelopment Bank.Canada (IDRC);Netherlands (NCCAP);United States(USCSP); GEF.GEF.Source:  UNFCCC Expert Meeting on Coastal Adaptation, 22-23 March 1999, Bonn.IDRC: International Development Research Centre (Canada).AUSAID: Australian Agency for International Development. IFREMER: Institut Français de Recherche pour l’Exploitation de la Mer.BMZ: German Federal Ministry for Economic Cooperation and Development. IRD: Institut de Recherche pour le Developpement (France).CIDA: Canadian International Development Agency. JICA: Japan International Cooperation Agency.DANIDA: Danish International Development Assistance. NCCAP: Netherlands Climate Change Assistance Programme.DFID: United Kingdom Department for International  Development. NORAD: Norwegian Agency for Development Cooperation.DGIS: Directorate General for International Co-operation. SIDA-SAREC: Department for Research Cooperation within the Swedishof the Netherlands Ministry of Foreign Affairs. International Development Agency.GEF: Global Environment Facility. USAID: United States Agency for International Development.GTZ: German Agency for Technical Cooperation. USCSP: United States Country Studies Program.FCCC/TP/1999/1     Page 19FCCC/TP/1999/1Page 208     This section on barriers draws upon information provided by coastal zone experts (academics as well as theprivate sector), the UNFCCC Expert Meeting on Coastal Adaptation Technologies (22-23 March 1999, Bonn) andfrom working drafts of the coastal zone chapter of the IPCC Special Report on Methodological and TechnicalIssues in Technology Transfer. F.  Training engineers from developing countries at centresof excellence in countries with a coastal engineering tradition57. In most developing countries there is a shortage of trained coastal scientists, managersand engineers.  Verhagen (1995) observes that whereas young engineers in countries with atradition of coastal engineering first serve apprenticeships after their qualification, in manyinstances newly qualified engineers returning to their home countries are immediately given aposition as “expert”, often lacking someone more experienced to rely upon for help.  Theshortage means that most coastal engineers in developing countries are project engineers withlittle time to develop new coastal engineering tools or to engage in research.  However trainingalone is not enough.  Training and awareness-raising is most effective when the newly trainedstaff can apply their skills.  In turn this requires adequate financial support. 58. An important pathway for the transfer of coastal engineering technologies is via thetraining of young professionals from developing countries in developed countries, mainly in theNetherlands and the United States.  For example, many coastal engineers in developing countrieshave done further degrees at the International Institute for Infrastructural, Hydraulic andEnvironmental Engineering (IHE) at Delft in the Netherlands.  Since 1957, IHE has trained morethan 2,000 coastal engineers and scientists from many parts of the world. 59. While training is an important component of the development and transfer of coastaladaptation technologies, the particular technology needs for a given coastal situation tend to beunique.  This limits the scope for developing best practice guides for the development andtransfer of coastal adaptation technologies.  Simply copying structures may not result in thediffusion of best practice.  Structures in developed countries may be the result of political andeconomic compromise and may not be the best technologies or practices available.  Once trained,coastal engineers from developing countries sometimes return and emulate the practices theyhave been taught or have seen.  Concerning ‘best practice’, there are examples where engineersin developing countries want to copy exactly the design of structures they have seen work inother countries (perhaps due to lack of support from peers or experienced mentors).  One case,for example, involved the copying of a northern European harbour design including a devicerelevant to reduce ice pressure, which was installed in its entirety in a tropical country. VI.  BARRIERS TO THE DEVELOPMENT AND TRANSFER OFCOASTAL ADAPTATION TECHNOLOGIES860. Many examples of barriers to the development and transfer of coastal adaptationtechnologies are described below.  The barriers are discussed under two broad themes:FCCC/TP/1999/1Page 219     See for example FCCC/TP/1998/1.• Sectoral barriers (applicable to both developed and developing country contexts);and• Specific barriers to the transfer of coastal adaptation technologies to developingcountries.A.  Sectoral barriers to the development and transferof coastal adaptation technologies 61. A number of generic barriers to the transfer of environmentally sound technologies havebeen widely cited in the literature.9  Broadly such barriers can be classified as:• Institutional:  lack of legal and regulatory frameworks, limited institutionalcapacity, and excessive bureaucratic procedures, restrictive bidding procedures,restrictions on ownership and control;  • Political:  instability, interventions in domestic markets (for example, subsidies),corruption and lack of civil society; • Technological:  lack of infrastructure, lack of technical standards and institutionsfor supporting the standards, low technical capabilities of firms and lack of atechnology knowledge base;• Economic:  instability, inflation, poor macroeconomic conditions and disturbedand/or non-transparent markets; • Information:  lack of technical and financial information and of a demonstratedtrack record for many coastal adaptation technologies;• Financial:  lack of investment capital and financing instruments;• Cultural:  consumer preferences and social biases; and• General:  intellectual property protection, and unclear arbitration procedures.62. In line with these generic barriers, there are a number of barriers specific to the coastalsector.  These sectoral barriers to the development and transfer of coastal technologies areapplicable to both the developed and developing country contexts.  Key barriers include:  FCCC/TP/1999/1Page 22• There are large uncertainties about the scale of sea-level rise and associatedeffects.  Although sea-level rise predictions are converging, tools to understandand raise awareness about other important factors such as possible changes infuture wave and wind climates are not available.  In turn, these uncertainties makeit difficult for governments to commit expenditures;• There is a lack of finance to incorporate adaptation into coastal projects - coastalengineering projects are generally expensive and often there is very little moneyavailable for basic projects.  Discretionary projects are generally not funded andonly those projects which need to be undertaken, usually after a storm event, areundertaken.  Building adaptation into new projects usually involves greaterup-front capital costs. • Short-term political and economic considerations frequently win out overlonger-term approaches.  Political and economic time-scales can be shorter thanthose associated with the research, planning and consultation necessary for majorcoastal projects, in some cases resulting in a lack of action;• Few countries have integrated coastal zone management plans.  In manyinstances, vulnerable coastal nations have yet to publish integrated coastal zonemanagement plans.  In other cases where plans have been made, there can be alack of funds for implementation; • Decision-makers are risk averse and frequently favour traditional hard structuresover ‘softer’ or innovative coastal adaptation technologies.  Generally, fundingagencies and to some extent consultants have little appetite for experimentation. Very few innovative coastal engineering projects are being implemented;• Different perceptions of risk lead to different priorities.  National approaches torisk assessment vary and are evolving.  A case study is the Netherlands.  The greatflood of 1953 prompted the Government of the Netherlands to adopt the 1 in10,000 event criterion still used with respect to some of its sea defences. A process to move from a ‘failure’ rate criterion towards a risk-based approachinvolving consensus on acceptable levels of damage in the event of flooding isunder way in the Netherlands.  There is, therefore, a transition from a failure rate,to a flood rate of the polders, then to a damage (risk) assessment.  Few countrieshave adopted this approach.  Consequently, certain approaches including coastaladaptation technologies may be overlooked in the search to avoid solutions whereaccommodation of the potential risk is factored in;• The influence of insurance, or the lack of it.  In the case of coastal projects, lackof suitable insurance products may stifle innovation (see also above on riskadversity, risk perception and demonstration projects).  In terms of generaldevelopment and settlement trends in vulnerable coastal areas, the availability or FCCC/TP/1999/1Page 23otherwise of insurance (public or private) can significantly influence vulnerability.  On the one hand, a lack of insurance can discourage high riskdevelopment and on the other its availability tied to appropriate incentives canencourage settlements at lower risk.  Insurance (public or private) can be animportant vehicle for raising awareness among coastal land owners of thepotential risks due to climate change;• Appropriate software, tailored to specific local needs and circumstances to assistin decision support, is mostly unavailable and costly to develop; • Small and medium-size private enterprises can be left out. Smallcompanies/projects do not attract much attention from government, yet small andmedium-size enterprises do a good deal of the development; • Social attitudes and behaviour are complex. Viable technical solutions for coastaladaptation must be considered in the context of social attitudes and behaviour. Sometimes it is social choices which exacerbate the vulnerability of the coast tosea-level rise;• Coastal adaptation technologies are not easily scalable.  The planning and designof coastal structures requires detailed and often complex analysis.  Experience atone site can only be transferred elsewhere with caution, as the effectiveness orotherwise of a particular technology depends on site-specific conditions; • Coastal mangers are not aware of climate change. Climate change, weatherprotection, and environment are not top priorities for those responsible formanaging the coast.  Indeed, sometimes weather protection is not recognized bycoastal managers; and• Property rights.  The majority of coastal adaptation technologies are in the publicdomain.  However in some instances - though these are relatively few comparedwith other sectors (a consequence of the tradition of public coastal engineering) -intellectual property rights could perhaps be a barrier to the transfer of appropriatecoastal adaptation technologies.  Examples of patented technologies include theshapes of so-called armour units and a new underground drainage technologydeveloped in Denmark.  The software for understanding coastal morphology/wavefluxes/sediment transport is a further area where property rights are wellestablished.  However in the case of armour units, the most widely used designsare those that are, or were, patented (versus those that have never been patented). The lack of property rights could therefore be a barrier to the development andtransfer of coastal adaptation technologies. FCCC/TP/1999/1Page 24B.  Specific barriers to the transfer of coastal adaptationtechnologies to developing countries63. Specific barriers to the development of coastal adaptation technologies within developingcountries include:• Coastal adaptation is not seen as a development objective.  The causal chainwhich links economic development/poverty eradication first to good coastal zonemanagement and then to coastal adaptation to sea-level rise is not well understoodor accepted.  Expenditures on coastal projects are carried out in the name ofeconomic goals.  Coastal engineering in developing countries is supported by thegovernment to stimulate and support economic activities, such as fisheries andport development and tourism; • Foreign coastal consulting and construction engineers sometimes engage in“technology push”, attempting to sell what is on the shelf rather than develop newin-situ technologies.  Local  expertise, needs and concerns are often overlooked;• Foreign technology pull: at the same time there is often a strong belief on the partof coastal managers in developing countries that buying foreign is buying better.This tendency undermines long-term local capacities to develop sustainablecoastal adaptation technologies; • Lack of education, training or awareness.  While a great deal of information isavailable in the coastal engineering literature about what works/does not work,this information can be difficult for decision-makers to access or assimilate; • Engineers returning from training overseas often lack support to develop andimplement new techniques and working practices. Newly qualified engineers aregiven the position of ‘expert’ before serving apprenticeships and gaining seasonedexperience.  There is generally a lack of supervision within the industry for youngqualified engineers;  • Lack of domestic capacity to engage in research or develop new tools. Trainingalone does not enhance technology transfer.  Coastal engineers may be assignedother administrative duties, or lack funds, instruments and even political supportto engage in meaningful research to develop appropriate tools.  In addition, lowremuneration (and the consequent risk of brain drain), lack of resources and a lackof training means that the engineer becomes outdated and despairs.  This set ofproblems could be addressed by a more long-term programme of training andupdating skills; • Lack of coastal centres and networks (this is described in more detail insection IV); andFCCC/TP/1999/1Page 25• The specific challenges of developing nations lie outside the mainstream of developed countries.  National and international collaborative research anddevelopment programmes of developed countries have few incentives to focusupon the unique engineering challenges for coastal adaptation technologies inother vulnerable coastal areas. VII.  OPTIONS TO ACCELERATE AND SUSTAIN THE DEVELOPMENTAND TRANSFER OF COASTAL ADAPTATION TECHNOLOGIES64. What are the options to accelerate and sustain the development and transfer of coastaladaptation technologies ?  In many cases, such options might seek to address the various barriersto the development and transfer of coastal adaptation technologies described above.  Asdescribed in section V, the central pathway for the development and transfer of coastaladaptation technologies is the design, planning and implementation of coastal projects.  Variousopportunities exist to address such barriers in the context of the project cycle.  65. The UNFCCC coastal adaptation expert meeting identified a number of keycharacteristics to describe what it termed as ‘sustainable coastal adaptation technologydevelopment and transfer’.  The five key characteristics of projects which contribute tosustainable coastal adaptation technology development and transfer are:& The project proposal is supported by a sound understanding and evaluation oflocal coastal characteristics and processes; & The project is located within the goals of a national or regional coastal zonemanagement plan; & The project cycle includes appropriate elements relating to:  pre-tenderawareness-raising, pre-qualification criteria, encouragement of competition andcreativity, socio-economic evaluations, whole life cycle costs (projects shouldhave maintenance costs built in) and post-project evaluation;  & During design, planning and implementation, the project seeks to contribute to thebuilding of local and/or regional capacities to support coastal zone planning andmanagement (e.g. use where possible of local expertise and capacities as well ason-the-job training); and& Where possible, projects contribute to, and form part of, longer-term collaborationbetween government and the private sector. 66. The coastal adaptation expert meeting identified a range of options to accelerate andsustain the development and transfer of coastal adaptation technologies, which could beconsidered by a broad spectrum of stakeholders involved in taking decisions which affect theinfrastructure and management of the coastal zone.  The range of stakeholders includes:FCCC/TP/1999/1Page 26• Development banks (and others loan providers) and aid agencies; • Intergovernmental organizations;  • National, regional and local government; • Universities (both research and teaching/training functions)• Private sector (consulting and construction coastal engineers); • Insurance companies; and• Non-governmental organizations. 67. A detailed set of options, identified at the coastal adaptation expert meeting, relating tothe roles that each of the different stakeholders could play and which could help implementsustainable coastal technology development and transfer, is listed below. Development banks, others loan providers and aid agencies68. Development banks, other loan providers and aid agencies play a central role in thefinancing and often design, planning and implementation of coastal projects.  Finance providersare often in a position to foster sustainable coastal technology development and transfer, forexample by:   • Encouraging national and regional governments to locate coastal projects withinnational and regional coastal reviews and assessments; • Ensuring that best available technologies are integrated into project design; • Encouraging and facilitating long-term post-project evaluations (e.g. after 10years), perhaps as a condition on future-related loans; • In conjunction with the private sector, helping to set up and resource independentnational coastal zone assessment boards to provide adequate third partyassessments of projects and post-project evaluations; • Setting aside specific funds to encourage projects which contribute to sustainablecoastal adaptation technology development and transfer as well as fordemonstration projects;• Packaging projects within longer-term cooperation frameworks to provide clearersignals to the private sector of longer-term commitment;• Where possible, encouraging appropriate project planning to incorporate wholelife cycle project costs, i.e. including operating and maintenance costs of thecoastal adaptation technologies;• Ensuring that adequate training and advice are available to prepare specificationsand assess bids;FCCC/TP/1999/1Page 27• Listening carefully to local stakeholders and providing independent andappropriate third party expert advice, together with a commitment to continualsupport; • Linking aid and/or loan conditions to the undertaking and implementation ofnational and/or regional coastal zone management plans; and• Integrating climate change considerations into natural disaster mitigation planningand relief. Intergovernmental organizations:  69. Several options could be considered by appropriate intergovernmental organizations,particularly emphasizing their comparative advantages in providing information and raisingawareness.  Options include:  • Raising awareness and enhancing the understanding of sea-level rise and other climate change impact predictions, including translation into meaningful andeffective action among the various stakeholders in the coastal zone; • Encouraging and facilitating national governments to set appropriate technologygoals for coastal adaptation technologies, while helping to establish appropriateinternational research and development goals and funding priorities forsustainable coastal adaptation technologies; • Facilitating improved cooperation and coordination among multilateral andbilateral loan providers and donors (e.g. arranging workshops and seminars toshare policies and experience); and• Cooperating with existing regional centres and supporting an internationalnetwork of regional clearing houses to provide coastal zone managers andengineers in developing countries with greater access to a wider variety oftechnical and project-related information.National, regional and local government70. National governments play a critical role in setting the general legal, institutional andeconomic framework in which projects are carried out and, together with regional and localgovernments, agree project terms and conditions.  The options described above  relating todevelopment banks, other loan providers and aid agencies constitute a sustainable coastaladaptation technology ‘push’.  In many cases, government at all levels could undertakecomplementary actions to ‘pull’ finance providers toward sustainable coastal adaptationtechnology development and transfer.  In addition to these complementary options, other optionsinclude:FCCC/TP/1999/1Page 28• Ensuring an appropriate national framework of policies, including national and/orregional coastal zone management plans as well and coastal adaptation R&Dprogrammes (national and international); • Providing support to sustain knowledge and expertise in the field of coastal zonemanagement and coastal adaptation, by encouraging the development andmaintenance of adequate institutional capacities (hydraulic laboratories,monitoring networks, training institutions); • Increasing direct support for the training of both senior and junior engineers fromdeveloping countries;  • Providing clearer long-term signals to loan providers and the private sector, inparticular by packaging loan and aid requests into longer-term agreements orframeworks to provide regional and local government, as well as the privatesector, with greater foresight.  In turn this may help encourage internationalprivate sector coastal consulting and construction engineers to establish regionaloffices, backed by a long-term commitment to staff and maintain them; • Packaging coastal adaptation projects within other civil engineering programmesto provide the incentive of spin-off markets to the private consulting andconstruction engineering sector;  • Providing feedback to academics and the private sector on local issues, includingthe training of foreign consulting and construction engineers through appropriatein-situ knowledge exchange; • Endogenous building up of local institutional capacities, e.g. through support forliaison officers to interact with regional and national stakeholders; and • Helping non-governmental organizations to promote sustainable coastaladaptation. Universities (research, teaching and training)71. Through fundamental scientific and applied engineering research, as well as teaching andtraining, universities are particularly important in expanding the scope of possibilities andlowering the costs of long-term adaptation to sea-level rise and its associated effects.  Particularoptions include:  • Undertaking research to apply existing knowledge where there are differentboundary conditions, where possible stemming from practical situations;• Engaging in partnerships with the private sector and local government; FCCC/TP/1999/1Page 29• Supporting appropriate research on, and development of, post-project evaluationframeworks (e.g. learning from failures as well as successes); • Providing focused teaching and training to national and foreign students,incorporating appropriate advice and feedback from the public and privatesectors; • Altering the reward structure within universities to encourage better qualityteaching;  • Boosting capacities to provide distance learning/continuous improvement forcoastal zone managers and engineers in the field, in particular incorporatinglearning processes which attempt to gain the commitment not only of youngforeign-trained professionals but also of their senior managers;• Encouraging in-situ “two-way” information exchange and learning betweendeveloped and developing country knowledge bases; and• Providing additional support and guidance relating to the training of universitytrainers.  Private sector72. Together with governments and finance providers, the private sector forms the thirdmember of the typical project consortium.  The private sector most closely associated with thedevelopment and transfer of coastal adaptation technologies consists mainly of coastal consultingand construction engineers who operate internationally in developing countries.  Frequently it isthe private sector which helps design, plan and implement coastal projects identified by nationalgovernment and finance providers.  Options which the private sector could consider include:  • Entering into long-term cooperation and framework agreements with national andregional governments, including the encouragement of partnerships to long-termfoster responsibility for stretches of coast (design and build, and maintain); • Building adequate and appropriate training for local companies and governmentinto the terms of reference and project bids to ensure that projects contribute tocapacity-building and knowledge exchange; • Engaging in joint ventures between large international consultants and local smalland medium enterprises; • Setting up and maintaining regional offices in response to government incentives(e.g.  long-term partnership or framework agreements, greater market potentials);  andFCCC/TP/1999/1Page 30• Promoting enhanced and perhaps innovative approaches to the training of coastalengineers from developing countries (e.g. through public-private partnerships). Insurance companies73. Insurance plays an important role in various parts of the project cycle.  Insurance andre-insurance companies could consider options to support other key stakeholders in their pursuitof sustainable coastal technology development and transfer.  This may for example includeexamining ways to provide guarantees for demonstration projects and activities as well asinsurance products which help finance providers, governments and the private sector to equitablyshare and manage the risks relating to the development and transfer of sustainable coastaladaptation technologies.  At the same time, insurance companies could build into projectrequirements many of the elements relating to sustainable coastal technology development andtransfer outlined above. Non-governmental organizations74. Non-governmental organizations could play a critical role in raising awareness aboutsustainable coastal adaptation.  However, such organizations would in many cases requireadditional support to develop suitable strategies to approach the interconnectedness of manyenvironmental and social issues surrounding coastal adaptation responses.  In addition to raisingawareness on various coastal-zone-related impacts and adaptation options, non-governmentalorganizations may wish to consider options to help them participate in project design, planningand evaluation. FCCC/TP/1999/1Page 31REFERENCESBouchet, R. (1992).  Coastal Structures and Breakwaters.  Thomas Telford, London. pp. 95-110.Hummer, C. W. (1998).  DOER: “A major dredging research programme”, in Terra et Aqua,No. 72, September.IPCC (1995).  Climate Change 1995a:  The Science of Climate Change.  Contribution of Working Group I to the Second Assessment Report of the Intergovernmental Panel onClimate Change.  Cambridge University Press, Cambridge:  1996.__________  Climate Change 1995b:  Impacts, Adaptations and Mitigation of Climate ChangeScientific Technical Analyses.  Contribution of Working Group II to the Second AssessmentReport of the Intergovernmental Panel on Climate Change.  Cambridge University Press,Cambridge:  1996.__________  (1998).  The Regional Impacts of Climate Change:  An Assessment ofVulnerability. Cambridge University Press, Cambridge.Klein, R. J. T. and R. J. Nicholls (1998).  “Coastal Zones”, in UNEP Handbook on Methods for Climate Change Impact Assessment and Adaptation Strategies.  Feenstra, J. F., Burton, I.,Smith, J. B. and R.S.J. Tol (ed.).__________, Nicholls, R. J. and N. Mimura (1999).  “Coastal Adaptation to Climate Change:  Can the IPCC Technical Guidelines be Applied?”, in Mitigation and Adaptation Strategiesfor Global Change, in press. __________, Smit, M. J., Goosen, H., and C. H. Hulsbergen (1998).  “Resilience andVulnerability:  Coastal Dynamics or Dutch Dikes?”, in The Geographical Journal,vol. 164 (3), pp. 259-268. Leatherman, S. P. (1997).  Island States at Risk:  Global Climate Change, Development and Population.  Journal of Coastal Research, Special Issue 24. McManus, J. W., van Zwol, C., Garces, L. R., and D. Sadacharan, (1998).  A Framework for Future Training in Marine and Coastal Protected Areas Management.  Coastal ZoneManagement Centre/International Centre for Living Aquatic Resources Management,Den Haag/Manila.National Resources Council (1987).  Responding to Changes in Sea Level:  Engineering Implications.  National Academy Press, Washington. Pilarczyk, K. W. (1990).  “Introduction to Coastal Protection”, in Coastal Protection, Pilarczyk, K. W. (ed), A. A. Balkema, Rotterdam.FCCC/TP/1999/1Page 32__________, Tarnowska, M., Proszak, Z. and T. Basinski.  (1992).  “Coastal Defence Systems and Unconventional Design”, in Effectiveness of Coastal Defence Measures.  R. B. Zeidler(ed.)  Rijkswaterstaat and Delft Hydraulics, Gdansk. __________  (1994).  Novel Systems in Coastal Engineering:  Geotextiles and Other Methods, Rijkswaterstaat, Delft. Scott, J., Stoops, K. and J. Cochran (1993).  “Holding a Shoreline with a Buried Revetment”,in Coastal Engineering Considerations in Coastal Zone Management, Proceedingsof Coastal Zone 1993, the Eighth Symposium on Coastal and Ocean Management, NewOrleans, July 19-23 1993,  pp. 1-15.  Stephen A. Hughes (ed.).SOPAC  Miscellaneous Report 177 (1993).  Coastal Protection in the Pacific Islands:  Current Trends and Future Prospects.  South Pacific Regional Environment Programme, Apia.__________  222 (1996).  Coasts of Pacific Islands.  South Pacific Regional Environment Programme, Apia.Tanimoto, K. and Y. Goda (1992).  “Historical development of breakwater structures in theworld”, in Coastal Structures and Breakwaters, Proceedings of the Conference Organisedby the Institution of Civil Engineers, London, 6-8 November, 1991.  Thomas Telford,London.UNEP (1998).  Handbook on Methods for Climate Change Impact Assessment and Adaptation Strategies.  Feenstra, J. F., Burton, I., Smith, J. B. and R.S.J. Tol (ed.).Verhagen, H. J. (1995).  “The requirements of coastal engineers in integrated coastal zone management”, in COPEDEC IV:  Proceedings of the Fourth International Conference onCoastal and Port Engineering in Developing Countries, Rio de Janeiro, Brazil,25-29 September, 1995, pp. 542-551.FCCC/TP/1999/1Page 33Annex IUNFCCC EXPERT MEETING ON COASTAL ADAPTATION TECHNOLOGIES In response to a request from SBSTA to prepare reports on adaptation technologies, theUNFCCC secretariat convened a meeting of 12 coastal zone managers and engineers to obtainrelevant advice and guidance.  The objective of the meeting was to promote an exchange ofviews on options to accelerate and sustain the development and transfer of coastal adaptationtechnologies.  The list of participants is provided below.  Experts discussed the context for coastal adaptation technologies, and noted that thetechnologies themselves are sub-components of the wider framework of coastal zonemanagement. Participants reaffirmed that the consideration of coastal adaptation technologiesshould be related to the three fundamental coastal adaptation options identified in the IPCCSecond Assessment Report (retreat, accommodation, protection). Participants discussed an arrayof technologies to support coastal adaptation. Coastal adaptation technologies includetechnologies to gather information about coastal characteristics and processes (e.g. gauges,monitoring technologies), decision tools (models, software) and technologies included in thedesign, construction and maintenance of projects designed to retreat, accommodate or protect aparticular part of the coastal strip. While the number of coastal adaptation technologies is large, the group noted that there arevery few of them which do not suffer from hydrodynamic constraints, or involve significantsocio-economic and environmental costs.  Indeed most, if not all, technical responses to sea-levelrise and associated effects have social, economic and/or environmental drawbacks. Participants noted that applying technologies which are not properly understood or havebeen simply copied and applied to a new location without due attention usually results in anexaggeration of such drawbacks.  In many cases, experience has demonstrated that taking actioncan be worse than doing nothing.  Nevertheless, in specific situations where coastal processes areunderstood and clear political decisions have been taken in the context of an integrated coastalplan, technologies are available to attenuate or avoid particular coastal impacts.  The expertsidentified a number of examples of gaps in the existing knowledge-base regarding coastaladaptation technologies which, if filled could support coastal adaptation (see section IV, E). They also listed options which could help identify coastal adaptation technology needs. The coastal project cycle was presented as a practical framework within which tounderstand and describe the development, and in particular the transfer, of coastal adaptationtechnologies.  Participants identified several important and specific barriers to the developmentof coastal adaptation technologies, many of which relate to issues concerning the project cycle. Experts also provided feedback on the pilot survey of worldwide institutional capacity inthe field of coastal zone management and engineering (see section IV, D) and identified a rangeFCCC/TP/1999/1Page 34of options to accelerate and sustain the development and transfer of coastal adaptation technologies.  In particular experts developed the concept of sustainable technology transfer(see section VII). List of participantsAlan Brampton: HR Wallingford Ltd., United Kingdom of Great Britain and Northern IrelandBilan Du:  China Institute for Marine Development Strategy of State Oceanic Adm., ChinaAlfonse Dubi:  Institute of Marine Sciences, University of Dar-es-Salaam,United Republic of TanzaniaBen Hamer:  Halcrow International Partnership, Consulting Engineers, United Kingdom ofGreat Britain and Northern IrelandRaymond Johnson:  Institute of Marine Biology and Oceanography, Sierra LeoneRussell Maharaj:  South Pacific Applied Geoscience Commission (SOPAC), FijiFrank van der Meulen:  National Institute for Coastal and Marine Management/RIKZ,The NetherlandsAntonio Rowe:  Coastal Zone Management Unit, BarbadosAndrés Saizar:  Unit of Environmental Impact Assessment, UruguayHenk Jan Verhagen:  Hydraulic Engineering Department, IHE Delft, The NetherlandsEarle Buckley:  IPCC Lead Author, Special Report on Methodology and Technological Issuesin Technology Transfer (National Oceanic and Atmospheric Administration, Coastal ServicesCenter, United States of America)UNFCCC secretariat:Dennis TirpakStephen PeakeDaniele ViolettiFCCC/TP/1999/1Page 351      Initial national communications of non-Annex I Parties; second national communications of Annex I Parties. Annex IIINFORMATION ON THE IMPACTS OF SEA-LEVEL RISEAS WELL AS ADAPTATION OPTIONS AND TECHNOLOGIESREPORTED IN NATIONAL COMMUNICATIONS1Party Reporting of impacts of sea-levelrise and methods usedCoastal adaptation optionsand technologies reportedNON-ANNEX I PARTIESArgentina 140 km2 of different regions andecological systems are vulnerable toinundation from a 50 cm sea-levelrise.NoneRepublic ofKorea Multiple impacts from a non-specificsea-level rise. • Relocation of basic structures• Achievement of harmony between environmentand industryMexico Various impacts described.  Fiveregions analysed for a 2 metresea-level rise using satellite images,aerial photos, ground testing andtopographical charts.  None FederatedStates ofMicronesiaInundation from 0.2, 0.3 and 1.0metre scenarios for different islands. • Protection of coral reefs (which can grow in linewith sea-level rise)• Large-scale mangrove reforestation• Use of Micronesian technologies and practices topromote shoreline stabilization and coastal areaecosystem preservation. • Discouragement of contemporary sea walls,groyne and revetment construction. • Encouragement of local measures such asnearshore ‘sea fences’, ‘staggered stone sea fences’(as in Yap) and use of stilts (as in Kosrae). Senegal Between 1,945 and 6,073 km2affected by inundation and erosion,(affecting a population of 68,000-178,000) using  0.5 and 1.0 mscenarios• No options reported, total cost of protectionreported at US$ 407-2,156 million. Uruguay Five regions vulnerable to sea-levelrise showing 5 different types of landaffected using three scenarios forsea-level rise, 0.3, 0.5 and 1.0metres.  Bruun and equilibriumerosion methods cited. • Detailed costs for sea walls and beachnourishment to protect 14 different locations for eachof three scenarios.  Total costs range from US$ 46.5billion to approximately US$ 4 trillion, depending onscenario and type of protection. ANNEX I PARTIESAustralia Possible increase in frequency andintensity of tropical cyclones withassociated impacts.  Citations from9 case studies including wetlandareas, monsoonal rainforests,mangroves.  Positive impacts oncoral reefs due to sea-level risereported, though reefs may bevulnerable to increased sea surfacetemperatures.• Planning principles which require that coastaldevelopments be safe for a 30 centimetre rise in sealevel; • Minimum design levels for coastal and tidalstructures; • Restriction of developments in low-lying areas;monitoring and research on sea levels.FCCC/TP/1999/1Page 36Party Reporting of impacts of sea-levelrise and methods usedCoastal adaptation optionsand technologies reportedCanada Acceleration of erosion problemswhich threaten coastal structuressuch as harbours and sewagedisposal systems.None.Denmark Coastal retreat accelerated, risk toexisting dyke and storm floodprotection increased, reducedeffectiveness of sewerage systems ofcoastal cities, assuming 50 cmsea-level rise by 2100• Slowness of sea-level rise offers time to adjustconstruction of structures to meet the need of changedconditions. • Beach nourishment.  Estonia Increased erosion, changes insedimentation patterns, disappearingbeaches, loss of breeding habitats formigrating birds, salt-water intrusion,assuming a 1 m sea-level riseNone. France Increased inundation of low-lyingcoasts.  Increased beach and clifferosion, saline intrusion from a    0.3 m sea-level riseNone. Germany Various impacts for 5 states arepresented (total areas affected withand without adaptation measures),endangered population, asset loss,wetland loss.  IPCC methodreported.  Taking into account landdepression a relative sea-level rise of50-60 cm by 2100 is estimated.• No specific options mentioned but cost ofDM 300 million per year to 2100.Greece None.  • Studies have been conducted as inputs to planningprocesses. • Development of a national regulatory frameworkfor coastal areas is being financed.Iceland More frequent sea floods anddamage to roads, harbours and otherstructures, land erosion. • Study launched on the vulnerabilities and to seekways to reduce impacts.Ireland 176,000 km2.  (0.25%) of total landarea believed to be at risk fromsea-level rise, mainly in the west ofthe country.  Erosion or flooding ofcoastal transport routes.• Coastal zone management study initiated toprovide a strategic approach.• Cost of protection by building sea defencesestimated to reach Irish £ 270 billion (1990 prices).Japan Sea surface temperatures to rise by 1.2-1.8 degrees.  Sea-level risearound the country estimated to be20-40 centimetres.  Japan to lose57-90 per cent of its sandy beaches(for 30-100 cm sea-level rise). Coupled atmosphere-ocean generalcirculation model cited. • Raising levels of breakwaters, bulkheads, mooringquay walls, wharves.  Additional flood protectionmeasures.• 12 trillion yen to maintain coastal facilities atpresent levels. Lithuania Erosion, inundation. • Planning regulations• Coastal research programmeFCCC/TP/1999/1Page 37Party Reporting of impacts of sea-levelrise and methods usedCoastal adaptation optionsand technologies reportedNetherlands Sediment losses using sedimentbudget analysis. • Policy of ‘dynamic preservation’ and research tofind best way to supplement loss of sediment from theforeshore (7-12 metres deep).• Design of new structures must incorporate a 50cm sea-level rise.  Rotterdam storm surge barrier(1997) was the first such structure. NewZealandCLIMPACTS model predicts 17-35 cm sea-level rise for NewZealand by 2050. • New Zealand Coastal Policy Statement guideslocal authorities in their day-to-day management(local authorities responsible for avoiding,minimizing and mitigating the costs and effects ofnatural hazards. Poland 2,200 km2 of coastal zone, 230,000people at risk assuming 1 m sea-levelrise. • Implementation of all feasible precautions andprotective measures aiming at minimizing land loss• Total cost of protection reaches Zl 34.5 billion(1990 prices). • Establishment of protective systems along opencoasts (16.3 km of dykes, 21.7 km of sea walls and1 km. of offshore breakwaters). • Preservation of polder on periphery of Odra riverestuary. • Construction of 100-280 km of new dykes andreconstruction of 240-340 km. • Modernization of the existing polders. Portugal Acceleration of erosion, innundationof low-lying coastal areas, increasedrisks of flooding close to rivermouths and to coastal structures. • Make inventory of regions at risk.• Regulations, planning measures. • Promotion of natural conservation of beaches anddunes.• Regulations to enforce consideration of problemof sea-level rise for new coastal structures.RussianFederationImpact of sea-level rise on ports(e.g. St. Petersburg). • Dam constructed at St. Petersburg to preventflooding may be seen as a protection against longer-term sea-level rise. Spain Inundation and beach loss, increasederosion assuming 50 cm sea-levelrise by 2100 (IPCC).None.Sweden Ports/bridges using 0.5 m sea-levelrise scenario.• ‘Costly adjustments’ to ports and bridgesUnitedKingdomImpacts related to agricultural land,coastal aquifers, coastal flooding,fish stocks; nursery and aqua-culturesites; salmon and other migratoryspecies.• Planning policy guidance.• Research on climatic status of UK coastal waters.UnitedStatesInundation of low-lying areas, shoreerosion, more coastal flooding, salineintrusions within 1 metre of meanhigh water.• Fourfold strategy:  hard and soft engineeringmanagement options as well as property protectionstrategies. • Federal Coastal Management Act requires statesto consider the problems of sea-level rise in theirprogrammes.• Coastal Risk Assessment Database developed. Source: UNFCCC secretariat.FCCC/TP/1999/1Page 38Annex III DESCRIPTION OF COASTAL ADAPTATION TECHNOLOGIESTable 1.  Examples of technologies to assess coastal processes,characteristics and vulnerabilitiesTechnology DescriptionData gathering technologiesTide gauges The ability to detect changes in relative sea level (isostatic vs. eustatic sea level) is,in itself, an extremely important aspect of adaptation.  Tide gauges measure waterlevels relative to land.  Requires very long-term commitment to maintain system ofgauges and analyse data. Wave gauges Wave gauges are used to measure various characteristics of waves including:  height, period, length, direction.  There are various types of wave gauges including: wave rider buoys, pressure gauges, and wave recorders.  Networks of wavemonitoring stations require fairly sophisticated maintenance and long-term support. Wind recorders  Wind recorders measure various properties of wind (e.g. strength, direction).  Onceinstalled, wind recorders require basic maintenance and data handling skills.Current meters Current meters are used to measure current velocity and direction as well as to mapsea surface topography.Salinometers Salinometers are instruments to determine the degree of salt water intrusion incoastal areas.Sediment traps, dredgegrabsVarious devices, including sediment traps and dredge grabs, can be used to collectsediments for coastal sediment analysis and mapping.Geological surveys Geological surveys provide information on solid geology, long-term geomorphology, plus local availability of rock, sand, aggregates.  Surveys can beexpensive to perform. Echo-sounders andcontinuous seismicprofilers (CSP)Echo sounders and CSPs are used in topographic/bathymetric surveys to obtaininformation about the topography of the ocean bottom. Beach profiling Beach profiling involves conducting surveys of the cross/long beach profiles usingvarious manual techniques.Habitat mapping Field mapping of ecosystems.  Numerical/qualitative in situ data gathering.  Timeseries information can be collected by the field deployment of the instrumentation. Baselineenvironmental surveysBird counts, plant surveys, fisheries surveys.  However, large natural variabilitymake direct causal links difficult. Contingent valuationmethod (CVM)surveysCVM surveys are used to solicit the views of local users (e.g. to determine therecreational value of beaches). Shoreline monitoring Shoreline monitoring involves the collection of various kinds of quantitative andqualitative data.  Potentially low cost if community-based but can be highertechnology (e.g. satellite).  To be useful, data need to be checked, collated andanalysed. Historical coastlinechange A variety of methods can be used to map historical coastline changes including useof old maps, charts and photos and interviews with long-term residents. Techniquescan be inaccurate but can be better than nothing. FCCC/TP/1999/1Page 39Technology DescriptionSatellite remotesensing, aerialphotography mapping Remote sensing is the collection of various kinds of data (e.g. geophysical such assea surface mapping and topography, biological, environmental) using satellites andin some cases aircraft.  Satellites are commercially available with resolutions up to1 metre.  Examples of uses of aerial photography include lidar - a technology derived from theoil exploration industry (and described in the forthcoming IPCC Special Report). Data from remote sensing generally need support of field data. Data management and decision support technologiesWave prediction Global and regional wave propagation models may be run in real time.  Most modelshave been developed by the private sector. Modelling of waveprocessesWave generation and wave transformation processes can themselves be modelled.Good input data and training is necessary, while the results can be of limitedaccuracy. Hydraulic laboratories Hydraulic laboratories are important for testing the engineering properties ofstructures in particular hydrodynamic conditions and can support various kinds ofmodelling activities:  experimental; numerical; dynamical.   Laboratories representessential institutional capacity to assist in coastal adaptation.  However, they areexpensive to establish and maintain.Predictive climatemodelling Predictive climate modelling is a young and mainstream coastal engineering research activity.  There is still a long way to go in research terms, particularly inpredicting coastal change in the medium and long term.  This work is clearlyimportant when predicting the effects of climate change and assessing the impacts ofalternative solutions.  Particularly important are models that can translate globalmean sea-level rise into regional and local implications. Flood warning andemergency responsesystemsFlood warning systems consist of a series of monitors and a central database.  Theyare an efficient means of reducing loss of life due to coastal flooding.  These systemscan also make an important contribution to limiting the damage to property (if, forexample, people can carry their most valuable belongings upstairs). Buildingwarning and emergency response capacity can provide measurable returns oninvestment.  There is some evidence that if people are confident that they will not die in a flood, they will be more willing to participate in schemes for enhancingcoastal resilience which may involve them making some compromises e.g. acceptinglost productivity due to occasional flooding of their land.  The United StatesNational Flood Insurance Programme (NFIP), for example, requires informationtechnology to define the hazardous zone.  Eligibility for flood insurance is providedin return for obeying codes. Source:  UNFCCC Expert Meeting on Coastal Adaptation Technologies, 22-23 March 1999, Bonn.FCCC/TP/1999/1Page 40For each of the technologies described in tables 2 and 3 of this annex, an indication of theparticular adaptation option (managed retreat, accommodation or protection) which thetechnologies support is provided, together with a brief description of the technology and, whereappropriate, other relevant information regarding, for example, costs, advantages ordisadvantages. Table 2.  Examples of demonstrated technologies to support implementation of retreat(managed), accommodation or protection coastal adaptation optionsTechnology DescriptionReplacementeasementsOption supported:  managed retreatAlternative easements (access routes to and from the coastal area) in some cases mayneed to be arranged for in advance of their erosion/submergence.  Such easements mayhave additional impacts on land not directly affected by coastal erosion. Inland flooddefences Option supported:  accommodation Inland flood defences are structures which essentially create a new coastal strip that isvulnerable to more frequent flooding.  The area behind the defence is less vulnerable.This is a potentially cheaper option than other protection technologies, though itinvolves the adaptation of  land use near the coastline e.g. from crops to grazing. Flood-warningsystems Option supported:  accommodationFlood warning systems can provide real-time predictions of high tides, surges and waveovertopping, and disseminate warnings.  However, the systems need to be backed up byrefuges, escape routes etc.  (see also entry in table 1 of this annex).  Such systems alsohave the disadvantage of potentially being inaccurate, leading to complacency or fear. Relocation ofreservoirs inlandabove the coastalzone Option supported:  accommodationRelocation of freshwater supplies currently in the vulnerable zone to somewhere abovethe saline intrusion zone may be necessary.  In turn this requires componenttechnologies used for reservoir reconstruction, pumping.  Disruption costs arepotentially high.  Better managementof rain/waste waterOption supported:  accommodation Various component technologies related to drainage and sewerage schemes would beneeded to improve the management of rain and waste-water to reduce potentialgeotechnical erosion and recession problems.Dune management Option supported:  accommodationThe active management of dunes can contribute to the reduction of human-causedstresses on the coastal zone and wind damage and allow dunes to retreat landward. Potential drawbacks include reduced access and amenity and eventual land loss on theinland side of dunes. FCCC/TP/1999/1Page 41Technology Description“Building withnature” techniquesOption supported:  managed retreat, accommodation“Building with nature” techniques can include the creation, maintenance or restorationof  wetlands, marshlands and dune systems.  In cases where re-vegetation is required tosimulate natural forms of dune or back-shore protection, this may involve the use ofhorticultural or arboricultural technologies to produce large numbers of seedlings oryoung plants needed to re-vegetate large areas.  Re-vegetation is a relatively low-costapproach which does not disrupt coastal processes.  Indigenous “pioneer” species fordune stabilization are particularly effective as a ‘bridging  technique’ so that naturalvegetation can be restored. Mangroves, for example, are a natural form of coastal protection, though they are notsuitable for all coastal conditions (they are happiest in fine-grained soft organic mudsdeposited in sheltered locations).  Other types of vegetation such as shrubs, grasses andground-creeping vines have also been used in re-vegetation projects.  Some locationsmay not be suitable for plantation.  Care needs to be taken to choose the rightvegetation, planting and fertilization for local conditions. These natural technologies may only accelerate existing morphological trends notchange them.  Such approaches may only work well for small wave climates and inparticular seasons.The creation of wetlands and marshlands requires space, new set-back lines, proactivethinking, relocation of existing facilities and buildings.  Artificial wetlands may takedecades to replace the biodiversity of natural ones.  In turn, this requires a commitmentto long-term planning.  Techniques such as setting aside land which is allowed tobecome saturated with autochthonous water and in turn encourage creation of peatbogsor even lakes are important options (e.g. see Klein et al, 1998).  Dredgers Option supported:  managed retreat, accommodation, protectionDredgers are an essential part of the heavy equipment needed to build and maintaincoastal structures.  They are expensive to run and maintain.  Dredgers are vesselsequipped with various types of equipment suitable for moving large quantities ofsand/mud from one place to another.  They are an important component technology ofmany other techniques and practices to stabilize or grow with the coast.  Dredgers areclassified according to the mechanisms employed to lift and shift the sand etc.  Hencethere are hopper dredgers, bucket dredgers, sweep dredgers, disc cutter dredgers, cuttersuction dredgers.  Certain methods of pumping sand have also been given names.  Thereis for example the ‘Rainbow Method’ of dredging. Dredgers are particularly important for ‘beach nourishment’.  Beach nourishment maybe the creation of a planned beach profile by dumping large quantities of sand onto thebeach, or the creation of sand or shingle groynes using a combination of dredgers andmechanical earth movers.  Nourishment preserves the natural beach and does not disruptcoastal processes.  Disadvantages are that nourishment requires heavy equipment and asupply of sand.  Typically this is not feasible for small projects.  The current scale ofbeach nourishment is around 30 million cubic metres per year in United States, and ofthat order in Europe.  Over time, the sand washes away and nourishment needs to becarried out again. New, bigger dredgers which could operate at greater depths, more cheaply, could help  to reduce costs and environmental impacts, though the scope for such improvements isthought to be limited.  At depths greater than 100m turbidity can be damaging todredgers.  While dredging operations are highly technological, the mobilization ofdredgers (getting the right dredge to the right place at the right time) is itself asignificant components of overall costs.  The key part of the dredger is the sand pump.  It is thought there are very limitedpossibilities for developing cheaper, efficient sand pumps. FCCC/TP/1999/1Page 42Technology DescriptionMechanical earthmovers.Option supported:  retreat/accommodation/protection Earth movers are used to push around large quantities of sand to make planned beachand dune profiles, at relatively low cost.  The equipment is generally expensive topurchase, with moderate technology and maintenance costs. Various methods tostimulate growth ofcoral reefs orartificially simulatethemOption supported:  protection Coral needs suitable surfaces to grow upon.  The importation of a substrate of carbonatesand or rock can therefore encourage reef growth (limited to environments where coralreefs develop naturally).  Reefs themselves are a particularly effective natural coastaldefence technology, acting like submerged breakwaters to dissipate incoming waveenergy. Concrete piles have been driven into the seabed to act as a substrate to attract reefcolonization.  This technology is demonstrated in the Maldives.A form of artificial coral reef has been demonstrated using wire mesh through which alow electric current is passed.  Calcites then form on the mesh.  A method wasdeveloped called ‘Seacrete’.  Geotextiles (see below) are covered with chicken wireconnected to a low voltage electrical source.  The electric field induces chemicalreactions with the sea water.  After a few months the wire is covered by a fewcentimetres of calcium rock with a structure similar to natural coral stone.  Thistechnology has also been used to create underwater sculptures.  It would requirerelatively expensive sources of electric power, though this could possibly be supplied byrenewable energy.Floating or ‘surfing’ reefs are constructed and held down on the sea bed.  Reefs can enhance biological diversity and be used, for example, as fisheries.  Reefs and piles areunlikely to solve the problems of sea-level rise.  They  may themselves generate adverseeffects on adjacent coasts, navigation channels. Hand-placed rock seawalls (inclined)Option supported:  protectionLocal rocks combined with other materials (e.g. shingle, coconut by-products) arehand-placed to form sea walls.Hand-placed rock sea walls are a common line of protection used, for example, in thePacific region (e.g. extensively used in Kiribati).  Placed correctly and maintained, hand-placed sea walls have been demonstrated as an effective technology.  Human-builtstructures can be surprisingly better than machine ones, as humans are good at packingand placing rocks.  These walls are relatively simple to put in place but still need someskill.  However, they have limited capacity to withstand waves and, like all sea walls,have some adverse hydraulic effects. Gabions Option supported:  protectionGabions are low-cost wire or plastic baskets filled with local materials (shingle).  Thebaskets vary in size from half to one metre cubed.  Baskets are placed together asbuilding blocks to form structures or buried revetments to act as a last line of defence ina storm.  The great advantage of gabions is that they can be constructed with a minimumof equipment.  They are also portable and can be removed if not effective. However,they deteriorate rapidly.  Some supervision may be required to fill with suitable size andshape rocks.  Gabions are particularly suited to lagoonal shores.Timber piles Option supported:  protectionTimber piles are an important component technology used for other structures (e.g. a low-cost method of making reefs or sea walls).  Piles are driven into the sand.  Usedtyres or other material can be placed over the piles and fixed together with chains orbolts.  A supply of timber resistant to biodegradation is needed.FCCC/TP/1999/1Page 43Technology DescriptionBags made fromgeotextile materialOption supported:  protection/retreat Geotextiles are bags, mattresses, tubes and containers made out of high-strength fabricsand filled with sand, mortar.  These different shaped bags or tubes are then used to makelarge structures.  Mattresses and bags are generally used for slope and bed protection,tubes and containers for construction of groynes, perched beaches or offshorebreakwaters.The first applications of this technology started in the 1950s, with more rapiddevelopments in the 1970s.  Geotextiles are a relatively cheap alternative to riprap(rock), concrete units or asphalt as a construction material.  A main obstacle to theirlarger scale deployment is the lack of proper design criteria for the geotextile structures(e.g. Pilarczyk, 1994).  Geotextiles are particularly useful for the construction ofunderwater breakwaters and sills, which are not easy to construct with traditionalmaterials.Several geotextile designs are patented.  Examples include Longard tubes, Dura bags,Fabriform range, Bolsaroca, Bolsacreto, Cochacreto.  Geotextile structures are not stable in the long term - a possibly attractive feature for managed retreat options. Coastal protectionunits (also known as‘armour units’)Option supported:  protectionCoastal protection units or ‘armour’ units are an important component technology ofcoastal structures, particularly in situations where there are no local or even regionalsupplies of riprap.  Armour units are precast high-strength concrete structures (weighingup to 2 tonnes).  They are available in many different shapes and sizes.  Often theseshapes are specifically designed to be interlocking to give a structure made up of suchunits stability.  The key to a successful armour unit design is one which withstands wave motion and in which the units do not start to move about.  Moving causes damageto the protection units, breaking off ‘arms’ or other features, eventually rendering thestructure much weaker. Armour units are generally an expensive solution often used to protect expensiveinfrastructure built on exposed coasts and where there is a lack of large rock (commonlyknown as “armour rock” or “riprap”).  They also require heavy equipment. They canhowever be designed to suit particular wave conditions.  The cost of a typical armourunit is around US$ 50.  Of the order of tens of thousands are needed per kilometre ofcoast to be protected. Major technical breakthroughs in the design and effectiveness of coastal protection unitsare unlikely.  Manufacturers already have incentives to create lighter, longer lastingunits for less money.  Any real breakthrough would most likely have to come from useof non-conventional materials.  Many designs for coastal protection units are proprietary.  Names for the designs of various units or concrete revetment blocksinclude:  Gobi (ERCO), Jumbo, Shpiap, Nami Ring, Stepped, Waffle, Lok-Gard,Terrafix, Armourloc, Tri-lock, SHED, Nicolon Armourflex, A-Jacks FCCC/TP/1999/1Page 44Technology DescriptionGroynes Option supported:  protectionGroynes are structures placed perpendicularly to the shore to trap sediments.  Theyre-distribute currents along the coast, altering long-shore sediment transport as a result.Groynes are constructed using wood, other local materials, concrete or steel.  Theimmediate sand build-up on the up-drift side of the groyne is however combined withan immediate erosion on the down-drift side (often resulting in failure of the piles). Introduction of groynes is often a direct response to an acute sediment erosion problem. Groynes can be a relatively effective and low-cost way of preventing further erosion. A major problem however is that accretion of sediment means that beaches down driftare deprived of nourishment and erode faster.  Effectively, groynes will shift the erosionproblem down drift.  Sediments are needed for the groyne field to work.  Groynes are anunnatural beach obstruction and can if badly designed force sand off the beach into deepwater.  This approach is generally not recommended because of detrimental effects onthe coastline.Revetments Option supported:  protection  A revetment is a slope consisting of loose or interlocking protection units (geotextilesmay also be used).  Revetments are medium to high-cost structures which provideprotection to banks or cliffs of erodible material.Bulkheads and seawalls Option supported:  protection Bulkheads and sea walls are retaining walls made of concrete or interlocking rockswhose primary purpose is to hold or prevent sliding of the soil while providingprotection from light to moderate wave action.  Sea walls are stronger, larger versions ofbulkheads designed to prevent the back-shore from heavy wave action.  Non-verticalwalls on the seaward side more efficiently prevent ‘overtopping’ as the wave hits.Several aspects of the geometrical design of sea walls together with use of othermaterials at the base of the wall can improve the performance characteristics of thestructure. Bulkheads and sea walls are heavily engineered inflexible structures.  Bulkheads andespecially sea walls are generally expensive structures requiring proper design andconstruction supervision.  They protect the land area only and frequently cause adversehydraulic impacts in front of the wall, including down drift.  Few designs can be built by manual labour and from local materials.  The structures have the side-effect ofencouraging beach erosion.  Typically they are deployed to protect high land and capitalvalues, where threatened property and buildings cannot easily be relocated. These hard structures with relatively long lives can prevent autonomous coastal change. They are brittle structures and can fail catastrophically with no warning.  They requiremaintenance and can give a false sense of security.Inexpensive designs are often ineffective.  The south Pacific experience, for example,with inexpensive sea walls has been generally unsuccessful with one or sometimes twogenerations of sea walls having failed (other examples include areas in the Majuro Atolland in the Marshall Islands). Breakwaters Option supported:  protection Breakwaters are double-sided structures with water on both sides, used (as their namesuggests) to dissipate wave and current energy.  They therefore need to be muchstronger and substantial than groynes.  Breakwaters use large amounts of rock material(of the order of several cubic metres of material per metre of breakwater) and requirespecial construction equipment.  They can be constructed perpendicular or parallel to the shore or to form harbours. Breakwaters are generally expensive, sophisticated structures.  They are therefore moreprevalent in industrialised countries with a coastal engineering tradition.  Anybreakthrough in materials consumption of breakwaters would require designs usinglarge voids.  One low-cost option is to construct the core of the breakwater with wastematerial e.g. old car tyres.FCCC/TP/1999/1Page 45Technology DescriptionStorm surge barriers Option supported:  protectionStorm surge barriers are sophisticated, expensive coastal defence structures that canprotect tidal inlets, rivers and estuaries from occasional surge events.  They generallyincorporate advanced technology, and have high capital and maintenance costs.Maintenance is crucial and requires a flood warning system.  These barriers are notapplicable everywhere, but are best suited to tidal inlets with narrow mouths. Flooding and stormdrainsOption supported:  accommodation/protectionFlooding and storm drains are technologies to manage the run-off of rain water.  Theycan prevent serious erosion during stormsPolders Option supported:  protectionPolders are areas with an artificially controlled water level.  The polder technique is amethod to encourage the accumulation of sediment.  Polders themselves may not reverse erosion trends. Source:  UNFCCC Expert Meeting on Coastal Adaptation Technologies, 22-23 March 1999, Bonn.FCCC/TP/1999/1Page 46Table 3.  Examples of new technologies to support implementation of retreat (managed), accommodation or protection coastal adaptation options‘Coastal Drain BeachManagement System’Option supported:  protection (beach nourishment)Lowering the water table below a beach can alter the beach profile.  Anovel approach to beach nourishment has recently been demonstrated which does not require the use of dredgers.  A channel is dug along thebeach about 5 metres from mean tide level (the ‘uprush’ zone) and 4 metresdeep.  Drainage pipes are inserted in the channel together with a pumpingsystem to drain the pipes.  Sand is replaced.This is a relatively new technology demonstrated in non-macro-tidal areas.The technology represents a very local solution to a larger problem.  Energycosts could be considerable.  Emissions could be reduced by usingrenewable energy.Bubble curtains Option supported:  protectionBubble curtains have been demonstrated in the laboratory as a wavedissipation technology.  Air is pumped and dissipated through tubes.  Awall of bubbles has been shown to be effective at dampening wave forces.The technology has not been demonstrated on a large scale.  Air pumpsrequire energy.  One possibility is that this could be renewable energy.Self-priming buried sand pumps Option supported:  protectionAn innovative idea is that self-priming pumps could be buried on the seafloor.  Potentially such a technology could be an effective part of a beachmanagement system for recycling material, particularly if powered byrenewable energy sources.  These pumps would provide additionallong-shore transport of sand from areas of accretion.  However, thetechnology may be expensive to run and may require substantialmaintenance. Movable structures Option supported:  managed retreatIn order to be able to retreat it would be beneficial to have movablestructures, perhaps on a modular basis, which can be disassembled quicklyand relocated to a set-back position.  Potential drawbacks include conflictswith local or traditional planning practices. Field of underwaterscreens/horizontal slabsOption supported:  protectionFields of underwater screens have been demonstrated in the laboratory as apotentially effective wave dissipation and near-shore stabilizationtechnology.  Concrete slabs can be buried vertically in the seabed. Prototypes have been demonstrated to dissipate incoming wave energy andprevent sediment loss.  The design of correct field structure for localconditions would require sophisticated modelling and monitoringtechnologies. Horizontal concrete slabs placed under the surface water attenuate incomingwave energy.  In some instances they have been demonstrated to be better atattenuating waves than vertical ones (see Bouchet, 1992).Underwater pneumaticbreakwatersOption supported:  protection (wave dissipation)Underwater pneumatic breakwaters are a high technology solution toattenuate waves.  They oscillate in harmonic sequence with incoming waves and kill them almost completely if tuned exactly to the incomingwave period.  This technology is unproven, expensive, and would requirehigh maintenance.  Sophisticated sensing equipment would be needed totune to incoming waves.  May require an energy supply. FCCC/TP/1999/1Page 47Wave energy generating floatingbreakwatersOption supported:  protectionDesigns for wave energy generating breakwaters have included rows ofbuoyant ‘wedges’ strung together which oscillate with incoming waves. The waves behind the floating breakwaters are significantly damped.  While wave energy generation technologies have been demonstrated forover two decades, they have proved expensive and unreliable.  They mayhowever be suited to generally calmer conditions where stresses are less.More attractive if there is a need for electricity as well as coastal protection. Floating/inflatable breakwaters Option supported:  protection Tyres have been used as a buoyant material for floating breakwaters.  Tyresare fixed together to form floating rafts.  These rafts dampen incomingwaves.  These are small-scale structures suitable for small-scale waves.The ‘Wave Maze’ rubber tyre floating breakwater is patented and cannot beused without payment of royalties.  Goodyear tyre company has alsodeveloped a design which may be used without charge.  Relatively hightechnology is needed for the connections and high maintenance. Geotextiles with an impervious layer can be filled with air.  These devicesare lashed together and fixed down to the seabed.  Floating breakwatershave been demonstrated in sheltered waters with locally generated waves.They are not thought to be effective in open ocean conditions.Source:  UNFCCC Expert Meeting on Coastal Adaptation Technologies, 22-23 March 1999, Bonn.FCCC/TP/1999/1Page 481     Extracts from the following report prepared for the UNFCCC secretariat:  “Worldwide overview of coastalzone management centres and coastal engineering centres”.  Netherlands Coastal Zone Management Centre,National Institute for Coastal and Marine Management, Ministry of Transport, Public Works and WaterManagement, P.O. Box 20907, 2500 EX The Hague, The Netherlands.Annex IVOVERVIEW OF COASTAL ZONE MANAGEMENT AND ENGINEERING CENTRES:  A PILOT SURVEY 1The UNFCCC secretariat has undertaken a pilot survey of international centres of coastalzone management and coastal engineering with the cooperation of the Coastal Zone ManagementCentre (CZMC) in the Netherlands.  The purpose of the survey was to establish an overview ofthe national, as well as international, institutional capacity available to support coastaladaptation.The survey was undertaken through:  • A literature review (including the Tropical Coast Journals 1996-1998); • An Internet search; and • Inputs from experts from the Coastal Zone Management Centre and theInternational Institute for Infrastructural, Hydraulic and EnvironmentalEngineering (IHE) in the Netherlands, including surveys of attendance atimportant coastal zone management and engineering meetings.A number of preliminary conclusions can be drawn from the pilot survey regarding thestatus of national and international coastal zone management and engineering centres andnetworks.  At the national level, the survey revealed that, in many countries, a wide variety ofcentres and individuals are working in the field of coastal zone management and engineering.Typically, five broad categories of institutions operate at the national level, including:  • National laboratories for civil and coastal engineering • National departments of fisheries, environment, tourism, planning etc.• National science and technology universities • Private sector consulting and construction firms• Non-governmental organizations Industrialized countries with long coastal engineering traditions (e.g. the Netherlands,Denmark, the United Kingdom, the United States of America, Japan, France, Spain, NewZealand, Australia, Greece) tend to have a variety of institutions in each category.  Developingcountries, on the whole, tend to have fewer institutions, with some more than others.  At theinternational level, the pilot survey identified nine examples of international or regional centreswhich are particularly active in facilitating the development and transfer of knowledge andFCCC/TP/1999/1Page 49expertise in the field of  coastal zone management and engineering (distinct from a wider groupincluding centres of expertise in coastal sciences) (see table).  Further conclusions regarding thepilot survey are also described in section IV. D. Examples of international and regional centres active in facilitatingthe development and transfer of knowledge and expertise in the field of coastal zone management and engineeringCentre Regional/national coverageCoastal Zone Management Centre (CZMC) http://www.minvenw.nl/projects/netcoast/index.htmSouth Asia, Southeast Asia, Central America,Baltic area, Southeast Africa, North Africa,Caribbean, Black Sea regionCoastal Resource Centre (CRC)http://crc.uri.eduRegional field programmes in:  Asia, Easternand Southern Africa, Latin America and theCaribbean, United StatesCenter of Excellence in Coastal Resources Management(CECRM)http://www2.mozcom.com/~admsucrm/ Philippines, Southeast AsiaCoastal Resources Institute (CORIN) http://www.psu.ac.th/corin/Thailand and the Asia Pacific regionInternational Centre for Coastal Resources Research(CIIRC)http://www.upc.es/ciirc/MediterraneanCoordinating Committee for Coastal and OffshoreGeoscience Programmes (CCOP)http://www.ccop.or.th/Thailand, East and Southeast AsiaSecretariat for Eastern African Coastal Area Management(SEACAM)http://www.seacam.mz/Eastern and Southern AfricaInternational Centre for Living Aquatic ResourcesManagement (ICLARM)http://www.cgiar.org/iclarm/Bangladesh, Caribbean, Eastern Pacific, Egypt,Malawi, Solomon IslandsCenter for Coastal and Marine Resources Studies(CCMRS)http://www.indomarine.or.idIndonesiaSource: Netherlands Coastal Zone Management Centre.- - - - -",
    "Link": "https://core.ac.uk/download/160275655.pdf"
}