{
    "Title": "Open educational resources: shared solutions for higher education",
    "Authors": "Weedon, Alexis",
    "Year": "No year available",
    "Abstract": "Open Educational Resources (OERs) are a response to a need for more flexible licensing of educational materials. The OER Movement aims to create materials which can be exchanged and recombined for educational purposes. In the Higher Education sector, some universities (notably MIT) have led the way in putting their course material and lectures online. One of the effects of this has been a greater diversity in student access and recruitment[1]. However, there are many different approaches across the Higher Education sector, and most UK universities control access to some or all of their course content, licensing or selling the Intellectual Property to partner institutions",
    "Keywords": "No keywords available",
    "Publisher": "University of Bedfordshire",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " JPD 13   across the University of Bedfordshire, in order to increase student engagement with these tools in the referencing and reflective processes.  A workbook should be made available as a wiki with a link published on the Media Learning Resources webguide.  A weblog should be incorporated into the Media webguide to facilitate promotion and feedback upon resources and training. References Abram, S. (2006) Web 2.0, Library 2.0 and Librarian 2.0: preparing for the 2.0 world. SirsiDynix OneSource 2 (1). Available at: http://www.imakenews.com/sirsi/e_article000505688.cfm. [Accessed 21st July, 2008] Bradley, P. (2006) Web 2.0: a new generation of services, part 2. Library + Information Update. 5 (6), June, pp. 38-39. Bradley, P. (2007) How to use Web 2.0 in your library. London: Facet Publishing. Chad, K. (2007) ‘Are you missing the point?’ In Library and Information Gazette, 21 September – 4th October, pp. 2. Godwin, P. and Parker, J. (eds.) (2008) Information literacy meets library 2.0. London: Facet Publishing. Godwin, P. (2006) ‘Information Literacy in the age of amateurs’. Paper given at eLit 2006 5th International Conference on eLiteracy, Loughborough. Joint Information Systems Committee (2008) Great expectations of ICT: how Higher Education Institutions are measuring up: Research study conducted for the Joint Information Systems Committee. London: Ipsos MORI. Library Technology Reports (2006) Exploring Web 2.0 and libraries. July-August 2006. Available at: www.techsource.ala.org. [Accessed 10th May, 2008]. Miller, P. (2005) ‘Web 2.0: building the new library’. Ariadne. 45. Available at: http://www.ariadne.ac.uk/issue45/miller. [Accessed 10th May, 2008] Notess, G.R. (2006) The terrible twos: Web 2.0, Library 2.0 and more. www.onelinemag.net May/June 2006. [Accessed 16th May, 2008]   Schallert, D. L., Reed, J. H., & the D-Team (2003) Intellectual, motivational, textual, and cultural considerations in teaching and learning with computer-mediated discussion. Journal of Research on Technology in Education, 36, pp.103-118.  \"Talking Point...\"  Open Educational Resources: Shared Solutions for Higher Education Professor Alexis Weedon, University of Bedfordshire   Open Educational Resources (OERs) are a response to a need for more flexible licensing of educational materials. The OER Movement aims to create materials which can be exchanged and recombined for educational purposes. In the Higher Education sector, some universities (notably MIT) have led the way in putting their course material and lectures online. One of the effects of this has been a greater diversity in student access and recruitment.1 However, there are many different approaches across the Higher Education sector, and most UK universities control access to some or all of their course content, licensing or selling the Intellectual Property to partner institutions.   Providing content for free may seem counterintuitive, but business models in other                                                           1 See Open Learn Report and MIT statistics at http://ocw.mit.edu/about/site-statistics/  JPD 14   fields suggest that successful systems of cultural and educational production must ensure access to content to encourage take-up. In our case we need to ask how OER can underpin the University’s values of internationalisation, access, partnership, and innovation.  Take the example of publishing. Regulatory and institutional restrictions on the publishing industry in other countries have often led to atrophy as they frequently reflect a conservative attitude to new ideas and markets. In our society we recognize the need for a balance between services which are free at a point of delivery, such as our public library system, and the commercial interests of the book trade. Such situations are often oversimplified as an ‘either or’ competitive market. What is more important is how both contribute to the cultural environment in which books are valued, reading encouraged, and where high literacy levels are acknowledged as of quantifiable social and economic benefit. As books help us understand each other’s differences and points of view, education aids our ability to work in a complex society. People may choose to borrow a book they believe to be of transitory interest and purchase a book which has affected them, or appears to have a longer term application in their life. What is important is the association between both actions, and that if there is the niche for one, there is likely to be the niche for the other.  Universities such as MIT show how Open Educational Resources can be successfully designed to complement the core business of the University. It is perhaps easiest to see how our access mission is fulfilled by OER, but OERs can also help our partnership with industry, innovation and application of research and internationalisation. Nevertheless, research is needed into how this complementarity can function best in our educational environment: in particular in providing an education service to our international partners and students. Although it must be noted that OER does not provide academic, administrative or pastoral support, it only provides educational resources as a starting point for learning, research and collaboration. OER is actively supported by UNESCO; it has its own community wiki at http://oerwiki.iiep.unesco.org/index.php/Main_Page which contains its own OER toolkit. Crossing Media Boundaries: Adaptations and New Media Forms of the Book is a project initiated by the Faculty of Creative Arts, Technology and Science at the University of Bedfordshire. Its aims align with the University's agenda, as well as UNESCO's medium term strategy, principally in its 'education for all' agenda. It will assist the objectives of building knowledge societies by collaborating between institutions which provide Higher Education in communication and the media, and sharing and disseminating the knowledge gained though the project via multiplatform distribution. If it is awarded external as well as internal funding, the project will be an excellent opportunity for researching the value of OER to the University.  The project will address the following specific aims:  1. To contribute to aims of education for all by employing appropriate technologies to augment the physical book, improving access to knowledge and provide accessible, affordable and multiplatform resources.  This aim for the project underpins the University’s access mission.  JPD 15   2. To support development by surveying and analysing trends in the use of mobile media and internet technologies as a cost-effective and geography-independent way of sharing book resources, and provide knowledge transfer opportunities via industry links.  This aim for the project underpins the University’s commitment to blended learning.  3. To preserve the cultural heritage of national book cultures in new e-book developments.   This aim for the project underpins the University’s internationalism agenda through linking institutions in India, China, Australia and the UK to work on the research.  The project’s aims relate to the work of UNESCO's objectives in the following ways:  Attaining quality education for all and lifelong learning: The projects outputs include a published (free/OER) website of academic and teaching materials using data collected and demonstrating the models and methods for use in Higher Education teaching. Implementation and use will be monitored to feedback into the design and content. Data collected through the survey will identify gaps in gender equality though the use of gender analysis and sex disaggregated data. The project will work towards equality for women in education by building support for change though alliances and partnerships.   Building inclusive knowledge societies through information and communication: The project will research levels of access to electronic texts and their use across a variety of platforms. Websites are not always accessible or open for technological or regulatory reasons. Alternative platforms such as mobile phones are in some places more accessible. Practice-led research will create two augmented books openly available to the project team to assess and use.  Accessible, affordable multiplatform resources: The potential for the dissemination of information and collaborative work will be explored through the project. Using open access software for the project’s collaborative ‘sandpit’ site, will enable it to be inclusive, pluralistic, equitable, open and participatory. As one partner said, she is committed to the project because ‘electronic media are particularly important for the third world: websites are a cost-effective and geography-independent way of sharing resources’. OER can use social media to increase access and use.  While generating its own content the project would explore how this content is used in the collaborating centres, looking at issues of access, cost, and participation, cultural relevance, sustainability, and integration and support of the taught curriculum. It will also seek to understand whether OER can aid international academic exchange and support student mobility. It will help us understand how OER can underpin the University’s values in internationalisation, access, partnership, and innovation.  ",
    "Link": "https://core.ac.uk/download/29822090.pdf"
}