{
    "Title": "Dr. Vaughn Bryant Visit plus two lectures",
    "Authors": "Climate Change Institute",
    "Year": "No year available",
    "Abstract": "I am requesting funding for Dr. Vaughn Bryant\\u27s recent visit (March 19-21) to UMaine where he met with a diversity of researchers across campus and presented two lectures on his areas of expertise. Vaughn is Professor of Anthropology and Director of the Palynology Laboratory at Texas A&M University. He is internationally known for his research in forensic pollen analysis, prehistoric diet reconstruction, honey research, and in the reconstruction of paleoenvironments. Dr. Bryant conducts extensive forensic palynological investigations for the CIA, DOE, and Customs and Border Protection (CBP). He pioneered efforts in three new and emerging areas of pollen research including: 1 ) the floral sources used by honeybees to produce honey, the use of pollen coefficient data to identify and verify premium grades of honey, and techniques used to identify the geographical origin of commercially-imported and exported honey; 2) the use of pollen data to track and help eradicate agricultural insect pests such as the boll weevil, corn earworm, root worm, and celery looper; and 3) the use of pollen as an important forensic tool used to track and convict criminals. Dr. Bryant has published numerous books, over 150 scholarly publications, and hundreds of presentations around the globe, and he was honored with the prestigious Fryxell Award for Interdisciplinary Research by the Society for American Archaeology, the premiere archaeology society. He has appeared on the Today Show, CNN, Fox Network News, the BBC, CBS News, 3-2- 1 Contact, and the Discovery Channel. His c.v. is attached",
    "Keywords": "No keywords available",
    "Publisher": "DigitalCommons@UMaine",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "The University of Maine\nDigitalCommons@UMaine\nCultural Affairs Distinguished Lecture Series Cultural Affairs Committee\n4-2012\nDr. Vaughn Bryant Visit plus two lectures\nClimate Change Institute\nFollow this and additional works at: https://digitalcommons.library.umaine.edu/ca-lectureseries\nPart of the Higher Education Commons\nThis Grant Application is brought to you for free and open access by DigitalCommons@UMaine. It has been accepted for inclusion in Cultural Affairs\nDistinguished Lecture Series by an authorized administrator of DigitalCommons@UMaine. For more information, please contact\num.library.technical.services@maine.edu.\nRepository Citation\nClimate Change Institute, \"Dr. Vaughn Bryant Visit plus two lectures\" (2012). Cultural Affairs Distinguished Lecture Series. 248.\nhttps://digitalcommons.library.umaine.edu/ca-lectureseries/248\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "Link": "https://core.ac.uk/download/217065156.pdf"
}