{
    "Title": "From Forgotten To Fought Over: Neoliberal Restructuring, Public Schools, And Urban Space",
    "Authors": "Aggarwal, U., Mayorga, Edwin",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "From Forgotten to Fought Over: Neoliberal Restructuring,Public Schools, and Urban Spaceby Ujju Aggarwal andEdwin Mayorgasfonline.barnard.edu /navigating-neoliberalism-in-the-academy-nonprofits-and-beyond/ujju-aggarwal-edwin-mayorga-from-forgotten-to-fought-over-neoliberal-restructuring-public-schools-and-urban-space/0/IntroductionBrandeis High School was located on 84th Street in an area of Manhattan known as the Upper West Side. However,84th Street was not always the Upper West Side. Historically, 84th Street and the area surrounding it were primarilycomprised of low-income African American, Haitian, Latino, and White residents. Like so many other neighborhoodsof New York City, as a result of multiple waves of gentrification, the area is now comprised of a percentage ofaffluent residents, the majority of whom are White. Amidst these neighborhood shifts, however, Brandeis continuedto serve low-income students and students of color until 2009, when the New York City Department of Education(NYCDOE) decided that it was a failing school and slated it to be phased out, or closed.[1]Brandeis was one of several large, comprehensive high schools in New York City. It was also the case study forMichelle Fine’s seminal Framing Dropouts.[2] To a large extent, the conditions that Fine documented over twentyyears ago have not considerably changed over time: Brandeis continued both to be under-resourced and to serve astudent body that was predominantly low-income and Black and Latino.[3] The school also served a large number ofEnglish language learners as well as students with special needs. Brandeis was among over 100 schools that wereclosed during Michael Bloomberg’s tenure as Mayor.[4] In many ways, Brandeis is representative of a forgotten orabandoned place, which Ruth Wilson Gilmore describes as “planned concentrations or sinks—of hazardousmaterials and destructive practices that are in turn sources of group-differentiated vulnerabilities to premature death….”[5]During the phase out of Brandeis, as the students slowly disappeared, the question arose as to what should be builtin the space. And it was during this time that Brandeis—or more precisely, the building that once housed Brandeis—transformed from being a place that was once forgotten and never sought after, to one that became fought over.Several scholars have drawn upon David Harvey’s articulation of accumulation by dispossession to highlight therelationships between restructuring in education, the increasingly explicit role of market forces that permeate state-driven education reforms, and the gentrification of urban neighborhoods.[6] Building upon the work of these scholars,we use historical and ethnographic methods to examine what the case of Brandeis might tell us about how thecontinued production of what Gilmore terms “group differentiated vulnerability to premature death”[7] occurs intandem through urban renewal and education reform.[8]In the sections that follow, we trace state-driven education reforms and urban renewal programs that moved throughBrandeis and through the Upper West Side over the course of several decades. We begin with an examination ofhow the education reforms that claimed to fix Brandeis only allowed for a continued dispossession. While thesereforms ensured that the world inside Brandeis remained consistent over time, the world outside the building waschanging rapidly. We chart how urban renewal programs for the Upper West Side facilitated a gradually increasingdisjuncture between the school and its surrounding community. Finally, we interrogate the cultural logic thatundergirded the negotiation of this disjuncture during what we term the postmortem period of Brandeis phase out.[9]A History of Reform1/16In this section we use Brandeis to examine the contradictory dimensions of decades of state-driven educationreforms. By tracing these reforms as they were implemented at Brandeis, we hope to demonstrate that the currentcrisis in education is neither a new nor an accidental phenomenon. Rather, the very same reforms that claimed to fixso-called failing schools like Brandeis only ensured a slow and steady, yet aggressive dispossession.The official discourse of education reform over the past four decades might best be described as variations on atheme, and can be traced back to the 1983 report A Nation at Risk: The Imperative for Education Reform, issued bythe Reagan Administration’s National Commission on Educational Excellence.[10] The report arrived on the heels ofthe 1970s fiscal crisis. By 1982, the year preceding the report’s publication, unemployment had reached 10.8percent nationally, and in 1980, inflation had hit 13.5 percent as a yearly average, the highest it had been since1947.[11] As noted by Michael W. Apple, during this time education became a key dumping ground through whichthese realities were explained and rationalized.[12] Indeed, a major claim made by the report stated that the “risingtide of mediocrity that threatens our very future as a Nation and a people” was due to a failing education system thatcould be fixed through reforms that focused on four key areas, central among which was the development of uniformand measurable standards.[13]Standards were presented as an appeal to excellence and to the promise of meritocracy offered by the dominantnarrative of public education as the “great equalizer.”[14] One of the primary ways standards were to be measuredwas through the implementation of high-stakes tests, an instrument for student evaluation that are termed as suchdue to their role in determining specific consequences for students, including promotion in grade levels.[15] Coupledwith calls for standards and accountability were debates over the role of the state, and specifically the federalgovernment, in education. In the years following A Nation at Risk, presidential administrations would shape the riseof what has come to be termed the “accountability regime.” This regime grew considerably during the Clinton years,as a result of the Goals 2000 program, which focused on accountability and allowed states to design their ownacademic standards and tests.[16] Goals 2000 would ultimately not create new mandates, but was considered awatershed moment in which there was, as Patrick J. McGuinn suggests, a “fundamental break with the historicalfederal education focus on promoting access and equity for disadvantaged groups and initiated a new era in whichthe federal government would emphasize academic improvement for all students.”[17] The “accountability regime”then, marked a shift to measurement, metrics, punitive consequences for “failure.”The George W. Bush administration’s No Child Left Behind Act, and its accompanying calls for testing and fundingtied to accountability (promoted by Goals 2000), was integral to the solidification of the accountability regime. NoChild Left Behind (NCLB) made high-stakes tests mandatory for all public school students in grades three througheight.[18] NCLB also expanded the range of those impacted by these tests to include individual school workers aswell as entire school communities.[19] Advocates of NCLB echoed the rationale for reform advanced by A Nation atRisk and identified public education as a major culprit that was to blame for societal problems. Significantly, race andclass were particularly highlighted by the Bush administration’s official discourse on NCLB, and the administrationpromised to close the achievement gap for low-income students and students of color by increasing accountabilityfrom schools. The market-based ideology of standards and accountability put forth by A Nation at Risk and Goals2000 was woven through the policy guidelines and mechanisms of NCLB. For example, provisions included inNCLB allowed for testing to emerge as the single instrument of assessment of student progress; teachers at schoolsthat failed to demonstrate improvement (or Adequate Yearly Progress) could be fired, and schools could be closed.Despite the rhetoric surrounding these reforms—of providing equal opportunity and greater accountability—thecombination of uniform standards and high-stakes tests have instead increased inequities in educationalachievement, access, and outcomes.[20] This contradiction has been particularly pronounced in New York City,where in 2002 Mayor Michael Bloomberg introduced the Children First initiative, which, among other measures, re-centralized the nation’s largest school system.[21] Within this reconfiguration of governance, the Bloombergadministration made significant use of NCLB provisions to utilize test scores to aggressively penalize schools, such2/16as Brandeis, that were deemed to be underperforming.The NYCDOE’s decision to close Brandeis was accompanied by a decision that three small schools would beopened in the building. Brandeis’s student population, which began being phased out in 2009, would steadily bereplaced by growing student populations at these new schools. Small schools is a term used to refer to aneducational reform movement that started in the 1970s and was led by progressive educators who sought to disruptthe model of large, comprehensive high schools—like Brandeis—which they assessed to be representative of afactory style of schooling that only warehoused low-income students. As an alternative, they called for the creation ofsmall, innovative schools that emphasized progressive pedagogy and curricula, building community within theschool, and growing relationships among students, teachers, families, and the school’s surrounding community.Over the past decade, the Bill and Melinda Gates Foundation has identified small schools as a key prototype forinvestment, and as a result, small schools have rapidly expanded across the country. In their book Small Schools:Public School Reform Meets the Ownership Society, scholar-activists and veteran small-school advocates Michaeland Susan Klonsky trace the ways that the small-schools movement has been hijacked within the context ofrestructuring ushered in by NCLB:The launching of scores of new small and charter schools in Chicago cannot be understood apartfrom community economic redevelopment and the effort to make the city an important hub in theglobal economy …. Chicago’s small-schools movement was, from its inception, tied by many stringsto the city’s redevelopment plans and therefore represented a collage of educational and politicalforces, including business and educational interests ….[22]Among the small schools that opened in 2010, as Brandeis was being phased out, was Frank McCourt High School.According to news articles, Frank McCourt High School was “highly anticipated by middle and upper class familieson the Upper West Side who want a selective school close to home.” It was also heavily supported by state andlocal officials who claimed it responded to a demand for a second “high performing” high school in theneighborhood.[23] According to early documents announcing the school, admission to Frank McCourt was at firstdesigned to be “selective,” where admissions criteria were largely dependent on students’ high test scores.However, as the result of organizing by social-justice groups, parents, and activists, admissions criteria wasestablished that ensured that a significant percentage of students served by Frank McCourt would be similar indemographic characteristics to former Brandeis students, and that admissions to the school would be evaluatedbased on factors that extended beyond test scores.While the Frank McCourt plan was interrupted, another plan for the building was soon introduced. Success CharterNetwork (SCN), a fast-growing New York City–based charter-school management company, proposed that a newelementary school—called Upper West Success Academy (UWS)—be opened in the Brandeis building.[24] Over thelast decade, an increasing number of federal, state, and local governments have promoted the establishment ofcharter schools, a trend hat has resulted in considerable and patterned growth in New York City as well as inChicago and New Orleans. In these cities, as several have documented, high concentrations of charter schools arealso often linked to processes of gentrification through similar alignments as those identified above by Klonsky andKlonsky.[25] In New York City, charter schools often bid on portions of space within public-school buildings that aredetermined (by a panel appointed by the mayor) to be underutilized spatially either as the result of under-enrollmentor when a school—like Brandeis—is being phased out and as a consequence, space is available.[26]SCN’s 2010 bid on a portion of space within the Brandeis building was successful, and their expansion wasembedded within yet another reform that claimed to fix public schools: the Race to the Top Fund (also known as the“education stimulus”), which was part of the Obama administration’s American Recovery and Reinvestment Act of2009. Race to the Top (RTTT) allocated a $4.35 billion increase in federal funding for education. However, these3/16monies were not evenly distributed among the states.[27] Rather, states were required to compete against oneanother for funding. Further, similar in design to structural adjustment programs, RTTT linked needed funds tosignificant policy changes.[28] According to RTTT guidelines, states were eligible to compete for funds as long asthey were able to meet a set of requirements. For example, New York State was ineligible to apply to RTTT until itdid away with particular provisions which limited the number of charter schools that could exist at one time, andwhich barred students’ test scores from determining teachers’ salaries. In order to be able to compete for funding,New York State raised the cap from 200 statewide charter schools to 460, and also did away with provisions thatprevented merit-pay programs for teachers. Between 2010 and 2012, New York State received nearly $700 millionfrom Race to the Top monies.[29]As we will see, similar to the initial intention of Frank McCourt High School, UWS also billed itself as a solution to thefailure of public education that Brandeis was supposed to represent. And getting rid of low income students of colorwas key to the particulars of the solution posed by UWS. But first, it is useful to look back to the history of urbanrenewal that produced Brandeis to begin with, which culminated in a situation where Brandeis’s Black and Brownstudents became an anomaly on the Upper West Side.Disjuncture: Brandeis High and the Production of the Upper West SideIn this section, we examine—and problematize—the location of Brandeis within a shifting urban landscape. Wefollow the urban renewal programs that moved through Brandeis and the Upper West Side to demonstrate howBrandeis High School (1965–2012) went from being an institution whose student population reflected the racial andeconomic demographics of its surrounding neighborhood to an institution that came to represent a disjuncture ofspace and race, as those inside the school and those outside the school grew increasingly dissimilar.Before Brandeis, there was the High School of Commerce. Opened in 1901, Commerce was located on West 65thStreet between West End Avenue and Broadway in Lincoln Square, which is the southernmost section of the UpperWest Side. Established when attendance at high school was still a luxury, Commerce reflected a larger ideologicaland philosophical struggle over the purposes, designs, and leadership of school and school reform. In the earlytwentieth century, the task of education reform was led by a cadre of college professors and educationalprofessionals. Described historically as the “administrative progressives,” this class of men were seen as educationexperts. They would focus on reorganizing schooling to reflect a Taylor-ist factory model, focused on efficiency asthe optimal framework for aligning education with the ever expanding industrial economy of the time, and reachingthe rapidly growing population of new Americans who were landing at the boat docks everyday.[30] MultimillionaireAndrew Carnegie was invited to speak at the laying of the cornerstone of Commerce, where he noted that the schoolwould be a place where “the son of the laborer enters upon exactly the same terms as the son of the millionaire,”and that the school was representative of the United States’ path to ultimately becoming “the great manufacturer andexplorer of articles in the world ….”[31] Commerce was thus an early example of high schools designed for themasses, and of education that would map onto and sustain the economic trajectories of the nation and its growingcities.By the 1950s, the school primarily drew students from Lincoln Square, San Juan Hill, and areas north of theneighborhood, which were comprised of primarily working-class African American, Haitian, Latino (majority PuertoRican), and White residents.[32] By the early 1960s, Commerce was one of two Manhattan high schools to whichBlack and Latino students were generally assigned if they did not attend school in the zone where they lived.[33]Commerce had gained an image as a “troubled” school, and news accounts implied that increasing incidents ofviolence were attributable to “incorrigible” youth from “underprivileged backgrounds, gangs, and broken families.”[34]These descriptions of Commerce and its students were indicative of a larger discourse that was embedded withinthe Slum Clearance and Community Development and Redevelopment program, an urban renewal project thatreshaped the area between the 1950s and 1970s. The program was part of the Housing Act of 1949, which called4/16for the “elimination of slums by using public capital to acquire, demolish, and clear blighted areas.”[35]Moreover, the program promoted reinvestment from the private sector through subsidized incentives by grantingeminent domain to local governments, along with critical funding and tax incentives that covered two-thirds to three-quarters of the costs of land acquisition. While funds were made available to both state and local governments, themajority of federal dollars in New York State were allocated to the redevelopment of New York City, where RobertMoses headed Mayor William O’Dwyer’s Committee on Slum Clearance.[36] According to the New York City UrbanRenewal Authority (a federal agency), sites would be targeted for redevelopment in order to “eradicate rampantdeterioration and to stimulate private investment.” Under Moses’ leadership, by 1956 ten sites had been designatedfor clearance.[37] Among these sites was Lincoln Square.The Lincoln Square Urban Renewal Area initially began with eighteen square blocks between 60th and 66th Streets.To ensure the project’s success, the authority acquired additional adjoining properties to the north and west to serveas a buffer of “stable land.”[38] Moses’ vision, of a “reborn west side, marching north from Columbus circle, andeventually spreading over the entire dismal and decayed west side,” was thus realized through the support of thefederal government, and resulted in the creation of two different renewal projects across the 2.4-plus square milesof the West Side.[39]Commerce High was located within the “stable land” area that was to serve as a buffer for the Lincoln Square UrbanRenewal Area, and like the residents of Lincoln Square, the students of Commerce were displaced.[40] In the springof 1965, Commerce was designated for demolition, and the majority of the students were sent to Brandeis HighSchool, a new comprehensive high school that was opening on 84th Street.[41] Thus, although it was “new,”Brandeis inherited many of the students that Commerce formerly served, and many of the descriptors that hadqualified Commerce followed its students to Brandeis. In the years that followed, the neighborhood, along with thecity, continued to undergo processes of major racial and economic transformation, particularly accentuated by thefinancial crisis of the 1970s and 1980s, when Brandeis, along with other comprehensive high schools, becamesymbolic of an increasing moral panic.[42] Within this context, popular media portrayed Brandeis as a place ofviolence, decay, non-learning, and undesirable populations. As a graduate of one of the city’s elite high schools (wholived in the Brandeis High School area) recollects, by 1971 Brandeis was already being referred to as “theDrugstore” or “the Gauntlet” that was increasingly avoided by many students and families.[43]The racialized moral panic produced a response of white flight from the school system. Indeed, during the 1970sand 1980s, the percentage of White families who sent their children to Brandeis shrunk considerably. On the UpperWest Side, as Jonathan Kozol has noted, this phenomenon was particularly ironic given the pronounced liberalismthat characterized the area.[44] Brandeis became known for its concentration of low-income students of color, manyof whom were also English language learners. Yet, despite the fact that Brandeis was increasingly portrayed (bypopular media as well as by city officials) as emblematic of urban blight, the neighborhood demographics were notcompletely incongruent with that of Brandeis’s student population. The pre-1970s migration of Puerto Ricans,Haitians, and African Americans to the area was accompanied by the beginning of an out-migration of olderresidents from the neighborhood, and during the 1970s and 1980s the Upper West Side became “associated withthe indigent, poor, and bohemian elements of Manhattan.”[45]Between the 1970s and the 1990s, however, the city increasingly supported the growth of retail and infrastructure ofservices that would attract a wealthier population; and property values on the Upper West Side grew, as did themedian family income.[46] Beginning in the 1990s, the Upper West Side went through what real estate investors andhistorians have described as a “renaissance” that was characterized by the development of a number of luxurybuildings and a steady increase in upper-income residents.[47] By 2006, the Upper West Side accounted for thelargest increase in home ownership throughout Manhattan, and 46 percent of surveyed households registeredwithin the top quintile of New York City incomes ($100,552+). Low-income households were either increasingly5/16contained in rent-regulated apartment buildings, public housing projects, or homesteaded buildings. Many poor andworking-class families also migrated out of the neighborhood or outside of the city.[48] Amidst a changing urbanlandscape, Brandeis High School had continued to accept the same students it always had, along with studentscoming off of suspensions at other schools, released from incarceration, and other vulnerable or “at-risk”populations. By the late 1990s and early 2000s, a number of high schools, including Brandeis, had been deemeddangerous to the point that they required an increase in school safety agents (SSAs) and metal detectors.[49] Yet asthe area around 84th Street grew wealthier, there grew to be an increasingly visible racial and economic disjuncturebetween the students inside of Brandeis and the community surrounding the school. In the next section, we explorehow this disjuncture was negotiated during the postmortem period of the school’s phase out, as new claims weremade to this once-abandoned place.Postmortem Brandeis and the Cultural Logic of Academic ImaginariesIn 2009, following the rhetoric of NCLB reform, NYCDOE asserted that closing Brandeis was an act in service to thevery communities who had historically attended the school. Yet, as the number of students slowly diminished eachyear that the phase out was in effect, missing from the proposals that circulated about what would replace the so-called failing school was any consideration of the low-income students of color whom the school had served.Brandeis is part of New York City’s Community School District 3, which spans 59th Street to 122nd Street along theWest Side of Manhattan. Despite the gentrification and displacement that has impacted the area, and largely due toa significant public housing stock, the majority of public school students in the district continue to be low-incomestudents of color.[50] Indeed, public housing and public schools like Brandeis are the few remaining institutions thatserve the low-income communities of color in the area. Yet, as the neighborhood that surrounds these institutionschanges, these low-income residents and students of color are increasingly out-of-place in the very places andspaces that they have historically called home. In this section we examine how this disjuncture was negotiatedthrough the contestation that emerged over who would have the right to learn and grow in the Brandeis building asthe city, a charter management corporation, and middle-class families laid claim to a once-forgotten and long-abandoned place.Maia Cucchiara builds upon Miriam Greenberg’s concept of the urban imaginary (which refers to the ways thatcultural representations of cities are intentionally produced to work in tandem with global capital and labor needs) tochart the production of a parallel academic imaginary in gentrifying downtown Philadelphia. As she finds, the re-branding of particular public schools was made possible by public–private partnerships between municipalgovernments and business associations that marketed certain schools as neighborhood schools. These efforts, sheargues, were meant to appeal to middle-class families by positioning the re-branded schools as representative of aspecific type of urban life that relies upon an assumption of “families of similar status” who have come together tocreate an “idealized urban space dominated by a middle-class ethos, an ‘urban village’ of sorts where families ofsimilar status who share key norms and values experience the best of city life.”[51]The alignment between the NYCDOE and a charter management company that propelled the academic imaginaryof Upper West Success is well illustrated by the comments below, made by NYCDOE Deputy Chancellor of PortfolioPlanning Marc Sternberg:If the presence of a charter school in a community will keep a family in the New York City publicschool system, a family that might have been able to afford private school or that might haveconsidered moving to the suburbs because of the schools there, then we’ve done our job.[52]However, these moments of disclosure (of who is prioritized within the structuring of public services) are rare. In theparagraphs that follow, we examine the cultural logic that propelled the academic imaginary of Upper West Success6/16that—characterized by themes of neighborhood and community and a rhetoric of rights and choice—was groundedupon the implicit exclusion of low-income communities of color. Although they were written out of the future of whowould grow and learn in the Brandeis building, the Black and Brown students representative of Brandeis past werecritical to the construction of the academic imaginary of Upper West Success. They were, after all, the figuresagainst which an imagined community was constructed.One of the first indicators of Upper West Success’s academic imaginary was a pronounced shift in clientele targetedby the marketing campaign for the 84th Street iteration of the charter network. At the time, SCN already operated anumber of schools further uptown (including a significant number of schools in the same district), where it hadpitched its schools to low-income Black and Latino families as a necessary alternative to public schools that, likeBrandeis, were historically under-funded, ignored, and long-abandoned.[53] However, the aggressive marketingcampaign undertaken by SCN began even before October 2010, when the State University of New York (SUNY)Charter Institute officially approved the creation of Upper West Success.New York City charter schools are not required to adhere to the same regulations and requirements that governpublic schools. Unlike most public schools, then, charters do not have to solely serve the students of a particularresidential area: they usually agree to accept a certain percentage of local students, and outline this in theircontractual agreements with the city and state, or literally, in their charters. Utilizing this freedom, SCN aggressivelymarketed itself in particular areas north and south of 84th Street—while ignoring other areas of the district that hadbeen slower to gentrify.[54] The aggressive marketing campaign undertaken by SCN began even before October2010, when the State University of New York (SUNY) Charter Institute officially approved the creation of Upper WestSuccess.As part of its marketing strategies, SCN held open houses to recruit potential families. These open houses wereheld regularly at the Jewish Community Center as well as in private apartments along Central Park West andincluded wine and expensive hors d’oeuvres. In addition to the open houses, Upper West Success created glossybrochures, and advertisements were purchased on Google.com. Strikingly missing from early versions of thebrochures were the faces of any children who were identifiably of color, and for the first months of SCN’s advertisingcampaign, no applications were available in Spanish, even though the district continues to have a large Latino andSpanish-speaking student population.[55] SCN’s recruitment messaging, conveyed through its fliers and brochures,declared Upper West Success Academy the “public-school solution to private-school tuition.” At communitymeetings where the charter school was discussed, appeals made by advocates for the charter school were unifiedby an argument that SCN was a response to the needs of an increasingly diverse population that resulted fromgentrification.[56]Yet the academic imaginary of Upper West Success was constructed by a confluence of interests and a diversity ofactors that reached well beyond SCN. Indeed, at several public meetings held about the creation of the school,White and middle-income families became increasingly vocal about asserting their rights to neighborhood andcommunity schools. And these rights-based claims were constructed in opposition to racialized images of Brandeisstudents.The following comments are taken from a popular blog about New York City public schools and respond to an articleposted about the closure of Brandeis and the opening of Upper West Success[57] :Why can’t this/these schools serve the community, which needs them, rather than bused-in children?*Why do they put a school for the worst kids in the city in an otherwise wonderful neighborhood. Thetax payers of the UWS are already going to have to subsidize every aspect of these kids lives, from7/16their single mother’s welfare checks, to their food stamps, to the public transportation that bringsthem to school, to their “education”, to their future incarceration, BUT we also have to tolerate thembringing their “thug-life” mindset to the stroller packed streets of the UWS….. Whatever they want todo, let them do it in their own neighborhoods.*I, for one, am not sad to see this school go. Let’s stop walking around the problem; the students, ifyou could even call them that, are the problem. Not the administration, not the new standards forschool evaluation, and certainly not the teachers. These kids are leeches to society, they only causeharm….punk ass kids. You know exactly what kind of kids I’m talking about.*…. here on the Upper West Side, we have one sought-after high school… that can accommodateonly a small fraction of our kids who apply, so they are also travelling around the city. Why not reopenBrandeis as a neighborhood high school? What am I missing?*… Get rid of the students who are the problem. Stop being so politically correct and careing for thestudents who disrupt the learning process. Get rid of the problem and schools won’t have to CLOSE.[sic]These commentators not only position Brandeis students as problematic, but as the problem: as the cause for thefailure of the school and its necessary closure. Moreover, according to the first commentator, Brandeis students notonly harm the school, they harm society as a whole. Importantly, the commentators, who locate themselves asresidents of the Upper West Side, position these depictions of Brandeis students against the community, or morespecifically, their community.These concepts of community and neighborhood are buoyed by a particular rhetoric of rights and choice that hascome to be palpable on the Upper West Side in conversations about whom the district’s schools should serve andprioritize.[58] Embedded within these discussions is a joined logic of the market and rights: of those who deservetheir rights, and those who don’t. And, as evidenced by the example below, race and class contour the fault linesbetween the two.On a January evening in 2011, the NYCDOE held (as required by law) a Joint Public Hearing about the opening ofUpper West Success Academy.[59] The hearing was held in the Brandeis building’s auditorium, and on their waydown the stairs to the meeting, while waiting to add their names to the attendance and speakers’ lists, parents andcommunity members commented on how well-kept the building was, and what a difference the recent buildingrenovations had made; $22 million had just been put into the building to update it when the smaller high schoolswere opened. Close to 400 people were in attendance. Over 100 parents, teachers, students, and elected officialsspoke both in favor of and against the charter school. As the hearing was called to order, Sheila, a middle-agedWhite woman, scurried in and looked for an empty seat. She found one near the front and sat down—and as shenestled in her seat, she talked about the reasons she had come out that night. Like most mothers, Sheila wanted agood school for her child. Upper West Success was important, she believed, because a school that served thecommunity was needed. According to Sheila, too many “Brooklyn grandmothers” who didn’t even live in the areahad gained access to the district’s schools.Implied in Sheila’s comments are raced and classed based references to women—raising their children’s children—who are supposedly cheating the system by working hard to ensure that their children get a good education,8/16sometimes by shuttling them back and forth for hours every day on long cross-borough journeys. In contrast tothese imagined grandmothers is the notion that those who have chosen to move to the Upper West Side are therebyentitled to and deserving of a particular set of public goods and services.[60] See, for example, the following quotefrom the Upper West Success Academy’s website, about the need for the school:There are lots of high quality public schools on the Upper West Side. That’s why many of us chosethis neighborhood in the first place and why so many new families continue to move in. The problemis: there are not enough of these great schools to meet current demand.[61]Proprietary claims such as the one above position the problem, “there are not enough great schools to meet thecurrent demand,” as one of supply shortage, not of structural inequality. According to this market-based logic, rights—even to public goods that are supposed to be universal, such as public education—are contingent upon choicesthat are predicated on economic wealth. As Stuart Hall explains, concepts of difference and choice have significantlyguided the economic and political restructuring of recent decades. As such, the citizen consumer is confronted witha differentiation of public goods. This differentiation is accompanied by a growing inequality as well as a increasedonus on the citizen consumer to make the right choice. As Hall notes, this structuring of public goods as marketgoods excepts the state from guaranteeing that all hospitals and schools, for example, are excellent.[62] Suchreasoning, as exemplified within the academic imaginary of Upper West Success, anticipates exclusion.In the end, the combined forces of City, SCN, and the middle-class families won, and SCN was slated to open in thefall of 2011. But as Upper West Success Academy got ready to open its doors, a range of other issues needed to beaddressed: How would a school that was built for high-school students physically accommodate kindergarteners?Woven into these debates about renovations that needed to be made to adjust the building to smaller students wasthe question of metal detectors—would kindergarteners really be expected to pass through these machines? Ratherthan remove the policing infrastructure from the school altogether, another solution was devised: a separateentrance so that Upper West Success Academy students would not be required to pass through the checkpoints thatwould continue to operate as usual for the “big kids” with whom the school was being shared.Indeed, even as the students themselves disappear, the figures of Brandeis students remain. The fall of 2011marked the entrance of the first group of Upper West Success students and the last group of Brandeis students.That same year, at a Community Education Council[63] meeting held in a small room at the district’s offices on 93rdStreet, a few parents—all of whom were White—chatted before the meeting began. They were discussing, withconcern, a recent incident of violence that involved an older and a younger student. The first question asked was,“Was it Brandeis kids?” It was not, yet their figures, or perhaps the shadows of their Black and Brown bodies thatrepresented a threat to these parents, loomed.In many ways, Upper West Success is an exaggerated symptom of a much older problem: how some remainconsistently forgotten while the futures of others continue to be well-secured. Yet the cultural logic that emerges inthe postmortem period of the phase out of Brandeis and in the struggles that ensued over what would take its placeelides this reality; and dispossession—propelled by a group of would-be concerned villagers claiming that this once-abandoned place should serve the community’s children—appears not only just, but also driven by concepts ofcommunity and neighborhood and a rhetoric of rights, and choice.ConclusionThat Brandeis was going to be closed came as no surprise to many. The NYCDOE had been closing a number ofschools throughout the city, most often with no consultation with school workers, students, or parents. After hearingthe news that Brandeis would be closed, one school worker commented, “We’ve been waiting for the other shoe todrop for years.” However, part of the story that gets lost amidst the echoes that surround this seemingly inevitable9/16“drop,” marked by the decision to close Brandeis, reveals the slow violence of education reform and illuminates amuch longer trajectory of a decades-long project of abandonment that extends well beyond the city’s 2009 decision.Rob Nixon defines slow violence as:. . . a violence that occurs gradually and out of sight, a violence of delayed destruction that isdispersed across time and space, an attritional violence that is not typically viewed as violence at all.Violence is customarily conceived as an event or action that is immediate in time, explosive andspectacular in space, and as erupting into instant sensational visibility. We need, I believe, to engagea different kind of violence, a violence that is neither spectacular nor instantaneous, but ratherincremental and accretive, its calamitous repercussions playing out across a range of temporalscales.[64]Stretching Nixon’s theory of environmental injustice to apply to public education, the city’s 2009 announcement ofthe closing can be considered a flashpoint and “newsworthy” event. Yet the slow violence that produced Brandeisremained relatively invisible, persistently active beneath the surface for decades. It worked through the state-drivenreforms that have claimed to redress unequal learning conditions. This violence also worked in tandem withdecades of state-sponsored urban renewal programs that silently (and sometimes not so silently) worked to displacelong-term residents and produce what is now the Upper West Side of Manhattan, and create a situation in whichBrandies students were out-of-place. And it continued through an emergent cultural logic that grounded theacademic imaginary of Upper West Success.For neighborhoods like the Upper West Side, schools are some of the few institutions through which low-incomecommunities of color find each other in the wake of this multi-layered, slow, yet steady violence; and through whichshared histories are still remembered and told. Before Upper West Success developers bid on space in theBrandeis building, they had first tried to obtain space at a nearby public elementary school that was not slated forclosure but which, according to the NYCDOE, was under-utilized. The parents and teachers at this school organizedquickly. They were able to fight back against the charter school co-location. Amidst the organizing meetings, severalstories emerged: of teachers who had taught there for decades, of families who had been part of the school for atleast three generations, and of school workers who had attended the school themselves. Like so many otherschools, and also like Brandeis, this school was more than a building; it was a place that held these histories, of thedaily acts of growing up, of working, and of the gendered labor of caretaking and raising children. Indeed, as oneformer New York City public school student reflected in a public meeting on education reform held in December2010, “If they close the school, how are you supposed to go to your reunion?”The question posed indicates what is at stake: a continued dispossession that threatens the capacity of acommunity to survive. The case of Brandeis and Upper West Success indicates a renewed forgetting andabandonment of a place and its people. We write through the postmortem lens of Brandeis’s phase out not to lamentits closure. Rather, we hope that by chronicling how Brandeis went from being a long-forgotten place to one thatwas sought after, we might inform potential strategies that interrupt the variegated forms and speeds of violence thatcontinue to circulate through public schools and the people who inhabit them.Footnotes1. “Phased out” is a term used to describe the multi-year process through which a school isclosed down after the NYCDOE identifies it as failing and determines closure as the solution.[Return to text]2. Michelle Fine, Framing Dropouts: Notes on the Politics of an Urban Public High School(Albany: State University of New York Press, 1991). Fine used the pseudonym10/16“Comprehensive High School” in her study. [Return to text]3. As Fine documented, only 20 percent of ninth graders made it to twelfth grade, and only 80percent of that group graduated. According to Brandeis New York State Report Cards, thestudent population continued to maintain similar rates of retention and graduation. Between2003 and 2009, Brandeis served between 98 and 99 percent students of color, with a free andreduced lunch population of approximately 71 percent and a LEP (Limited English Proficient)population of approximately 25 percent. New York State Department of Education,Comprehensive Information Report: Louis D. Brandeis High School. New York: New YorkState Department of Education, 2009. [Return to text]4. Micha Landau, “State Plans to Revise School Phase-out Process,” UFT.org, September 8,2011. [Return to text]5. Ruth Wilson Gilmore, Golden Gulag: Prisons, Surplus, Crisis, and Opposition in GlobalizingCalifornia (Berkeley: University of California Press, 2007), 35. [Return to text]6. See Kristen L. Buras, “Race, Charter Schools, and Conscious Capitalism: On the SpatialPolitics of Whiteness as Property (and the Unconscionable Assault on Black New Orleans),”Harvard Educational Review 81.2 (2011): 296–331; K.N. Gulson and T.C. Pedroni,“Neoliberalism, Cities and Education in the Global South/North” Discourse: Studies in theCultural Politics of Education 32.2 (2011): 165–169; Pauline Lipman, The New PoliticalEconomy of Urban Education Neoliberalism, Race, and the Right to the City (New York:Routledge, 2011); Pauline Lipman and David Hursh, “Renaissance 2010: The Reassertion ofRuling-Class Power through Neoliberal Policies in Chicago,” Policy Futures in Education 5.2(2007): 160–178. David Harvey, The New Imperialism (New York: Oxford University Press,2003), 158. Harvey describes accumulation by dispossession as the process by which“[a]ssets held by the state or in common were released into the market where overaccumulating capital could invest in them, upgrade them, and speculate in them. New terrainsfor profitable activity were opened up… Once in motion, however, this movement createdincredible pressures to find more and more arenas, either at home or abroad, whereprivatization might be achieved.” [Return to text]7. Gilmore, Golden Gulag, 28. [Return to text]8. Our sources include including news and multimedia archives and school documents as well asdata from participant observation and informal interviews. [Return to text]9. In this piece, we trace the raced and classed dimensions of the cultural logic that emergedduring the period of Brandeis phase out. However, it is important to note that gender is alsocritical to understanding how this logic was often articulated. On the one hand, the people whoanimated the forgotten place of Brandeis were low-income Black and Brown young men andwomen who were often imagined as both unworthy, “troubled,” or threatening. Theyexperienced raced and gendered hostility and aggressive behaviors from people outside theschool as well as school safety agents (SSA) inside the school. On the other hand, genderwas articulated during the period of “fighting,” as the place of Brandeis was transformed toinclude an elementary school. During this period, mothers who occupied different race andclass positions were laying claim to what they understood to be the rights of their children. Formore on the latter, please see U. Aggarwal, “The Politics of Choice and the Structuring ofCitizenship Post-Brown v. Board of Education,” Transforming Anthropology 22.2 (2014): 92–104. [Return to text]10. National Commission on Excellence in Education, A Nation at Risk: The Imperative forEducational Reform: A Report to the Nation and the Secretary of Education, United StatesDepartment of Education, 1983. [Return to text]11/1611. US Department of Labor, Labor Force Statistics from the Current Population Survey , Bureau ofLabor Statistics Data, October 15, 2011. [Return to text]12. Michael Apple, “Comparing Neo-Liberal Projects and Inequality in Education,” ComparativeEducation 37.4 (2001): 409–423. [Return to text]13. National Commission on Excellence in Education, A Nation at Risk. [Return to text]14. See Apple, “Comparing Neo-Liberal Projects”; Sandra Jackson, “Commentary on the Rhetoricof Reform,” Education as Enforcement: The Militarization and Corporatization of Schools, ed.Kenneth J. Saltman and David Gabbard (New York: RoutledgeFalmer, 2003); Samuel Bowlesand Herbert Gintis, Schooling in Capitalist America: Educational Reform and theContradictions of Economic Life (New York: Basic Books, 1976). [ Return to text]15. American Educational Research Association, “Position Statement on High-Stakes Testing,”www.aera.net, July 2000; Phil Gonring, Paul Teske, and Brad Jupp, Pay-for-PerformanceTeacher Compensation: An Inside View of Denver’s ProComp Plan (Cambridge, MA: HarvardEducation Press, 2007). [Return to text]16. Patrick J. McGuinn, No Child Left Behind and the Transformation of Federal Education Policy,1965–2005 (Lawrence, KS: University Press of Kansas, 2006); Diane Ravitch, The Death andLife of the Great American School System: How Testing and Choice Are UnderminingEducation (New York: Basic Books, 2010). [ Return to text]17. McGuinn, No Child Left Behind, 91–92. [Return to text]18. NCLB is a reauthorization of the Elementary and Secondary Education Act of 1965. [ Return totext]19. We use the term “school workers” from a more horizontal vantage point from which todescribe the various individuals who are paid laborers within the context of the school building.This includes, though is not limited to, teachers, administrators, guidance counselors, schoolpsychologists, physical and speech/language therapists, custodial services, healthprofessionals, kitchen staff, and school safety officers. [Return to text]20. New York State ranks among the top states nationally that maximize the utilization andexpansion of high-stakes testing. [Return to text]21. New York City’s public school system had been centralized until 1969 when, as the result of along and multifaceted struggle (known as the movement for “Community Control” of schools),the city’s public schools were broken up to integrate New York City schools. Diane Ravitch,The Great School Wars: New York City, 1805–1973: A History of the Public Schools asBattlefields of Social Change. (NY: Basic Books, 1974). Richie Perez, “A Young LordRemembers.” Jerald E. Podair, The Strike that Changed New York: Blacks, Whites, and theOcean Hill-Brownsville Case. (New Haven: Yale University Press, 2004). [Return to text]22. Michael Klonsky and Susan Klonsky, Small Schools: Public School Reform Meets theOwnership Society (New York: Routledge, 2008), 37. [Return to text]23. Maura Walz, “UWS Parents and Politicos Took Central Role in McCourt’s Building,”Chalkbeat New York, November 13, 2009. [Return to text]24. Charter schools are publicly funded schools that have been freed from some of the rules,regulations, and statutes that apply to other public schools, in exchange for fulfilling certainaccountability measures as set forth in the charter (National Education Association 2012).Charters have a complicated and contradictory history: while they were used as demonstrativeprojects by teachers and communities of color, many also argue that their roots can also betraced back to the segregation academies of the South. For a thorough overview and12/16interrogation of charter schools and the contemporary charter school movement, see MichaelFabricant and Michelle Fine, The Changing Politics of Education: Privatization and theDispossessed Lives Left Behind (Boulder: Paradigm Publishers, 2013). [Return to text]25. See Buras, “Race, Charter Schools, and Conscious Capitalism”; Lipman and Hursch,“Renaissance 2010”; Kenneth J. Saltman, Capitalizing on Disaster: Taking and BreakingPublic Schools. (New York: Routledge, 2008). [ Return to text]26. The ways the NYCDOE determines school utilization is a problem. It is not uncommon, forexample, for the DOE to include janitors’ closets in their accounting of square footage. Basedon these arbitrary calculations that do not take into account the particular needs of differentstudents in a school, the NYCDOE often mis-determines a school to be under-utilized. [Returnto text]27. Fabricant and Fine, The Changing Politics of Education. [Return to text]28. There are several definitions of structural adjustment programs. According to the Encyclopediaof Social and Cultural Anthropology, structural adjustment refers to “In development, a termused from the 1980s onward for a range of policies, strongly favoured (some would sayimposed) by international agencies such as the World Bank and the International MonetaryFund, usually involving drastic reductions in state activity (e.g. welfare payments or subsidieson foodstuffs) and so-called ‘liberalization’ of free market activity” (Barnard and Spencer 2010,623). [Return to text]29. The State of New York initially approved charter schools in 1998 and set the cap (or limit) at100 charter schools across the state. In 2007, this number was increased to 200. Since 2010,when the cap increased to 460, the number of charter schools in New York City has steadilyincreased from 99 charter schools in the 2009–2010 school year (with 30,000 studentsserved) to 136 charter schools in the 2011–2012 school year (serving 45,000 students).According to the NYCDOE’s Statistical Summaries, as of 2011, the student population in NewYork City public schools was 1,043,886 students (this number includes charter schoolstudents). These trends suggest that very soon, one out of every ten of New York City’s publicschool students will be attending a charter school. (See, for example, (NYC Charter SchoolCenter 2012). [Return to text]30. Herbert M. Kliebard, The Struggle for the American Curriculum, 1893-1958, 3rd ed. (New York:Routledge, 2004); David B. Tyack, The One Best System: A History of American UrbanEducation (Cambridge, MA: Harvard University Press, 1974). [Return to text]31. “Commerce High School Cornerstone Laid,” The New York Times, December 5, 1901: 6.[Return to text]32. William J. Wilson, The Declining Significance of Race: Blacks and Changing AmericanInstitutions (Chicago, University of Chicago Press, 1980); Marcy S. Sacks, Before Harlem: TheBlack Experience in New York City before World War I (Philadelphia: University ofPennsylvania Press, 2006). In the 1910s, San Juan Hill, located between Sixtieth and Sixty-fourth Streets and Tenth and Eleventh Avenues, was the place of residence for approximately80 percent of the entire Black population of the island of Manhattan. [Return to text]33. City Pupil Wins Fight to Attend ‘Better Integrated’ High School,” The New York Times,February 9, 1962: 14. [Return to text]34. Kaplan, Morris. “One Schools Finds Police Aid Useful.” The New York Times, February 4,1958. The New York Times (1923-Current file). [Return to text]35. Ian S. Tattenbaum, “Renewal for the 1990s: An Analysis of New York City RedevelopmentPrograms in Light of Title I of the Housing Act of 1949,” New York University Environmental13/16Law Journal 6.220 (1997): 221. [Return to text]36. Tattenbaum, “Renewal for the 1990s.” [Return to text]37. Wilson, Declining Significance, 38. How Moses ran the Slum Clearance and CommunityRedevelopment program was also important. According to Tattenbaum, “In other cities, slumareas were condemned, residents were relocated, buildings were demolished, and vacantlands were turned over to developers. Moses, however, claimed that he could not obtain firmcommitments from builders unless the slums were turned over to the developers with thebuildings still standing and residents still living there. As a result, Moses allowed thedevelopers to collect rent on occupied buildings, thus undermining incentives to demolish andreconstruct sites quickly,” 232. [Return to text]38. Wilson, Declining Significance, 38. [Return to text]39. Peter Salwen, Upper West Side Story: A History and Guide  (New York: Abbeville Press, 1989),274. [Return to text]40. Despite organizing efforts that included a lawsuit that eventually reached the Supreme Court,by 1958 the West Side Lincoln Square Urban Renewal Project had displaced 16,000 residentsof Lincoln Square, many of whom had lived there for decades (Wilson, Declining Significance).[Return to text]41. Brandeis High, along with a new elementary school a block away, were built as part of theWest Side Renewal Project to respond to shortages in school buildings across the city, as wellas part of the strategy to “clean-up” the neighborhood, which had become known for highlevels of drug trafficking and drug use (Wilson, Declining Significance). [Return to text]42. Stuart Hall, Policing the Crisis: Mugging, the State, and Law and Order (London: Macmillan,1978). [Return to text]43. Heather MacDonald, “How Gotham’s Elite High Schools Escaped the Leveller’s Ax,” CityJournal, September 20, 2011. [Return to text]44. Jonathan Kozol, Amazing Grace: The Lives of Children and the Conscience of a Nation (NewYork: Crown, 1995). [Return to text]45. Wilson, Declining Significance, 36. [Return to text]46. For example, as Wilson notes in Declining Significance, by 1980, the median family income inthe neighborhood rose by nearly $8,000 annually.[Return to text]47. Citi Habitats. “The Upper West Side.” NRT LLC. 2007. [Return to text]48. With the ongoing renewal processes and the rising cost in real estate in Manhattan, mostworking families and families of color would go down two paths. First, many were forced tosearch for more affordable situations in the neighborhood or outside of the neighborhood (andfurther away from the center of the city). Second, long-time residents organized to motivateinvestment in long-time communities as the foundation of renewal. Although some successwas attained, by the end of the 1980s, the city had started rolling back its financial support ofthese groups, leaving many unable to sustain their efforts to counter gentrification (Wilson,Declining Significance). [Return to text]49. Rakmil, Elise, Interview by Edwin Mayorga. Personal Interview. New York City, November 30,2011. The New York Civil Liberties Union (NYCLU) reported that by the start of the 2008–2009school year there were 5,055 school safety agent (SSAs), and 191 armed police officers inNew York City public schools. 99,000 students passed through metal detectors each day (NewYork Civil Liberties Union, “A Look At School Safety ” [2015]). In a 2007 report, the NYCLU also14/16found that the SSAs were hostile and aggressive, and made derogatory statements towardstudents. A Brandeis student reported that SSAs would make comments like “this girl has noass” to students (Elora Mukherjee, “Criminalizing the Classroom,” New York Civil LibertiesUnion, 2007). [Return to text]50. In 2010, 29 percent of the district’s public school students were Black; 36 percent were Latino;27 percent were White; and 7 percent were Asian (with 53 percent of students receivingfree/reduced lunch). This data does not include charter schools and is based on New YorkState District Profile Accountability and Overview Reports for 2010–2011. [Return to text]51. Maia Cucchiara, “Re-Branding Urban Schools: Urban Revitalization, Social Status, andMarketing Public Schools to the Upper Middle Class,” Journal of Education Policy 23.2 (2008):165–179, 172. [Return to text]52. Fernanda Santos, “On Upper West Side, Hurdles for Charter School,” The New York Times,January 22, 2011: A1. [Return to text]53. SCN as well as other charter management companies have since replicated similar strategiesin other gentrifying neighborhoods of New York City. These neighborhoods include, forexample, Cobble Hill and Williamsburg. [Return to text]54. The intentionality of SCN’s focused marketing was particularly apparent in its outreach effortsnorth of 84th and south of 122nd street, where there are still clusters of blocks (some largerthan others) that are comprised of low-income families, as well as a number of public housingprojects. [Return to text]55. According to Jennifer Friedman (co-founder of La Escuelita, a bilingual preschool in thedistrict), “I live on the West Side and have received 100 fliers [from West Side SuccessCharter] and I have never seen anything in Spanish” (as quoted in the West Side Spirit’sJanuary 20, 2011 article “Hype Fuels Charter Fight” by Josh Rogers). The organizing effortsby public school parents and teachers to block Upper West Success Academy from openingresulted in significant media coverage, which included critiques of the way the school haddeliberately marketed itself almost exclusively to white and middle-class families. In response,SCN produced different versions of the brochure, later versions of which included greater“diversity” in the students photographed as well as an eventual Spanish-language version.According to informal interviews and participant observation conducted over a five-monthperiod, low-income and public school parents attributed this change to the media attention thattheir organizing efforts had gained. However, “diversity” or representation in marketing was notnecessarily their goal (which was, rather, to block the school from opening). [Return to text]56. Santos, “On Upper West Side.” [Return to text]57. Phillsa Cramer, “Shrugs, sadness as Brandeis High School learns it will be closed.”  ChalkbeatNew York. February 3, 2009. [Return to text]58. Ujju Aggarwal, Edwin Mayorga, and Donna Nevel. “Slow Violence and Neoliberal EducationReform: Reflections on a School Closure,” Peace and Conflict: Journal of Peace Psychology18.2 (2012): 156–164. [Return to text]59. While the Department of Education holds these hearings, thus complying with legalrequirements, most often, the decisions that they are supposed to deliberate have alreadybeen determined by the time the hearings are held. Further, as Liza N. Pappas observes,“While the New York City Department of Education (NYCDOE) administrators have insistedthat school closings will ensure better educational opportunities and outcomes, communityactivists, union leaders, elected officials, educators, and others dispute this contention.Nowhere are these debates more visible than at public hearings. In compliance with the15/16reauthorization of the New York City mayoral control law, the NYCDOE convenes hearings formembers of the public to provide comments on proposals that introduce ‘any significantchange in school utilization’ including a closure, grade reconfiguration, resisting, or co-locationof schools (i.e., two or more schools housed in the same building). Over the past 3 years,thousands of people have packed school auditoriums across NYC in overwhelming oppositionto school closing proposals, but increasingly public hearings have become a site of contestbetween parents vying for excellent schools for their children.” Pappas, Liza N. “SchoolClosings and Parent Engagement.” Peace and Conflict: Journal of Peace Psychology  18, no.2 (2012): 165–72. [Return to text]60. While there is a rich discussion to be had about the articulation of raced and classedmotherhood (about which mothers make the “right choices” for their children), for the purposesof this piece we limit our discussion to ways that race and class determine the processes ofclaim-making and asserting of rights that inform discussions about inequality and educationreform. [Return to text]61. Success Charter Network, “Why the UWS?,” The Upper West Success Academy CharterSchool, October 17, 2011. [Return to text]62. Stuart Hall, “New Labour’s Double-Shuffle,” The Review of Education, Pedagogy and CulturalStudies 27.4 (2005): 319–335. [Return to text]63. Community Education Councils (CECs) are Community School Boards reconstituted throughthe re-centralization of the New York City public schools system. [Return to text]64. Rob Nixon, Slow Violence and the Environmentalism of the Poor (Cambridge, MA: HarvardUniversity Press, 2011). [Return to text]Tagsclass education history neoliberalism policy poverty youth16/16",
    "Link": "https://core.ac.uk/download/76221447.pdf"
}