{
    "Title": "Gene Therapy in Cardiac Arrhythmias",
    "Authors": "Francis, Johnson, Praveen, S.V, Venugopal, K",
    "Year": "No year available",
    "Abstract": "Gene therapy has progressed from  a dream to a bedside reality in quite a few human diseases. From its first application in adenosine  deaminase deficiency, through the years,  its application has evolved to vascular angiogenesis and cardiac arrhythmias. Gene based biological pacemakers  using viral vectors or mesenchymal cells tested in animal models hold much promise. Induction of pacemaker activity within the left bundle branch can provide stable heart rates. Genetic modification of the AV node mimicking beta blockade can be therapeutic in the management of atrial fibrillation. G protein overexpression to modify the AV node also is experimental. Modification and expression of potassium channel genes altering the delayed rectifier potassium currents may permit better management of congenital long QT  syndromes. Arrhythmias in a failing heart are due to abnormal calcium cycling. Potential targets for genetic modulation include the sarcoplasmic reticulum calcium pump, calsequestrin and sodium calcium exchanger.Lastly the ethical concerns need to be addressed",
    "Keywords": "No keywords available",
    "Publisher": "Indian Pacing and Electrophysiology Group",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " \nwww.ipej.org 111\nReview Article\nGene Therapy in Cardiac Arrhythmias\nPraveen S.V., MBBS, MD, DNB,  Johnson Francis, MBBS, MD, DM, FCSI,  Venugopal K., \nMBBS, MD, DM, FCSI.\nDepartment of Cardiology, Medical College, Calicut, Kerala, India\nAddress for correspondence: Dr. Praveen S.V., MBBS, MD, DNB, Department of Cardiology, \nMedical College, Calicut-673008. Kerala, India. Email: praveensv2001@yahoo.com\nAbstract  \n            Gene therapy has progressed from  a dream to a bedside reality in quite a few human \ndiseases. From its first application in adenosine  deaminase deficiency, through the years,  its \napplication has evolved to vascular angiogenesis and cardiac arrhythmias. Gene based biological \npacemakers  using  viral  vectors  or  mesenchymal  cells  tested  in  animal  models  hold  much \npromise. Induction of pacemaker activity within the left bundle branch can provide stable heart \nrates. Genetic modification of the AV node mimicking beta blockade can be therapeutic in the \nmanagement  of  atrial  fibrillation.  G protein  overexpression  to  modify  the  AV node  also  is \nexperimental.  Modification  and  expression  of  potassium  channel  genes  altering  the  delayed \nrectifier potassium currents may permit better management of congenital long QT  syndromes. \nArrhythmias in a failing heart are due to abnormal calcium cycling. Potential targets for genetic \nmodulation include the sarcoplasmic reticulum calcium pump, calsequestrin and sodium calcium \nexchanger.Lastly the ethical concerns need to be addressed.\nKey Words: Gene therapy; biological pacemakers; AV node modification; long QT syndromes; \nsarcoplasmic reticulum calcium pump\nIntroduction\n            Gene  therapy  is  defined  as  the  transfer  of  nucleic  acids  to  somatic  cells  as \ntherapeutically  useful  molecules.  Genetic  defects  can  be  corrected  or  gene  products  be \nexpressed by gene therapy. This approach has many potential  applications, the most obvious \nbeing the treatment of inherited monogenic disorders like cystic fibrosis. Human genome has \napproximately 30,000 genes. The genetic diversity is amplified by alternate splicing of mRNA \nand post translational modification of proteins. The possible gene targets  for arrhythmias is very \nlarge. Anti arrhythmic agents act by blocking the ion channels. These antiarrhythmics have poor \nchannel specificity and may cross  react  with other  ion channels.  In  addition they have poor \naffinity  for  the  channels  and  have  a  narrow  therapeutic  window.  The  molecular  targets  of \narrhythmia management are the ion channels and the modulators of ion channels like G proteins1.\nVectors for gene therapy\n            A vector is the vehicle commonly used to introduce the gene to the target cell. Vectors \nmay  be  RNA  or  DNA  viruses  or  non  viral  in  nature.  Viruses  which  have  the  capacity  to \nincorporate themselves in the host genome are used as vectors for gene therapy. The commonly \nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\nPraveen S.V, Johnson Francis, Venugopal K, “Gene Therapy in Cardiac Arrhythmias”  112\nused viral vectors are genetically modified retroviruses, adenoviruses, adeno associated viruses \nand lentiviruses. These viral vectors are made replication deficient to ensure safety, but requires \nlarge amounts of vector particles for efficacy. Non viral vectors based on plasmids, DNA- lipid \ncomplexes  and  naked  DNA  are  also  used  since  they  lack  foreign  proteins  and  avoid \nimmunological problems. None of the currently available vectors satisfy the criteria of an ideal \ngene therapeutic system. The feasibility of gene transfer has been demonstrated in both animals \nand humans.\n            In  contradistinction  to  the  experimental  laboratory,  the  extent  of  gene  transfer  and \nexpression is  low in  clinical  settings.  The  period during  which a  newly  introduced gene  is \nexpressed is variable and differs with the tissue, but is often short. For example, early-generation \nnon-viral vectors express the gene at maximum levels only for a few days2. Many adenoviral \nvectors express the gene for 2-3 weeks3.  Non viral  vectors also have short  duration of gene \nexpression.  Short  duration  of  gene  expression  necessitates  repeat  dosing,  although  less \nefficacious. By contrast, expression from adeno-associated viral vectors may not peak for several \nweeks, but then remain constant in some tissues for several months4. Retroviruses produce a long \nlasting effect by integration of the transfected gene into the host genome5\nMethods of gene delivery\n            The  classical  methods  of  vector  delivery  are  direct  injection  into  the  myocardium, \ninfusion through the coronary arteries or administration to the epicardium.Various novel methods \nof  transfection  have  been  tried  in  animal  models,  including  DNA polymer  coating  on  inert \nmaterials  and  subsequent  transfer  to  the  atrial  myocardium,  with  sustained  gene  activity6. \nIntracoronary perfusion is another modality of gene transduction with near  complete expression \nunder optimal conditions7. The gene transfer efficiency depends on the coronary flow rate, virus \nconcentration, virus exposure time and microvascular permeability. Agents which increase the \nmicrovascular permeability have been used to enhance the delivery. Each disease has its own \ntarget tissue and the amount of gene product required for treatment. So  only few generalizations \ncan be made about the vector selection and the method of gene delivery.\nThe need for gene therapy in cardiac arrhythmias\n            Antiarrhythmic medications suppress arrhythmias, but their systemic effects are often \npoorly tolerated and their proarrhythmic effects increase mortality. Radiofrequency ablation can \ncure  only  a  limited  number  of  arrhythmias.  Implantable  devices  can  be  curative  for \nbradyarrhythmias  and  lifesaving  for  tachyarrhythmias,  but  require  a  lifetime  commitment  to \nrepeated procedures, have a significant expense, and may lead to severe complications. The need \nfor new treatment strategies for cardiac arrhythmias has motivated the continuing development of \ngene therapeutic options  Gene therapy may prove to be a less intrusive, long-term solution to \narrythmias than pacemakers or antiarrhythmic agents. Gene therapy for arrhythmias is a field still \nin its infancy.\n            The ongoing research into gene therapy for  cardiac arrhythmias can be briefly discussed \nunder:\n1) Biological pacemakers\n2) AV nodal modification\n3) Long QT syndromes\n4) Arrhythmias of cardiac failure\n5) Ventricular arrhythmias\nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\nPraveen S.V, Johnson Francis, Venugopal K, “Gene Therapy in Cardiac Arrhythmias”  113\nBiological pacemakers\n            Conventional electronic pacemakers although highly efficacious, have a finite battery life \nand  problems related  to  lead  and  circuitry.  Biological  pacemakers  aim a  near  physiological \npacing by molecular or cellular targeting.Biological pacemakers can be cell  therapy based or \ngene therapy based. Strategies have included gene therapy using naked plasmids or viral vectors \nand cell therapy  with both adult human mesenchymal stem cells (hMSCs) and human embryonic \nstem cells8,9. Over the past few  years, gene therapy has been used to explore the overexpression \nof  β2-adrenergic  receptors,  the  down-regulation  of  inward  rectifier  current,  and  the \noverexpression of pacemaker current as potential sources of biological pacemakers10. The protein \nproduct of HCN2 gene is a candidate for the pacemaker current. Rosen et al from Columbia \nuniversity have recreated the biological pacemaker by  administering the pacemaker gene HCN2  \nvia viral vector or  in an hMSC platform to produce pacemaker function in the intact canine \nheart.  Adenovirus  containing  the  HCN2 gene [ad HCN2] on  introduction  in  canine  models  \nproduced  spontaneous  rhythms.\n            Another potential approach to a biological pacemaker is the induction of pacemaker \nactivity  within  the  left  bundle  branch,  thereby  providing  a  ventricular  escape  rhythm  with \nphysiologically acceptable rates. The long-term stability and feasibility of this approach remain \nto be tested11. Adeno viral vectors have been tried in animal models to create pacemaker clones \nfrom ventricular myocytes. The inward rectifier current [IK1] is responsible for the maintenance \nof the resting membrane potential. The main subunit of this is Kir 2.1. The Kir 2.1 gene was  \nmutated  to make it a dysfunctional channel (a dominant-negative), inserted into an adenoviral \nvector and  delivered to the hearts of guinea pigs. The enhanced automaticity of the ventricular \nmyocytes  subsequent  to  the  gene  transfer  conferred  pacemaker  like  properties12.  \nAV nodal modification\n            As in case of biological pacemakers, the field is limited to animal studies. The major area \nof research in gene therapy for tachyarrhythmias now is on AV nodal modification to produce \nAV nodal block mimicking beta blockade.\n            Genetic modification of AV node in an intracoronary perfusion model of porcine heart  \nwas reported by Donahue et al from John Hopkins University13. They infected porcine hearts \nwith Adbetagal (recombinant adenovirus expressing Escherichia coli beta-galactosidase) or with \nAdGi [adenovirus encoding the Galphai2 subunit]. Galphai2 overexpression suppressed baseline \natrioventricular conduction and slowed the heart rate during atrial fibrillation without producing \ncomplete  heart  block.  In  contrast,  expression of  the  reporter  gene beta-galactosidase  had no \nelectrophysiological effects. Reporter genes are nucleic acid sequences encoding easily assayed \nproteins.\n            AV nodal gene transfer can decrease heart rates in animal models of atrial fibrillation. \nInhibitory G protein overexpression  can prolong the AV nodal refractory period with slowing of \nconduction  resulting in reduced ventricular rates in atrial fibrillation14. In mouse models, cardiac \noverexpression of  adenosine receptor [A(3)AR] resulted in gene dose-dependent AV block and \npronounced sinus nodal dysfunction in vivo. These may have future therapeutic implications for \nSA and AV nodal modification15.  Focal gene transfer to the AV node  to produce a genetic \ncalcium channel blocker  has been successful in experimental settings. Over expression of the \nras  related small G- protein [Gem] in AV node slowed  AV nodal conduction  controlling the \nheart rate in atrial fibrillation16.\nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\nPraveen S.V, Johnson Francis, Venugopal K, “Gene Therapy in Cardiac Arrhythmias”  114\nLong QT syndromes ( LQTS)\n            Sympathetic imbalance was  previously thought to be responsible for this disease. Since \n1991, 7 LQTS genes have been discovered and more than 300 mutations have been identified to \naccount for the disease. Acquired LQTS, is presumed to be due to the blockade of the rapid \ncomponent of the delayed rectifier K+ current (IKr). Blockage of the IKr prolongs the QT interval \nand increases the dispersion of repolarization, predisposing to torsades de pointes. Molecular \ngenetic  analysis  could  be  useful  to  unravel  subclinical  mutations  or  polymorphisms.\n            Individuals  with  cardiac  potassium  channel  missense  mutation,  Q9E-hMiRP1  are \npredisposed  to  develop  QT  prolongation  after  clarithromycin  administration.  Experimental \nstudies have demonstrated that cells  transfected with plasmid DNA containing Q9E-hMiRP1 \nhave reduced potassium currents on exposure to clarithromycin.\n            Site specific gene therapy for arrhythmias by transfecting cell clones with the K+ channel \ngenes is a feasible approach to the management of LQTS17. Mutated K+ channels resulting in \nloss of function have been implicated in LQT 1 and 2. The potassium channel alpha subunit \ngenes KCNH2 [HERG] and  KCNQ1 [KvLQT1] responsible for Ikr and Iks respectively are \nmutated in LQTS. In normal epithelia, KCNE3 [E3] interacts with the KVQT1 [Q1] thereby \naugmenting the potassium currents. E3 subunit can be genetically expressed in cardiac tissues \n[where  it  is  normally  scarce]  to  abbreviate  the  action  potential  duration  and  enhance  the \npotassium  current.This  potentially  prevents  arrhythmias  in  LQTS.  Adenovirus  encoded  E3 \nintroduced into guinea pig ventricles shortened QT interval on homogenous transduction, but \ncould be potentially arrhythmogenic if transduction is heterogenous18.\nArrhythmias of cardiac failure\n            Abnormal  calcium  cycling  plays  an  important  role  in  the  genesis  of  contractile \ndysfunction  and  arrhythmias  in  the  setting  of  heart  failure.  Genetic  modulation  of  the \nsarcoplasmic reticulum calcium ATP ase pump [SERCA] can have an ameliorating effect on the \narrhythmias of cardiac failure. \n            Delayed repolarization predisposes the failing heart to  ventricular arrhythmias and this \nrepresents a logical target for gene therapy. The calcium ATPase SERCA1 was coexpressed with \nthe potassium channel Kir2.1 in guinea pig hearts. Such myocytes  had bigger calcium transients \nand shorter action potentials.  In vivo, repolarization was abbreviated, but contractile function \nremained unimpaired19. This shortening of repolarization prevents arrhythmias. Coexpression of \nSERCA1 prevented  the  decrease  in  contractility  due  to  shortening  of  action  potential.  This \ninteresting  observation is  useful  in  prevention  of  arrhythmias  in  the  setting of  heart  failure.\n            Calsequestrin,  the  high  capacity  calcium binding  protein  expressed  in  sarcoplasmic \nreticulum,  also  positively  controls  the  rate  of  calcium  release  during  excitation-contraction \ncoupling. Mutations in the calsequestrin gene have been linked to arrhythmias and sudden death.  \nFor example,  the recessive form of catecholaminergic polymorphic ventricular tachycardia is \nassociated with calsequestrin mutations20. Modulation of the gene for calsequestrin could be one \nof the numerous potential targets for therapy.\n            The main pathway for calcium efflux from the cell is the Na - Ca exchanger (NCX), a \nmembrane antiporter  and a determinant of both the electrical and contractile state of the heart. \nNCX causes efflux of one Ca(2+) for three Na+ transported into the cell. Enhanced expression of \nNCX  has  recently  been recognised as one of  the  molecular  mechanisms that  contributes  to \nreduced Ca(2+) release, impaired contractility and an increased risk of arrhythmias during the \nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\nPraveen S.V, Johnson Francis, Venugopal K, “Gene Therapy in Cardiac Arrhythmias”  115\ndevelopment  of  cardiac  hypertrophy  and  failure.  The  NCX also  plays  a  crucial  role  in  the \npathogenesis  of  arrhythmias  and  cellular  injury  associated  with  ischaemia  and  reperfusion. \nHence,  NCX  blockade  represents  a  potential  therapeutic  strategy  for  treating  cardiac \ndisease.However, its reversibility and electrogenic properties must be taken into consideration \nwhen predicting the outcome. NCX inhibition has been demonstrated to be protective against \nischaemic injury and to have a positive inotropic and antiarrhythmic effect in failing heart cells21.\n            Failing hearts  show a delay of repolarization and  prolongation of action potential due to \ndiminished  potassium  currents,  which  is  proarrhythmic.  Adenovirus  over-  expressing  the \npotassium channels [AdShK] can reverse the prolongation of action potential duration, thereby \npotentially preventing arrhythmias22.\nVentricular arrhythmias \n            Electrical  alternans  has  been  linked  to  the  development  of  ventricular \narrhythmias.Increasing the rapid component of the delayed rectifier current (IKr) may suppress \nelectrical alternans and may be antiarrhythmic. IKr in isolated canine ventricular myocytes was \nincreased by infection with an adenovirus containing the gene for the pore-forming domain of IKr \n[human ether-a-go-go gene (HERG)]. The voltage at which peak IKr occurred was significantly \nless negative in HERG-infected myocytes, thereby shifting the steady-state voltage-dependent \nactivation and inactivation curves to less negative potentials23. This observation lend support to \nthe idea that increasing IKr may be a viable approach to suppressing electrical alternans thereby \nsuppressing arrhythmias.\nCurrent problems with gene therapy\n            As alluded to earlier, gene medicine is still in its infancy. Except for a  few  human trials, \nmajority  of  trials  to  date  have  been  in  experimental  animals.The  expected  result  from gene \ntherapy is a permanent cure of arrhythmias with a single stage treatment with minimal or no \nadverse effects. Obviously we are far from the ideal.    In the field of arrhythmias, an expectant  \nwaiting for the scenario to unfold in full is needed. The available vectors to date are far from \nideal.Problems with vectors include variability in transfection capabilities,inefficient delivery at \nsite,limited  period  of  gene  expression,  and  immunogenicity.  The  tissue  expression  of  many \ngenes are transient. The level and efficiency of expression of many trans genes are suboptimal. \nMany viral  vectors  are  potentially  immunogenic  and  carcinogenic.  The  interaction  between \nvector and host genome can result in the vector being rendered replicant and lose  the therapeutic \ngene. Another area of concern is that the currently available vectors have less ability to transduce \nvascular cells than nonvascular cells. This could hamper efforts at cardiovascular gene transfer. \nTraditional vectors need to be engineered to increase their affinity for the target tissue or cell and \nprevent transduction to other cells24. \n            Succesful transfer of the therapeutic gene to all the myocytes at the target site is not fully \nachieved in the experimental settings. The receptors for many viral vectors are present in many \ntissues therby limiting the specificty of gene delivery.\n            Many an arrhythmia with a diffuse substrate like atrial fibrillation needs the gene to be \ndelivered to a wide area [the whole of the atrium]. The transfer methods like direct injection into \nmyocardium fails to deliver the gene a short distance from the injecton site.    A special area of \nconcern in arrhythmia gene therapy is the potential for the remedy itself being arrhythmogenic. \nIncomplete restoration may in also be arrhythmogenic. In a non linear system like biological \norganisms, making an isolated change in a specific aberration will result in restoration of normal \nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\nPraveen S.V, Johnson Francis, Venugopal K, “Gene Therapy in Cardiac Arrhythmias”  116\nfunction only if the defect is truly isolated and is the direct cause of the phenotypic response.The \nlong term response of a genetic modification in the myocardium is unknown at present. Only \ncontinued research and time can answer these problems with certainty.\nThe Future\n            Newer  refinements  in  vector  development  and  design  are  needed  to  have  better \ntransduction  in  cardiovascular  tissue.  Cell  specific  regulatory  elements  and  promoters  to \nselectively target the cardiac tissue is a potential  area of interest25. Application at bed side awaits \nfurther refinement in gene delivery. Bactofection (bacterial gene delivery) as an alternative to \nviral vectors has been proposed26. Hybrid vectors, gutted vectors and new generation non viral \nvectors may hold the key to future research.  \nConclusion\n            Given a wide plethora of potential targets for gene therapeutic strategies, the possible \napplications are unlimited. We have still a long way to go from animal models to the level of safe \nand  efficacious  application  at  the  bedside.  This  awaits  more  refinements  in  gene  delivery \nmethods and vector designs. Not to be forgotten are the increasing concerns about safety. A \nregulated and sustained target tissue expression of the transduced gene with a wide index  of \nsafety  should be the ultimate goal of any genetic intervention. \nReferences\n1. Members  of  the  Sicilian  gambit.  New  approaches  to  antiarrhythmic  therapy,  part \nII;Circulation  2001;104: 2990-2994.\n2. Lee ER, Marshall  J,  Siegel  CS, et  al.  Detailed analysis  of  structures and formulations of \ncationic lipids for efficient gene transfer to the lung.  Hum Gene Ther 1996; 7: 170117.\n3. Armentano D, Zabner J, Sacks C, et al. Effect of the E4 region on the persistence of transgene \nexpression from adenovirus vectors. J Virol 1997;71:240816.\n4. Yla-Herttuala S, Martin JF. Cardiovascular gene therapy. Lancet. 2000:355;213-222.\n5. Smith AE.  Gene therapy--where are we? Lancet. 1999;354 Suppl 1:SI1-4.\n6. Labhasetwar V, Bonadio J, Goldstein S, Chen W, Levy RJ.  A DNA controlled-release coating \nfor gene transfer: transfection in skeletal and cardiac muscle. J Pharm Sci. 1998 ;87:1347-50.  \n7. Donahue JK, Kikkawa K, Johns DC, Marban E, Lawrence JH.   Ultrarapid, highly efficient \nviral gene transfer to the heart. Proc Natl Acad Sci U S A. 1997 ;94:4664-8.\n8. Rosen  MR,  Robinson RB,  Brink  P,  Cohen IS;  Anat  Rec  A Discov Mol  Cell  Evol  Biol. \n2004;280:1046-52.\n9. Rajesh G,  Francis  J.  Biological  Pacemakers.  Indian Pacing Electrophysiol  J.  2006;  6:1-5.\n10. Rosen MR, Brink PR, Cohen IS, Robinson RB. Genes, stem cells and biological pacemakers  \nCardiovasc Res. 2004;64:12-23.\n11. Qu J, Plotnikov AN, Sosunov EA et al. Biological pacemaker implanted in canine left bundle \nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\nPraveen S.V, Johnson Francis, Venugopal K, “Gene Therapy in Cardiac Arrhythmias”  117\nbranch  provides  ventricular  escape  rhythms  that  have  physiologically  acceptable  rates. \nCirculation. 2004;109:506-12.\n12. Glenn  CM,  Pogwizd  SM.  Gene  therapy  to  develop  a  genetically  engineered  cardiac \npacemaker. J Cardiovasc Nurs. 2003;18:330-6.\n13. Donahue JK, Heldman AW et al. Focal modification of electrical conduction in the heart by \nviral gene transfer.  Nat Med. 2000;6:1395-8.\n14. Bauer A, McDonald AD, Nasir K, Peller L, Rade JJ, Miller JM, Heldman AW, Donahue JK. \nInhibitory  G  protein  overexpression  provides  physiologically  relevant  heart  rate  control  in \npersistent atrial fibrillation.  Circulation. 2004 ;110:3115-20.\n15. Fabritz L, Kirchhof P, Fortmuller L, Auchampach JA, Baba HA, Breithardt G, Neumann J, \nBoknik  P,  Schmitz  W.  Gene  dose-dependent  atrial  arrhythmias,  heart  block,  and  brady-\ncardiomyopathy in mice overexpressing A(3) adenosine receptors. Cardiovasc Res. 2004;62:500-\n8\n16. Murata  M, Cingolani  E,  McDonald AD,  Donahue JK,  Marban E.  Creation  of  a  genetic \ncalcium channel blocker by targeted gem gene transfer in the heart. Circ Res. 2004;95:398-405.\n17. Burton DY, Song C, Fishbein I, Hazelwood S, Li Q, DeFelice S, Connolly JM, Perlstein I, \nCoulter DA, Levy RJ. The incorporation of an ion channel gene mutation associated with the \nlong QT syndrome (Q9E-hMiRP1) in a plasmid vector for site-specific arrhythmia gene therapy: \nin vitro and in vivo feasibility studies. Human Gene Ther; 2003;14:907-22.\n18. Mazhari  R,  Nuss  HB,  Armoundas  AA,  Winslow RL,  Marban  E.  Ectopic  expression  of \nKCNE3  accelerates  cardiac  repolarization  and  abbreviates  the  QT  interval.  J  Clin  Invest. \n2002;109:1083-90.\n19. Ennis IL, Li RA , Murphy AM, Marban E, Nuss HB. Dual gene therapy with SERCA1 and \nKir2.1 abbreviates excitation without suppressing contractility. J Clin Invest. 2002;109:393-400.\n20. Francis J, Sankar V, Krishnan Nair V, Priori SG.  Catecholaminergic polymorphic ventricular \ntachycardia. Heart Rhythm. 2005;2:550-4. \n21. Hobai IA, O'Rourke B. The potential of Na+/Ca2+ exchange blockers in the treatment of \ncardiac disease. Expert Opin Investig Drugs. 2004;13:653-64.\n22. Nuss HB, Johns DC, Kaab S, Tomaselli GF, Kass D, Lawrence JH, Marban E. Reversal of \npotassium channel deficiency in cells from failing hearts by adenoviral gene transfer: a prototype \nfor gene therapy for disorders of cardiac excitability and contractility. Gene Ther. 1996;3:900-12.\n23. HuaF, JohnsDC, Gilmour RF Jr.  Suppression of electrical alternans by overexpression of \nHERG in canine ventricular myocytes. Am J Physiol Heart Circ Physiol. 2004;286:H2342-51.\n24. Baker AH. Designing gene delivery vectors for cardiovascular gene therapy. Progs biophys \nmol 2004;84; 279-99.\n25. Beck  C,  Uramoto  H  ,  Jan  Boren,Levent  M  Akyurek.  Tissue  specific  targeting  for \ncardiovascular  gene  transfer.  Potentials  vectors  and  future  challenges.  Curr  Gene  Therapy. \n2004;4;457-67.\nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\nPraveen S.V, Johnson Francis, Venugopal K, “Gene Therapy in Cardiac Arrhythmias”  118\n26. Palffy R, Gadlik R ,J Hodosy, M Behuliak. Bacteria in gene therapy; Bactofection versus \nalternative gene  therapy. Gene Therapy 2006(13) 101-105.\nIndian Pacing and Electrophysiology Journal (ISSN 0972-6292), 6(2): 111-118 (2006)\n",
    "Link": "https://core.ac.uk/download/pdf/86511.pdf"
}