{
    "Title": "The use of genes for performance enhancement: doping or therapy?",
    "Authors": "Collares, T. F., Collares, T. V., Oliveira, R. S., Seixas, F. K., Smith, Kevin R.",
    "Year": "No year available",
    "Abstract": "Recent biotechnological advances have permitted the manipulation of genetic sequences to treat several diseases in a process called gene therapy. However, the advance of gene therapy has opened the door to the possibility of using genetic manipulation (GM) to enhance athletic performance. In such ‘gene doping’, exogenous genetic sequences are inserted into a specific tissue, altering cellular gene activity or leading to the expression of a protein product. The exogenous genes most likely to be utilized for gene doping include erythropoietin (EPO), vascular endothelial growth factor (VEGF), insulin-like growth factor type 1 (IGF-1), myostatin antagonists, and endorphin. However, many other genes could also be used, such as those involved in glucose metabolic pathways. Because gene doping would be very difficult to detect, it is inherently very attractive for those involved in sports who are prepared to cheat. Moreover, the field of gene therapy is constantly and rapidly progressing, and this is likely to generate many new possibilities for gene doping. Thus, as part of the general fight against all forms of doping, it will be necessary to develop and continually improve means of detecting exogenous gene sequences (or their products) in athletes. Nevertheless, some bioethicists have argued for a liberal approach to gene doping",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "ISSN 0100-879XBIOMEDICAL SCIENCESANDCLINICAL INVESTIGATIONwww.bjournal.com.br Volume 44 (12) 1194-1298 December 2011Institutional SponsorsThe Brazilian Journal of Medical and Biological Research is partially financed by All the contents of this journal, except where otherwise noted, is licensed under a Creative Commons Attribution License Faculdade de Medicina de Ribeirão PretoCampusRibeirão PretoExplore High - Performance MSOrbitrap TechnologyIn Proteomics & Metabolomicsanaliticaweb.com.br S C I E N T I F I CBraz J Med Biol Res, December  2011, Volume 44(12) 1194-1201 doi: 10.1590/S0100-879X2011007500145The use of genes for performance enhancement: doping or therapy?R.S. Oliveira, T.F. Collares, K.R. Smith, T.V. Collares and F.K. SeixasBrazilian Journal of Medical and Biological Research (2011) 44: 1194-1201ISSN 0100-879X ReviewThe use of genes for performance enhancement: doping or therapy?R.S. Oliveira1*, T.F. Collares1*, K.R. Smith2, T.V. Collares1 and F.K. Seixas31Laboratório de Embriologia Molecular e Transgênese, Biotecnologia, Centro de Desenvolvimento Tecnológico, Universidade Federal de Pelotas, Pelotas, RS, Brasil2School of Contemporary Sciences, University of Abertay Dundee, Dundee, Scotland, United Kingdom 3Laboratório de Genômica Funcional, Biotecnologia, Centro de Desenvolvimento Tecnológico, Universidade Federal de Pelotas, Pelotas, RS, BrasilAbstractRecent biotechnological advances have permitted the manipulation of genetic sequences to treat several diseases in a process called gene therapy. However, the advance of gene therapy has opened the door to the possibility of using genetic manipula-tion (GM) to enhance athletic performance. In such ‘gene doping’, exogenous genetic sequences are inserted into a specific tissue, altering cellular gene activity or leading to the expression of a protein product. The exogenous genes most likely to be utilized for gene doping include erythropoietin (EPO), vascular endothelial growth factor (VEGF), insulin-like growth factor type 1 (IGF-1), myostatin antagonists, and endorphin. However, many other genes could also be used, such as those involved in glucose metabolic pathways. Because gene doping would be very difficult to detect, it is inherently very attractive for those involved in sports who are prepared to cheat. Moreover, the field of gene therapy is constantly and rapidly progressing, and this is likely to generate many new possibilities for gene doping. Thus, as part of the general fight against all forms of doping, it will be necessary to develop and continually improve means of detecting exogenous gene sequences (or their products) in athletes. Nevertheless, some bioethicists have argued for a liberal approach to gene doping.Key words: Genetic manipulation; Erythropoietin; Vascular endothelial growth factor; Insulin-like growth factor-1; Myostatin; Bioethics Introductionwww.bjournal.com.brBraz J Med Biol Res 44(12) 2011Correspondence: F.K. Seixas, Centro de Desenvolvimento Tecnológico, Universidade Federal de Pelotas, Campus Universitário, s/n°, 96010-900 Pelotas, RS, Brasil. Fax: +55-53-3275-7551. E-mail: seixas.fk@gmail.com*These authors contributed equally to this study.Received April 4, 2011. Accepted October 13, 2011. Available online October 28, 2011. Published November 28, 2011.In the domain of genetics, scientific knowledge has made many remarkable advances in recent years. In the last decade, the publication of the human genome (1,2), together with much molecular information existing at the time, has permitted genetic manipulation (GM) techniques to be used in the treatment of various diseases. In the past, doping and cheating in sports were enabled by advances in pharmacology and physiology. Now, advances in molecular genetics have given rise to the potential to improve various non-medical human features including sports performance by the use of GM technology (3,4).Gene expression is regulated primarily by two main mechanisms: a) changes in DNA structure and b) direct control over the processes of transcription and translation. The first includes epigenetic modifications and mutations. Through epigenetics, the degree of gene transcription is altered, without causing changes in DNA sequence (5). Also of importance, mutations promote changes in the nucle-otide sequence of the gene and can derail the process of transcription or generate a new product, different from the original (6). The second mechanism consists of repressor and inductor molecules, transcription factors, enhancers and post-transcriptional modifiers (7). Thus, some changes in the regulatory process may result in an increased or decreased concentration of gene product.The World Anti-Doping Agency (WADA) considers gene doping as the use of pharmacological or biological agents that alter gene expression, or the transfer of cells or genetic elements (DNA and RNA) (8). As explained by Sharp (9), some changes in gene expression are potentially able to increase sports performance in a number of ways (Figure 1). Such expression changes have the potential to up-regulate cellular functions in a wide variety of organs and tissues, leading to potential performance benefits. Examples include Gene doping 1195www.bjournal.com.br Braz J Med Biol Res 44(12) 2011increased erythrocyte production and enhanced oxygen transfer via bone marrow targeting (10); liver targeting to increase Cori-cycle lactate-removing kinetics and energetic metabolism (11), erythropoietin (EPO) synthesis via kidney targeting (12), targeting of the myocardium to enhance cardiac output, and skeletal muscle targeting to influence fiber-type quality, percentage, sarcomere structure, mito-chondrial number, glycolytic/glycogenesis enzymes, and muscle capillary numbers (13,14). It might even be pos-sible to target neurologic areas in order to increase pain tolerance (15). The rapid improvement of biotechnology inadvertently supplied fuel to drive the development of doping in all its modern forms. From recombinant protein production in GM microorganisms to gene doping, detection of athletes who have benefitted from such abuse remains a major technological challenge (16). Moreover, the new oppor-tunities generated by recent scientific advances require bioethical analysis. What, if any, limits should be placed on the use of science to promote athletic performance? Should sportspeople be permitted to use gene therapy to treat disorders even if this results in improved perfor-mance? Does GM technology threaten to undermine the very spirit of sport? In this review article, we will provide a current overview of gene doping possibilities, including their development and detection techniques. Candidate genes for use in gene dopingErythropoietin: increase in energy production by aerobic metabolism In adults, EPO is produced mostly by interstitial cells Figure 1. Targeted tissues and organs for gene doping. Main aims of gene doping to enhance sports performance: improvement of pain tolerance (endorphin/enkephalin genes), muscle quality and vascular-ization (VEGF gene and myostatin antagonists) and erythrocyte number (EPO gene). With more genomic understanding, other organs will be targeted in the future, such as heart and kidneys, to increase cardiac output and EPO production, respectively. VEGF = vascular epithelial growth factor; EPO = erythropoi-etin.1196 R.S. Oliveira et al.www.bjournal.com.brBraz J Med Biol Res 44(12) 2011within the kidney, and in small quantities by the liver, where fetal synthesis occurs (17). Erythropoiesis is regulated by the concentration of circulating oxygen, and thus differs in conditions of normal oxygen tension (normoxia) and low oxygen tension (hypoxia) (18). The enzymes prolyl hydroxylase and asparaginyl hydroxylase are sensors of the level of intracellular oxygen. In normoxia, the hypoxia-inducible transcription factor 1α (HIF-1α) has its proline residues 402 and 567 hydroxylated at O2-dependent sites of proteosomal degradation. The next step is hydroxylation of asparagine residues in the carbon terminal transactiva-tion domain (C-TAD). These hydroxylations prevent the binding of HIF-1α to the nucleotide sequence (A/G) CGTG, a regulatory region of the EPO gene. The opposite occurs in conditions of hypoxia - the hydroxylations do not occur, resulting in binding of HIF-1α to the regulatory region of the EPO gene. Thus, in hypoxia the up-regulation of gene expression leads to increased levels of intracellular EPO. Other transcription factors are also involved in the regulation of EPO expression, including HIF-1β, HIF-2α/β and HIF-3α/β (19). Following transcription and translation, the resultant EPO polypeptide undergoes glycosylation and other post-translational modifications essential for the establishment of proper in vivo function (20).The hematopoietic system is regulated by three main groups of hematopoietic growth factors: a) the colony- stimulating factors, b) EPO and thrombopoietin, and c) cytokines, mainly interleukins. The erythroid lineage, which ultimately yields the erythrocytes, is primarily regu-lated by signaling performed by EPO (21). Erythropoiesis occurs in several steps of cell differentiation: the stem cell produces the pluripotent hematopoietic myeloid pro-genitor, which differentiates into the colony-forming unit erythroid (CFU-E). EPO stimulates the proliferation and differentiation of this CFU in basophilic, polychromatic and orthochromatic erythroblasts, in that order (22). These last cells differentiate into reticulocytes. Last, but not least, the reticulocytes mature and produce the erythrocytes, cells that contain hemoglobin, the key protein involved in gas exchange during cell respiration (23). Erythrocytes carry oxygen to tissues, where it is used for energy production through oxidative phosphorylation. Thus, an increase in the number of circulating red blood cells leads to an in-crease in the body’s ability to supply oxygen to tissues and to a concomitantly greater energy production by aerobic mechanisms. This is the basic principle for the use of EPO in gene doping (24).Bone marrow contains the early stages of the CFU-E progeny. These have a dimerized receptor for EPO, whose intracellular portion has a tyrosine kinase-coupled domain, called Janus kinase 2 (JAK-2). Binding of EPO to the recep-tor induces interaction of JAK-2 with the SH2 domain of the cytosolic protein STAT 5 (a signal transducer and activator of transcription 5). This interaction promotes phosphorylation of STAT 5, forming a homodimer of phosphorylated STAT 5. This facilitates translocation to the nucleus, whereupon binding to specific nucleotide sequences takes place, result-ing in the promotion of transcription of the genes necessary for erythropoiesis differentiation (25).Recombinant human EPO (rhuEPO) is produced on a large scale by biotechnological processes and has wide application for the treatment of various diseases, such as anemia, chronic renal insufficiency, hematological malignancies, chemotherapy, and premature birth (26,27). Additionally, rhuEPO is used to minimize allogeneic blood transfusions after major surgical procedures. Notoriously, rhuEPO has also been illicitly used for enhancement of sport performance (28).Fattori et al. (29) analyzed the efficacy of intramuscular injection of the EPO gene with the application of electric pulses to optimize the process of transduction. The gene was electro-injected into mice, rabbits and cynomolgus monkeys to test for protein production and biological effects. The study concluded that the injected EPO gene yields higher levels of circulating EPO and a more pronounced biological effect than the endogenous gene in all the species tested, thus showing great potential in clinically developable gene therapy approaches for EPO delivery.Vascular endothelial growth factor: increase in oxygen supplyOxygen is vital for the synthesis of ATP by aerobic respiration (30). Oxygen, as a small molecule, is able to diffuse through the plasma membrane of endothelial cells. Therefore, an increased vascular branching promotes a more rapid and effective diffusion of oxygen to the tissues and a greater availability of it for energy production. Vascular endothelial growth factor (VEGF) promotes the branching of a preexisting vessel, in a process called angiogenesis (31). In gene doping, several copies of the gene coding for VEGF would be inserted into the muscle, probably using viral vectors. Thus, if successful in athletes, the muscular microcirculation would be stimulated and the supply of oxygen to the muscles increased (32).Insulin-like growth factor type 1: increase in muscle growth and differentiationInsulin-like growth factor type 1 (IGF-1) is a 70-amino acid polypeptide synthesized primarily in the liver under the control of growth hormone (GH) (33). The hypothalamus produces two peptides, growth hormone-releasing hormone (GHRH) and somatostatin, which control the release of GH by the somatotropes of the anterior pituitary. GHRH, sleep, intense physical exercise, hypoglycemia, and low levels of circulating IGF-1 stimulate the release of GH (34,35). However, this is inhibited by somatostatin, hyperglycemia and increased blood concentrations of IGF-1. GH acts on hepatocytes stimulating production and secretion of IGF-1, a growth factor that stimulates the growth and differentiation of skeletal muscle tissue and the overall growth of bone Gene doping 1197www.bjournal.com.br Braz J Med Biol Res 44(12) 2011tissue (36). The availability of IGF-1 is regulated by binding proteins (IGF-BP); IGF-1 is mainly complexed to IGF-BP3. Production of IGF-1 also occurs in skeletal muscle, and acts in autocrine and paracrine pathways (37).The main route of intracellular signaling of IGF-1 starts with its binding to IGF1R, a receptor formed by dimeriza-tion of two glycoproteins with the cytoplasmic domains of tyrosine kinase (36). The interaction of IGF-1 and its receptor induces tyrosine autophosphorylation in the cytoplasmic domains of the receptor, triggering an intracellular signal-ing cascade that promotes the survival and proliferation of the muscle cell. IGF-1 also has activities beyond muscular effects, including an ability to drive tumor development and progression (36,37).In gene doping, multiple copies of the gene coding for IGF-1 might be inserted in skeletal muscle, promoting an increase in muscle mass due to hypertrophy of muscle cells. This somatic gene insertion could be accomplished through the use of two alternative vectors: plasmids or viruses. Plasmids represent the least expensive method, but also the least efficient. Viral vectors, widely used in gene therapy, actively insert the exogenous DNA into the genome of the target cell. Viral classes commonly used in relevant gene therapy attempts include: a) the adenoviruses, with double-stranded DNA, and b) the adeno-associated viruses, with single-stranded DNA (9,37).Myostatin antagonists: increase in muscle hypertrophy and hyperplasiaFirst described by McPherron et al. (38), myostatin, a member of the superfamily of transforming growth factor (TGF)-β, is a strong negative regulator of skeletal muscle growth and differentiation, where its expression predomi-nates (38,39). The growth of this tissue can be achieved by the inhibition of its negative effects using specific antibod-ies or drugs that bind to myostatin, a principle that has the potential to be used in gene doping in order to enhance muscle percentage and athletic performance (40). Mosher et al. (41) have shown an association between double-muscle phenotype and a mutation in the myostatin gene in whippet dogs with higher racing performance, thus demonstrating the role of this protein in muscle development.Several substances block the inhibitory activity of myostatin, promoting muscle growth and differentiation. Important amongst these substances are follistatin and a number of follistatin domain-containing proteins; all have the ability to bind to myostatin, making it unavailable for its natural inhibitory function (42).Endorphin and enkephalin: increase in pain endurancePain during or following physical exertion functions as a sensory mechanism that serves as an alert to the subject that will lead to reduced activity. In evolutionary terms, this mechanism presumably developed as a means to avoid physical or physiological damage. However, the occurrence of pain in an athlete, produced either by injury or metabolic changes (for example lactic acid build-up), reduces the ability to train and perform. Competitors are trained to psy-chologically handle pain during intense activities, and may consume anti-inflammatory and pain-relieving drugs (43). The advantage of a higher resistance to pain has brought several candidate genes into focus for potential use in gene therapy (for clinical pain) or gene doping. The genes encod-ing endorphin and enkephalin are prominent contenders in this context. The expressed molecules are neuropeptides that bind to opioid receptors, promoting analgesic effects and, therefore, pain relief. In order to increase the pain threshold, copies of these genes might be inserted, with expression being targeted to the nervous system (44). This promising possibility has been preliminarily studied using animal models (45). No such data have been reported in humans, suggesting that pain-killing gene therapy will not be available soon for clinical use or for gene doping. Side effects of gene doping: health risks of performance enhancementSince 2001, when the improvement of athletes’ abilities using the principles of gene therapy was discussed for the first time, doping has been subject to much discussion, some of it polemic, regarding its prohibition. As gene therapy is a new form of medicine, and until recently was tested only in patients with terminal illnesses, its long-term consequences are unknown. Thus, important questions remain to be answered about the potential use of GM in the context of sport. Perhaps the most fundamental question concerns the theoretical possibility that the transgenes used in gene doping could inadvertently affect the germ cells, produc-ing permanent alterations, which could be transmitted to future generations (46). At present, there are no definitive answers to this question.Some of the negative effects of gene doping will not be specific to GM, but rather to the nature of the gene product so expressed. In this regard, the risks of gene doping can be analyzed with reference to knowledge (where available) on the conventional use of the product concerned. To take one example: although there are no descriptions of the consequences of gene doping on reproductive parameters in vivo and in vitro, studies have shown that EPO stimulates steroidogenesis in Leydig cells, triggering an increase in testosterone production, leading to a negative feedback on the release of reproductive hormones and, consequently, reducing spermatogenesis and the spermatic potential, which may cause infertility (47). By contrast, some studies have shown positive side effects of expression products of doping candidate genes, such as the reduction of adipogenesis promoted by myosta-tin antagonists (48) and neuroprotective properties provided by EPO-based treatments (49,50). Still, it is necessary to 1198 R.S. Oliveira et al.www.bjournal.com.brBraz J Med Biol Res 44(12) 2011learn more about the complex physiology of each transgene product, before it would be safe and acceptable to sanction any such use. Detection of gene doping: challenges and limitationsThe detection of gene doping is likely to be difficult, although it could be accomplished by a number of avail-able approaches, involving either direct or indirect methods (51). Direct methods involve the detection of recombinant proteins or gene insertion vectors (such as viruses or plasmids). Indirect methods depend upon the detection of signature changes associate with gene doping: for example, changes in the immune system following gene transfer, or changes in the transcriptome or proteome of a particular cell type (Table 1).In gene therapy, the transgene substitutes for a defective gene and thus gene expression will be detected where it was previously missing. However, in gene doping, the ex-pected effect will be an increased concentration of a gene product previously expressed at normal levels, thus making detection more difficult in the latter case (52). Lasne et al. (53) showed some structural differences between endog-enous and recombinant EPO, via their different isoelectric behavior. Another possibility for direct detection is based on the use of molecular tests to differentiate the genomic DNA from complementary DNA (cDNA). The sequence of cDNA does not contain introns, so it can be distinguished using techniques such as the polymerase chain reaction (PCR) or Southern blotting (54).The detection of insertion vectors in blood plasma presents great difficulties, considering the extremely short half-life of circulating plasmids, adenoviruses and adeno-associated viruses. Thus, the only way to detect the insertion vectors in bodily fluids would be through the application of molecular tests with relatively short intervals, with the need to create a regular testing regime (55).Indirect methods are based on studies of gene doping effects on cells, tissues or the entire organism. This strategy includes examining for potential immune responses to gene insertion vectors or ‘non-self’ peptides encoded by intro-duced nucleic acid (52). Recently, the use of transcriptom-ics, which consists of analysis of tissue mRNA transcripts, became a promising potential method to detect gene doping. The quantity and composition of a tissue transcriptome is highly reflective of its metabolic activity. Some tissues can be easily accessed to construct a gene expression pat-tern. So, it is possible to evaluate some alterations in each expression pattern, supporting the development of doping detection techniques (56). Bioethics of gene dopingIn the ancient Olympic Games, athletes competed for recognition, eternal fame and an olive branch. Today, such motives continue to serve as important reasons for participa-tion in international competitions; however, they have been joined by an additional factor: money. For an athlete, to win a medal is a guarantee of lucrative contracts in the future. Thus, multiple factors conspire to place pressure upon athletes to a hitherto unprecedented degree, generating temptations to resort to extreme measures, including con-ventional doping and, potentially, gene doping (57). The main arguments used by the WADA to justify the prohibition of gene doping are 2-fold. Uppermost are con-cerns over potential health risks from the insertion of genes or the use of substances that interfere in gene expression. Such alterations of gene expression can bring unknown risks to the athlete’s health and, should exogenous sequences reach the germ line cells, some changes might be transmit-ted to future generations. A second argument of the WADA centers on the issue of fairness. The use of GM to increase sports performance is seen as a violation of the sporting spirit, giving unfair physical advantages to those who have access to the requisite technology (46).Arguably, there are two ways to analyze the ethical status of gene doping (58). The first holds that sports eth-ics is subservient to medical ethics. So, if the use of gene therapy for medicine is permitted, any performance increase should be acceptable, essentially as a form of ‘side effect’. In this way, a sports physician could prescribe potentially performance-enhancing substances - or gene therapy - to athletes in order to alleviate a medical condition. However, this matter is not straightforward and it is not an easy task for a physician to answer the question: how best to treat the Table 1. Methods for the detection of gene doping.Detection Principle Most used techniquesDirect Detection of insertion vectors PCR; Southern blottingDetection by inserted gene length PCR; Southern blottingIndirect Quantitative transcriptomics Real-time PCR; microarrayQuantitative proteomics Mass spectroscopy; 2-D electrophoresisImmune response ELISA; Western blottingGene doping 1199www.bjournal.com.br Braz J Med Biol Res 44(12) 2011athlete-patient - more as an athlete or more as a patient? Furthermore, some patients might have more interest in receiving a treatment that makes them well for sports performance, rather than well for life.The second way to approach sports doping as an ethical issue is to consider sports ethics as representing a separate entity from medical ethics. In other words, sport is seen as a moral practice which, while not requiring a rejection of the concepts of medical ethics, depends more on the sporting context than on the medical context (59,60).Viewpoints favorable towards liberalizing the use of performance-enhancing agents in sport have been ex-pressed by some ethicists, albeit a minority thereof (see for example, Refs. 58 and 61). The essential argument here is that since athletes legitimately strive to improve their performance (for example, by use of training methods, nutri-tion, and psychological conditioning), there are no obvious reasons to exclude performance-enhancing agents (e.g., anabolic steroids) from the set of methods that may be used to enhance athletic performance. While it may seem that this would give an unfair advantage to athletes able to access these agents, it can be argued that specialist gym apparatus, advanced nutrition, and psychological coaching are also expensive and thus - like performance-enhancing drugs - not available to all athletes. So, it can be argued that performance-enhancing drugs should not be singled out for prohibition on the basis of a lack of fairness. Similarly, health risks are inherent in many forms of sports training; thus, banning performance-enhancing agents on grounds of safety is arguably inconsistent, as the basis for such prohibition implies a similar ban on forms of training, such as lifting heavy weights, or practicing gymnastic moves, that might conceivably endanger the health of the athlete. Logically, any prohibition should be based on an objective assessment of risk, which would evaluate drugs and train-ing methods on an equal basis, as opposed to prohibiting simply on the basis of categorizations.Such pro-enhancement arguments, if accepted with respect to conventional performance-enhancing drugs, would logically also apply to gene doping (58). At present, the risks of human gene therapy are inadequately under-stood in the context of application to healthy individuals, but if a GM method could be shown to carry an acceptably low health risk (including any risk of inter-generational transmission of introduced gene sequences), then there would be no logical grounds for prohibition. Because gene therapy is at the cutting edge of medical science, its use for performance enhancement would be expensive and thus restricted to well-funded athletes, again raising the issue of fairness. However, it is an economic rule that technologies (e.g., computers, medical devices, etc.) drop steeply in price as they come to be used more widely, and this rule is very likely to apply to human GM technology. Thus, it may be that inexpensive commercial gene therapy ‘kits’ will become available in the future. If so, gene doping could become widely accessible to athletes regardless of their financial situation.Those who reject conventional doping on ethical grounds will also reject gene doping. However, an acceptance of conventional doping, as advocated by a minority of bioethi-cists, would rationally permit the full use of GM technology in sports. If this were to happen, then there can be little doubt that world sporting records (many of which have reached a plateau) would tumble, and athletic performance would reach hitherto unprecedented levels. As GM technology advances, athletes, regulatory bodies and society in general will need to decide whether to open the door to the ‘brave new world’ of gene doping.ConclusionsRecent developments in molecular biotechnology have provided new approaches to the treatment of several diseases, but have also generated new opportunities for cheating in sports. Most recently, these discoveries have enabled the potential use of gene doping, a strategy that promises (or threatens) to radically enhance athletic per-formance using GM approaches that will be hard to detect. Sport-regulatory organizations will need to remain vigilant for signs that gene doping starts to be used by athletes; if this does happen, scientists will need to rise to the challenge of entering an ‘arms race’ to develop effective means to detect such abuse. Meanwhile, bioethicists need to promote an active debate on an important emerging question: should gene doping be banned, controlled or liberalized?AcknowledgmentsT.F. Collares is a student of the Graduate Program in Biotechnology, Federal University of Pelotas. R.S. Oliveira and T.F. Collares are supported by CNPq.References 1.  Finishing the euchromatic sequence of the human genome. Nature 2004; 431: 931-945. 2. Levy S, Sutton G, Ng PC, Feuk L, Halpern AL, Walenz BP, et al. The diploid genome sequence of an individual human. PLoS Biol 2007; 5: e254. 3. McKanna TA, Toriello HV. Gene doping: the hype and the harm. Pediatr Clin North Am 2010; 57: 719-727. 4. Friedmann T, Rabin O, Frankel MS. Ethics. Gene doping and sport. Science 2010; 327: 647-648. 5. Beisel C, Paro R. Silencing chromatin: comparing modes 1200 R.S. Oliveira et al.www.bjournal.com.brBraz J Med Biol Res 44(12) 2011and mechanisms. Nat Rev Genet 2011; 12: 123-135. 6. Shastry BS. SNPs: impact on gene function and phenotype. Methods Mol Biol 2009; 578: 3-22. 7. Braun V, Mahren S, Sauter A. Gene regulation by transmem-brane signaling. Biometals 2006; 19: 103-113. 8. World Anti-Doping Agency. The 2011 Prohibited List. http://www.wada-ama.org. Accessed August 15, 2011. 9. Sharp NC. The human genome and sport, including epi-genetics, gene doping, and athleticogenomics. Endocrinol Metab Clin North Am 2010; 39: 201-215, xi.10. Boning D, Maassen N, Pries A. The hematocrit paradox - how does blood doping really work? Int J Sports Med 2011; 32: 242-246.11. Borrione P, Mastrone A, Salvo RA, Spaccamiglio A, Grasso L, Angeli A. Oxygen delivery enhancers: past, present, and future. J Endocrinol Invest 2008; 31: 185-192.12. Lundby C. Synthesis, function and possible new avenues for erythropoietin. J Physiol 2011; 589: 1249.13. Gualano B, Artioli GG, Poortmans JR, Lancha Junior AH. Exploring the therapeutic role of creatine supplementation. Amino Acids 2010; 38: 31-44.14. Nikolopoulos DD, Spiliopoulou C, Theocharis SE. Doping and musculoskeletal system: short-term and long-lasting effects of doping agents. Fundam Clin Pharmacol 2011; 25: 535-563.15. Azzazy HM. Gene doping. Handb Exp Pharmacol 2010; 485-512.16. Wang W, Zhang S, Xu J, Xia X, Tian Y, Zhang X, et al. [Cur-rent status and prospects of gene doping detection]. Se Pu 2008; 26: 408-412.17. Fisher JW. Erythropoietin: physiology and pharmacology update. Exp Biol Med 2003; 228: 1-14.18. Tian YM, Yeoh KK, Lee MK, Eriksson T, Kessler BM, Kramer HB, et al. Differential sensitivity of hypoxia inducible factor hydroxylation sites to hypoxia and hydroxylase inhibitors. J Biol Chem 2011; 286: 13041-13051.19. Jelkmann W. Regulation of erythropoietin production. J Physiol 2011; 589: 1251-1258.20. Jelkmann W. Molecular biology of erythropoietin. Intern Med 2004; 43: 649-659.21. Jelkmann W. Erythropoietin after a century of research: younger than ever. Eur J Haematol 2007; 78: 183-205.22. Lodish H, Flygare J, Chou S. From stem cell to erythroblast: regulation of red cell production at multiple levels by multiple hormones. IUBMB Life 2010; 62: 492-496.23. Handelman GJ, Levin NW. Red cell survival: relevance and mechanism involved. J Ren Nutr 2010; 20: S84-S88.24. Jelkmann W. Erythropoiesis stimulating agents and tech-niques: a challenge for doping analysts. Curr Med Chem 2009; 16: 1236-1247.25. Wojchowski DM, Sathyanarayana P, Dev A. Erythropoietin receptor response circuits. Curr Opin Hematol 2010; 17: 169-176.26. Schmid H, Schiffl H. Erythropoiesis stimulating agents and anaemia of end-stage renal disease. Cardiovasc Hematol Agents Med Chem 2010; 8: 164-172.27. Vogiatzi G, Briasoulis A, Tousoulis D, Papageorgiou N, Stefanadis C. Is there a role for erythropoietin in cardiovas-cular disease? Expert Opin Biol Ther 2010; 10: 251-264.28. Diamanti-Kandarakis E, Konstantinopoulos PA, Papailiou J, Kandarakis SA, Andreopoulos A, Sykiotis GP. Erythropoietin abuse and erythropoietin gene doping: detection strategies in the genomic era. Sports Med 2005; 35: 831-840.29. Fattori E, Cappelletti M, Zampaglione I, Mennuni C, Calva-ruso F, Arcuri M, et al. Gene electro-transfer of an improved erythropoietin plasmid in mice and non-human primates. J Gene Med 2005; 7: 228-236.30. Lynch RM, Paul RJ. Energy metabolism and transduction in smooth muscle. Experientia 1985; 41: 970-977.31. Arveschoug A, Christensen KS. Constitutive expression of phVEGF165 after intramuscular gene transfer promotes collateral vessel development in patients with critical limb ischemia. Circulation 1999; 99: 2967-2968.32. Wells DJ. Gene doping: the hype and the reality. Br J Phar-macol 2008; 154: 623-631.33. Harridge SD, Velloso CP. Gene doping. Essays Biochem 2008; 44: 125-138.34. Kanaley JA, Weltman JY, Veldhuis JD, Rogol AD, Hartman ML, Weltman A. Human growth hormone response to re-peated bouts of aerobic exercise. J Appl Physiol 1997; 83: 1756-1761.35. Segura J, Gutierrez-Gallego R, Ventura R, Pascual JA, Bo-sch J, Such-Sanmartin G, et al. Growth hormone in sport: beyond Beijing 2008. Ther Drug Monit 2009; 31: 3-13.36. Rotwein P, Chia DJ. Gene regulation by growth hormone. Pediatr Nephrol 2010; 25: 651-658.37. Harridge SD, Velloso CP. IGF-I and GH: potential use in gene doping. Growth Horm IGF Res 2009; 19: 378-382.38. McPherron AC, Lawler AM, Lee SJ. Regulation of skeletal muscle mass in mice by a new TGF-beta superfamily mem-ber. Nature 1997; 387: 83-90.39. Carnac G, Ricaud S, Vernus B, Bonnieu A. Myostatin: biol-ogy and clinical relevance. Mini Rev Med Chem 2006; 6: 765-770.40. Rodgers BD, Garikipati DK. Clinical, agricultural, and evolu-tionary biology of myostatin: a comparative review. Endocr Rev 2008; 29: 513-534.41. Mosher DS, Quignon P, Bustamante CD, Sutter NB, Mel-lersh CS, Parker HG, et al. A mutation in the myostatin gene increases muscle mass and enhances racing performance in heterozygote dogs. PLoS Genet 2007; 3: e79.42. Gajos-Michniewicz A, Piastowska AW, Russell JA, Ochedalski T. Follistatin as a potent regulator of bone me-tabolism. Biomarkers 2010; 15: 563-574.43. Gaffney GR, Parisotto R. Gene doping: a review of perfor-mance-enhancing genetics. Pediatr Clin North Am 2007; 54: 807-xiii.44. Benedetti F, Pollo A, Colloca L. Opioid-mediated placebo responses boost pain endurance and physical performance: is it doping in sport competitions? J Neurosci 2007; 27: 11934-11939.45. Lin CR, Yang LC, Lee TH, Lee CT, Huang HT, Sun WZ, et al. Electroporation-mediated pain-killer gene therapy for mononeuropathic rats. Gene Ther 2002; 9: 1247-1253.46. Haisma HJ, de Hon O. Gene doping. Int J Sports Med 2006; 27: 257-266.47. Yamazaki T, Kanzaki M, Kamidono S, Fujisawa M. Effect of erythropoietin on Leydig cell is associated with the activation of Stat5 pathway. Mol Cell Endocrinol 2004; 213: 193-198.48. Tsuchida K. The role of myostatin and bone morphogenetic proteins in muscular disorders. Expert Opin Biol Ther 2006; 6: 147-154.Gene doping 1201www.bjournal.com.br Braz J Med Biol Res 44(12) 201149. Ehrenreich H, Degner D, Meller J, Brines M, Behe M, Has-selblatt M, et al. Erythropoietin: a candidate compound for neuroprotection in schizophrenia. Mol Psychiatry 2004; 9: 42-54.50. Chatagner A, Huppi PS, Ha-Vinh LR, Sizonenko S. [Erythro-poietin and neuroprotection]. Arch Pediatr 2010; 17 (Suppl 3): S78-S84.51. Mansour MM, Azzazy HM. The hunt for gene dopers. Drug Test Anal 2009; 1: 311-322.52. Baoutina A, Alexander IE, Rasko JE, Emslie KR. Developing strategies for detection of gene doping. J Gene Med 2008; 10: 3-20.53. Lasne F, Martin L, de Ceaurriz J, Larcher T, Moullier P, Chenuaud P. “Genetic Doping” with erythropoietin cDNA in primate muscle is detectable. Mol Ther 2004; 10: 409-410.54. Baoutina A, Coldham T, Bains GS, Emslie KR. Gene doping detection: evaluation of approach for direct detection of gene transfer using erythropoietin as a model system. Gene Ther 2010; 17: 1022-1032.55. Beiter T, Zimmermann M, Fragasso A, Hudemann J, Niess AM, Bitzer M, et al. Direct and long-term detection of gene doping in conventional blood samples. Gene Ther 2011; 18: 225-231.56. Rupert JL. Transcriptional profiling: a potential anti-doping strategy. Scand J Med Sci Sports 2009; 19: 753-763.57. Filipp F. Is science killing sport? Gene therapy and its pos-sible abuse in doping. EMBO Rep 2007; 8: 433-435.58. Miah A. Rethinking enhancement in sport. Ann N Y Acad Sci 2006; 1093: 301-320.59. Miah A. Gene-doping: sport, values & bioethics. In: Glasa J (Editor), The ethics of human genetics. Strasburg: Council of Europe; 2003. p 171-180.60. Artioli GG, Hirata RDC, Lancha Junior AH. Terapia gênica, doping genético e esporte: fundamentação e implicações para o futuro. Rev Bras Med Esporte 2007; 13: 349-354.61. Kious BM. Philosophy on steroids: why the anti-doping posi-tion could use a little enhancement. Theor Med Bioeth 2008; 29: 213-234.",
    "Link": "https://core.ac.uk/download/228176899.pdf"
}