{
    "Title": "Human Schistosome Infection and Allergic Sensitisation",
    "Authors": "Mutapi, Francisca, Rujeni, Nadine, Taylor, David W.",
    "Year": "No year available",
    "Abstract": "Several field studies have reported an inverse relationship between the prevalence of helminth infections and that of allergic sensitisation/atopy. Recent studies show that immune responses induced by helminth parasites are, to an extent, comparable to allergic sensitisation. However, helminth products induce regulatory responses capable of inhibiting not only antiparasite immune responses, but also allergic sensitisation. The relative effects of this immunomodulation on the development of protective schistosome-specific responses in humans  has yet to be demonstrated at population level, and the clinical significance of immunomodulation of allergic disease is still controversial. Nonetheless, similarities in immune responses against helminths and allergens pose interesting mechanistic and evolutionary questions. This paper examines the epidemiology, biology and immunology of allergic sensitisation/atopy, and schistosome infection in human populations",
    "Keywords": "No keywords available",
    "Publisher": "'Hindawi Limited'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "     Edinburgh Research Explorer                                      Human Schistosome Infection and Allergic SensitisationCitation for published version:Rujeni, N, Taylor, DW & Mutapi, F 2012, 'Human Schistosome Infection and Allergic Sensitisation' Journalof Parasitology Research, vol 2012, pp. 1-17., 10.1155/2012/154743Digital Object Identifier (DOI):10.1155/2012/154743Link:Link to publication record in Edinburgh Research ExplorerDocument Version:Publisher final version (usually the publisher pdf)Published In:Journal of Parasitology ResearchGeneral rightsCopyright for the publications made accessible via the Edinburgh Research Explorer is retained by the author(s)and / or other copyright owners and it is a condition of accessing these publications that users recognise andabide by the legal requirements associated with these rights.Take down policyThe University of Edinburgh has made every reasonable effort to ensure that Edinburgh Research Explorercontent complies with UK legislation. If you believe that the public display of this file breaches copyright pleasecontact openaccess@ed.ac.uk providing details, and we will remove access to the work immediately andinvestigate your claim.Download date: 20. Feb. 2015Hindawi Publishing CorporationJournal of Parasitology ResearchVolume 2012, Article ID 154743, 17 pagesdoi:10.1155/2012/154743Review ArticleHuman Schistosome Infection and Allergic SensitisationNadine Rujeni, David W. Taylor, and Francisca MutapiInstitute of Immunology and Infection Research, Centre for Immunity, Infection, and Evolution, School of Biological Sciences,University of Edinburgh, Ashworth Laboratories, King’s Buildings, West Mains Rd, Edinburgh EH9 3JT, UKCorrespondence should be addressed to Francisca Mutapi, f.mutapi@ed.ac.ukReceived 14 May 2012; Accepted 28 June 2012Academic Editor: Maria Ilma AraujoCopyright © 2012 Nadine Rujeni et al. This is an open access article distributed under the Creative Commons Attribution License,which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.Several field studies have reported an inverse relationship between the prevalence of helminth infections and that of allergicsensitisation/atopy. Recent studies show that immune responses induced by helminth parasites are, to an extent, comparableto allergic sensitisation. However, helminth products induce regulatory responses capable of inhibiting not only antiparasiteimmune responses, but also allergic sensitisation. The relative eﬀects of this immunomodulation on the development of protectiveschistosome-specific responses in humans has yet to be demonstrated at population level, and the clinical significance ofimmunomodulation of allergic disease is still controversial. Nonetheless, similarities in immune responses against helminthsand allergens pose interesting mechanistic and evolutionary questions. This paper examines the epidemiology, biology andimmunology of allergic sensitisation/atopy, and schistosome infection in human populations.1. IntroductionThe major human helminth parasites belong to two phyla,the nematodes (or roundworms) which include intestinalsoil transmitted helminths (STH) and filarial worms (whichcause lymphatic filariasis and onchocerciasis), and theplatyhelminths (or flatworms) which include the flukes (ortrematodes, including schistosomes) and the tapeworms (orcestodes). Although common inmost parts of the world sixtyyears ago [1], these parasites are currently mainly prevalentin sub-Saharan Africa, Asia, and South America [2–4], wherethey are responsible for considerable disabilities includingblindness and elephantiasis (filarial worms). Furthermore,helminth infections are responsible for morbidities thatinclude anaemia, stunted growth, poor cognitive develop-ment, and malnutrition [5–7], hence exert a negative socioe-conomic impact in some of the poorest communities in theworld.Immune-mediated diseases including auto-immune dis-eases (such as type 1 diabetes, inflammatory bowel diseases,and rheumatoid arthritis) and allergic diseases (such asasthma, allergic rhinitis, and atopic eczema) are reportedto be more prevalent in developed countries and in urbanareas of developing countries [8, 9]. But studies from Africaare demonstrating that allergic diseases are common, if notacknowledged, clinical problems in this region [10]. Immunedisorders have been responsible for increased mortality andmorbidity worldwide [11–13] and they negatively impacton economic growth due to their elevated cost of theirtreatment [14, 15]. There is also mounting evidence thatallergic disorders, especially allergic rhinitis, are associatedwith attention deficit disorder and hyperactivity in children[16, 17].Increasing rates of childhood allergies have long been apuzzle to epidemiologists [18, 19]. Thus, studying cohortsof children born in 1946, 1958, and 1970, concluded thata “new environmental agent,” contained in breast milk andpossibly infants’ food was responsible for the increase ineczema. Emmanuel, reviewing medical literature publishedfrom 1820 to 1900, suggested that the hay fever “epidemic”was associated with the rapid industrial growth of the 19thcentury since this disorder was rarely described prior thatperiod [19]. It was Strachan who in 1989, observing thatthe rate of hay fever and eczema was consistently negativelyassociated with family size and birth position in house-holds, hypothesized that reduced exposure to childhoodinfections due to increased hygiene was responsible for theallergy epidemics. This hypothesis, currently referred to as2 Journal of Parasitology ResearchTable 1: Heterogeneity in studies investigating the eﬀect of helminth infection on atopy.Parasite spp, References Atopy outcome Association Population ageAscaris lumbrocoides[37]1 Wheeze, SPT Negative 1–4 years[38]2 IgE, PK Negative 5–15 years[39]1 SPT, airway responsiveness Positive 8–18 years[40]2 Allergen-induced Th2 cytokines None 7–13 years[41]2 SPT, wheeze None 9 years mean age[42]2 SPT Negative 6–17 yearsWheeze, eczema, EIB NoneTrichuris trichiura[38]2 IgE, PK Negative 5–15 years[37]1 Wheeze, SPT None 1–4 years[43]# SPT Negative 2–8 yearsHookworm[37]1 Wheeze, SPT None 1–4 years[42]2 SPT Negative 6–17 yearswheeze, eczema, EIB NoneSchistosoma mansoni[44]1 SPT, IgE Negative 18± 9.7 years[45]# SPT, asthma symptoms Negative 15 years mean ageSchistosoma haematobium[46]1 SPT Negative 5–14 yearsCross-sectional 1 and treatment followup 2 studies are reported here.#Longitudinal approach but treatment intervention was not the primary objective of the study. SPT: skin prick test; PK: Prausnitz-Kustner passive transfertest, EIB: exercise-induced bronchoconstriction.the “hygiene hypothesis,” was subsequently supported bysome epidemiological studies [20, 21] but contradicted byothers [22, 23] (see summary in Table 1). In a retrospectivecase control study on Italian military cadets, Matricardiand colleagues were able to show that cumulative exposuresto foodborne and oral-faecal infections, but not infectionstransmitted via other routes, were associated with a reducedrisk of being atopic [24]. They suggested that the mode oftransmission of the pathogen was a determining factor insubsequent protection (or lack of protection) against atopyand asthma, hence explaining inconsistencies in previousstudies.2. Global Burden of Schistosomiasis and Atopy2.1. Schistosomiasis. Schistosomiasis accounts for up to 70million DALYs annually [6], with an estimated 15,000 deaths[4], and children carry the heaviest burden of infection [47].With these figures, schistosomiasis is classified second only tomalaria in terms of human morbidity and mortality due toparasitic diseases [48]. Schistosomiasis is caused by infectionwith blood-dwelling trematodes of the genus Schistosoma, ofwhich S. haematobium, S. mansoni, and S. japonicum are themain human schistosomes [49]. It is typically prevalent inrural areas where natural streams, ponds, rivers, and lakesharbouring the infected intermediate host snails, are themain sources of water for domestic or occupational purposessuch as washing and fishing. School children usually becomeinfected during swimming or collecting water, while youngerchildren and infants become infected when accompanyingadults (washing clothes or collecting water) or by beingbathed in these water sources [50].2.2. Atopy. Rising rates of atopic diseases have been reportedin developed countries since the end of World War II [18]and currently constitute a major public health issue [51].Demographic data in the US have shown an average increasein childhood asthma prevalence of 4.3% per year from 1980to 1996, with associated deaths and hospitalisation increasingby 3.4% and 1.4%, respectively [52]. In the United Kingdom,according to the British Allergy Foundation, 1 in 3 peoplesuﬀer from allergy at some time in their lives. This reportindicates that 58% of allergic sensitisations are triggered byhouse dust mites (HDM), a known risk factor for developingasthma and allergic rhinitis [53, 54]. Increasing prevalenceof asthma in adults over a period of 10 years and doubling inschool children over 20 years have been reported in Australia[55]. A recent study involving 12 European countries and 19centres reported incidences of asthma between 5 and 17%(average 8%), while allergic rhinitis varies between 23 and44%, with an average of 30% [56].In less aﬄuent countries, comparable rates of atopicdiseases are generally reported in urban and suburban areas.Thus, a prevalence of asthma of 9% was reported in urbanJournal of Parasitology Research 3areas of Rwanda [57] while the International Study ofAsthma and Allergies in childhood (ISAAC) reported anoverall prevalence of 10.9% across 22 centres in Africa [58].Reported incidences of allergic rhinitis range from 14% to54% in urban and suburban areas across African countries(reviewed by [59]). Importantly, according to the ISAACphase three, although the prevalence was generally lower,there were more severe symptoms of rhinoconjnnctivitisreported in urban centres of developing countries comparedto those reported in developed countries [8]. However,studies from Africa suggest that allergic conditions may beunderdiagnosed in Africa due to “inappropriate” diagnostictests and these studies call for component-resolved allergytesting in Africa [60]. Indeed a recent study in Zimbabweshowed that schistosome-infection resulted in impaireddiagnosis of cat allergy [61].3. Atopy and Schistosome Life-Cycle StagesIn schistosome infection, the human immune system isexposed to schistosome larvae (cercariae and schistosomula),adult worm, and egg antigens. Animal studies as well asin vitro studies have demonstrated immunological changesand regulatory mechanisms associated with these diﬀerentlife-cycle stages. The surface of cercariae (enriched in car-bohydrates [62]) and the newly transformed schistosomulaactivate the complement cascade [63, 64] and eliciting proin-flammatory responses [65, 66]. An excessive immunologicalreaction to skin stage cercarial antigens results in cercarialdermatitis or swimmer’s itch [67], an allergic conditionalso occurring in contact with nonhuman schistosomesthat is prevalent in developed countries [68–70]. Thisinflammatory reaction is rarely reported in populations inwhich schistosomiasis is endemic, possibly due to regulatoryresponses resulting from multiple exposures as has beendemonstrated in mice [71]. Such regulatory responses maybe induced by skin-stage schistosomula-derived moleculessuch as prostaglandin E2(PGE2) which upregulates IL-10production during skin penetration by the parasite [72].The PGE2 is also secreted by the lung-stage schistosomuladuring migration through the capillary beds of the lungs,and this is thought to diminish eosinophil infiltrates aroundthe parasites (and thus inflammation [73]). In addition,these parasites are capable of inhibiting the expressionof endothelial adhesion molecules such as E-selectin andVCAM-1, limiting leucocyte recruitment in the lungs [74].These anti-inflammatory mechanisms in the lungs havebeen suggested as potential explanations for reduced severityof asthma symptoms in schistosome-infected asthmaticpatients [45], although there are nomechanistic studies fromhuman populations to support this.Schistosome eggs are major Th2 triggers as demonstratedin murine studies [75, 76], and they induce formation offibrotic lesions or granulomas [77–79]. Indeed, an S. mansoniegg-secreted glycoprotein, omega-1, has recently been identi-fied that conditions dendritic cells for Th2 polarisation [25].However, egg secretions are capable of inhibiting the specificbinding of chemokines such as CXCL8 (IL-8) and CCL3(MIP-1α), therefore blocking chemokine-elicited migrationof neutrophils and macrophages respectively during granu-loma formation [80].Schistosome adult worm antigens also induce Th2responses and IgE in mice [81], baboons [82], and humans[83]. However, this parasite life stage elicits high levelsof modulatory responses capable of inhibiting antiparasite[84] as well as allergic reactions [85]. The latter studydemonstrated that worm infection induces IL-10, producingB cells that could protect mice against anaphylaxis. Theylater demonstrated that egg-laying worms exacerbate whilesingle sex worms (precluding egg production) inhibit airwayhyperresponsiveness [86].Together, these studies show that the diﬀerent parasitelife-cycle stages are associated with diﬀerent mechanisms ofregulation and inflammation. Although concurrent exposureto all or most antigens is likely in endemic areas, anddespite the fact that they may induce cross-reactive immuneresponses [87], the diﬀerent parasite life-cycle stages maydiﬀerentially aﬀect atopic responses.4. Epidemiology4.1. Schistosomiasis. The epidemiological patterns of schisto-somiasis diﬀer from those of atopy, mainly because of theiraetiology. Indeed, while schistosome infection is acquired asa result of exposure to parasites, atopy is a genetic predis-position (although the clinical manifestations are influencedby environmental factors). In schistosome endemic areas,infection levels follow a convex shape with host age, whereinfection intensity rises to peak in childhood-adolescenceand decline in adulthood [88]. This peak was initially inter-preted as arising from diﬀerent water contact levels betweenage groups [89]. However, longitudinal studies showed thatwith the same exposure rate, “resistant” individuals wereolder than “susceptible” individuals [90–92], suggestingan age-dependent acquired resistance to reinfection. Inaddition, in communities of diﬀerent parasite transmission,infection intensity peaks at a younger age in areas of hightransmission compared to low-transmission areas [88, 93–95], a phenomenon referred to as a “peak shift.” This phe-nomenon has been interpreted as reflecting diﬀerent ratesof development of acquired resistance to infection duringschistosome infection as has been reported for Plasmodiuminfections (which cause malaria) [96, 97]. This interpretationis supported by age-related changes in immune responses,with the peak of antibodies and cytokine associated withprotection coinciding with the decline in infection levels havebeen reported in S. haematobium endemic areas [83, 98, 99].More recently, Black and colleagues observed that the rate ofacquisition of antischistosome protective responses by adultsoccupationally exposed to S. mansoni, following treatment,is dependent on their history of exposure, being faster inthose with a longer history [100]. This study, consistent withearlier studies [101, 102], demonstrated that resistance toschistosome infection/reinfection is acquired independent ofage related physiological changes [103].4.2. Atopic Diseases. Atopy is the genetic predisposition tobecome excessively sensitised and produce high levels of4 Journal of Parasitology ResearchIgE [104]. However, atopic diseases result from a geneticpredisposition in combination with environmental stimulisuch as allergens, smoke, diet, and/or infectious agents[105, 106]. The epidemiology of atopic diseases is complexas some diseases may become more prominent with agewhile others diminish or disappear [107]. The earliest phasesof atopic diseases usually manifest during the first fiveyears of life and the severity (and prevalence) of clinicalsymptoms seem to increase in late childhood/adolescenceand plateau throughout adulthood [108–110] or decline forsome conditions [111, 112].It has been suggested that a natural history of allergymanifestations in atopic individuals involves progressionfrom atopic eczema (below one year of age) to asthma orallergic rhinitis (late childhood/adolescence), a phenomenonreferred to as the “atopic/allergic march” [112]. However,this is not always consistent as some children may developatopic dermatitis long after the onset of asthma [113], whilesome atopic individuals may only develop one of theseconditions throughout life. Longitudinal studies indicatethat atopy in infancy predicts the occurrence and severityof asthma [114] and bronchial hyperresponsiveness [115] inlater life. Total and allergen-specific IgE levels also seem toincrease throughout childhood in allergic individuals [116].However, a number of events occurring in the first fewyears of life and in utero are likely to influence the onsetand persistence of disease. Thus, Klinnert and colleagueshave shown that respiratory infections during the first yearof life and parenting diﬃculties (e.g., postnatal maternaldepression) were independent predictors of the onset ofasthma during early (3 years) and late (6–8 years) childhoodin children at risk [114, 117].Microbial exposures and diet of pregnant mothers mayalso alter early gene expression in neonates, influencing theonset of allergy in childhood (see [106, 118]). Consistentwith this hypothesis is the finding that maternal exposure tofarmmilk and farm animals during pregnancy was associatedwith demethylation within the FOXP3 (Treg transcriptionfactor) locus in cord blood and subsequent elevated levels ofregulatory T cells (Tregs) (and their suppressive activity) inoﬀspring [119]. Murine studies have also shown that, whenexposed to a methyl rich diet during pregnancy (as maybe the case for folate supplementation in humans), foetalDNA may undergo changes in methylation that results indecreased gene transcription activity, leading to subsequentenhanced development and severity of allergic diseases [120].The study also showed that this diet-associated allergicphenotype was transgenerationally inheritable (persistenceof high levels of IgE and eosinophilia into the F2 generation).5. Effector Responses in Atopy andSchistosome Infection5.1. Immunoglobulin E. Identified in the 1960s as a “carrierof reaginic activity” [121, 122], IgE is well known as acentral player in atopic diseases and anaphylactic reactions.This antibody is part of a protein network involving its3 receptors, namely, the FcεRI, the CD23 (or FcεRII) andgalectin-3 [32], all of which can be found in soluble forms[123, 124]. The FcεRI (also termed high-aﬃnity receptor)is mainly expressed on mast cells and basophils but also onepidermal Langerhans cells [125] and eosinophils [126, 127].Cross-linking of these high-aﬃnity receptors by IgE inducesactivation of mast cells and basophils and their degranula-tion. The galectin-3 receptor is expressed on neutrophils andon trophoblast cells in placentas [128], where it is thought tofacilitate IgE transport [129]. The CD23 receptor facilitatesthe transport of IgE-antigen complexes but is also involvedin the regulation of IgE synthesis [32]. Highly conserved inmammalian lineages [130], IgE is thought to have evolved asa first line of defence against helminth parasites.IgE antibodies are naturally strongly regulated and havethe lowest concentrations of all antibodies in serum ofhealthy nonatopic individuals [32]. Mechanisms of regula-tion of IgE include its short half-life in serum (12 h formurine monoclonal antibodies [131]), the poor processingof mRNA for the membrane ε heavy chain [132], and thenegative feedback regulation by the CD23 [133]. The latterhas been a subject of investigations in terms of therapeuticapplication in atopic diseases but also in autoimmunediseases [134] and chronic lymphocytic leukaemia [135].5.2. CD23. CD23 is the low-aﬃnity receptor for IgE anddiﬀers from the high-aﬃnity FcεRI receptor in structureand function. Thus, while cross-linking of the latter resultsin degranulation of mast cells and release of mediators,engagement of membrane-bound CD23 suppresses theproduction of IgE by B lymphocytes [33]. CD23 has longbeen proposed as a natural regulator for IgE synthesis [133]although elevated levels of CD23+ B cells have been reportedin atopic patients [136]. As initially suggested by Aubryand colleagues [137], CD23 not only binds IgE but alsoCD21, a cell-surface protein expressed on T-cell, B-cell, andfollicular dendritic cells, classically identified as a receptor forcomplement proteins [138] or Epstein-Barr virus [137]. Theinteraction between CD23, IgE, and CD21 may lead to eithernegative or positive regulation of IgE synthesis (reviewed in[34–36]). The binding of IgE stabilises membrane-boundCD23 and inhibits IgE synthesis from activated B cells, whilein the absence of IgE binding, CD23 is cleaved by ADAM10(a disintegrin and metalloprotease protein 10), and thisdestabilisation enhances IgE synthesis [32]. Soluble CD23(sCD23) fragments resulting from the cleavage can bind toIgE with diﬀerent aﬃnities and outcomes for IgE synthesisdepending on their oligomerization state. Trimers bind IgEwith high aﬃnity and enhance IgE synthesis by their ability toalso bind the CD21 receptor while monomers bind with lowaﬃnity but do not bind CD21 and hence inhibit IgE synthesis[36, 139].5.3. Immunoglobulin 4. Serum IgG4 antibodies, the leastabundant among human IgG subclasses, have long beenassociated with IgE-mediated diseases [140–142]. However,rather than the cause of disease, these antibodies seem tobe involved in the regulation of IgE-induced anaphylacticreactions [143]. IgG4 may interfere with antigen recognitionby IgE due to their similar antigenic specificity [144],although diﬀerent epitope-binding [145]. In a process thatJournal of Parasitology Research 5involves exchange of fab molecules, IgG4 are structurallyhetero-bivalent (each heavy chain and light chain recognisinga diﬀerent epitope within a single IgG4 molecule) and oftenfunction as monovalent [141, 146], to bring about anti-inflammatory eﬀects [147]. The interaction between IgG4and a given antigen results in small and non-pathologicalimmune complexes (since these antibodies cannot cross-link antigens) [146]. Furthermore, in contrast to otherIgG subclasses, IgG4 cannot fix complement but inhibitscomplement activation by IgG1 [148]. IgG4 antibodies, inallergy or helminth infection, are secreted in response to highantigen loads [141, 149, 150] but levels of the antibodiesare diﬀerentially regulated by the same cytokines [151] asthose regulating IgE, suggesting an important homeostaticmechanism for controlling IgE-mediated responses.6. Control of Effector Responses in Atopy andSchistosome InfectionIn addition to the cross-regulation between Th1 and Th2[152] (and potentially other T cell subsets), there is growingevidence that Th2 cells interact with a complex networkof other T cell subsets as well as B cells and antibodies,naturally or during disease (atopic or infectious). Thus, it hasemerged that Tregs play an important role in the toleranceof ubiquitous antigens and that alterations in Treg function[153, 154] and/or the fine balance between Tregs and Th2cells [155, 156] determines the clinical manifestation ofatopy. Indeed, in healthy (nonatopic) individuals T cellpolarization occurs in contact with environmental allergensbut higher levels of Tregs dampen the eﬀect of Th2 cells,leading to peripheral tolerance [156]. Tregs modulate theactivity of Th2 (and Th1) cells via several mechanismsincluding the secretion of anti-inflammatory cytokines suchas IL-10 and TGF-β [155, 157]. As the description and role ofother recently identified T-helper cells is clarified (e.g., Th17cells shown to be important in nonatopic asthma) regulationof Th2 mediated responses will also become clearer [158].The role of cells such as the T-helper cells recently shownto produce both IL-17 and Th2 cytokines (IL-4, IL-5, IL-9, and IL-13) [159] in pathogenesis is currently underintense investigation. Our own group has recently describeda role for Th17 responses in human schistosome-acquiredimmunity (submitted).IL-10 producing B cells (Bregs) are also involved in therecruitment of Tregs, hence contributing to the regulationof Th2 responses as demonstrated in murine models ofhelminth infection (see [31]). IL-10 can inhibit eﬀectorfunctions of mast cells and eosinophils, and regulate thegrowth of several cells including B cells, NK cells, mast cells,and dendritic cells. Furthermore, IL-10 modulates IgE : IgG4ratios [154] possibly by indirectly inducing the antibodyswitch to IgG4 in the B-cell progeny while preventing IgEproduction [160].IgG4 may control IgE-mediated histamine release as hasbeen demonstrated in filarial infection [143]. Furthermore,it has recently been shown that the binding patterns of IgG4antibodies correspond to natural recovery from childhoodIgE-mediated milk allergy [161], suggesting their potentialprotective role in atopic diseases, although this is stillcontroversial [141]. In addition, early observations that IgG4antibodies were highly elevated in sera of patients receivingallergen immunotherapy [162] have prompted the use ofIgE : IgG4 ratio as a marker for successful immunotherapy[142, 163, 164]. In helminth infections, high IgG4 : IgE ratiohas been associated with reduced pathology while favouringa heavy worm load [150, 165, 166]. Interestingly, IgG4 maybe one of the “regulatory antibodies” resulting from IgGsyalilation involved in the control of immune disorders [167,168].7. Immune Responses in AtopyThe human immune system must distinguish between adangerous pathogen and ubiquitous environmental allergensand has evolved to mount appropriate defensive responses tothe first while tolerating (or ignoring) the latter. However,a certain proportion of individuals fail to tolerate environ-mental allergens and develop allergic diseases such as asthma,atopic dermatitis and allergic rhinitis. These result fromexcessive sensitisation to ordinary exposures to allergens[104]. IgE antibodies are critical eﬀector molecules in thepathogenesis of these diseases [169]. Mast cells and basophilsare coated with specific IgE antibodies and this results inimmediate hypersensitivity (release of mediators) and/orlate-phase inflammatory reaction (cytokine secretion andrecruitment of leucocytes).In atopic individuals, allergen products (e.g., cysteineproteases) activate epithelial cells, which produce thymicstromal lymphopoietin (TSLP), IL-25, and IL-33 which inturn initiate Th2 polarisation with increased productionof IL-4, IL-5, IL-9, and IL-13 cytokines [170, 171]. Th2cytokines are involved in the class-switching to IgE as wellas the development and recruitment of basophils, mastcells, and eosinophils (see Figure 1(c)). IgE binds to thehigh-aﬃnity FcεRI receptor on mast cells, basophils, andeosinophils which (upon exposure to allergens) results intheir activation and degranulation (via cross-linking ofallergens), with the release of preformed mediators suchas histamine, cysteinyl leukotrienes, and prostaglandin D2[154, 172].A complex interplay between innate and adaptiveimmune responses underlies the heterogeneous characteris-tics of atopic diseases. Thus, recruitment of eosinophils intothe lungs of asthmatics may be promoted not just by Th2(IL-5) alone but in conjunction with natural killer T cells(NKT) as well as CD8+ T cells (see [173]). In addition, IL-17-producing T cells (Th17 [174]) may be involved in theseverity of asthma [175]. These promote the recruitmentand activation of neutrophils and lead to corticosteroids—resistant asthma [175]. IL-9-producing T-cell subset (Th9),which probably derive from Th2 cells under the influenceof TGFβ1 [176], may also be involved in the production ofIgE and mast cell recruitment in the lungs [173]. In allergicrhinitis, mast cells accumulate in the epithelium of the nasalmucosa where they secrete inflammatory cytokines (IL-6, IL-8, and TNFα) in addition to Th2 cytokines [177].6 Journal of Parasitology ResearchParasite burdenAPCIL-25IL-10IL-10IL-10Breg TregTh2Th2Th2Th2Th2CD23?CTLA4TGFβIL-4 IL-4IL-5IL-5IL-3, IL-9 IL-3, IL-9IL-4, IL-10 IL-4, IL-13BBB EosEosBasBasAAMMCMCIgE IgEYYYYYYYAllergenIL-25, IL-33GITRIgG4 ≫ IgE(I)(II)(III)(a) Primary infection (b) Secondary/chronic infection (c) Atopic inflammationFigure 1: Possible regulatory mechanisms in helminth infections. Primary response (a) to parasite antigens involves Th2 polarization,IgE production, and eosinophil, mast cell, and basophil activation (I), mechanisms similar to those observed in allergic sensitisation (c).This Th2-response may be induced by parasite-secreted antigens such as the Omega-1 secreted by S. mansoni eggs [25]. However, withincreasing parasite load or chronic infection (b), regulatory B cells are activated which suppress Th2 responses (II) via IL-10 secretionor CD23 expression [26], and/or contribute to the recruitment of Tregs [27]. Tregs (III), which may also be induced and expanded byparasite antigens [28, 29], either induce anergic Th2 cells (expressing GITR and CTLA4) unable to progress through to eﬀector cells, ormodify downstream eﬀector functions such as B cell switch to IgG4 and/or alternative activation of macrophages, resulting in immunologicaltolerance (reviewed by [30]). This immunosuppression is induced in the context of helminth infection, but may also expand to allergen-induced inflammation (gray line), hence suppressing allergy. DC: dendritic cell; B: B cell, Eos: eosinophil; Bas: basophil; MC:mast cell; GITR:glucocorticoid-induced TNFα-related protein; CTLA4: cytotoxic T lymphocyte antigen 4; AAM: alternatively activated macrophage; Breg:regulatory B cell; Treg: regulatory T cell. The question mark (?) denotes lack of strong evidence. Figure adapted from [30, 31] and collatedinformation from the cited references.8. Immune Responses duringSchistosome InfectionAcquired immunity to schistosome infection was first pro-posed by Fisher in the 1930s when analysing data fromanimal studies as well as those from hospital-diagnosedS. haematobium infected people [88]. Subsequently, thesusceptibility of schistosome larvae to immune attack wasdemonstrated by in vitro studies showing that sera from S.mansoni infected individuals could damage schistosomula inthe presence of normal human peripheral blood leucocytes[178]. This “antibody-dependent” killing was subsequentlyshown to be eosinophil mediated [178, 179], and studieson monoclonal antibodies led to the identification of IgEantibodies with the highest cytotoxicity for the schistosomula[180–182]. Field studies were conducted to identify antibodyresponses predictive of resistance to reinfection followingchemotherapy. Hagan et al. [83] demonstrated in a multi-variate logistic regression that reinfection with S. haemato-bium was less likely in individuals producing high IgE levelsagainst the worm antigens and more likely in those produc-ing high levels of IgG4 against the worm or egg antigens. Therole of IgE in resistance was also demonstrated by Rihet et al.[183], who identified specific antigens (120–165KDa and85KDa) to which IgE reacted (on immunoblots) and showedthat these antibodies, in contrast to IgM and IgG, were sig-nificantly higher in the sera of the most resistant individuals.This study showed that some of the immunogenic antigenswere readily accessible to IgE on living S. mansoni larvae asthey were located on the outer membrane. However, Dunneand colleagues, working on S. mansoni as well, showedthat IgE (produced following treatment) against adult wormantigens, particularly a 22 kDa tegumental antigen (Sm22),but not against any other life-cycle stages, were associatedwith resistance to reinfection following treatment [184].Both antiadult worm and anti-schistosomula tegument IgEantibodies were associated with resistance to S. mansonireinfection in another study in Brazil [185] while antiegg IgEantibodies also could confer protection against S. japonicumreinfection [186].Collectively, these studies and several others [187–190]have led to the conclusion that resistance to schistosomeinfection/reinfection is dependent on IgE antibodies. How-ever, data on other antibody isotypes have been reportedwhich correlated with resistance to infection/reinfection. Forexample, IgG3 against the recombinant antigen Sh13 hasJournal of Parasitology Research 7been associated with resistance to S. haematobium infection[191], while antiworm and cercariae IgM were significantlyhigher in individuals more resistant to reinfection with S.mansoni [185]. Furthermore, a decline in IgA together withan increase in IgG1 were associated with resistance acquiredwith host age as well as following treatment in S. haema-tobium endemic area [192]. IgA against Sm28GST antigenhas also been associated with reduced S. mansoni fecundityand increased host resistance to reinfection [193]. Morerecently, antiworm IgE antibodies, as well as eosinophiliaand the low aﬃnity receptor for IgE (the CD23) have beenshown to correlate with resistance in individuals undergoingmultiple rounds of treatment [100, 194], again suggestingthat IgE may be directly involved in parasite killing viaantibody-dependent cellular cytotoxicity (ADCC) in vivo.However, since schistosomula aremore susceptible to ADCC,it is possible that adult-worm-specific antibody responsesmay rather target the incoming larvae, a process termed“concomitant immunity” (as predicted by Fisher [88]) andwell demonstrated in rhesus monkeys [195].As initially demonstrated by in vitro studies [196–198],ADCC is dependent on Th2 cytokines, and these have beeninvolved in resistance to schistosome infection. Thus, higherratios of IL-4/IFN-γ and IL-5/IFN-γ were produced by spe-cific T-cell clones from S. mansoni resistant than susceptibleindividuals [199] and IL-5 correlated with lower levels ofS. haematobium infection [99] and S. mansoni reinfectionafter treatment [200]. Furthermore, IL-4, IL-5, and IL-10levels were associated with resistance posttreatment whileIFN-γ was associated with susceptibility [201]. However,significantly higher levels of IFN-γ against adult worm andcercariae antigens by PBMCs from resistant individuals com-pared to those from susceptible individuals [202], suggestingthat acquired resistance to human schistosomiasis cannot beexclusively classified into a single T helper cell subset.Cellular immune responses, although involved in resis-tance, mediate most of schistosome-related pathology [203,204], which can be divided into acute and chronic diseasesbased on disease progression. Acute schistosomiasis is adebilitating febrile disease which often occurs in individualswith no experience of infection. It is characterized byhigh percentage of eosinophilia, which may be reversedby chemotherapy [205], nausea, urticaria, dry cough, andfever [206, 207]. Anatomically, this stage is accompaniedby a dissemination of large and destructive granulomasaround the eggs [67, 208]. Chronic schistosomiasis is oftenreferred to as a Th2 disease and accounts for most humanimmunopathologies in endemic areas [77, 204, 208–210].As infection becomes chronic, schistosome eggs lodge in theliver, gut (S. mansoni), or bladder (S. haematobium), andthe granulomatous response translates into extensive tissuedamage and excessive extracellular matrix protein (ECMP)deposition, leading to fibrosis [210].9. Immunological Interaction betweenHelminth Antigens and Allergens9.1. Helminth Infection and the “Mast Cell Saturation”Hypothesis. The earliest protective mechanism of helminthinfection suggested was “mast cell saturation,” wherebyhelminths induce high levels of nonspecific IgE that saturateFc receptors on mast cells, thus inhibiting hypersensitivityreactions [211, 212]. Further supportive evidence for theFc saturation hypothesis came from a study showing thathistamine release of human mast cells from lung fragmentscould be blocked by preexposure of these fragments tohigh total IgE [213]. However, more recent studies onbasophils have shown that high levels of polyclonal IgE andpolyclonal/specific IgE ratios from filarial- and hookworm-infected patients do not prevent antigen-induced histaminerelease [214, 215]. Nevertheless, Mitre and colleagues wereable to show that extremely high ratios of polyclonal/specificIgE, enhanced with polyclonal myeloma IgE in vitro, couldprevent histamine release [214]. Although basophils andmast cells may be diﬀerentially regulated [216], these exper-iments suggested that the FcεRI receptor saturation may notbe the primary mechanism by which helminths “protect”against allergy.9.2. Helminth Infection and Cross-Reactive IgE Responses.Another hypothesis suggested was that helminth parasitesinduce a “clinically irrelevant” allergen-specific IgE response,which would be cross-reactive between helminths andallergens [217]. Cross-reactive anti-tropomyosin IgE anti-bodies between helminths and allergens have recently beendemonstrated, where monkeys infected with Loa loa (filarialparasites) mounted an IgE cross-reacting between filarialtropomyosin and Derp 1 allergen but not with timothygrass [218]. Furthermore, cross-reactivity between ascarisand mites has been reported [219]. However, field studiesreport mixed results on the eﬀects of helminth infections onallergen-specific IgE in endemic areas [220–222]. Our recentstudy has demonstrated that the levels of anti-Derp1 IgEantibodies inversely correlate with S. haematobium infectionintensity in a high schistosome infection area in Zimbabwe[223].9.3. Helminth-Induced Immunomodulation. Technologicaland scientific advances such as genomic sequences andproteomic approaches have generated molecular and evolu-tionary information on the relationship between helminthparasites and allergic reactivity. Helminth infections aregenerally characterised by a Th2-polarised immune response[25, 84, 224], which is often associated with host resistanceto infection/reinfection [30]. However, this Th2 responseis also associated with pathology [204], consistent withthe role for Th2 in allergic diseases [171]. Nevertheless,helminth parasites are capable of modulating this response toprolong their survival andminimize severe pathology in theirhost [76, 84, 225]. This immunomodulation is thought toaﬀect unrelated antigens such as allergens, hence dampeningthe clinical manifestation of allergy. Indeed, experimentalstudies have demonstrated helminth-induced suppression ofallergic responses via multiple pathways (Figure 1). However,these observations and mechanisms remain to be rigorouslytested in humans. Furthermore, biological and evolutionarydiﬀerences in the mouse experimental host and the naturalhuman host must be taken into account when extrapolating8 Journal of Parasitology ResearchIgEmCD23sCD23CD21ADAM10Cleavage sitesB-cell membraneNNNNNIgE (Cε) transcription in nucleus(I)(II)(III)(IV)Figure 2: Interaction between CD23 and its ligands, IgE and CD21. Binding of IgE stabilises membrane-bound CD23 and inhibits IgEsynthesis (I) from activated B cells while in the absence of IgE binding the CD23 is cleaved by ADAM10 (a disintegrin and metalloproteaseprotein 10) and this destabilisation enhances IgE synthesis (II). However, soluble CD23 (sCD23) fragments resulting from the cleavagehave the ability to bind IgE with diﬀerent aﬃnities depending on their oligomerization state: trimers (III) bind IgE with high aﬃnity whilemonomers (IV) bind with low aﬃnity. Trimers enhance IgE synthesis by their ability to also bind CD21 receptor (III) while monomers failto bind CD21 and inhibit IgE synthesis (IV) (adapted from [32–36]).mechanistic and phenomenological results from the mouseto the human, for example, diﬀerences in the IgE receptors[226].Human studies investigating the regulatory mechanismsunderlying the protective eﬀect of helminth infections onatopy have primarily focused on IL-10. Thus, parasite-induced IL-10 production and skin prick reactivity werenegatively associated in Ascaris lumbricoides [42] and Schisto-soma haematobium [46] infected populations. Furthermore,allergen-induced IL-10 was associated with reduced Th2responses (IL-4 and IL-5) in asthmatic schistosome infectedpatients [227]. More recently, it has been shown that thefrequency of PBMCs expressing cytotoxic-T-lymphocyteantigen 4 (CTLA-4) and monocytes expressing IL-10 fromasthmatic patients infected with S. mansoni was significantlyhigher compared to their asthmatic uninfected counterparts[228]. However, a study on an Ecuadorian populationshowed no association between skin prick reactivity witheither IL-10 or IL-10-producing T cells induced by Ascarislumbricoides [40].The TGFβ is another cytokine involved in the modu-lation of immune responses, and is secreted by antigen-presenting cells (APCs) or regulatory T cells [229]. However,there is a paucity of human studies on this cytokine inthe context of atopy and helminth infections. Interestingly,we have observed a negative association between atopyand the levels of soluble CD23 in S. haematobium infectedpopulations (Rujeni et al., manuscript in preparation). TheCD23 is the low aﬃnity receptor for IgE and is involved in theregulation of these antibodies [35]. As illustrated in Figure 2,the soluble CD23 can either upregulate or downregulate IgEsynthesis depending on their size and oligomerization state.Of note, expression of this receptor has been associated withresistance to schistosome [194] and Ascaris [230] infectionsin humans, and suppressed airway allergy in helminth-infected mice [231].As illustrated in Figure 1, immunomodulation duringchronic helminth infection is driven by regulatory T andB cells (Tregs and Bregs, resp.), which secrete the abovementioned anti-inflammatory cytokines. Treg cells are eitherrecruited by Bregs or induced and expanded by helminth-derived products [28]. Both T and B regulatory cells cansuppress Th2 cells thereby regulating atopy and helminth-induced pathology [31, 232]. Indeed, a study in our labhas shown that Treg proportions correlate with the levels ofschistosome infection in young children actively acquiringinfection [233].Helminthmolecules have been identified from excretory-secretory (ES) products that are associated with immunomo-dulation during helminth infection. Thus, the ES-62 isa phosphorylcholine-containing glycoprotein secreted byAcanthocheilonema viteae, a rodent filarial nematode [234].This protein presents anti-inflammatory properties and hasbeen successfully tested in mouse models of allergy andautoimmune diseases [235, 236], and it is currently beingexploited as a potential therapeutic agent for inflammatorydiseases in humans [237]. The anti-inflammatory propertiesof this molecule include modulation of B-cell proliferationand cytokine production as well as hyporesponsivenessand desensitization of mast-cell degranulation [237–240].The interleukin-4-inducing principle from S. mansoni eggIPSE/alpha-1, identified as one of the most abundantproteins secreted by S. mansoni eggs [241], has also beenassociated with immunomodulation, possibly by inducingJournal of Parasitology Research 9granulomatous responses [242]. Furthermore, IPSE/alpha-1 has been shown to induce antigen-independent IL-4production by murine basophils in vivo [243]. The venomallergen-like (VAL) proteins are another group of helminthES products involved in immunomodulation. Thus, Hewit-son et al. have demonstrated that antibodies to these VALantigens are dominant in susceptible mice in an H. polygyrusinfection model [244]. Sj-VAL-1 is one of the VAL proteinsidentified in S. japonicum egg ES products inducing anantibody response during the first 6 weeks of infection inmice [245].10. Convergence of Allergic andAntiparasite ResponsesThere is current interest in determining the common featuresin the induction of immune responses by allergens and byhelminths as well as the evolutionary advantages of main-taining allergic responses. As illustrated above, several studieshave suggested that similarities in antigens may underliethe commonality of Th2 responses elicited by allergens andby helminths. A recent review [246] of allergic responsesindicated that there is relatively little structural similaritybetween diﬀerent allergens (e.g., house dust mite, foodallergens, and haematophagous fluids) and between allergensand helminth parasites. Instead, this paper suggests that therelationship between allergic and antiparasite Th2 responsesarises from a common response to diﬀerent classes ofenvironmental challenges which include helminth parasites,venoms and haematophagous fluids, and environmentalirritants such as carcinogens and noxious xenobiotics, sothat this diverse group of stimuli activates responses collec-tively known as “allergic host defences” [246]. Within thisparadigm, these environmental challenges are characterisedonly by the type of response they elicit with multiplepathways leading to the activation of Th2 responses withthe result of protecting against environmental challenges byeither reduced exposure to, or elimination of the “irritant.”In this scenario, allergic reactivity is believed to have evolvedas an important and essential mechanism against harmrather than a harmful overreaction of a misdirected immunesystem [247]. Studies in cancer patients also show a negativeassociation between cancer and atopy which has led tothe suggestion that allergy protects against some types ofcancer [248, 249]. This suggests that the Th2 responsesprotecting against allergens, carcinogens, and helminths arecomplex. This presents a challenge for the developmentof therapeutics relying on helminth products to overcomeallergic responses, since induction of allergic responses aswell as the eﬀector mechanisms maybe tightly regulated, andthe eﬀector responses they elicit may have been selected forredundancy.11. ConclusionsWe have shown similarities in the immunological responsesto schistosome parasites and to allergens. Studies continueto determine the aetiology of the similar responses and theevolutionary pathways that may have led to the developmentand maintenance of allergic responses which are paradoxi-cally harmful to the host [246, 247], but may be essential toprotect against harm from environmental challenges [246].The clinical manifestation of atopy is complex with severalstudies from helminth endemic areas having shown thatallergic sensitisation and clinical manifestation of allergycan be dissociated [222]. Furthermore, allergic disease andparasitic infections exist as comorbidities in many patientsand are not mutually exclusive [250]. The role of impairedserological allergy diagnosis in parasitized allergy patientsas well as under diagnosis in developing countries needs tobe addressed to inform future studies. Detailed longitudinaland mechanistic studies relating atopy and clinical disease toschistosome infection and disease in human populations willbe valuable to inform on not only the immunological processoccurring, but more importantly on clinical management ofallergy and schistosomiasis patients.AcknowledgmentsThis paper contains some of our work which was fundedby the World Health Organization (Grant no. RPC264), TheWelcome Trust (Grant no. WT082028MA), the Universityof Edinburgh, and the Government of Rwanda. F. Mutapiis funded by the Thrasher Foundation. The authors aregrateful to Laura Appleby for providing comments on themanuscript.References[1] N. R. Stoll, “This wormy world,” Journal of Parasitology, vol.33, pp. 1–18, 1947.[2] GaHI, “Global Atlas of helminth infections,” Consulted,Manta Ray Media Ltd, 2012, http://www.thiswormyworld.org/.[3] P. J. Hotez, J. H. F. Remme, P. Buss, G. Alleyne, C. Morel, andJ. G. Breman, “Combating tropical infectious diseases: reportof the disease control priorities in developing countriesproject,” Clinical Infectious Diseases, vol. 38, no. 6, pp. 871–878, 2004.[4] P. J. Hotez, P. J. Brindley, J. M. Bethony, C. H. King, E.J. Pearce, and J. Jacobson, “Helminth infections: the greatneglected tropical diseases,” Journal of Clinical Investigation,vol. 118, no. 4, pp. 1311–1321, 2008.[5] J. Bethony, S. Brooker, M. Albonico et al., “Soil-transmittedhelminth infections: ascariasis, trichuriasis, and hookworm,”The Lancet, vol. 367, no. 9521, pp. 1521–1532, 2006.[6] C. H. King and M. Dangerfield-Cha, “The unacknowledgedimpact of chronic schistosomiasis,” Chronic Illness, vol. 4, no.1, pp. 65–79, 2008.[7] C. H. King, K. Dickman, and D. J. Tisch, “Reassessment ofthe cost of chronic helmintic infection: a meta-analysis ofdisability-related outcomes in endemic schistosomiasis,” TheLancet, vol. 365, no. 9470, pp. 1561–1569, 2005.[8] N. Aı¨t-Khaled, N. Pearce, H. R. Anderson et al., “Globalmap of the prevalence of symptoms of rhinoconjunctivitis inchildren: the International Study of Asthma and Allergies inChildhood (ISAAC) Phase Three,” Allergy, vol. 64, no. 1, pp.123–148, 2009.[9] H. Williams, C. Robertson, A. Stewart et al., “Worldwidevariations in the prevalence of symptoms of atopic eczema inthe international study of asthma and allergies in childhood,”10 Journal of Parasitology ResearchJournal of Allergy and Clinical Immunology, vol. 103, no. 1 I,pp. 125–138, 1999.[10] E. N. Sibanda, “Inhalant allergies in Zimbabwe: a commonproblem,” International Archives of Allergy and Immunology,vol. 130, no. 1, pp. 2–9, 2003.[11] R. Beasley, S. Nishima, N. Pearce, and J. Crane, “β-agonisttherapy and asthma mortality in Japan,” The Lancet, vol. 351,no. 9113, pp. 1406–1407, 1998.[12] P. Davis, R. Jackson, and N. Pearce, “Asthma mortality,” NewZealand Medical Journal, vol. 98, no. 783, p. 604, 1985.[13] R. Jackson, “Undertreatment and asthma deaths,” TheLancet, vol. 2, no. 8453, p. 500, 1985.[14] R. Brown, F. Turk, P. Dale, and J. Bousquet, “Cost-eﬀective-ness of omalizumab in patients with severe persistent allergicasthma,” Allergy, vol. 62, no. 2, pp. 149–153, 2007.[15] R. Gupta, A. Sheikh, D. P. Strachan, and H. R. Anderson,“Burden of allergic disease in the UK: secondary analyses ofnational databases,” Clinical and Experimental Allergy, vol.34, no. 4, pp. 520–526, 2004.[16] P. Suwan, D. Akaramethathip, and P. Noipayak, “Associationbetween allergic sensitization and attention deficit hyperac-tivity disorder (ADHD),” Asian Pacific Journal of Allergy andImmunology, vol. 29, no. 1, pp. 57–65, 2011.[17] M. C. Tsai, H. K. Lin, C. H. Lin, and L. S. Fu, “Prevalenceof attention deficit/hyperactivity disorder in pediatric allergicrhinitis: a nationwide population-based study,” Allergy andAsthma Proceedings, vol. 32, no. 6, pp. 41–46, 2011.[18] B. Taylor, J. Wadsworth, M. Wadsworth, and C. Peckham,“Changes in the reported prevalence of childhood eczemasince the 1939–45 war,”The Lancet, vol. 2, no. 8414, pp. 1255–1257, 1984.[19] M. B. Emanuel, “Hay fever, a post industrial revolutionepidemic: a history of its growth during the 19th century,”Clinical Allergy, vol. 18, no. 3, pp. 295–304, 1988.[20] F. D. Martinez, D. A. Stem, A. L. Wright, L. M. Taussig, andM. Halonen, “Association of non-wheezing lower respiratorytract illnesses in early life with persistently diminished serumIgE levels,” Thorax, vol. 50, no. 10, pp. 1067–1072, 1995.[21] S. O. Shaheen, P. Aaby, A. J. Hall et al., “Measles and atopyin Guinea-Bissau,” The Lancet, vol. 347, no. 9018, pp. 1792–1796, 1996.[22] J. S. Alm, G. Lilja, G. Pershagen, and A. Scheynius, “EarlyBCG vaccination and development of atopy,” The Lancet, vol.350, no. 9075, pp. 400–403, 1997.[23] I. L. Strannega˚rd, L. O. Larsson, G. Wennergren, and O.Strannega˚rd, “Prevalence of allergy in children in relation toprior BCG vaccination and infection with atypical mycobac-teria,” Allergy, vol. 53, no. 3, pp. 249–254, 1998.[24] P. M. Matricardi, F. Rosmini, S. Riondino et al., “Exposure tofoodborne and orofecal microbes versus airborne viruses inrelation to atopy and allergic asthma: epidemiological study,”BritishMedical Journal, vol. 320, no. 7232, pp. 412–417, 2000.[25] B. Everts, G. Perona-Wright, H. H. Smits et al., “Omega-1,a glycoprotein secreted by Schistosoma mansoni eggs, drivesTh2 responses,” Journal of Experimental Medicine, vol. 206,no. 8, pp. 1673–1680, 2009.[26] M. S. Wilson, M. D. Taylor, M. T. O’Gorman et al.,“Helminth-induced CD19+CD23hi B cells modulate exper-imental allergic and autoimmune inflammation,” EuropeanJournal of Immunology, vol. 40, no. 6, pp. 1682–1696, 2010.[27] S. Amu, S. P. Saunders, M. Kronenberg, N. E. Mangan, A.Atzberger, and P. G. Fallon, “Regulatory B cells prevent andreverse allergic airway inflammation via FoxP3-positive Tregulatory cells in a murine model,” Journal of Allergy andClinical Immunology, vol. 125, no. 5, pp. 1114.e8–1124.e8,2010.[28] H. J. McSorley, Y. M. Harcus, J. Murray, M. D. Taylor, and R.M. Maizels, “Expansion of Foxp3+ regulatory T cells in miceinfected with the filarial parasite Brugia malayi,” Journal ofImmunology, vol. 181, no. 9, pp. 6456–6466, 2008.[29] J. R. Grainger, K. A. Smith, J. P. Hewitson et al., “Helminthsecretions induce de novo T cell Foxp3 expression andregulatory function through the TGF-β pathway,” Journal ofExperimental Medicine, vol. 207, no. 11, pp. 2331–2341, 2010.[30] J. E. Allen and R. M. Maizels, “Diversity and dialogue inimmunity to helminths,” Nature Reviews Immunology, vol.11, no. 6, pp. 375–388, 2011.[31] L. Hussaarts, L. E. P. M. van der Vlugt, M. Yazdanbakhsh,and H. H. Smits, “Regulatory B-cell induction by helminths:implications for allergic disease,” Journal of Allergy andClinical Immunology, vol. 128, no. 4, pp. 733–739, 2011.[32] H. J. Gould and B. J. Sutton, “IgE in allergy and asthmatoday,” Nature Reviews Immunology, vol. 8, no. 3, pp. 205–217, 2008.[33] M. Acharya, G. Borland, A. L. Edkins et al., “CD23/Fcepsi-lonRII: molecular multi-tasking,” Clinical and ExperimentalImmunology, vol. 162, no. 1, pp. 12–23, 2010.[34] R. G. Hibbert, P. Teriete, G. J. Grundy et al., “The structureof human CD23 and its interactions with IgE and CD21,”Journal of Experimental Medicine, vol. 202, no. 6, pp. 751–760, 2005.[35] D. H. Conrad, J. W. Ford, J. L. Sturgill, and D. R. Gibb,“CD23: an overlooked regulator of allergic disease,” CurrentAllergy and Asthma Reports, vol. 7, no. 5, pp. 331–337, 2007.[36] S. L. Bowles, C. Jaeger, C. Ferrara et al., “Comparative bind-ing of soluble fragments (derCD23, sCD23, and exCD23) ofrecombinant human CD23 to CD21 (SCR 1-2) and nativeIgE, and their eﬀect on IgE regulation,” Cellular immunology,vol. 271, no. 2, pp. 371–378, 2011.[37] D. Dagoye, Z. Bekele, K. Woldemichael et al., “Wheezing,allergy, and parasite infection in children in urban and ruralethiopia,” American Journal of Respiratory and Critical CareMedicine, vol. 167, no. 10, pp. 1369–1373, 2003.[38] N. R. Lynch, I. Hagel, M. Perez,M. C. Di Prisco, R. Lopez, andN. Alvarez, “Eﬀect of anthelmintic treatment on the allergicreactivity of children in a tropical slum,” Journal of Allergyand Clinical Immunology, vol. 92, no. 3, pp. 404–411, 1993.[39] L. J. Palmer, J. C. Celedo´n, S. T. Weiss, B. Wang, Z. Fang,and X. Xu, “Ascaris lumbricoides infection is associated withincreased risk of childhood asthma and atopy in rural China,”American Journal of Respiratory and Critical Care Medicine,vol. 165, no. 11, pp. 1489–1493, 2002.[40] P. J. Cooper, E. Mitre, A. L. Moncayo, M. E. Chico, M.G. Vaca, and T. B. Nutman, “Ascaris lumbricoides-inducedinterleukin-10 is not associated with atopy in schoolchildrenin a rural area of the tropics,” Journal of Infectious Diseases,vol. 197, no. 9, pp. 1333–1340, 2008.[41] P. J. Cooper, M. E. Chico, M. G. Vaca et al., “Eﬀect ofalbendazole treatments on the prevalence of atopy in childrenliving in communities endemic for geohelminth parasites: acluster-randomised trial,” The Lancet, vol. 367, no. 9522, pp.1598–1603, 2006.[42] C. Flohr, L. N. Tuyen, R. J. Quinnell et al., “Reduced helminthburden increases allergen skin sensitization but not clinicalallergy: a randomized, double-blind, placebo-controlled trialin Vietnam,” Clinical and Experimental Allergy, vol. 40, no. 1,pp. 131–142, 2010.Journal of Parasitology Research 11[43] L. C. Rodrigues, P. J. Newcombe, S. S. Cunha et al., “Earlyinfection with Trichuris trichiura and allergen skin testreactivity in later childhood,” Clinical and ExperimentalAllergy, vol. 38, no. 11, pp. 1769–1777, 2008.[44] M. I. Araujo, A. A. Lopes,M.Medeiros et al., “Inverse associa-tion between skin response to aeroallergens and Schistosomamansoni infection,” International Archives of Allergy andImmunology, vol. 123, no. 2, pp. 145–148, 2000.[45] M. Medeiros Jr., J. P. Figueiredo, M. C. Almeida et al., “Schis-tosoma mansoni infection is associated with a reduced courseof asthma,” Journal of Allergy and Clinical Immunology, vol.111, no. 5, pp. 947–951, 2003.[46] A. H. J. van den Biggelaar, R. Van Ree, L. C. Rodrigueset al., “Decreased atopy in children infected with Schistosomahaematobium: a role for parasite-induced interleukin-10,”The Lancet, vol. 356, no. 9243, pp. 1723–1727, 2000.[47] P. J. Hotez and A. Fenwick, “Schistosomiasis in Africa: anemerging tragedy in our new global health decade,” PLoSNeglected Tropical Diseases, vol. 3, no. 9, article e485, 2009.[48] A. Fenwick, J. P. Webster, E. Bosque-Oliva et al., “The Schis-tosomiasis Control Initiative (SCI): rationale, developmentand implementation from 2002–2008,” Parasitology, vol. 136,no. 13, pp. 1719–1730, 2009.[49] B. Gryseels, K. Polman, J. Clerinx, and L. Kestens, “Humanschistosomiasis,” The Lancet, vol. 368, no. 9541, pp. 1106–1118, 2006.[50] J. R. Stothard and A. F. Gabrielli, “Schistosomiasis in Africaninfants and preschool children: to treat or not to treat?”Trends in Parasitology, vol. 23, no. 3, pp. 83–86, 2007.[51] J. Ring, “Davos Declaration: allergy as a global problem,”Allergy, vol. 67, no. 2, pp. 141–143, 2012.[52] L. J. Akinbami and K. C. Schoendorf, “Trends in childhoodasthma: prevalence, health care utilization, and mortality,”Pediatrics, vol. 110, no. 2, part 1, pp. 315–322, 2002.[53] J. M. Smith, M. E. Disney, J. D. Williams, and Z. A. Goels,“Clinical significance of skin reactions to mite extracts inchildren with asthma,” BritishMedical Journal, vol. 1, no. 659,pp. 723–726, 1969.[54] D. O.Miranda, A. O. Deise Silva, F. C. Jorge et al., “Serum andsalivary IgE, IgA, and IgG4 antibodies to Dermatophagoidespteronyssinus and its major allergens, Der p1 and Der p2, inallergic and nonallergic children,”Clinical and DevelopmentalImmunology, vol. 2011, Article ID 302739, 11 pages, 2011.[55] J. L. Hopper, M. A. Jenkins, J. B. Carlin, and G. G. Giles,“Increase in the self-reported prevalence of asthma and hayfever in adults over the last generation: a matched parent-oﬀspring study,” Australian Journal of Public Health, vol. 19,no. 2, pp. 120–124, 1995.[56] D. Jarvis, R. Newson, J. Lotvall et al., “Asthma in adults andits association with chronic rhinosinusitis: the GA(2) LENsurvey in Europe,” Allergy, vol. 67, no. 1, pp. 91–98, 2011.[57] S. Musafiri, J. van Meerbeeck, L. Musango et al., “Prevalenceof atopy, asthma and COPD in an urban and a rural area ofan African country,” Respiratory Medicine, vol. 105, no. 11,pp. 1596–1605, 2011.[58] C. K. W. Lai, R. Beasley, J. Crane et al., “Global variationin the prevalence and severity of asthma symptoms: phaseThree of the International Study of Asthma and Allergies inChildhood (ISAAC),” Thorax, vol. 64, no. 6, pp. 476–483,2009.[59] C. H. Katelaris, B. W. Lee, P. C. Potter et al., “Prevalence anddiversity of allergic rhinitis in regions of the world beyondEurope and North America,” Clinical and ExperimentalAllergy, vol. 42, no. 2, pp. 186–207, 2011.[60] K. Westritschnig, E. Sibanda, W. Thomas et al., “Analysis ofthe sensitization profile towards allergens in central Africa,”Clinical and Experimental Allergy, vol. 33, no. 1, pp. 22–27,2003.[61] K. Arkestl, E. Sibanda, C. Thors et al., “Impaired allergydiagnostics among parasite-infected patients caused byIgE antibodies to the carbohydrate epitope galactose-α1,3-galactose,” Journal of Allergy and Clinical Immunology, vol.127, no. 4, pp. 1024–1028, 2011.[62] J. C. Samuelson and J. P. Caulfield, “The cercarial glycocalyxof Schistosoma mansoni,” Journal of Cell Biology, vol. 100, no.5, pp. 1423–1434, 1985.[63] J. T. Culbertson, “The cercaricidal action of normal serums,”The Journal of Parasitology, vol. 22, no. 2, 1936.[64] W. Dias Da Silva and M. D. Kazatchkine, “Schistosomamansoni: activation of the alternative pathway of humancomplement by schistosomula,” Experimental Parasitology,vol. 50, no. 2, pp. 278–286, 1980.[65] S. J. Jenkins, J. P. Hewitson, S. Ferret-Bernard, and A.P. Mountford, “Schistosome larvae stimulate macrophagecytokine production through TLR4-dependent and -inde-pendent pathways,” International Immunology, vol. 17, no.11, pp. 1409–1418, 2005.[66] R. A. Paveley, S. A. Aynsley, J. D. Turner et al., “The MannoseReceptor (CD206) is an important pattern recognitionreceptor (PRR) in the detection of the infective stage of thehelminth Schistosoma mansoni and modulates IFNgammaproduction,” International Journal for Parasitology, vol. 41,no. 13-14, pp. 1335–1345, 2011.[67] J. R. Lambertucci, “Acute Schistosomiasis mansoni: revisitedand reconsidered,” Memorias do Instituto Oswaldo Cruz, vol.105, no. 4, pp. 422–435, 2010.[68] S. V. Brant and E. S. Loker, “Schistosomes in the southwestUnited States and their potential for causing cercarialdermatitis or swimmer’s itch,” Journal of Helminthology, vol.83, no. 2, pp. 191–198, 2009.[69] S. J. Fraser, S. J. R. Allan, M. Roworth et al., “Cercarial der-matitis in the UK,” Clinical and Experimental Dermatology,vol. 34, no. 3, pp. 344–346, 2009.[70] A. Soleng and R. Mehl, “Geographical distribution ofcercarial dermatitis in Norway,” Journal of Helminthology,vol. 85, no. 3, pp. 345–352, 2010.[71] P. C. Cook, S. A. Aynsley, J. D. Turner et al., “Multiplehelminth infection of the skin causes lymphocyte hypo-responsiveness mediated by Th2 conditioning of dermalmyeloid cells,” PLoS Pathogens, vol. 7, no. 3, Article IDe1001323, 2011.[72] K. Ramaswamy, P. Kumar, and Y. X. He, “A role for parasite-induced PGE2 in IL-10-mediated host immunoregulation byskin stage schistosomula of Schistosoma mansoni,” Journal ofImmunology, vol. 165, no. 8, pp. 4567–4574, 2000.[73] V. Angeli, C. Faveeuw, P. Delerive et al., “Schistosomamansoniinduces the synthesis of IL-6 in pulmonary microvascu-lar endothelial cells: role of IL-6 in the control of lungeosinophilia during infection,” European Journal of Immunol-ogy, vol. 31, no. 9, pp. 2751–2761, 2001.[74] F. Trottein, S. Nutten, V. Angeli et al., “Schistosoma mansonischistosomula reduce E-selectin and VCAM-1 expression inTNF-alpha-stimulated lung microvascular endothelial cellsby interfering with the NF-kappaB pathway,” EuropeanJournal of Immunology, vol. 29, no. 11, pp. 3691–3701, 1999.[75] E. J. Pearce, C. M. Kane, J. Sun, J. J. Taylor, A. S. McKee, andL. Cervi, “Th2 response polarization during infection with12 Journal of Parasitology Researchdie helminth parasite Schistosoma mansoni,” ImmunologicalReviews, vol. 201, pp. 117–126, 2004.[76] E. J. Pearce and A. S. MacDonald, “The immunobiology ofschistosomiasis,” Nature Reviews Immunology, vol. 2, no. 7,pp. 499–511, 2002.[77] H. M. Coutinho, L. P. Acosta, H.W.Wu et al., “Th2 cytokinesare associated with persistent hepatic fibrosis in human Schis-tosoma japonicum infection,” Journal of Infectious Diseases,vol. 195, no. 2, pp. 288–295, 2007.[78] S. Henri, C. Chevillard, A. Mergani et al., “Cytokineregulation of periportal fibrosis in humans infected withSchistosoma mansoni: IFN-γ is associated with protectionagainst fibrosis and TNF-α with aggravation of disease,”Journal of Immunology, vol. 169, no. 2, pp. 929–936, 2002.[79] A. Dessein, B. Kouriba, C. Eboumbou et al., “Interleukin-13in the skin and interferon-γ in the liver are key players inimmune protection in human schistosomiasis,” Immunologi-cal Reviews, vol. 201, pp. 180–190, 2004.[80] P. Smith, R. E. Fallon, N. E. Mangan et al., “Schistosomamansoni secretes a chemokine binding protein with antiin-flammatory activity,” Journal of Experimental Medicine, vol.202, no. 10, pp. 1319–1325, 2005.[81] L. A. de Oliveira Fraga, E. W. Lamb, E. C. Moreno etal., “Rapid induction of IgE responses to a worm cysteineprotease during murine pre-patent schistosome infection,”BMC Immunology, vol. 11, article 56, 2010.[82] M. Nyindo, T. M. Kariuki, P. W. Mola et al., “Role of adultworm antigen-specific immunoglobulin E in acquiredimmunity to Schistosoma mansoni infection in baboons,”Infection and Immunity, vol. 67, no. 2, pp. 636–642, 1999.[83] P. Hagan, U. J. Blumenthal, D. Dunn, A. J. G. Simpson,and H. A. Wilkins, “Human IgE, IgG4 and resistance toreinfection with Schistosoma haematobium,”Nature, vol. 349,no. 6306, pp. 243–245, 1991.[84] R. M. Maizels and M. Yazdanbakhsh, “Immune regulationby helminth parasites: cellular and molecular mechanisms,”Nature Reviews Immunology, vol. 3, no. 9, pp. 733–744, 2003.[85] N. E. Mangan, R. E. Fallon, P. Smith, N. Van Rooijen, A.N. McKenzie, and P. G. Fallon, “Helminth infection protectsmice from anaphylaxis via IL-10-producing B cells,” Journalof Immunology, vol. 173, no. 10, pp. 6346–6356, 2004.[86] N. E. Mangan, N. Van Rooijen, A. N. J. McKenzie, and P. G.Fallon, “Helminth-modified pulmonary immune responseprotects mice from allergen-induced airway hyperrespon-siveness,” Journal of Immunology, vol. 176, no. 1, pp. 138–147,2006.[87] R. S. Curwen, P. D. Ashton, D. A. Johnston, and R. A. Wilson,“The Schistosoma mansoni soluble proteome: a comparisonacross four life-cycle stages,” Molecular and BiochemicalParasitology, vol. 138, no. 1, pp. 57–66, 2004.[88] A. C. Fisher, “A study of the schistosomiasis of the Stanleyvilledistrict of the Belgian congo,” Transactions of the Royal Societyof Tropical Medicine and Hygiene, vol. 28, no. 3, pp. 277–IN1,1934.[89] K. S. Warren, “Regulation of the prevalence and intensity ofschistosomiasis in man: immunology or ecology?” Journal ofInfectious Diseases, vol. 127, no. 5, pp. 595–609, 1973.[90] A. E. Butterworth, M. Capron, and J. S. Cordingley, “Immu-nity after treatment of human Schistosomiasis mansoni. II.Identification of resistant individuals, and analysis of theirimmune responses,” Transactions of the Royal Society ofTropical Medicine and Hygiene, vol. 79, no. 3, pp. 393–408,1985.[91] D. W. Dunne, A. J. Fulford, A. E. Butterworth, D. Koech,and J. H. Ouma, “Human antibody responses to Schistosomamansoni: does antigen directed, isotype restriction resultin the production of blocking antibodies?” Memorias doInstituto Oswaldo Cruz, vol. 82, supplement 4, pp. 101–104,1987.[92] A. E. Butterworth, A. J. Fulford, D. W. Dunne, J. H. Ouma,and R. F. Sturrock, “Longitudinal studies on human schis-tosomiasis,” Philosophical transactions of the Royal Society ofLondon B, vol. 321, no. 1207, pp. 495–511, 1988.[93] R.M. Anderson and R.M.May, “Herd immunity to helminthinfection and implications for parasite control,” Nature, vol.315, no. 6019, pp. 493–496, 1985.[94] A. J. C. Fulford, A. E. Butterworth, R. F. Sturrock, and J. H.Ouma, “On the use of age-intensity data to detect immunityto parasitic infections, with special reference to Schistosomamansoni in Kenya,” Parasitology, vol. 105, no. 2, pp. 219–227,1992.[95] M. E. J. Woolhouse, P. Taylor, D. Matanhire, and S. K.Chandiwana, “Acquired immunity and epidemiology ofSchistosoma haematobium,” Nature, vol. 351, no. 6329, pp.757–759, 1991.[96] K. Marsh and R. W. Snow, “Host-parasite interaction andmorbidity in malaria endemic areas,” Philosophical Transac-tions of the Royal Society B, vol. 352, no. 1359, pp. 1385–1394,1997.[97] M. E. J. Woolhouse, “Patterns in parasite epidemiology: thepeak shift,” Parasitology Today, vol. 14, no. 10, pp. 428–434,1998.[98] F. Mutapi, P. D. Ndhlovu, P. Hagan, and M. E. J. Woolhouse,“A comparison of humoral responses to Schistosoma haema-tobium in areas with low and high levels of infection,” ParasiteImmunology, vol. 19, no. 6, pp. 255–263, 1997.[99] F. Mutapi, G. Winborn, N. Midzi, M. Taylor, T. Mduluza,and R. M. Maizels, “Cytokine responses to Schistosomahaematobium in a Zimbabwean population: contrastingprofiles for IFN-γ, IL-4, IL-5 and IL-10 with age,” BMCInfectious Diseases, vol. 7, article 139, 2007.[100] C. L. Black, P. N. Mwinzi, E. M. Muok et al., “Influence ofexposure history on the immunology and development ofresistance to human Schistosomiasis mansoni,” PLoS NeglectedTropical Diseases, vol. 4, no. 3, article e637, 2010.[101] D. M. S. Karanja, A. W. Hightower, D. G. Colley et al.,“Resistance to reinfection with Schistosoma mansoni in occu-pationally exposed adults and eﬀect of HIV-1 co-infection onsusceptibility to schistosomiasis: a longitudinal study,” TheLancet, vol. 360, no. 9333, pp. 592–596, 2002.[102] M. Z. Satti, S. M. Sulaiman, M. M. A. Homeida, S. A. Younis,and H. W. Ghalib, “Clinical, parasitological and immunolog-ical features of canal cleaners hyper-exposed to Schistosomamansoni in the Sudan,” Clinical and Experimental Immunol-ogy, vol. 104, no. 3, pp. 426–431, 1996.[103] A. J. C. Fulford, M. Webster, J. H. Ouma, G. Kimani, D. W.Dunne, and T. Fulford, “Puberty and age-related changes insusceptibility to schistosome infection,” Parasitology Today,vol. 14, no. 1, pp. 23–26, 1998.[104] S. G. O. Johansson, T. Bieber, R. Dahl et al., “Revised nomen-clature for allergy for global use: report of the NomenclatureReview Committee of the World Allergy Organization,October 2003,” Journal of Allergy and Clinical Immunology,vol. 113, no. 5, pp. 832–836, 2004.[105] M. Herr, L. Nikasinovic, C. Foucault et al., “Can early house-hold exposure influence the development of rhinitis symp-toms in infancy? Findings from the PARIS birth cohort,”Journal of Parasitology Research 13Annals of Allergy, Asthma and Immunology, vol. 107, no. 4,pp. 303–309, 2011.[106] S. L. Prescott, “The influence of early environmental expo-sures on immune development and subsequent risk ofallergic disease,” Allergy, vol. 66, no. 95, pp. 4–6, 2011.[107] J. M. Spergel and A. S. Paller, “Atopic dermatitis and theatopic march,” Journal of Allergy and Clinical Immunology,vol. 112, no. 6, supplement, pp. S118–S127, 2003.[108] N. Bhattacharyya, J. Grebner, and N. G. Martinson, “Recur-rent acute rhinosinusitis: epidemiology and health care costburden,”Otolaryngology andHead andNeck Surgery. In press.[109] R. Sporik, S. T. Holgate, and J. J. Cogswell, “Natural historyof asthma in childhood—a birth cohort study,” Archives ofDisease in Childhood, vol. 66, no. 9, pp. 1050–1053, 1991.[110] M. L. Martinson, J. O. Teitler, and N. E. Reichman, “Healthacross the life span in the United States and England,”American Journal of Epidemiology, vol. 173, no. 8, pp. 858–865, 2011.[111] C. Y. Hwang, Y. J. Chen,M.W. Lin et al., “Prevalence of atopicdermatitis, allergic rhinitis and asthma in Taiwan: a nationalstudy 2000 to 2007,” Acta Dermato-Venereologica, vol. 90, no.6, pp. 589–594, 2010.[112] E. G. Weinberg, “The atopic march,” Current Allergy &Clinical Immunology, vol. 18, no. 1, pp. 4–5, 2005.[113] G. Barberio, G. B. Pajno, D. Vita, L. Caminiti, G. W.Canonica, and G. Passalacqua, “Does a “reverse” atopicmarch exist?” Allergy, vol. 63, no. 12, pp. 1630–1632, 2008.[114] M. D. Klinnert, H. S. Nelson, M. R. Price, A. D. Adinoﬀ,D. Y. Leung, and D. A. Mrazek, “Onset and persistence ofchildhood asthma: predictors from infancy,” Pediatrics, vol.108, no. 4, p. E69, 2001.[115] P. O. Van Asperen, A. S. Kemp, and A. Mukhi, “Atopyin infancy predicts the severity of bronchial hyperrespon-siveness in later childhood,” Journal of Allergy and ClinicalImmunology, vol. 85, no. 4, pp. 790–795, 1990.[116] P. M. Matricardi, A. Bockelbrink, C. Gru¨ber et al., “Longi-tudinal trends of total and allergen-specific IgE throughoutchildhood,” Allergy, vol. 64, no. 7, pp. 1093–1098, 2009.[117] D. A. Mrazek, M. Klinnert, P. J. Mrazek et al., “Prediction ofearly-onset asthma in genetically at-risk children,” PediatricPulmonology, vol. 27, no. 2, pp. 85–94, 1999.[118] P. G. Holt and D. H. Strickland, “Soothing signals: transpla-cental transmission of resistance to asthma and allergy,”Journal of Experimental Medicine, vol. 206, no. 13, pp. 2861–2864, 2009.[119] B. Schaub, J. Liu, S. Ho¨ppler et al., “Maternal farm exposuremodulates neonatal immune mechanisms through regula-tory T cells,” Journal of Allergy and Clinical Immunology, vol.123, no. 4, pp. 774.e5–782.e5, 2009.[120] J. W. Hollingsworth, S. Maruoka, K. Boon et al., “Inutero supplementation with methyl donors enhances allergicairway disease in mice,” Journal of Clinical Investigation, vol.118, no. 10, pp. 3462–3469, 2008.[121] K. Ishizaka and T. Ishizaka, “Physicochemical properties ofreaginic antibody. I. Association of reaginic activity with animmunoglobulin other than γA- or γG-globulin,” Journal ofAllergy, vol. 37, no. 3, pp. 169–185, 1966.[122] K. Ishizaka and T. Ishizaka, “Identification of gamma-E-antibodies as a carrier of reaginic activity,” Journal ofImmunology, vol. 99, no. 6, pp. 1187–1198, 1967.[123] E. Dehlink, B. Platzer, A. H. Baker et al., “A soluble formof the high aﬃnity IgE receptor, Fc-epsilon-RI, circulates inhuman serum,” PLoS ONE, vol. 6, no. 4, Article ID e19098,2011.[124] B. Platzer, E. Dehlink, S. J. Turley, and E. Fiebiger, “How toconnect an IgE-driven response with CTL activity?” CancerImmunol Immunother. In press.[125] T. Bieber, H. De la Salle, A. Wollenberg et al., “Humanepidermal Langerhans cells express the high aﬃnity receptorfor immunoglobulin E (FcεRI),” Journal of ExperimentalMedicine, vol. 175, no. 5, pp. 1285–1290, 1992.[126] A. S. Gounni, B. Lamkhioued, E. Delaporte et al., “The high-aﬃnity IgE receptor on eosinophils: from allergy to parasitesor from parasites to allergy?” Journal of Allergy and ClinicalImmunology, vol. 94, no. 6, part 2, pp. 1214–1216, 1994.[127] A. S. Gounni, B. Lamkhioued, K. Ochiai et al., “High-aﬃnityIgE receptor on eosinophils is involved in defence againstparasites,” Nature, vol. 367, no. 6459, pp. 183–186, 1994.[128] U. Jeschke, D. Mayr, B. Schiessl et al., “Expression ofgalectin-1, -3 (gal-1, gal-3) and the thomsen-friedenreich(TF) antigen in normal, IUGR, preeclamptic and HELLPplacentas,” Placenta, vol. 28, no. 11-12, pp. 1165–1173, 2007.[129] E. Rindsjo¨, M. Joerink, N. Papadogiannakis, and A.Scheynius, “IgE in the human placenta: why there?” Allergy,vol. 65, no. 5, pp. 554–560, 2010.[130] M. Vernersson, M. Aveskogh, and L. Hellman, “Cloning ofIgE from the echidna (Tachyglossus aculeatus) and a compar-ative analysis of ε chains from all three extant mammalianlineages,” Developmental and Comparative Immunology, vol.28, no. 1, pp. 61–75, 2004.[131] P. Vieira and K. Rajewsky, “The half-lives of serum immuno-globulins in adult mice,” European Journal of Immunology,vol. 18, no. 2, pp. 313–316, 1988.[132] A. Karnowski, G. Achatz-Straussberger, C. Klockenbusch, G.Achatz, and M. C. Lamers, “Ineﬃcient processing of mRNAfor the membrane form of IgE is a genetic mechanism tolimit recruitment of IgE-secreting cells,” European Journal ofImmunology, vol. 36, no. 7, pp. 1917–1925, 2006.[133] P. Yu, M. Kosco-Vilbois, M. Richards, G. Kohler, and M. C.Lamers, “Negative feedback regulation of IgE synthesis bymurine CD23,”Nature, vol. 369, no. 6483, pp. 753–756, 1994.[134] C. Plater-Zyberk and J. Y. Bonnefoy, “Marked ameliorationof established collagen-induced arthritis by treatment withantibodies to CD23 in vivo,” Nature Medicine, vol. 1, no. 8,pp. 781–785, 1995.[135] J. C. Byrd, T. J. Kipps, I. W. Flinn et al., “Phase 1/2 study oflumiliximab combined with fludarabine, cyclophosphamide,and rituximab in patients with relapsed or refractory chroniclymphocytic leukemia,” Blood, vol. 115, no. 3, pp. 489–495,2010.[136] N. Aberle, A. Gagro, S. Rabatic´, Z. Reiner-Banovac, and D.Dekaris, “Expression of CD23 antigen and its ligands inchildren with intrinsic and extrinsic asthma,” Allergy, vol. 52,no. 12, pp. 1238–1242, 1997.[137] J. P. Aubry, S. Pochon, P. Graber, K. U. Jansen, and J. Y.Bonnefoy, “CD21 is a ligand for CD23 and regulates IgEproduction,” Nature, vol. 358, no. 6386, pp. 505–507, 1992.[138] J. J. Weis, T. F. Tedder, and D. T. Fearon, “Identificationof a 145,000 M(r) membrane protein as the C3d receptor(CR2) of human B lymphocytes,” Proceedings of the NationalAcademy of Sciences of the United States of America, vol. 81,no. 3, pp. 881–885, 1984.[139] N. McCloskey, J. Hunt, R. L. Beavil et al., “Soluble CD23monomers inhibit and oligomers stimulate IGE synthesis inhuman B cells,” Journal of Biological Chemistry, vol. 282, no.33, pp. 24083–24091, 2007.[140] F. X. Desvaux, G. Peltre, and B. David, “Characterization ofgrass pollen-specific IgE, IgA, IgM classes and IgG subclasses14 Journal of Parasitology Researchin allergic patients,” International Archives of Allergy andApplied Immunology, vol. 89, no. 2-3, pp. 281–287, 1989.[141] R. C. Aalberse, S. O. Stapel, J. Schuurman, and T. Rispens,“Immunoglobulin G4: an odd antibody,” Clinical and Exper-imental Allergy, vol. 39, no. 4, pp. 469–477, 2009.[142] R. C. Aalberse, F. Van Milligen, K. Y. Tan, and S. O. Stapel,“Allergen-specific IgG4 in atopic disease,” Allergy, vol. 48, no.8, pp. 559–569, 1993.[143] R. Hussain, R. W. Poindexter, and E. A. Ottesen, “Control ofallergic reactivity in human filariasis: predominant localiza-tion of blocking antibody to the IgG4 subclass,” Journal ofImmunology, vol. 148, no. 9, pp. 2731–2737, 1992.[144] P. Rihet, C. E. Demeure, A. J. Dessein, and A. Bourgois,“Strong serum inhibition of specific IgE correlated to com-peting IgG4, revealed by a newmethodology in subjects froma S.mansoni endemic area,” European Journal of Immunology,vol. 22, no. 8, pp. 2063–2070, 1992.[145] F. Mutapi, C. Bourke, Y. Harcus et al., “Diﬀerential recog-nition patterns of Schistosoma haematobium adult wormantigens by the human antibodies IgA, IgE, IgG1 and IgG4,”Parasite Immunology, vol. 33, no. 3, pp. 181–192, 2011.[146] R. C. Aalberse and J. Schuurman, “IgG4 breaking the rules,”Immunology, vol. 105, no. 1, pp. 9–19, 2002.[147] M. V. D. N. Kolfschoten, J. Schuurman,M. Losen et al., “Anti-inflammatory activity of human IgG4 antibodies by dynamicFab arm exchange,” Science, vol. 317, no. 5844, pp. 1554–1557, 2007.[148] J. S. van der Zee, P. Van Swieten, and R. C. Aalberse,“Inhibition of complement activation by IgG4 antibodies,”Clinical and Experimental Immunology, vol. 64, no. 2, pp.415–422, 1986.[149] R. M. Maizels, E. Sartono, A. Kurniawan, F. Partono, M.E. Selkirk, and M. Yazdanbakhsh, “T-cell activation and thebalance of antibody isotypes in human lymphatic filariasis,”Parasitology Today, vol. 11, no. 2, pp. 50–56, 1995.[150] T. Adjobimey and A. Hoerauf, “Induction of immunoglob-ulin G4 in human filariasis: an indicator of immunoregula-tion,” Annals of Tropical Medicine and Parasitology, vol. 104,no. 6, pp. 455–464, 2010.[151] J. Punnonen, G. Aversa, B. G. Cocks et al., “Interleukin 13induces interleukin 4-independent IgG4 and IgE synthesisand CD23 expression by human B cells,” Proceedings of theNational Academy of Sciences of the United States of America,vol. 90, no. 8, pp. 3730–3734, 1993.[152] T. R. Mosmann, H. Cherwinski, and M. W. Bond, “Twotypes of murine helper T cell clone. I. Definition accordingto profiles of lymphokine activities and secreted proteins,”Journal of Immunology, vol. 136, no. 7, pp. 2348–2357, 1986.[153] J. H. Lee, H. H. Yu, L. C. Wang, Y. H. Yang, Y. T. Lin, andB. L. Chiang, “The levels of CD4+CD25+ regulatory T cellsin paediatric patients with allergic rhinitis and bronchialasthma,” Clinical and Experimental Immunology, vol. 148, no.1, pp. 53–63, 2007.[154] S. Dimeloe, A. Nanzer, K. Ryanna, and C. Hawrylowicz,“Regulatory T cells, inflammation and the allergic response-the role of glucocorticoids and Vitamin D,” Journal of SteroidBiochemistry and Molecular Biology, vol. 120, no. 2-3, pp. 86–95, 2010.[155] M. Akdis, “Immune tolerance in allergy,” Current Opinion inImmunology, vol. 21, no. 6, pp. 700–707, 2009.[156] A. Taylor, J. Verhagen, C. A. Akdis, and M. Akdis, “Tregulatory cells in allergy and health: a question of allergenspecificity and balance,” International Archives of Allergy andImmunology, vol. 135, no. 1, pp. 73–82, 2004.[157] R. M. McLoughlin, A. Calatroni, C. M. Visness et al.,“Longitudinal relationship of early life immunomodulatoryT cell phenotype and function to development of allergicsensitization in an urban cohort,” Clinical and ExperimentalAllergy, vol. 42, no. 3, pp. 392–404, 2011.[158] L. Cosmi, F. Liotta, E. Maggi, S. Romagnani, and F. Annunzi-ato, “Th17 cells: new players in asthma pathogenesis,”Allergy,vol. 66, no. 8, pp. 989–998, 2011.[159] L. Cosmi, L. Maggi, V. Santarlasci et al., “Identification ofa novel subset of human circulating memory CD4+ T cellsthat produce both IL-17A and IL-4,” Journal of Allergy andClinical Immunology, vol. 125, no. 1, pp. 222.e4–230.e4, 2010.[160] P. Jeannin, S. Lecoanet, Y. Delneste, J. F. Gauchat, and J. Y.Bonnefoy, “IgE versus IgG4 production can be diﬀerentiallyregulated by IL-10,” Journal of Immunology, vol. 160, no. 7,pp. 3555–3561, 1998.[161] E. M. Savilahti, V. Rantanen, J. S. Lin et al., “Early recoveryfrom cow’s milk allergy is associated with decreasing IgE andincreasing IgG4 binding to cow’s milk epitopes,” Journal ofAllergy and Clinical Immunology, vol. 125, no. 6, pp. 1315.e9–1321.e9, 2010.[162] M. E. Devey, D. V. Wilson, and A. W. Wheeler, “The IgGsubclasses of antibodies of grass pollen allergens produced inhay fever patients during hyposensitization,” Clinical Allergy,vol. 6, no. 3, pp. 227–236, 1976.[163] R. J. Bullock, D. Barnett, and M. E. H. Howden, “Immuno-logic and clinical responses to parenteral immunother-apy in peanut anaphylaxis—a study using IgE and IgG4immunoblot monitoring,” Allergologia et Immunopathologia,vol. 33, no. 5, pp. 250–256, 2005.[164] M. T. Gallego, V. Iraola, M. Himly et al., “Depigmentedand polymerised house dust mite allergoid: allergen content,induction of IgG4 and clinical response,” InternationalArchives of Allergy and Immunology, vol. 153, no. 1, pp. 61–69, 2010.[165] A. Hoerauf, J. Satoguina, M. Saeftel, and S. Specht, “Immun-omodulation by filarial nematodes,” Parasite Immunology,vol. 27, no. 10-11, pp. 417–429, 2005.[166] A. Kurniawan, M. Yazdanbakhsh, R. Van Ree et al., “Diﬀer-ential expression of IgE and IgG4 specific antibody responsesin asymptomatic and chronic human filariasis,” Journal ofImmunology, vol. 150, no. 9, pp. 3941–3950, 1993.[167] Y. Kaneko, F. Nimmerjahn, and J. V. Ravetch, “Anti-inflammatory activity of immunoglobulin G resulting fromFc sialylation,” Science, vol. 313, no. 5787, pp. 670–673, 2006.[168] D. N. Mekhaiel, C. T. Daniel-Ribeiro, P. J. Cooper, andR. J. Pleass, “Do regulatory antibodies oﬀer an alternativemechanism to explain the hygiene hypothesis?” Trends inParasitology, vol. 27, no. 12, pp. 523–529, 2011.[169] T. H. T. Nguyen and T. B. Casale, “Immune modulation fortreatment of allergic disease,” Immunological Reviews, vol.242, no. 1, pp. 258–271, 2011.[170] A. B. Kay, “T lymphocytes and their products in atopic allergyand asthma,” International Archives of Allergy and AppliedImmunology, vol. 94, no. 1–4, pp. 189–193, 1991.[171] M. Jutel and C. A. Akdis, “T-cell subset regulation in atopy,”Current Allergy and Asthma Reports, vol. 11, no. 2, pp. 139–145, 2011.[172] W. E. Paul and J. Zhu, “How are T(H)2-type immuneresponses initiated and amplified?”Nature Reviews Immunol-ogy, vol. 10, no. 4, pp. 225–235, 2010.[173] C.M. Lloyd and E.M.Hessel, “Functions of T cells in asthma:more than just TH2 cells,” Nature Reviews Immunology, vol.10, no. 12, pp. 838–848, 2010.Journal of Parasitology Research 15[174] L. E. Harrington, R. D. Hatton, P. R. Mangan et al., “Inter-leukin 17-producing CD4+ eﬀector T cells develop via alineage distinct from the T helper type 1 and 2 lineages,”Nature Immunology, vol. 6, no. 11, pp. 1123–1132, 2005.[175] W. Al-Ramli, D. Pre´fontaine, F. Chouiali et al., “TH17-associated cytokines (IL-17A and IL-17F) in severe asthma,”Journal of Allergy and Clinical Immunology, vol. 123, no. 5,pp. 1185–1187, 2009.[176] M. Veldhoen, C. Uyttenhove, J. van Snick et al., “Trans-forming growth factor-β “reprograms” the diﬀerentiation ofT helper 2 cells and promotes an interleukin 9-producingsubset,” Nature Immunology, vol. 9, no. 12, pp. 1341–1346,2008.[177] R. Pawankar, S. Mori, C. Ozu, and S. Kimura, “Overview onthe pathomechanisms of allergic rhinitis,”Asia Pacific Allergy,vol. 1, no. 3, pp. 157–167, 2011.[178] A. E. Butterworth, R. F. Sturrock, V. Houba, and P. H. Rees,“Antibody dependent cell mediated damage to schistosomulain vitro,” Nature, vol. 252, no. 5483, pp. 503–505, 1974.[179] P. Hagan, P. J. Moore, and A. B. Adjukiewicz, “In-vitroantibody-dependent killing of schistosomula of Schistosomahaematobium by human eosinophils,” Parasite Immunology,vol. 7, no. 6, pp. 617–624, 1985.[180] A. Capron, J. P. Dessaint, M. Capron, and H. Bazin, “SpecificIgE antibodies in immune adherence of normal macrophagesto Schistosomamansoni schistosomules,”Nature, vol. 253, no.5491, pp. 474–475, 1975.[181] A. Capron and J. P. Dessaint, “IgE: a molecule in search ofa function,” Annales d’Immunologie, vol. 132, no. 1, pp. 3–8,1981.[182] C. Verwaerde, J. M. Grzych, H. Bazin, M. Capron, andA. Capron, “Production of monoclonal anti-Schistosomamansoni antibodies. Preliminary study of their biologicalactivities,” Comptes Rendus des Seances de l”Academie desSciences D, vol. 289, no. 10, pp. 725–727, 1979.[183] P. Rihet, C. E. Demeure, A. Bourgois, A. Prata, and A.J. Dessein, “Evidence for an association between humanresistance to Schistosoma mansoni and high anti larval IgElevels,” European Journal of Immunology, vol. 21, no. 11, pp.2679–2686, 1991.[184] D. W. Dunne, A. E. Butterworth, A. J. C. Fulford et al.,“Immunity after treatment of human schistosomiasis: asso-ciation between IgE antibodies to adult worm antigens andresistance to reinfection,” European Journal of Immunology,vol. 22, no. 6, pp. 1483–1494, 1992.[185] I. R. Caldas, R. Correa-Oliveira, E. Colosimo et al., “Sus-ceptibility and resistance to Schistosoma mansoni reinfection:parallel cellular and isotypic immunologic assessment,”American Journal of Tropical Medicine and Hygiene, vol. 62,no. 1, pp. 57–64, 2000.[186] Z. Zhang, H. Wu, S. Chen et al., “Association betweenIgE antibody against soluble egg antigen and resistance toreinfection with Schistosoma japonicum,” Transactions of theRoyal Society of Tropical Medicine and Hygiene, vol. 91, no. 5,pp. 606–608, 1997.[187] M. Jiz, J. F. Friedman, T. Leenstra et al., “Immunoglobulin E(IgE) responses to paramyosin predict resistance to reinfec-tion with Schistosoma japonicum and are attenuated by IgG4,”Infection and Immunity, vol. 77, no. 5, pp. 2051–2058, 2009.[188] C. W. A. Naus, C. J. Van Dam, P. G. Kremsner, F. W.Krijger, and A. M. Decider, “Human IgE, IgG subclass, andIgM responses to worm and egg antigens in Schistosomiasishaematobium: a 12-month study of reinfection in Cameroo-nian children,” Clinical Infectious Diseases, vol. 26, no. 5, pp.1142–1147, 1998.[189] A. P. deMoira, A. J. C. Fulford, N. B. Kabatereine, J. H. Ouma,M. Booth, and D. W. Dunne, “Analysis of complex patternsof human exposure and immunity to Schistosomiasis mansonithe influence of age, sex, ethnicity and IgE,” PLoS NeglectedTropical Diseases, vol. 4, no. 9, article e820, 2010.[190] M. Z. Satti, P. Lind, B. J. Vennervald, S. M. Sulaiman, A. A.Daﬀalla, and H. W. Ghalib, “Specific immunoglobulin mea-surements related to exposure and resistance to Schistosomamansoni infection in Sudanese canal cleaners,” Clinical andExperimental Immunology, vol. 106, no. 1, pp. 45–54, 1996.[191] F. Mutapi, T. Mduluza, N. Gomez-Escobar et al., “Immuno-epidemiology of human Schistosoma haematobium infection:preferential lgG3 antibody responsiveness to a recombinantantigen dependent on age and parasite burden,” BMCInfectious Diseases, vol. 6, article 96, 2006.[192] F. Mutapi, P. D. Ndhlovu, P. Hagan et al., “Chemotherapyaccelerates the development of acquired immune responsesto Schistosoma haematobium infection,” Journal of InfectiousDiseases, vol. 178, no. 1, pp. 289–293, 1998.[193] J. M. Grzych, D. Grezel, Chuan Bo Xu et al., “IgA antibodiesto a protective antigen in human Schistosomiasis mansoni,”Journal of Immunology, vol. 150, no. 2, pp. 527–535, 1993.[194] P. N. M. Mwinzi, L. Ganley-Leal, C. L. Black, W. E. Secor,D. M. S. Karanja, and D. G. Colley, “Circulating CD23+ Bcell subset correlates with the development of resistance toSchistosoma mansoni reinfection in occupationally exposedadults who have undergone multiple treatments,” Journal ofInfectious Diseases, vol. 199, no. 2, pp. 272–279, 2009.[195] S. R. Smithers and R. J. Terry, “Resistance to experimentalinfection with Schistosoma mansoni in rhesus monkeysinduced by the transfer of adult worms,” Transactions of theRoyal Society of Tropical Medicine and Hygiene, vol. 61, no. 4,pp. 517–533, 1967.[196] C. J. Sanderson, A. O’Garra, D. J. Warren, and G. G. B. Klaus,“Eosinophil diﬀerentiation factor also has B-cell growthfactor activity: proposed name interleukin 4,” Proceedingsof the National Academy of Sciences of the United States ofAmerica, vol. 83, no. 2, pp. 437–440, 1986.[197] C. J. Sanderson, D. J. Warren, and M. Strath, “Identificationof a lymphokine that stimulates eosinophil diﬀerentiationin vitro. Its relationship to interleukin 3, and functionalproperties of eosinophils produced in cultures,” Journal ofExperimental Medicine, vol. 162, no. 1, pp. 60–74, 1985.[198] M. Veith, D. W. Taylor, and K. Thorne, “Studies on theenhancement of human eosinophil function bymononuclearcell products in vitro,” Clinical and Experimental Immunol-ogy, vol. 58, no. 3, pp. 603–610, 1984.[199] P. Couissinier-Paris and A. J. Dessein, “Schistosoma-specifichelper T cell clones from subjects resistant to infectionby Schistosoma mansoni are Th0/2,” European Journal ofImmunology, vol. 25, no. 8, pp. 2295–2302, 1995.[200] M. Roberts, A. E. Butterworth, G. Kimani et al., “Immu-nity after treatment of human schistosomiasis: associationbetween cellular responses and resistance to reinfection,”Infection and Immunity, vol. 61, no. 12, pp. 4984–4993, 1993.[201] T. Mduluza, P. D. Ndhlovu, N. Midzi et al., “Contrastingcellular responses in Schistosoma haematobium infected andexposed individuals from areas of high and low transmissionin Zimbabwe,” Immunology Letters, vol. 88, no. 3, pp. 249–256, 2003.16 Journal of Parasitology Research[202] I. R. Viana, A. Sher, O. S. Carvalho et al., “Interferon-gammaproduction by peripheral blood mononuclear cells fromresidents of an area endemic for Schistosomamansoni,”Trans-actions of the Royal Society of Tropical Medicine and Hygiene,vol. 88, no. 4, pp. 466–470, 1994.[203] I. R. Caldas, A. C. Campi-Azevedo, L. F. A. Oliveira, A.M. S. Silveira, R. C. Oliveira, and G. Gazzinelli, “HumanSchistosomiasis mansoni: immune responses during acute andchronic phases of the infection,” Acta Tropica, vol. 108, no. 2-3, pp. 109–117, 2008.[204] C. N. L. De Morais, J. R. De Souza, W. G. Melo et al.,“Cytokine profile associated with chronic and acute humanSchistosomiasis mansoni,” Memorias do Instituto OswaldoCruz, vol. 103, no. 6, pp. 561–568, 2008.[205] G. Gazzinelli, J. R. Lambertucci, and N. Katz, “Immuneresponses during human Schistosomiasis mansoni. XI.Immunologic status of patients with acute infections andafter treatment,” Journal of Immunology, vol. 135, no. 3, pp.2121–2127, 1985.[206] A. D. Bastos and I. L. Brito, “Acute pulmonary schisto-somiasis: HRCT findings and clinical presentation,” JornalBrasileiro de Pneumologia, vol. 37, no. 6, pp. 823–825, 2011.[207] J. Clerinx, E. Bottieau, D. Wichmann, E. Tannich, and M.Van Esbroeck, “Acute schistosomiasis in a cluster of travelersfrom Rwanda: diagnostic contribution of schistosome DNAdetection in serum compared to parasitology and serology,”Journal of Travel Medicine, vol. 18, no. 6, pp. 367–372, 2011.[208] A. W. Cheever, K. F. Hoﬀmann, and T. A. Wynn, “Immuno-pathology of Schistosomiasis mansoni in mice and men,”Immunology Today, vol. 21, no. 9, pp. 465–466, 2000.[209] S. Ikemoto, T. Kishimoto, S. Wada, S. Nishio, and M.Maekawa, “Clinical studies on cell-mediated immunityin patients with urinary bladder carcinoma: blastogenicresponse, interleukin-2 production and interferon-γ produc-tion of lymphocytes,” British Journal of Urology, vol. 65, no.4, pp. 333–338, 1990.[210] M. S. Wilson, M. M. Mentink-Kane, J. T. Pesce, T. R. Rama-lingam, R. Thompson, and T. A. Wynn, “Immunopathologyof schistosomiasis,” Immunology and Cell Biology, vol. 85, no.2, pp. 148–154, 2007.[211] M. Bazaral, H. A. Orgel, and R. N. Hamburger, “Theinfluence of serum IgE levels of selected recipients, includingpatients with allergy, helminthiasis and tuberculosis, onthe apparent P-K titre of a reaginic serum,” Clinical andExperimental Immunology, vol. 14, no. 1, pp. 117–125, 1973.[212] I. Hagel, N. R. Lynch, M. Perez, M. C. Di Prisco, R. Lopez,and E. Rojas, “Modulation of the allergic reactivity of slumchildren by helminthic infection,” Parasite Immunology, vol.15, no. 6, pp. 311–315, 1993.[213] R. C. Godfrey and C. F. Gradidge, “Allergic sensitisationof human lung fragments prevented by saturation of IgEbinding sites,” Nature, vol. 259, no. 5543, pp. 484–486, 1976.[214] E. Mitre, S. Norwood, and T. B. Nutman, “Saturation ofimmunoglobulin E (IgE) binding sites by polyclonal IgEdoes not explain the protective eﬀect of helminth infectionsagainst atopy,” Infection and Immunity, vol. 73, no. 7, pp.4106–4111, 2005.[215] D. I. Pritchard, D. S. W. Hooi, A. Brown, M. J. Bockarie, R.Caddick, and R. J. Quinnell, “Basophil competence duringhookworm (Necator americanus) infection,” American Jour-nal of Tropical Medicine and Hygiene, vol. 77, no. 5, pp. 860–865, 2007.[216] S. J. Galli, “Mast cells and basophils,” Current Opinion inHematology, vol. 7, no. 1, pp. 32–39, 2000.[217] M. Yazdanbakhsh, P. G. Kremsner, and R. Van Ree,“Immunology: allergy, parasites, and the hygiene hypothe-sis,” Science, vol. 296, no. 5567, pp. 490–494, 2002.[218] H. C. Santiago, S. Bennuru, A. Boyd, M. Eberhard, and T.B. Nutman, “Structural and immunologic cross-reactivityamong filarial and mite tropomyosin: implications for thehygiene hypothesis,” Journal of Allergy and Clinical Immunol-ogy, vol. 127, no. 2, pp. 479–486, 2011.[219] L. Caraballo and N. Acevedo, “Allergy in the tropics: theimpact of cross-reactivity between mites and ascaris,” Fron-tiers in Bioscience, vol. 3, pp. 51–64, 2011.[220] N. R. Lynch, I. Hagel, M. Vargas et al., “Eﬀect of age andhelminthic infection on IgE levels in slum children,” Journalof Investigational Allergology & Clinical Immunology, vol. 3,no. 2, pp. 96–99, 1993.[221] N. R. Lynch, M. Palenque, I. Hagel, and M. C. Diprisco,“Clinical improvement of asthma after anthelminthic treat-ment in a tropical situation,” American Journal of Respiratoryand Critical Care Medicine, vol. 156, no. 1, pp. 50–54, 1997.[222] A. M. J. van den Biggelaar, L. C. Rodrigues, R. Van Ree etal., “Long-term treatment of intestinal helminths increasesmite skin-test reactivity in Gabonese schoolchildren,” Journalof Infectious Diseases, vol. 189, no. 5, pp. 892–900, 2004.[223] N. Rujeni, N. Nausch, C. D. Bourke et al., “Atopy is inverselyrelated to Schistosome infection intensity: a comparativestudy in zimbabwean villages with distinct levels of Schis-tosoma haematobium infection,” International Archives ofAllergy and Applied Immunology, vol. 158, no. 3, pp. 288–298,2012.[224] C. J. Oliphant, J. L. Barlow, and A. N. McKenzie, “Insightsinto the initiation of type 2 immune responses,” Immunology,vol. 134, no. 4, pp. 378–385, 2011.[225] R. M. Maizels, “Parasite immunomodulation and polymor-phisms of the immune system,” Journal of Biology, vol. 8, no.7, article 62, 2009.[226] H. Kita and G. J. Gleich, “Eosinophils and IgE receptors: acontinuing controversy,” Blood, vol. 89, no. 10, pp. 3497–3501, 1997.[227] M. I. A. S. Araujo, B. Hoppe, M. Medeiros et al., “ImpairedT helper 2 response to aeroallergen in helminth-infectedpatiente with asthma,” Journal of Infectious Diseases, vol. 190,no. 10, pp. 1797–1803, 2004.[228] R. R. Oliveira, K. J. Gollob, J. P. Figueiredo et al., “Schistosomamansoni infection alters co-stimulatory molecule expressionand cell activation in asthma,”Microbes and Infection, vol. 11,no. 2, pp. 223–229, 2009.[229] R. M. Maizels and M. Yazdanbakhsh, “T-cell regulation inhelminth parasite infections: implications for inflammatorydiseases,” Chemical Immunology and Allergy, vol. 94, pp. 112–123, 2008.[230] I. Hagel, M. Cabrera, P. Sa´nchez, P. Rodrı´guez, and J. J.Lattouf, “Role of the low aﬃnity IgE receptor (CD23) onthe IgE response against Ascaris lumbricoides in WaraoAmerindian children from Venezuela,” Investigacion Clinica,vol. 47, no. 3, pp. 241–251, 2006.[231] M. S. Wilson, M. D. Taylor, A. Balic, C. A. M. Finney,J. R. Lamb, and R. M. Maizels, “Suppression of allergicairway inflammation by helminth-induced regulatory Tcells,” Journal of Experimental Medicine, vol. 202, no. 9, pp.1199–1212, 2005.[232] Y. Osada and T. Kanazawa, “Parasitic helminths: newweapons against immunological disorders,” Journal ofBiomedicine & Biotechnology, vol. 2010, Article ID 743758,p. 9, 2010.Journal of Parasitology Research 17[233] N. Nausch, N. Midzi, T. Mduluza, R. M. Maizels, andF. Mutapi, “Regulatory and activated T cells in humanSchistosoma haematobium infections,” PLoS ONE, vol. 6, no.2, Article ID e16860, 2011.[234] W. Harnett and M. M. Harnett, “Helminth-derived immun-omodulators: can understanding the worm produce the pill?”Nature Reviews Immunology, vol. 10, no. 4, pp. 278–284,2010.[235] A. J. Melendez, M. M. Harnett, P. N. Pushparaj et al.,“Inhibition of Fc epsilon RI-mediated mast cell responsesby ES-62, a product of parasitic filarial nematodes,” NatureMedicine, vol. 13, pp. 1375–1381, 2007.[236] I. B. McInnes, B. P. Leung, M. Harnett, J. A. Gracie, F.Y. Liew, and W. Harnett, “A novel therapeutic approachtargeting articular inflammation using the filarial nematode-derived phosphorylcholine-containing glycoprotein ES-62,”The Journal of Immunology, vol. 171, no. 4, pp. 2127–2133,2003.[237] M. M. Harnett, A. J. Melendez, and W. Harnett, “The thera-peutic potential of the filarial nematode-derived immunodu-lator, ES-62 in inflammatory disease,” Clinical & Experimen-tal Immunology, vol. 159, no. 3, pp. 256–267, 2010.[238] W. Harnett, M. M. Harnett, B. P. Leung, J. A. Gracie,and I. B. McInnes, “The anti-inflammatory potential of thefilarial nematode secreted product, ES-62,” Current topics inMedicinal Chemistry, vol. 4, pp. 553–559, 2004.[239] W. Harnett and M. M. Harnett, “Filarial nematode secretedproduct ES-62 is an anti-inflammatory agent: therapeuticpotential of small molecule derivatives and ES-62 peptidemimetics,” Clinical and Experimental Pharmacology & Physi-ology, vol. 33, no. 5-6, pp. 511–518, 2006.[240] M. M. Harnett, D. E. Kean, A. Boitelle et al., “The phospho-rycholine moiety of the filarial nematode immunomodulatorES-62 is responsible for its anti-inflammatory action inarthritis,” Annals of the Rheumatic Diseases, vol. 67, no. 4, pp.518–523, 2008.[241] G. Schramm, F. H. Falcone, A. Gronow et al., “Molecularcharacterization of an interleukin-4-inducing factor fromSchistosoma mansoni eggs,” The Journal of Biological Chem-istry, vol. 278, no. 20, pp. 18384–818392, 2003.[242] M.-H. Abdulla, K.-C. Lim, J. H. McKerrow, and C. R.Caﬀrey, “Proteomic identification of IPSE/alpha-1 as a majorhepatotoxin secreted by Schistosoma mansoni eggs,” PLoSNeglected Tropical Diseases, vol. 5, no. 10, article e1368, 2011.[243] G. Schramm, K. Mohrs, M. Wodrich et al., “Cutting edge:IPSE/alpha-1, a glycoprotein from Schistosoma mansonieggs, induces IgE-dependent, antigen-independent IL-4 pro-duction by murine basophils in vivo,” The Journal ofImmunology, vol. 178, no. 10, pp. 6023–6027, 2007.[244] J. P. Hewitson, K. J. Filbey, J. R. Grainger et al., “Helig-mosomoides polygyrus elicits a dominant nonprotectiveantibody response directed against restricted glycan andpeptide epitopes,” The Journal of Immunology, vol. 187, no.9, pp. 4764–4777, 2011.[245] J. Chen, X. Hu, S. He et al., “Expression and immuneresponse analysis of Schistosoma japonicum VAL-1, a homo-logue of vespid venom allergens,” Parasitology Research, vol.106, no. 6, pp. 1413–1418, 2010.[246] N. W. Palm, R. K. Rosenstein, and R. Medzhitov, “Allergichost defences,” Nature, vol. 484, no. 7395, pp. 465–472, 2012.[247] D. Artis, R. M. Maizels, and F. D. Finkelman, “Forum:immunology: allergy challenged,” Nature, vol. 484, no. 7395,pp. 458–459, 2012.[248] P. W. Sherman, E. Holland, and J. S. Sherman, “Allergies:their role in cancer prevention,” Quarterly Review of Biology,vol. 83, no. 4, pp. 339–362, 2008.[249] B. E. Zacharia and P. Sherman, “Atopy, helminths, andcancer,” Medical Hypotheses, vol. 60, no. 1, pp. 1–5, 2003.[250] E. Sibanda, D. Gallerano, E. Wollmann, and R. Valenta,“EFIS-EJI African International Conference on Immunity(AICI),” European Journal of Immunology, vol. 42, no. 5, pp.1070–1071, 2012.Submit your manuscripts athttp://www.hindawi.comHindawi Publishing Corporation http://www.hindawi.com Volume 2013The Scientific World JournalHindawi Publishing Corporationhttp://www.hindawi.comNucleic AcidsJournal ofVolume 2013ArchaeaHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013ISRN BiotechnologyHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Hindawi Publishing Corporationhttp://www.hindawi.comGenomicsInternational Journal ofVolume 2013Evolutionary BiologyInternational Journal ofHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Hindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Advances inVirolog yISRN MicrobiologyHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Marine BiologyJournal ofHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013BioMed Research InternationalHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013ISRN ZoologyHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Hindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Signal TransductionJournal ofISRN Cell BiologyHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Hindawi Publishing Corporationhttp://www.hindawi.com Volume 2013BioinformaticsAdvances inPeptidesInternational Journal ofHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Hindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Enzyme ResearchHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Biochemistry Research InternationalISRN Molecular BiologyHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013Stem CellsInternationalHindawi Publishing Corporationhttp://www.hindawi.com Volume 2013",
    "Link": "https://core.ac.uk/download/28974396.pdf"
}