{
    "Title": "The SmartAG partner: CCAFS East Africa Bi-Annual Newsletter, July - December 2019",
    "Authors": "CGIAR Research Program on Climate Change, Agriculture and Food Security",
    "Year": "No year available",
    "Abstract": "We are pleased to share with you our SmartAg Partner bi-annual newsletter, highlighting policy engagement, ongoing research, field updates and activities with partners from the second half of 2019",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "The SmartAG Partner \nCCAFS East Africa Bi-annual Newsletter July - December 2019\n© 2020 CGIAR Research Program on Climate Change, Agriculture and Food Security (CCAFS), East Africa\nEditing: Seble Samuel, Catherine Mungai and Maren Radeny\nDesign and Layout: Solomon Makau \nPhoto Credits: Cover page S.Maylon (CIAT) Page 22. S.Samuel (CCAFS), C. Njuguna (IITA), A. Eitzinger (CIAT)  Back page: G.Smith (CIAT)\nContents \n1\n2\nScience News \nPolicy News \n3\n4\nOut & About\nIn our diary\nCCAFS EA in the media\nFurther reading and CCAFS tools \nCCAFS East Africa Bi-annual Newsletter      i\n6\n5\nEast African policy makers advocate for \ngender in climate policy\nMary Nyasimi, Dana Elhassan and Faith \nGikunda\nRaising farmers’ awareness on climate risks \nand adaptation with radio broadcasts\nYvonne Munyangeri and Seble Samuel\nTanzania’s female parliamentarians to \nmainstream gender in climate adaptation\nShakwaanande Natai, Madaka Tumbo, \nWinifred Masiko and Henry Mahoo\n Engagement\nIs climate-smart agriculture the silver bullet \nto attract youth to agriculture?\nVictor Mugo, Hannah Kamau and \nSeble Samuel\nLaunching digital agro-climate advisory \nplatform in Ethiopia \nSeble Samuel\n7\n8\n9\nDe-risking agricultural value chains using \nclimate-smart agriculture \nHannah Kamau, Victor Mugo, Christine \nLamanna, Catherine Mungai and         \nSeble Samuel\nGuiding investments in climate-smart \nlivestock systems in East Africa \nLili Szilagyi and Laura Cramer\nNyando Climate-Smart Village launches \ncommunity seedbank \nSeble Samuel and Gloria Otieno\nEnhancing capacity for resilient agriculture \nplanning and programming in Kenya\nHannah Kamau, Ivy Kinyua and \nVictor Mugo\nField Updates \n\nCCAFS East Africa Bi-annual Newsletter      iii\nMessage From\nThe Program Leader\nWe are pleased to share with you our SmartAg Partner newsletter, highlighting policy \nengagement and ongoing research from the second half of 2019.\nOur researchers hit the field to Lushoto’s Climate-Smart Village (CSV) in Tanzania to build \ncapacity for food systems resilience; to Farmer Field School Trainings and climate-smart \nagriculture (CSA) scaling workshops in Uganda as part of the Climate Resilient Agribusiness for \nTomorrow (CRAFT) project; and with PhD students to Doyogena’s climate-smart landscape in \nSouthern Ethiopia to kick off their studies; just to highlight a few!\nAs part of the CRAFT project, we conducted climate risk assessment workshops for key value chains in Kenya, Uganda and \nTanzania. Our team co-developed projections of extreme events across six value chains - potato and green gram in Kenya, \nsoybean and sesame in Uganda, sunflower and common bean in Tanzania.\nTo build the advocacy capacity of Africa’s young people, we facilitated the webinar: Communications for Agri-Climate Justice for \nthe Climate-Smart Agriculture Youth Network (CSAYN). In the lead up to the UN Youth Climate Summit, Global Climate Strike and \nUN Climate Action Summit, we co-hosted the online discussion and webinar Championing Climate Action: How the youth can \nstep up the fight against climate change in partnership with GSI, CSAYN and the Climate & Agriculture Network for Africa (CANA).\nWe created awareness amongst Tanzanian parliamentarians on gender mainstreaming in climate adaptation, co-organizing a  \nworkshop with the CCAFS  Gender and Social Inclusion (GSI) flagship, the Tanzania Climate-Smart Agriculture Alliance (TCSAA) \nand other partners.\nWe celebrated the Nyando CSV Community Seedbank Launch in Western Kenya to conserve biological diversity and strengthen \nfood systems resilience alongside Bioversity International and regional partners.\nIn September we hosted the International Fund for Agricultural Development (IFAD) learning journey on transformative \napproaches to mainstream climate change, nutrition, gender and youth as well as a South-South learning exchange across \nSouthern Ethiopia for IFAD and the Southern African Confederation of Agricultural Unions (SACAU).\nWe continued to make our mark internationally, participating in the African Climate Risks Conference in Addis Ababa, Ethiopia, \nto accelerate climate adaptation across the continent; the C40 Global Mayors Summit in Copenhagen, Demark speaking at the \nplenary session The Future We Want is Resilient; and at the Global Science Conference on CSA: Transforming Food Systems \nUnder a Changing Climate in Bali, Indonesia.\nWe supported the launch of Ethiopia’s digital agro-climate advisory platform, known as EDACaP, a multidisciplinary setup to \nensure Ethiopia’s food systems and livelihoods are climate-resilient – potentially benefiting about 60,000 extension agents \nadvising more than 18 million smallholder famers.\nRead on for details from the second half of 2019 and please share this newsletter with your networks.\nDr. Dawit Solomon\n\n# 1\nBy Mary Nyasimi, Dana Elhassan and Faith Gikunda\nPolicy makers from nine East African countries pledge to lobby governments and \npolicy influencers to consider gender mainstreaming in national climate change \npolicies.\nEast African policy makers advocate \nfor gender in climate policy\nA workshop on gender mainstreaming in East African climate change policies took place between 16 and 17 May 2019 in Nairobi, Kenya. The workshop was organized by the African Development Bank Group \n(AfDB) through its Inclusive Climate Change Adaptation for \na Sustainable Africa (ICCASA) project and was funded by the \nKorea-African Economic Corporation (KOAFEC). \nAfDB is implementing several interventions in line with their \nTen-Year  Strategy, High 5 Priority Areas, Gender Strategy \nand Second Climate Change Action Plan, with a focus on \nincreasing inclusivity and ensuring sustainable development. \nDuring the two-day capacity building and strategy meeting, \npolicy makers from Ethiopia, Tanzania, Burundi, Comoros, \nKenya, Djibouti, Eritrea, Uganda and Sudan were represented.\nThe participants committed to work with their fellow policy \nmakers to do the following:\n1. Parliamentary engagement to raise awareness of gender \nmainstreaming in climate change actions and policies. \nWith this knowledge, parliamentarians can scrutinize \nclimate change-related legislation and assess government \nresponses to gender and climate change issues, supported by \nappropriate gender-responsive budget allocation.\n2. Capacity building for policy makers to develop skills, \nknowledge and tools to mainstream gender and empower \nwomen in climate change actions and policies. Capacity \nbuilding also enables policymakers to identify entry points for \ngender-responsive action and determine which actions are \nappropriate.\n3. Developing and implementing national gender action \nplans (GAP) to guide the creation of gender responsive \nclimate policies and actions, while acknowledging the critical \ncontributions of women to achieving climate resilience. The \nGAP will be designed to fit national contexts, priorities and \nwill align with existing climate change legislation. \nBurundi representative Prudence Bizimana noted that \ngender features prominently in the country’s policies. \nImplementation, however, will require continued work. \nMadam Fatma Toufiq, a Member of Parliament in Tanzania, \nalso noted the crucial need for African policymakers to meet \noften in order to share lessons learned and support each \nother in gender and climate change issues.\nGeorge Wamukoya of the African Working Group on Gender \nand Climate Change (AWGGCC), a key ICCASA project \npartner, cited a number of significant efforts to mainstream \ngender into national climate change action plans and \npolicies, Nationally Determined Contributions (NDCs), \nNational Adaptation Plans (NAPs), Reducing Emissions \nCCAFS East Africa Bi-annual Newsletter      1\nPolicy news\n  2\nMary Nyasimi is the Gender and Climate Change Advisor for the \nICCASA project. Dana Elhassan is Senior Gender Specialist for the \nAfrican Development Bank. Faith Gikunda is Communications \nSpecialist for the ICCASA project. \nfrom Deforestation and Degradation (REDD+), and National \nCommunications (NC). He further stated that, regardless of \nall this remarkable progress in aligning gender and climate \nchange, there are still enormous opportunities that need to \nbe maximized to ensure gender is mainstreamed.\nUgandan participant Anastasia Munsana observed gender \nmainstreaming in national policies by designing gender \nsensitive projects, such as addressing adoption barriers for \nimproved charcoal production technologies and sustainable \nland management.\nDespite the enormous efforts of various countries, a gender \nmainstreaming gap remains in national policies. Participants \nhighlighted the hope for Africa to achieve maximum \ngender mainstreaming in NDCs, NAPs, NAMAs and other \ncommitments to equitably combat the effects of climate \nchange.\nG\n.S\nm\nith\n (C\nIA\nT)\nSuitable policies can enable women to use agriculture to contribute to economic growth while addressing their food security \nneeds. \nThis policy event was the result of an organized partnership \nbetween the African Working Group on Gender and Climate \nChange (AWGGCC), the CGIAR Research Program on Climate \nChange, Agriculture and Food Security (CCAFS), and World \nUniversity Service of Canada (WUSC).\n# 2\nBy Shakwaanande Natai, Madaka Tumbo, Winifred \nMasiko and Henry Mahoo\nTanzania’s Women Parliamentarian Group came together to explore pathways for \nmainstreaming gender into climate adaptation planning.\nTanzania’s female parliamentarians to \nmainstream gender in climate adaptation\nClimate change has been described as a wicked problem, with complexities, feedback loops and tipping points that can cause damage in the most undeserving of places. Across Tanzania, the climate \ncrisis manifests in the form of higher temperatures, an \nincrease in the frequency and magnitude of droughts and \nfloods, and rising sea levels.\nWomen face disproportionate impacts of the climate \nemergency, due to unequal rights and socio-economic status \ncompared to men, meaning climate impacts will widen \nthe gender gap. The World Bank estimates the gender \nproductivity gap in Tanzania alone is $105 million. This gap \ncould be decreased if national policies, programs, and plans \nenable women to use agriculture to lift themselves and their \nfamilies out of poverty and contribute to economic growth, as \nwell as through targeted adaptation and mitigation measures \nthat are gender-responsive. The Bank of America predicts \nthat such approaches could have positive economic impacts, \nestimating that achieving women’s equality could boost \nglobal gross domestic product (GDP) by up to 31 percent.\nMainstreaming gender and climate\nIn light of these challenging dynamics, Members of \nParliament (MPs) came together in September 2019 for an \nawareness training on gender mainstreaming in climate \nchange adaptation in Tanzania, with the objective to:\n• Enhance the knowledge of MPs on gender to facilitate \nthe smooth implementation of the established gender-\nsensitive policies, plans and strategies at national and \nsub-national levels.\n• Provide an opportunity for MPs to understand the \ncritical role gender plays in implementing climate \nchange actions.\n• Strengthen the knowledge of MPs regarding methods \nand tools that can facilitate the implementation, \nmonitoring and evaluation of gender-responsive \npolicies, plans and strategies.\n• Provide a platform for MPs to kickstart the process of \nbrainstorming on the revision of Tanzania’s Gender and \nClimate Change Action Plan.\nCCAFS East Africa Bi-annual Newsletter      3\nPolicy news\nTanzania’s women parliamentarians meet on gender and \nclimate. \n C\n. N\nju\ngu\nna\n (I\nIT\nA\n)\n  4\nA farmer working the field in Lushoto, Tanzania, one of the \nareas that experience adverse soil degredation. \nThe climate stakes\nExtreme weather events have already led to major economic \ncosts in Tanzania, estimated at USD$200 million per year for \nthe agricultural sector alone (CIAT and World Bank (2017): \nClimate-Smart Agriculture in Tanzania), reducing long-term \ngrowth and affecting millions of people and their livelihoods. \nThe net economic costs of addressing climate change impacts \ncould be equivalent to one to two percent of the GDP per \nyear by 2030.\nIn the past two decades, the country has experienced rising \ntemperatures with frequent and severe droughts. Since \n1960, average annual temperatures increased by 1.0ºC with \nprojections to increase between 1.7°C and 2.5°C in semi-arid \nareas (SAs) by 2030. Mean temperature and rainfall changes \nincluding increased variability of rainfall will have devastating \neffects on agriculture, food security, and ecosystems.\nStrides forward in the climate-gender nexus\nWhile the Government of Tanzania has developed an \nextensive policy repertoire to address the complex challenges \nat the nexus of gender and climate, implementation is \nstill lagging, particularly with regards to gender-sensitive \nadaptation and mitigation strategies. The MPs gathered at the \ngender and climate mainstreaming training, therefore, agreed \nto enable the implementation process through the following \nagreements:\n1. Generate evidence to support engagement with MPs to \nincrease their understanding on climate change and its \nimpacts in Tanzania.\n2. Identify gender and climate change champions to \nadvocate for gender and climate change mainstreaming \ninto national and district development planning and \nbudgeting.\n3. Enhance the capacity of MPs to effectively participate in \nthe review process of the Gender and Climate Change \nAction Plan.\n4. Support some MPs to attend the upcoming \nCommonwealth Parliamentary Conference, held \nin Uganda on 22-29 September 2019,  to share the \noutcomes of this seminar.\n5. Strengthen engagement with MPs, relevant ministries, \ndepartments and agencies, District Executive Councils, \nCSOs and other actors at different levels in the design \nand implementation of climate change actions.\nOnce implemented, these actions could serve as important \nenablers moving gender-responsive climate policies from \ntheory to practice across Tanzania.\nShakwaanande Natai is National Coordinator at the Tanzania Climate \nSmart Agriculture Alliance (TCSAA). Madaka Tumbo is Hydrologist \nat the Global Water Partnership (GWP) and Lecturer at the Water \nInstitute (WI). Winifred Masiko is Member of the African Working \nGroup on Gender and Climate Change (AWGGCC) and Consultant \nat The Skills Gallery. Henry Mahoo is Chairperson at the TCSAA and \nProfessor at the Sokoine University of Agriculture (SUA).\nRead more:\nNews update: East African policy makers advocate for gender in \nclimate policy: https://bit.ly/2UanAMP\nNews update: African negotiators talk adaptation tracking, soil \nfertility and gender: https://bit.ly/2THZNVq\nResearch highlight: Why ‘gender mainstreaming’ isn’t sufficient for \nadvancing gender equality: https://bit.ly/38JkhBo\nBlog: Africa Environment Day: CCAFS highlights efforts to bridge \nthe agricultural gender gaps in Ethiopia, Mali, Rwanda and Senegal: \nhttps://bit.ly/2W46vXm\nNews update: Gendering climate-smart agriculture in Doyogena, \nEthiopia: https://bit.ly/2W04TOl\nG\n.S\nm\nith\n (C\nIA\nT)\nCCAFS East Africa Bi-annual Newsletter      5\n# 3\nBy Hannah Kamau, Victor Mugo, Christine Lamanna, \nCatherine Mungai and Seble Samuel\nAcross the value chain, farmers face risks from production to market. Experts meet in \nNairobi to identify opportunities to de-risk key agricultural commodities.\nDe-risking agricultural value chains \nusing climate-smart agriculture\nIn April 2019, professionals from the soft commodity sectors who represent diverse value chains across the African continent came together for the Sustainable Agriculture Summit in Nairobi, Kenya. The gathering \nserved as an opportunity to learn from best practices, \ntechnologies, partnerships and real-life implementation of \nsustainable agriculture practices.\nAs part of the summit, the CGIAR Research Program on \nClimate Change, Agriculture and Food Security (CCAFS), \nin collaboration with the International Center for Tropical \nAgriculture (CIAT), the World Agroforestry Centre (ICRAF) \nand the Climate Smart Agriculture Youth Network (CSAYN) \nKenya chapter, hosted a workshop on the role of climate-\nsmart agriculture (CSA) in de-risking agricultural value chains. \nTwenty-five participants mapped their value chains while \nidentifying key risk factors and developing business pitches \nfor CSA interventions that would de-risk their respective \nvalue chains.\n“CSA as a de-risk strategy is based on three major concepts: \nsustainably increasing agricultural productivity, improving \nresilience to climate-related shocks, and mitigating \ngreenhouse gas emissions where possible” explained \nChristine Lamanna, Climate Decision Scientist at ICRAF, and \nco-facilitator of the workshop. “But the question is, can such \nan approach also make business sense?” \nOverall, climate change risks—particularly from droughts, \nunpredictable rainfall and flooding—were found to affect \nproduction in all commodities, with the production stage \nbeing the most affected. “For us, flooding is the biggest risk \nfor horticultural farmers at the Kenyan coastal area” said \nBenson Mwendia, a farmer from Kilifi County, Kenya, and \nfounder of the CSA Excellence Center.\nTo offset these risks, climate-smart interventions such as \nprovision of clean, certified, drought tolerant seeds, water \nharvesting and irrigation, changing harvesting times, use \nof cover crops and regular soil checks were identified as \nremedies.\nBeyond production risks\nHowever, risks are not only found in the production stage. \n“Most of the agricultural losses and waste happen during \npost-harvest” noted Philip Simiyu, a graduate student at the \nUniversity of Nairobi. Kenya loses 5 million bags of maize \nyearly to poor post-harvest handling through inadequate \nstorage facilities and poor preservation techniques. With \ntraditional drying techniques, changing weather patterns \nresult in prolonged drying times and upraised aflatoxins. \nThe situation is further worsened by long transportation \nperiods from farms to markets. CSA options to mitigate post-\nharvest losses such as drying grains using solar dryers, use of \nappropriate preservation facilities, changing harvesting times \nScience News \n  6\nAs agricultural livelihoods face increasing threats, experts meet in Nairobi to find pathways to de-risk key value chains. \nK\n. T\nra\nut\nm\nan\nn \n(C\nG\nIA\nR)\nand use of better storage bags could de-risk this stage of the \nvalue chain.\nEvidently, the potential of CSA to mitigate risks in value \nchains is high, so why aren’t farmers and agribusiness \nprofessionals implementing them? A key barrier to adoption \nof CSA was found to be access to finance. Luckily, there are \na growing number of innovative financing mechanisms, \nsuch as Financial Access, which lends exclusively to CSA and \nagribusiness farmers. Insurance is another option to reduce \nthe financial risks faced by farmers. “Insurance for agriculture \nisn’t just limited to weather index-based insurance anymore. \nNew products are being developed that cover the entire \nvalue chain, including risks to labor” said Wairimu Muthike of \nACRE Africa.\nThere was agreement on CSA’s potential for risk mitigation \nas well as its business sense: “ we need to bring the \nprivate sector to farmers to bridge the gap and engage the \ngovernment in support of local farmers incentives” concluded \nKenneth Monjero, Lead Scientist with Kenya’s Agricultural and \nLivestock Research Organization (KALRO).\nHannah Kamau is Research Assistant at the World Agroforestry \nCentre (ICRAF). Victor Mugo is Country Coordinator at the Climate \nSmart Agriculture Youth Network (CSAYN). Christine Lamanna is \nClimate Decision Scientist at ICRAF. Catherine Mungai is Partnerships \nand Policy Specialist at CCAFS East Africa. Seble Samuel is the \nCommunications and Knowledge Management Officer at CCAFS East \nAfrica.\nRead more:\nWorking paper: Climate risk assessment for selected value chain \ncommodities in Rwanda: https://bit.ly/3aNmo8u\nProject: Developing climate-smart value chains and landscapes for \nincreased resilient livelihoods in West Africa: https://bit.ly/2xvNNxx\nCCAFS East Africa Bi-annual Newsletter      7\nBy Lili Szilagyi and Laura Cramer\nNew project aims to ensure that key actors in the livestock sector increase climate \nchange adaptation and mitigation in farming practices, sector strategies and \ninvestment projects.\nGuiding investments in climate-smart \nlivestock systems in East Africa\nIn Sub-Saharan Africa, livestock is crucial for the livelihoods of more than 80 percent of poor households. In addition, as a result of a growing population, increasing income and urbanisation, demand for \nlivestock products is rising steadily across the region.\nThis might seem like a good combination—those with rising \npurchasing power can buy more livestock products, thereby \nhelping to increase the incomes of poor livestock keepers. \nThrow the climate crisis into the mix, however, and the \nsituation turns sour. Climate change has a negative impact on \nlivestock production. Rising temperatures and lower annual \nrainfall reduce livestock productivity and inhibit the growth \nof fodder crops. Soil degradation and water scarcity led to \ndeclines in food for animals. Land-use conflicts are increasing, \nthreatening food security and gradually eroding livestock \nfarmers’ livelihoods.\nOn the other hand, livestock production is not only affected \nby the impact of climate change, but it also contributes \nto it. For example, in many countries in the region, the \nagricultural sector is the largest source of greenhouse gas \n(GHG) emissions. The largest part often comes from livestock \nproduction, such as emissions released during the digestive \nprocess of ruminants, from storage and application of \nmanure, and in fodder production.\nMany countries indicate in their Nationally Determined \nContributions (NDCs) their willingness to implement \nmeasures for reducing livestock sector emissions; however, \nemissions data is not yet available for accurately determining \nthe mitigation potential of climate-smart livestock systems. \nSuch systems are better adapted to the impact of climate \nchange and contribute to climate change mitigation. Livestock \nfarmers and policy-makers in particular require information \non possible climate scenarios and tried-and-tested solutions \nfor their implementation.\nNew project to support climate-smart livestock systems\nIn the past few months, the Program for climate-smart \nlivestock systems (PCSL) was launched in Kenya, Ethiopia \nand Uganda by the International Livestock Research Institute \n(ILRI) to support interventions to increase the contribution of \nlivestock production to the three key pillars of CSA: increased \nproductivity, mitigation of GHG emissions and adaptation to \nclimate change. The program is being implemented across \nfour different major livestock production systems in the three \ncountries until 2022.\nThe PCSL will take an integrated three-pronged approach \nthat aims to improve capacities of different stakeholders to \nimplement interventions to support climate-smart livestock \ndevelopment:\n1. At the local level, ILRI will work with livestock keepers \nto identify and test field practices that are currently \ntechnically possible but need additional support to make \nthem socially and economically feasible, such as the \n# 4\nScience News \n  8\nimprovement of the quality of livestock feed.\n2. At the district and national level, ILRI will support \nline ministry staff, the private sector and civil society \nrepresentatives to develop the appropriate enabling \nenvironment for implementing climate-smart livestock \ndevelopment. ILRI will also provide decision-making \nsupport through the participatory development of \nplausible future scenarios, particularly given the \nuncertainty about the future and the differing objectives \nof key decision makers in the context of climate change.\n3. Finally, ILRI will develop measurement, reporting and \nverification (MRV) tools as well as baseline GHG emission \ndata for addressing the mitigation agenda. In addition, \nadaptation tracking protocols will be developed to \nsupport the country’s reporting on progress towards \ntheir climate change adaptation targets. Tools will be \ndeveloped in line with modalities, procedures and \nguidelines of the Enhanced Transparency Framework of \nthe Paris and Katowice agreements.\nThe PCSL will support governments, the private sector and \nlocal stakeholders in realizing their development objectives \nwhile also achieving their climate change adaptation and \nmitigation goals. The project will ensure that the expected \nshort, medium and long-term impacts of climate change on \nthe livestock sector are taken into account in the planning of \npolicy frameworks, strategies and investment projects.\nLili Szilagyi is the Communications Consultant for the CCAFS Flagship \non Priorities and Policies for CSA. Laura Cramer is the Science Officer \nfor the CCAFS Flagship on Priorities and Policies for CSA.\nRead more: \nProject page: Program for climate-smart livestock systems:         \nhttps://bit.ly/2TQfdpa\nWorking paper: Climate and livestock policy coherence analysis in \nKenya, Ethiopia and Uganda: https://bit.ly/2THZN7D\nThe project is financed by the GIZ commissioned by the \nGovernment of the Federal Republic of Germany.\nPortait of young Boran cattle in Ethiopia.\nC\n. H\nan\not\nte\n (I\nLR\nI)\nCCAFS East Africa Bi-annual Newsletter      9\nScience News \nBy Seble Samuel\nDigital systems are being implemented for climate-resilient agricultural livelihoods in \nEthiopia.\nLaunching digital agro-climate \nadvisory platform in Ethiopia\nThere was a time when traditional ecological knowledge was enough. When ancestral wisdom guided communities to sense the moods of the rains, the temperaments of the winds, the hidden \nmessages of the clouds. Through these interpretations \nof nature, farming communities could foretell times of \nplanting, times of abundance and times of harvest.\nThese times are decidedly gone. An atmosphere saturated by \ncarbon has done more than uproot physical ecosystems, halt \nlivelihoods and abruptly displace whole communities, leaving \nonly a memory of something familiar; it has disrupted and \nstolen from traditional ecological knowledge systems.\nIn this era of climate emergency, what is left when traditional \nknowledge is no longer enough?\nDigital agriculture—complete with its repertoire of climate \nservices, agricultural advisories and mobile technologies, \nweather forecasts and agricultural data infrastructure, \nsensors and spatial modeling—is emerging to bolster \nthese disrupted knowledge systems. The alliance of digital \ntechnologies and agricultural systems is a promising response \nto the struggles of rising populations, growing food demand \nand ecological crisis by transforming food systems, harnessing \nresource efficiency, building sustainability and amplifying \nproductivity.\nA home for digital systems within the agricultural sphere can \ntakes many forms. It can involve early warning systems to \nidentify livestock health or disease; seasonal climate forecasts \ndelivered to farmers’ mobile phones; real-time mapping of \nmarket demand for specific agricultural commodities; and the \nlist goes on. The coupling of such digital insights to the realm \nof soil and sun holds many rewards: analyzing the upcoming \nseasons, exploring ideal times to plant, honing in on preferred \ncrops, localizing promising markets, identifying how to \nheal damaged soil, forewarning climate extremes and pest \noutbreaks. These digital approaches help to shield farming \nlivelihoods from the deluge of uncertainties brought forth by \nthe climate crisis, as well as to boost productivity, adaptive \ncapacity and market connectivity.\nGrounding digital agriculture in Ethiopia\nIn the midst of Ethiopia’s exponential population climb and \nthe strikes of the climate emergency with erratic rains, dry \nspells, sharp floods and failed crops, the country launched a \ndigital agro-climate advisory platform, called EDACaP, to put \nresilience at the center of agricultural livelihoods.\nA team effort led by the Ethiopian Institute of Agricultural \nResearch (EIAR) in partnership with the Ministry of \nAgriculture (MoA) and the National Meteorological Agency \n(NMA), alongside numerous research centers and programs: \nthe International Center for Tropical Agriculture (CIAT), \nthe International Maize and Wheat Improvement Center \n(CIMMYT), the CGIAR Research Program on Climate Change, \nAgriculture and Food Security (CCAFS) and the International \n# 5\n  10\nTraders checking the price of beans. New white pea bean varieties developed by researchers at the Ethiopian Institute of \nAgricultural Research (EIAR) in Ethiopia and CIAT are more drought-resilient, pest and disease resilient than previous varieties.\nG\n.S\nm\nith\n (C\nIA\nT)\nCCAFS East Africa Bi-annual Newsletter      11\nScience News \nResearch Institute for Climate and Society (IRI), with support \nfrom the Agricultural Growth Program (AGP), the EDACaP has \ncome to life.\n“From paper, we’ve gone digital,” said Dr. Eyasu Abreha, \nAdvisor to the Minister of Agriculture, celebrating the launch \nof the EDACaP.\nThe advisory platform is composed of four complementary \nelements: an agro-climate database hub, climate modelling, \ncrop modelling and a dissemination platform. EDACaP \ncombines 1) geographical data, including geospatial \ninformation on site characteristics and agroecological \nzones; 2) climate data, both historical and projections from \nscenario analysis; 3) weather data, using seasonal and sub-\nseasonal data; 4) soil data, including physical, biological and \nchemical characteristics; 5) crop data and varieties, currently \nfocused primarily on cereals but soon expanding to legumes, \nstimulants and vegetables; and 6) agronomic information, \nmainly concentrated on management data.\nThis data is interpreted into yield forecasts, agro-climate \nadvisories and climate scenarios that are targeted to specific \ngeographies and agricultural value chains, and disseminated \nto farmers through extension training, mobile technologies, \nearly warning systems and multimedia. These translations \nof complex science to smallholder farmers improve decision \nmaking on diverse elements including the selection of crop \nfields and varieties, timing for planting and harvesting, ideal \nirrigation approaches, as well as measures to prevent pests \nand diseases.\n“The farmer is the biggest decision maker,” said Dr. Kindie \nTesfaye, Senior Scientist at CIMMYT. As a country whose \nagricultural systems are highly dependent on rainfall, these \ndigital interventions will serve as key decision support tools \nto manage climate risk and bolster the adaptive capacity \nof Ethiopia’s smallholder farmers. “Our effort must be in \ncreating resilient agricultural systems that are not shocked by \nclimate risks,” said Dr. Diriba Geleti, Deputy Director General \nfor Research at EIAR.\nFor these digital transformations of food systems to be \npossible, many hurdles must be overcome, the most \npressing being ensuring digital systems do not exacerbate \ninequalities, as well as overcoming capital constraints, limited \ntechnologies, infrastructure gaps in commercialization, and \nbuilding regulatory frameworks, digital access and literacy, \ndigital innovation and entrepreneurship models.\nEDACaP’s pilot phase has already reached 82,000 smallholder \nfarmers across Ethiopia and is expected to reach 16.7 million \nfarmers once scaled through the Ministry of Agriculture and \nthe country’s more than 60,000 agricultural extension agents.\nEDACaP is not alone in the push to facilitate Ethiopia’s food \nsystems to go hand in hand with digital approaches. YeZaRe, \ndeveloped by the social enterprise Echnoserve, is a digital \nmobile system that provides weather and market data to \nsmallholder farmers, as well as connects these farmers to \nmarkets to ensure income for their livelihoods and reduce \nlosses at the hands of middlemen. Currently there are \nmore than 33,000 registered users, ranging from farmers \nto cooperatives to extension workers to wholesalers. By \nconnecting the dots on climate data and market information, \nYeZaRe is able identify key markets for smallholder farmers to \nboost both their livelihood incomes as well as their climate \nresilience.\nTaking digital agriculture internationally\nAround the world, digital agriculture is gaining traction. In \nthe words of Dhanush Dinesh, Global Policy Engagement \nManager at CCAFS, and Ana María Loboguerrero, Head of \nGlobal Policy Research at CCAFS, “digitization of agriculture \ncan play a key role in enabling the agricultural sector to \nleapfrog traditional development pathways. It can also enable \nfarmers to make their livelihoods profitable and resilient to \nclimate change impacts.”\nAccording to these scientists, there are six key elements \nto making such a transformation possible: boosting digital \nconnectivity, sustaining tailored data services to smallholder \nfarmers, making a strong business case, building enabling \nenvironments, scaling digital models and finally evaluating \nprogress in an ongoing manner.\nIf these obstacles can be overcome, “digital systems can be a \ngreat equalizer,” said Dr. Dawit Solomon, East Africa Regional \nProgram Leader of CCAFS.\nSeble Samuel is the Communications and Knowledge Management \nOfficer for CCAFS East Africa.\n  12\nBy Seble Samuel and Gloria Otieno\nWestern Kenya now houses its very own community seedbank, a collection of the \nregion’s biological diversity.\nFarmers from across Kenya, Uganda and Tanzania traveled from their agricultural fields to Nyando in Western Kenya to celebrate the launch of the community’s new seedbank. “We were travelling \nlong journeys for seeds” said farmer Evelyn Kugonza, “but \nnow we are travelling short distances, because we have a \nseedbank. It has expanded our knowledge and our income.” \nCommunity seedbanks are now housed in two of East \nAfrica’s Climate-Smart Villages (CSVs) in Nyando, Kenya and \nHoima, Uganda.\nNyando’s community seedbank* is the result of four years \nenvisioning and laboring towards a seed diverse future. \nTogether with the region’s dedicated farmers, and the lead \nof Bioversity International, the CGIAR Research Program on \nClimate Change, Agriculture and Food Security (CCAFS) in \nEast Africa along with key multi-level partners** has been \ninstrumental in getting this project off the ground.\nThe seedbank allows farmers to access a wide range of \ndiversity for climate change adaptation, and helps them \nprotect and conserve their biological diversity and improve \nseed storage. In doing so, the seeds go hand in hand in \nboosting the adaptive capacity of farmers, by housing climate \nresilient varieties and the essential seed diversity that helps \nshield their livelihoods from climate risks.\nNyando Climate-Smart Village \nlaunches community seedbank\nA snapshot into Nyando’s community seed bank\nThe millet, sorghum and bean seeds that fill Nyando’s \nseedbank have been exchanged from the national genebanks \nof Kenya, Uganda and Tanzania, using climate and geospatial \nmapping to identify them from a pool of genetic resources \nheld by the genebanks.\nA total of 220 seed varieties were identified and then \nexchanged from the multilateral system of access and benefit \nsharing*** using Standard Materials Transfer Agreements \n# 6\nRonny Philly Muga, a volunteer at the seedbank, helps with \nthe final preparations for the launch of Nyando’s community \nseedbank. \nS.\n S\nam\nue\nl (\nC\nC\nA\nFS\n)\nCCAFS East Africa Bi-annual Newsletter      13\nField updates \n(SMTAs)—the process for requesting genetic materials \nacross parties of the multilateral system—between the \nthree competent authorities. The seeds were multiplied \nand evaluated for suitability to agroecological conditions \nin Nyando by the Kenya Agricultural & Livestock Research \nOrganization (KALRO) and Bioversity International along with \nfarmers. The seeds were then tested on site to evaluate their \nresilience to climate change, pests and diseases. The seeds \nthat remain after the selection, are, at least for now, the \n“crowd favorites.”\nTo make sure the seedbank can remain a bountiful \ncommunity resource in the future, farmers have developed \nguidelines for its sustainability. “The criteria is that when you \ntake one seed you return two, if you take five, you return ten, \nthat is how we keep it sustainable,” said David Musuya, Field \nTechnician with CCAFS, referring to the conditions set by the \nfarmer members themselves.\nNyando’s community seedbank launch and seed fair brings together the region’s biological diversity. \nS.\n S\nam\nue\nl (\nC\nC\nA\nFS\n)\nFor now, the community seedbank houses 100 sorghum, \n100 millet and 20 bean varieties. And with the seedbank’s \n“return” policy, this is only set to multiply, boosting the \nresilience of all participating farmers. In many ways, seed \ndiversity is like free insurance when you face a changing \nclimate.\nFrom subsistence to sales\nMoving from subsistence farming to the terrain of markets \ncan be difficult for farmers. “Understanding the business \nand restrictive seed sale laws that require certification are \nleading challenges,” said Ruth Nabaggala, Seed Market \nDevelopment Associate with PELUM Uganda. To address \nthese setbacks, farmers were exposed to the ins and outs \nof financial management and marketing strategies during a \ntwo-day training workshop on seed business management for \n  14\n*The seedbank is supported by the Benefit Sharing Fund \n(BSF) of the International Treaty for Plant Genetic Resources \nfor Food and Agriculture (ITPGRFA) under the project “Open \nSource Seed Systems for Climate Change adaptation in Kenya, \nUganda and Tanzania.”\n**Key partners include KALRO, Genetic Resources Research \nInstitute (GeRRI), Sustainable Agriculture and Natural \nResource Management Africa (SANREM Africa), HIVOS East \nAfrica, Uganda’s National Agricultural Research Organization \n(NARO), and Tanzania’s Plant Genetic Resources Center \n(TPGRC).\n***This system was developed by the ITPGRFA and serves \nas an open-access international platform for conservation, \nsustainable use and equitable sharing of plant genetic \nresources for food systems.\nSeble Samuel is the Communications and Knowledge Management \nOfficer for CCAFS East Africa. Gloria Otieno is an Associate Scientist \nat Bioversity International.\nRead more:\nNews update: Building resilience across East Africa one seed at a \ntime: https://bit.ly/2UaFEX9\nNews update: The future of banking is in seeds: Hoima district \nestablishes a community seedbank to strengthen farmers’ adaptive \ncapacity: https://bit.ly/2W149IJ\nNews update: Seed networks for climate change adaptation in \nKenya, Uganda and Tanzania: https://bit.ly/2wPmvSe\nBlog: Open source seed systems for climate change adaptation in \nKenya, Uganda and Tanzania: highlighting the importance of policy \nsupport: https://bit.ly/2wMFxJe\nseedbanks. Farmers shared their following key challenges and \nopportunities to making sound seed business management a \nreality.\nEthiopia, Malawi and Uganda are looking forward to working \nwith other member countries to develop more efficient and \nsustainable agricultural systems to meet growing global \ndemand for food in the context of a changing climate. \n“As farmers, we have to have accountability, we have to know \nhow we are going to invest every season, if we are improving \nor moving backwards,” said Evelyn Kugonza. “We were asking \nourselves how we were going to plan. Now we are happy, we \nhave learned to make a business plan; that is important.”\nIt is vital that momentum continues to grow, expanding seed \nsharing across the region. Nyando’s community seedbank not \nonly reflects a critical step in building the economic resilience \nof farmers, it is instrumental in preserving the biological \nsovereignty of their livelihoods.\nFarmers looking at the different seed varieties that were on \ndisplay during the community seed bank launch.\nS.\n S\nam\nue\nl (\nC\nC\nA\nFS\n)\nCCAFS East Africa Bi-annual Newsletter      15\nBy Hannah Kamau, Ivy Kinyua and Victor Mugo\nInsights and lessons learned on disseminating Kenya’s climate-smart agriculture \nstrategies, frameworks and investment plans.\nEnhancing capacity for resilient agriculture \nplanning and programming in Kenya\nKenya has made significant progress in the development of agricultural policies, yet implementation remains elusive, aggravating food insecurity challenges. To address this gap, recent \nfield visits were conducted across the counties of Nyeri, \nKajiado and Taita Taveta to disseminate Kenya’s Climate-\nSmart Agriculture (CSA) Strategy and Implementation \nFramework. This groundwork strived to support efforts \nto operationalize CSA into county-level action planning. \nKey insights have been drawn in the following lessons for \ncommunities and officials who seeks to operationalize CSA \nat multiple levels.\nLesson 1: Strike while the iron is hot\nThe period between policy launch and dissemination is \nvery crucial. Often times, policies have been made and \ndisseminated too late or just when policy review is due. It \nis only through dissemination that the disconnect between \npolicymakers and implementers can be bridged. The \nimplementation lag is worsened by national commitments \nsuch as the Nationally Determined Contribution (NDCs) that \nseek to report progress within a specified period of time. We \nadvise quicker and efficient dissemination programs that can \nreach as many sub-national implementers as possible to give \nthem ample time to review and shape the policy, as well as \noperationalize it to their relevant contexts.\nLesson 2: Two flints can make a fire\nWhen not limited to multilateral parties, effective \npartnerships are a major plus for transformative agriculture. \nMore than just creating synergies, collaborative partnerships \nhelp organizations to combine their expertise in delivering \ninnovative and scalable climate change and agriculture \nsolutions. For example, the Climate Change Unit of the \nMinistry of Agriculture, Livestock and Fisheries (MoALF), the \nUnited Nations Food and Agriculture Organization (FAO), \nthe International Center for Tropical Agriculture (CIAT) and \nWorld Agroforestry (ICRAF) came together to disseminate the \nclimate-smart policies and support sub-national governments \nin identifying their CSA investments. A partnership that \nyielded more wins than if we had worked in isolation.\nLesson 3: Finances\nClimate finance is a key driver for promoting CSA. For \nexample, when carrying out our mission we had to separate \nthe different levels of actors in the counties. In a week-\nlong exercise per county we sensitized the Members of \nCounty Assembly (MCAs), the members of County Executive \nCommittee Members (CECMs) and the implementers – \ntechnical officials in the County Agriculture Department. \nThese activities, while important, called for financial planning \nand consideration while formulating policies that require \n# 7\nField updates \n  16\nA farmer tending to her crops in Nyando where climate - smart practices are being implemented by smallholder farmers affected \nby climate change. \nT.\n M\nuc\nha\nba\n (C\nC\nA\nFS\n)\nCCAFS East Africa Bi-annual Newsletter      17\nlocal action. These should not be limited to sensitization \nand dissemination stages but instead reach as far as \nimplementation on the ground.\nLesson 4: Harmonized approaches\nDuring an exercise of mapping county initiatives with the \ntechnical teams, we discovered that many organizations were \nalready working independently with the communities to build \nresilient agricultural systems. Risks of initiatives duplication \nand sometimes information conflict are inevitable. Leveraging \nthe independent organizations to form one platform guided \nby an end goal could increase efficiency in the dissemination \nprocess, mobilization of funds and promotion of CSA. \nCurrently, in Kenya, several climate change and agriculture \nmulti-stakeholder platforms could be leveraged at the sub-\nnational level to promote resilient agriculture and reduce \nisolated interventions, in particular, the national multi-\nstakeholder platform on CSA.\nLesson 5: Target audience\nIt is important to select the right stakeholder groups \nto engage so as to convey information that is relevant, \nappropriate and leads to action. Understanding their roles, \nneeds and priorities cannot be understated if we are to \neffectively deliver on intended objectives. Therefore we \nidentified the political leadership (Members of County \nAssembly, County Executive Committee Members, Technical \nOfficers) as important stakeholders to engage. Having \nacknowledged their diverse roles, we tailored the activities, \nlanguage and design which ultimately led to facilitating \nseparate sessions for effective sensitization.\nLesson 6: Peg implementation on scientific evidence\nAs part of the mission activities, we supported the counties \nto develop CSA investments through their technical officers \nbased on their sub-sector (crops, livestock and fisheries) \nexpertise. To do this we used the CSA compendium \ndatabooks and Evidence for Resilient Agriculture (ERA) \ndeveloped by ICRAF, with support from the CGIAR Research \nProgram on Climate Change, Agriculture and Food Security \n(CCAFS) and CIAT, to pinpoint agricultural practices for specific \ncontexts and geographies. This provided the technical officers \nwith multiple technologies, innovations and interventions \nto understand, identify and select practices that would \ncontribute to CSA.\nThrough these county missions, it became apparent that \nCSA is still a confusing and complex concept that requires \nmultifaceted approaches to effectively deliver on its triple \nwins. More than that, there are many underlying factors \n(finance, data, attitudes, inclusivity) that influence its \nsuccess. Therefore, as we strive to ensure food and livelihood \nresilience, we must continually recognize these gaps and \ndevelop lasting solutions. We must also acknowledge our \nindividual organizational strengths and combine powers to \npromote resilient agriculture.\nHannah Kamau is Research Assistant at the World Agroforestry \nCentre (ICRAF). Ivy Kinyua is Research Assistant at the International \nCenter for Tropical Agriculture (CIAT). Victor Mugo is Country \nCoordinator at the Climate Smart Agriculture Youth Network \n(CSAYN). \nRead more: \nNews update: Kenya launches Climate-Smart Agriculture Strategy for \n2017-2026: https://bit.ly/2TW2di2\nNews update: Kenya launches framework to implement climate-\nsmart agriculture: https://bit.ly/2wSQrgj\nNews update: Stakeholders come together in Nairobi to create \na vibrant platform for climate-smart agriculture across Kenya:      \nhttps://bit.ly/39JbwIS\nNews update: Guiding investments in climate-smart livestock \nsystems in East Africa: https://bit.ly/39IMJof\nThis work was supported through the United States \nDepartment of Agriculture (USDA), Foreign Agricultural \nService (FAS), Enhancing Capacity – Low Emission \nDevelopment Strategies (EC-LEDS) Phase II: Resilient \nAgriculture Planning and Programming in Kenyan Counties, \nwith funding from the U.S. Department of State with \nadditional support from the CGIAR Research Program on \nClimate Change, Agriculture and Food Security (CCAFS) \nPartnerships for Scaling CSA Project and the United Nations \nFood and Agriculture Organization (FAO).\nField updates \n  18\nBy Victor Mugo, Hannah Kamau and Seble Samuel\nThe average African farmer’s age is nearly 60. Stakeholders come together to \nbrainstorm pathways of inspiring young people into agriculture.\nIs climate-smart agriculture the silver \nbullet to attract youth to agriculture?\nWith the average African farmer’s age hitting nearly 60 years, the sector’s stakeholders have been diligently working to come up with measures on how to attract and retain youth \nin the sector. There have been a myriad of suggestions, \nbut none of them seemed as attractive as engaging youth \nthrough climate-smart and digital agriculture.\nIn April 2019, thought leaders, policy experts, researchers, \nthe private sector and youthful farmers joined a sizeable \naudience of participants at the first Agtech Africa summit, \nheld in Nairobi, Kenya. These stakeholders came together to \ndiscuss the potential of climate-smart and digital agriculture \nin attracting young people and thereby rejuvenating an aging \nglobal agricultural sector.\nVictor Mugo, Country Coordinator for the Climate Smart \nAgriculture Youth Network (CSAYN), started by dispelling the \nnotion that youth keep away from the farm because it is a \n‘dirty job’. He went on to clarify that young people shy away \nfrom farming because it is not profitable: “With the train of \nrisks that are often exasperated by climate change, young \npeople see the sector offering little opportunity for economic \nenrichment and social fulfilment. Agriculture can only be cool \nif youth can make a decent living out of it.”\nWhile concurring with Victor’s statement, Benson Mwendia, \na young farmer who keeps poultry and grows watermelons, \nonions, okra and chillies, narrated his chilling experience with \nclimate-related disasters that had wreaked havoc in his farm: \n“My farm sits only a stone throw away from River Sabaki \nand while I benefit from a regular supply of water, I am also \nconstantly staring at the threat of flooding.”\nFor him, his saving grace was his introduction to climate-\nsmart agriculture (CSA) and the reinforcement of this \nknowledge through Kilifi County’s Climate Risk Profile that \nelaborated the available menu of options on how to adapt \nto climate-related threats. “With the new knowledge, I have \nbeen able to significantly reduce some of the risks associated \nwith growing these crops and I am now making a good return \nfrom my farming activities” he reported.\nBenson has also gone a step forward and turned his farm \ninto a Climate-Smart Agriculture Excellence Centre (CSAEC). \nHe now makes an extra income teaching farmers on how to \nstrengthen their local capacity to adapt to perennial climate-\nrelated hazards through adopting CSA technologies and \nmanagement practices.\nThe final panellist Philip Simiyu, a young maize farmer \nstudying agricultural economics at the University of Nairobi, \nnoted that although CSA increases agricultural production \nand builds the resilience of farmers, post-harvest losses and \nlack of stable markets water down all these gains. Even after \nincreasing his maize produce, Philip shared how he suffered \n# 8\nCCAFS East Africa Bi-annual Newsletter      19\nField updates \nat the hand of poor market prices and pests that ate his \nprofits away. Having learned his lesson, he now advises young \nfarmers to acquire a market-oriented farming mind-set that \nallows them to ‘sell before they plant’.\nGeorge Wamukoya, a policy expert from the Africa Group \nof Negotiators Expert Supporter (AGNES) team brought the \nsession to a subtle conclusion, warning that CSA was not a \nmiracle solution. He advised that appropriate technologies \nand management practices needed to be matched with \ndifferent weather conditions, soil state, topology and agro-\necological zone. However, he also noted that by using CSA, \nfarming activities could become less risky and therefore \nmore profitable. With this, young people could find it more \nappealing as a sector to venture into.\nVictor Mugo is Country Coordinator at the Climate Smart Agriculture \nYouth Network (CSAYN). Hannah Kamau is Research Assistant \nat the World Agroforestry Centre (ICRAF). Seble Samuel is the \nCommunications and Knowledge Management Officer for CCAFS \nEast Africa.\nRead more: \nNews update: Diverse youth groups come together for climate-smart \nagriculture: https://bit.ly/2TIySc8\nNews update: The future of farming: The potential of young people \nin the agriculture sector: https://bit.ly/3cShg4L\nNews update: Youth, agriculture, and innovation: Building \nthe capacity of young entrepreneurs to mange climate risks:              \nhttps://bit.ly/2W6Mqzp\nNews update: Encouraging African youth to adopt climate-smart \nagriculture: https://bit.ly/2w1iOsC\nPublication: Youth engagement in climate-smart agriculture in \nAfrica: Opportunities and challenges: https://bit.ly/2xsyIwB\nWhat are the best ways to attract youth to farming? Agricultural experts explore if climate-smart agriculture could be the key.\n C\n. S\nch\nub\ner\nt \n(C\nC\nA\nFS\n)\n  20\nBy Yvonne Munyangeri and Seble Samuel\nRadios are the farthest reaching tool in Rwanda. Equipped with climate information, \nthey have become a key messenger for farmers in creating resilient food systems.\nRaising farmers’ awareness on climate risks \nand adaptation with radio broadcasts\nIn Rwanda, radio coverage is 98%, which makes radio broadcasts the main awareness raising tool for local communities. Climate change, climate risk and adaptation related information are mainly shared \nthrough the radio and agriculture extensionists. Therefore, \nin collaboration with Radio Huguka, a local community \nradio, the Rwanda Climate Services for Agriculture (RCSA) \nproject has created 225 listeners’ clubs. These clubs are \nheaded by farmer promoters, trained in Participatory \nIntegrated Climate Services for Agriculture (PICSA)* and also \nin managing such clubs.\nThe listeners’ clubs encourage farmers to actively follow \nclimate and agriculture related information in order to \nenhance their knowledge and capacity to mitigate, adapt and \nmanage climate risks in agriculture. During the Huguka show, \nfarmers call and send messages and questions focused on \nclimate services in agriculture. At least three clubs participate \nand directly share their views during the broadcasts. As \njournalists facilitate the talk shows, experts from the Ministry \nof Agriculture and Animal Resources (MINAGRI), the Rwanda \nAgriculture Board (RAB) and the Rwanda Meteorology Agency \n(Meteo Rwanda) respond to the inquiries of farmers.\nIn a recent visit to the Abahuje Tunza club, located in the \nsouthern province and Icyizere Cy’ejo Heza club from \nthe eastern province, around 25 club members met at a \nmembers’ home to listen to the Huguka show. Following \nalong the direct broadcast through a small radio and the \ntelephone of the club leader, the farmers learned about the \nuse of climate information for agricultural livelihoods.\nA look into farmer radio broadcasts\nThe Huguka show is also an opportunity for farmers raise \ntheir concerns about climate change and agriculture and \nlearn about other practices. This contributes to increased \nengagement in finding solutions. “In our region, we don’t \nknow techniques for storing fodder during the dry season, \nso we are happy to learn from experts or farmers from other \nregions” said the village leader and Abahuje Tunza club \nmember, Eduard Mugenzi, during the broadcast on fodder \nstorage. “We have an old technique that we use to store \nlivestock food by putting the grass in a pit and covering it \nwith shrubs and soil to keep them from drying” responded \na farmer from the western province. As many other club \nmembers were unfamiliar with the technique, experts from \nRAB will be brought in to fill this knowledge gap and explain \nmore on fodder and storage in the dry season.\nIn the broadcast on pest control, members of Icyizere Cy’ejo \nHeza club shared their concerns about armyworms that \ndestroy maize crops. While the pest is common to many \nfarmers, they have limited knowledge on its control. “Until \nnow, we have no solution to the armyworms and it’s really \n# 9\nCCAFS East Africa Bi-annual Newsletter      21\nField updates \na big problem since they destroy whole crops and we really \nsuffer from crop losses” said Augustin Nyabyenda, a club \nmember of Icyizere Cy’ejo Heza. To address such challenges, \nthe Huguka show has equipped farmers with new techniques \nand skills, becoming something of a knowledge basin. Specific \nskillsets include using seasonal forecasts every season, \nplanting in lines, preparing the land before the season starts \nand using fertilizers to help crops survive climate variabilities \nduring the season.\nFarmers have expressed that they enjoy participating in the \nlisteners’ clubs and are particularly happy to share their \nperspectives on the radio. Club members come from all walks \nof life, even including those in charge of village development \nand health coverage, boosting the acceptance of the agro-\nclimate broadcasts across the villages. \nFarmers receive training on climate information as part of the Rwanda Climate Services for Agriculture project.\nN\n.P\nal\nm\ner\n (C\nIA\nT)\nYvonne Munyangeri is Project Assistant at CIAT-Rwanda. Seble \nSamuel is the Communications and Knowledge Management Officer \nfor CCAFS East Africa.\nRead more: \nNews update: Putting seasonal forecasts in the hands of Rwandan \nfarmers: https://bit.ly/33ccWZG\nNews update: Trainings in climate services for agriculture reach all of \nRwanda: https://bit.ly/38DuYFn\nNews update: New partnerships launched to bolster climate services \nin Rwanda: https://bit.ly/3aJWAu3\n* PICSA is a participatory agricultural extension approach, \ndeveloped by researchers at the University of Reading. PICSA \naims to support smallholder farmers to make informed \ndecisions, under variable and changing climatic conditions. \nIt does this through combining: i) accurate, locally-specific \nclimate and weather information, ii) locally relevant crop, \nlivestock and livelihood options, and iii) participatory decision-\nmaking tools.\nIn our diary \nFebruary\n11-13\n2020\nMarch \n12\n2020\nMarch\n19\n2020\nWebinars: Expansion of \nClimate Bonds Standard \ninto sustainable agriculture\nVenue: Online\nGender Equality in \nClimate Smart Agriculture: \nGender and climate \npolicy information for \npolicymakers and planners\nVenue: Online\nGender Equality in \nClimate Smart Agriculture: \nIndicators and measuring \nimpact\nVenue: Online\nMarch\n10\n2020\nThe 6th International \nConference on Climate \nServices (ICCS 6) \nVenue: Pune, India\nOut & About\n1. CCAFS East Africa staff in Addis Ababa June 12-14, 2019 for the Global Challenges Programme (GCP) 4, with eight CSA projects spanning \nEastern Africa. 2. Farmers and partners come together in Nyando, Kenya in September 2019 to launch Nyando’s community seedbank \n(NYACOSEB), to protect biological diversity and boost climate resilience. 3. Southern African Confederation of Agricultural Unions exchange \nwith CCAFS East Africa in Southern Ethiopia in September 2019, learning and sharing experiences for resilient food systems and agricultural \nlivelihoods. 4. Tanzania’s Women Parliamentarian Group came together in September 2019 for an awareness creation workshop on the climate \nand gender nexus. 5. CCAFS led a monitoring data collection training in Doyogena climate-smart landscape in Southern Ethiopia in November \n2019. 6. CCAFS EA team at the 5th Global Science Conference on Climate-Smart Agriculture 2019 in Bali, Indonesia. \n1 32 3\n4 5 6\nCCAFS EA in the media \nCCAFS East Africa Bi-annual Newsletter      23\nCCAFS EA in the media\nEthiopian farmers move on to greener pastures | Afro FM: https://bit.ly/38PgFhh\nWhy the government of Kenya is now investing heavily in water pans for irrigation | CHAMS Media: https://bit.ly/39P7TBc\nScaling climate-smart agriculture in East Africa: A role for all stakeholders taking into account contexts and needs | Food & \nBusiness Knowledge Platform: https://bit.ly/2IGjars\nCLIMATE CHANGE: East Africa faces 2°C rise in temperature | The Independent: https://bit.ly/33gBa57\nA Resilient Seed Systems Handbook to support farmers adapt to climate change | Bioversity International: https://bit.\nly/3aWdrdo\nWomen embrace ecosystem conservation in Ethiopia’s male-dominated agrarian livelihood | Xinhuanet: https://bit.ly/2QcVuzb\nSharing new approaches to bring together gender, youth, nutrition and climate | IFAD: https://bit.ly/2QfafS1\nThe Future We Want is RESILIENT | C40 Cities: https://bit.ly/2w6F9VL\nThe Digital Revolution: Communication technologies and the future of agriculture | Climate & Agriculture Network for Africa: \nhttps://bit.ly/3cPqVZY\nEastern Africa focus on cutting emissions, boosting productivity | ACIAR Partners in Research for Development:                       \nhttps://bit.ly/2WeJHEf\nKenyan farmers hit by worst locust swarms in 70 years | Voice of America: https://bit.ly/2U5xNtE\n  24\nFurther Reading and CCAFS Tools\nFurther Reading \nCCAFS Latest Publications \nCCAFS Tools \nCCAFS website and blog Updated daily with news on policy and \npractice, research, events and downloadable publications from \nthe CGIAR and partners. http://bit.ly/1gX2uKi  Blog: http://bit.ly/\nBlogs_EastAfrica\nAdaptation and Mitigation Knowledge Network (AMKN) Map-\nbased platform for sharing data and knowledge on agricultural \nadaptation and mitigation. http://bit.ly/AMKN_Maps\nAgTrials Large public repository of agricultural trial data sets, with         \ndifferent crops, technologies and climates. http://bit.ly/AgTrials\nFood Security CASE maps Map-based projections of crop area and \nyields, average calorie availability, and international trade flows \nacross the world. http://bit.ly/Casemaps\nMarkSim II Generator Future location-specific rainfall se-\nries, based on a choice of General Circulation Models:                                           \nhttp://bit.ly/MarkSimGCM\nGCM data portal Set of downscaled climate data sets.                       \nhttp://bit.ly/Climate_Data\nDataverse Public portal Full CCAFS data sets such as the baseline              \nsurveys from CCAFS East Africa sites that include information on       \nfarmers’ current adaptive practices. http://bit.ly/Baseline-Surveys \nBig Facts website Get all the links on climate change, agriculture  \nand food security: http://bit.ly/1gYWjWt\nAtlas of CCAFS sites Browse colorful maps of CCAFS research \nsites in three regions: East Africa, West Africa and South Asia:                    \nhttp://bit.ly/1iSfwHd\nCore Sites in the CCAFS regions This portfolio includes brief                 \ndescriptions of CCAFS core sites in East Africa, West Africa and South \nAsia, including coordinates of the sampling frames of the baseline \nsurveys: http://bit.ly/1dKwrfG\nAdaptation and Mitigation Knowledge Network Map-based plat-\nform for sharing data and knowledge on agricultural adaptation and \nmitigation: http://bit.ly/1kiEnng\nClimate Analogues This is a tool that uses spatial and tem-\nporal variability in climate projections to identify and map \nsites with statistically similar climates across space and time:                                       \nhttp://bit.ly/1pzmVhl\nClimate and Agriculture Network for Africa This web-based \nplatform seeks to link scientists with policy makers to address \nclimate change, agriculture and food security issues in Africa.                              \nhttp://bit.ly/1BHmhG0\nInfo Note: Gender assessment for women’s economic empowerment \nin Doyogena climate-smart landscape in Southern Ethiopia:\nhttps://bit.ly/2Q6WQez\nInfo Note: Scaling climate-smart agriculture: Towards co-creating \nbusiness models in the input supply chains and finance chains: \nhttps://bit.ly/2QcZDTQ\nInfo Note: Soil organic carbon sequestration for climate change \nmitigation in East African Climate-Smart Villages: \nhttps://bit.ly/2W9DCc3\nJournal article: A double ITCZ phenomenology of wind errors in \nthe equatorial Atlantic in seasonal forecasts with ECMWF models: \nhttps://bit.ly/2TLd1Rm\nJournal article: Climate change adaptation and the role of fuel \nsubsidies: An empirical bio-economic modeling study for an artisanal \nopen-access fishery: https://bit.ly/33h8CJ0\nJournal article: Impacts of intensifying or expanding cereal cropping \nin sub-Saharan Africa on greenhouse gas emissions and food \nsecurity: https://bit.ly/33cMeAb\nProject newsletter: Rwanda Climate Services for Agriculture: \nTransforming Rwanda’s rural farming communities and national \neconomy through improved climate risk management - Project \nNewsletter 2019: https://bit.ly/38QRDyo \nWorking paper: Gender implications of the Koronivia Joint Work on \nAgriculture: Background paper for the AGNES pre-SBs 50 strategy \nmeeting on agriculture and food security: https://bit.ly/2TYuyUN\n\nLed by:\nResearch supported by: \nFund\nFund\nCGIARClimate\n@ CGIARclimate\nCGIAR Research Program on Climate Change, Agriculture \nand Food Security (CCAFS), East Africa.\nP.O. Box 30709 - 00100 Nairobi, Kenya \nPhone: +254 20 422 3000 Fax: +254 20 422 3001\nEmail: ccafsea@cgiar.org\nWebsite: http://ccafs.cgiar.org/regions/east-africa\nCCAFS  East Africa is \nhosted by ILRI\nThailand (through the \nDepartment of Agriculture)\nCGIAR Climate Change, Agriculture & Food Security (CCAFS)\nAlliance\n",
    "Link": "https://core.ac.uk/download/294831701.pdf"
}