{
    "Title": "Th17 responses are not altered by natural exposure to seasonal allergens in pollen-sensitive patients",
    "Authors": "Czesnikiewicz-Guzik, Marta, Jasiewicz-Honkisz, Barbara, Maciag, Joanna, Matusik, Pawel T., Mikolajczyk, Tomasz, Osmenda, Grzegorz, Sagan, Agnieszka, Schramm, Agata, Siedlinski, Mateusz, Sliwa, Tomasz, Wilk, Grzegorz",
    "Year": "No year available",
    "Abstract": "Background:\n\nAllergic rhinitis affects 10–30 % of the global population and this number is likely to increase in the forthcoming years. Moreover, it commonly co-exists with allergic asthma as a chronic allergic respiratory syndrome. While the involvement of Th2 cells in allergy is well understood, alterations of pro-inflammatory Th17 responses remain poorly characterized. The aim of our study was to determine whether natural seasonal allergen exposure causes changes in T cell subset characteristics in patients with allergic rhinitis and asthma.\n\n\n\nMethods:\n\nSixteen patients with allergic rhinitis/atopic asthma (9M, 7F; age 31.8 ± 12.1) and 16 healthy controls were recruited into the study (9M, 7F; age 31.2 ± 5.3). Blood samples were collected from the patients 1–3 months before pollen season (visit 1), within 7 days of the appearance of pollen/initiation of allergic symptoms (visit 2) and 2 weeks after visit 2 following the introduction of symptomatic treatment with antihistamines (visit 3). Flow cytometry was used to assess major T cell subsets (naïve, central memory, effector memory and CD45RA+ effector) and key T cell cytokine production (IFNγ, IL-17A, TNF and IL-4) using intracellular staining. Data were analyzed using repeated measures ANOVA and paired t test.\n\n\n\nResults:\n\nAs expected, an increase in the percentage of IL‐4+ CD4+ cells was observed during natural pollen exposure in patients with allergic respiratory syndrome. No significant changes were observed in the production of other cytokines, including Th17 cells, which tended to be lower than in the control population but unchanged during pollen exposure. Introduction of antihistamine treatment led to only moderate changes in cytokine production from CD4 and CD8 T cells. Selective changes in CD8+ T cells were observed during natural pollen exposure including a decrease in transient cells (with features of CD45RA+ and CD45RO+ cells) and a decrease in the percentage of central memory cells in the peripheral circulation. Within the CD4 cell group the total percentage of CD45RA positive CD4 cells was increased during pollen exposure.\n\n\n\nConclusions:\n\nTh1 and Th17 responses are not altered during pollen season but allergen exposure affects T cell activation and memory cell status in patients with allergic respiratory syndrome",
    "Keywords": "No keywords available",
    "Publisher": "'Springer Science and Business Media LLC'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Schramm et al.  Allergy Asthma Clin Immunol  (2016) 12:55 DOI 10.1186/s13223-016-0157-6RESEARCHTh17 responses are not altered by natural exposure to seasonal allergens in pollen-sensitive patientsAgata Schramm1, Barbara Jasiewicz‑Honkisz1, Grzegorz Osmenda1, Grzegorz Wilk1, Mateusz Siedlinski1, Agnieszka Sagan1,2, Pawel T. Matusik1, Joanna Maciag1, Tomasz Sliwa1, Marta Czesnikiewicz‑Guzik3,4 and Tomasz P. Mikolajczyk1,5*Abstract Background: Allergic rhinitis affects 10–30 % of the global population and this number is likely to increase in the forthcoming years. Moreover, it commonly co‑exists with allergic asthma as a chronic allergic respiratory syndrome. While the involvement of Th2 cells in allergy is well understood, alterations of pro‑inflammatory Th17 responses remain poorly characterized. The aim of our study was to determine whether natural seasonal allergen exposure causes changes in T cell subset characteristics in patients with allergic rhinitis and asthma.Methods: Sixteen patients with allergic rhinitis/atopic asthma (9M, 7F; age 31.8 ± 12.1) and 16 healthy controls were recruited into the study (9M, 7F; age 31.2 ± 5.3). Blood samples were collected from the patients 1–3 months before pollen season (visit 1), within 7 days of the appearance of pollen/initiation of allergic symptoms (visit 2) and 2 weeks after visit 2 following the introduction of symptomatic treatment with antihistamines (visit 3). Flow cytometry was used to assess major T cell subsets (naïve, central memory, effector memory and CD45RA+ effector) and key T cell cytokine production (IFNγ, IL‑17A, TNF and IL‑4) using intracellular staining. Data were analyzed using repeated meas‑ures ANOVA and paired t test.Results: As expected, an increase in the percentage of IL‐4+ CD4+ cells was observed during natural pollen exposure in patients with allergic respiratory syndrome. No significant changes were observed in the production of other cytokines, including Th17 cells, which tended to be lower than in the control population but unchanged during pollen exposure. Introduction of antihistamine treatment led to only moderate changes in cytokine production from CD4 and CD8 T cells. Selective changes in CD8+ T cells were observed during natural pollen exposure including a decrease in transient cells (with features of CD45RA+ and CD45RO+ cells) and a decrease in the percentage of cen‑tral memory cells in the peripheral circulation. Within the CD4 cell group the total percentage of CD45RA positive CD4 cells was increased during pollen exposure.Conclusions: Th1 and Th17 responses are not altered during pollen season but allergen exposure affects T cell activa‑tion and memory cell status in patients with allergic respiratory syndrome.Keywords: Rhinitis, Allergy, Memory cells, Cytokines© 2016 The Author(s). This article is distributed under the terms of the Creative Commons Attribution 4.0 International License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated.Open AccessAllergy, Asthma & Clinical Immunology*Correspondence:  tomaszp.mikolajczyk@uj.edu.pl 1 Translational Medicine Laboratory, Department of Internal and Agricultural Medicine, School of Medicine, Jagiellonian University, Skarbowa 1, 31‑121 Cracow, PolandFull list of author information is available at the end of the articlePage 2 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 BackgroundAllergic rhinitis affects 10–30 % of the global population [1] and it seems that economic growth and industriali-zation will only serve to increase this number, not only due to changes in the living environment [2], but also due to expansion of allergic plants caused by increased carbon dioxide concentration in the air [3]. In the Pol-ish population, clinicians diagnose allergic rhinitis in 30.6 % of adults. Among Polish young adults, 16.7 % suf-fer from seasonal allergic rhinitis [4], which is most fre-quently caused by allergens such as pollens from trees and grass.Symptoms of allergic rhinitis and allergic asthma often coexist and it is postulated that they represent a response to the same allergen from upper and lower airways, together named chronic allergic respiratory syndrome [5]. The same inflammatory response is observed in nasal mucosa of patients with allergic rhinitis and bronchial mucosa of patients with asthma. In both of these situa-tions, infiltration by Th2 cells is present [5].Allergen presentation causes differentiation of T cells into Th2 cells, which produce cytokines stimulating B cells to produce IgE antibodies. These antibodies bind to mast cells and allergens causing a release of media-tors, such as histamine, which are responsible for the symptoms of allergic rhinitis. T cells also take part in the recruitment of eosinophils into the inflammatory site and development of the late phase of allergic reaction [6]. In the allergic reaction Th17 may also play a significant role [7]. Although an increased serum level of IL-17 in aller-gic patients has been described in many studies [8, 9], less is known about changes in Th17 cells caused by natu-ral seasonal allergen exposure. Systemic reaction caused by contact with allergen has been widely investigated in many studies, however, the immunological mechanisms leading to primary and secondary responses still remain unclear.T cells appear to be strongly involved in this process and its subsets may differ depending on antigen stimula-tion. The CD45RA marker is characteristic for naïve cells, which proliferate when stimulated with antigens, while the presence of CD45RO is characteristic for memory cells, which proliferate during re-call antigen stimula-tion [10]. Expression of C–C chemokine receptor type 7 (CCR7, CD197) on memory T cells enables distinguish-ing of central memory T cells (CD45RA− CCR7+), which are able to migrate to the lymph nodes and stimulate dendritic cells, from effector memory T cells (CD45RA− CCR7−), which possess effector functions and can migrate to the inflammatory site [11]. Transcrip-tional activation of dendritic cells caused by interaction with memory T cells and increased T cell proliferation after culturing with allergen-stimulated dendritic cells in patients suffering from allergic rhinitis has been described by Larsson et al. [12]. After secondary stimu-lation, central memory T cells lose their CCR7 receptor and acquire effector function becoming effector memory T cells [11].Although a primary study [11] described the pres-ence of a CD45RA+ effector cell population (CD45RA+ CCR7−) of CD8 cells and lack of this population among a pool of CD4 cells, a newer study revealed the presence of a CD4+ CD45RA+ CCR7− population, which is the most differentiated type [13]. It has been shown that per-centages of these cell subsets may differ depending on antigen persistence and load [13].Allergen-specific naïve and memory T cells differ in allergic and in healthy patients [14]. Changes are also observed depending on whether stimulation is caused by perennial or seasonal allergen. Dust mite-specific cells from mite-allergic patients are mostly of the cen-tral memory phenotype, while specific T cells from birch pollen-allergic patients have features of effector memory cells [15].Several studies have described changes of CD45RO/RA cells in patients with seasonal allergies [16–19], how-ever, less is known about changes in central memory and effector memory cell subsets in these patients. In particu-lar, studies describing the changes caused by pollen expo-sure in T cell subpopulations of patients suffering from allergic rhinitis are required. Interestingly, expression of surface antigens CCR4, CXCR1 and CD62L on memory cells increases during pollen season only in sympto-matic atopic patients, explaining the lack of symptoms in patients with asymptomatic skin sensitization and healthy controls [20].The aim of our study was to determine whether natural seasonal allergen exposure causes changes in the percent-age and immunological status of T cell subsets in patients with allergic respiratory syndrome. To further character-ize activation of T cells in this condition, production of cytokines by these cells was assessed.MethodsStudy groupSixteen adult patients with at least a 1 year-long history of pollen allergy manifested by allergic rhinitis or atopic asthma were recruited into the study (Table  1). Allergy was previously confirmed by skin prick tests and by the presence of specific IgE. Patients involved in the study did not present with symptoms at the beginning of the study. If patients suffered from asthma, the disease had to be well controlled prior to participation in the study. At the beginning of the observation, patients were not tak-ing any antihistamines, although they were permitted to use inhaled glucocorticosteroids or inhaled β2-mimetics. Page 3 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 If a patient had been taking antihistamines prior to the study, treatment was discontinued for at least 2 months before the beginning of observations.Patients with symptoms of perennial allergy or with concomitant allergy to other seasonal allergens with overlapping time of symptom occurrence were excluded from the study. Those suffering from chronic or inflam-matory diseases or undergoing immunotherapy within the past 3 years were also excluded.Blood samples were collected three times from all patients within 1 year: before allergy season (visit 1), dur-ing allergy season immediately following the appearance of symptoms (visit 2) and 2  weeks after the appearance of symptoms (visit 3). At the onset of symptoms (visit 2), after blood sample collection, all patients were started on treatment with new antihistamines. Treatment was dis-continued after symptoms subsided.In the period of high pollen concentration, blood sam-ples collected from 16 healthy controls with no history of allergy, with negative skin prick tests for pollens, not taking steroids, antihistamines, β2-mimetic nor mon-telukast, were also examined (Table  1). Investigation protocol was approved by the Jagiellonian University Bio-ethics Committee, Cracow, Poland (KBET/249/B/2012). Written consent was obtained from all subjects prior to enrollment in the study.Blood sample collectionBlood samples were collected from patients into ethylen-ediaminetetraacetic acid (EDTA) tubes. Whole blood was centrifuged to separate plasma, then peripheral blood mononuclear cells (PBMC) were isolated from the blood by standard gradient centrifugation on Lymphocyte Sep-aration Medium (LSM) 1077 (PAA Laboratories GmbH, Austria).Staining protocolIsolated cells were washed twice with a solution of phos-phate-buffered saline (PBS) with 1  % heat inactivated fetal bovine serum (FBS) from Gibco (Life Technolo-gies, USA) and suspended in this buffer. The amount of PBMC was estimated using a Fuchs-Rosenthal chamber. 5 ×  105 cells were stained with monoclonal antibodies: anti-CD3–PerCP (Clone SK7), anti-CD4–APC (Clone SK3), anti-CD8–APC-H7 (Clone SK1), anti-CD45 RO–PE (Clone UCHL1), anti-CD45 RA–FITC (Clone L48), anti-CCR7(CD197)–PE-Cy7 (Clone 3D12) from BD Bio-sciences (San Jose, CA, USA). After staining for 20 min in the dark at 4 °C, cells were washed with PBS+ 1 %FBS and suspended in 200  μl of this buffer. These prepared cells were collected using a FACS Canto II flow cytom-eter from BD Biosciences (San Jose, CA, USA). Data were analyzed using Flow Jo v10 (Ashland, OR, USA). First, lymphocytes were gated based on forward-scattered and side-scattered light (FSC/SSC). Next, the population of CD3+ cells (T cells) was selected. Among this group, subpopulations of CD4+ and CD8+ T cells were sepa-rated (Additional file 1: Fig. S1a). On CD3+, CD4+ and CD8+ cells presence of CD45RA and CD45RO marker was assessed. T cell subpopulations were also analyzed for presence of naïve (CD45RA+ CCR7+), central mem-ory (CD45RA−CCR7+), effector memory (CD45RA−CCR7−) and CD45RA+ effector (CD45RA+ CCR7−) cells.Assessment of intracellular cytokines1 × 106 PBMC were suspended in RPMI 1600 medium (Gibco, Life Technologies, USA) with 10  % FBS, 200 mM l-glutamine and 5 mg/ml gentamicin (Sigma–Aldrich, Saint Louis, MO, USA) and cultured with Table 1 Clinical characteristics of  the patients and  a con-trol groupAge and specific IgE levels are shown as mean ± SD, other features as number of patientsComorbidity of seasonal allergic rhinitis and asthma was observed in 9 individualsCoexistence of allergy for tree and grass pollen was observed in 9 patientsPatient characteristics Experimental groupControl groupAge 31.8 ± 12.1 31.2 ± 5.3Sex M:9; F:7 M:9; F:7DiseaseAllergic rhinitis 15 (93.8 %) 0Asthma 10 (62.5 %) 0Allergic conjunctivitis 14 (87.5 %) 0Atopic dermatitis 1 (6.25 %) 0Skin prick test positivityAlder 13 (81.3 %) 0Hazel 13 (81.3 %) 0Birch 12 (75.0 %) 0Grass 11 (68.8 %) 0Specific IgE level for skin prick test—positive patients [IU/l]Alder 15.3 ± 19.7 N.A.Hazel 5.5 ± 7.5 N.A.Birch 56.0 ± 39.2 N.A.Grass 43.1 ± 46.4 N.A.Specific IgE level for domi-nant allergen [IU/l]41.0 ± 43.7 N.A.Currently smoking 2 (12.5 %) 1 (6.25 %)TreatmentInhaled steroid 7 (43.8 %) 0Short acting β2‑mimetic 2 (12.5 %) 0Montelukast 2 (12.5 %) 0Long acting β2‑mimetic 1 (6.25 %) 0Page 4 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 Leukocyte Activation Cocktail with BD Golgi Plug from BD Biosciences (San Jose, CA, USA) for 4 h at 37 °C in a 5 % CO2 humidified atmosphere. After this time, cells were washed with PBS+ 1 %FBS and stained with mono-clonal antibodies anti-CD3–PerCP (Clone SK7), anti-CD4–APC (Clone RPA-T4), anti-CD8–APC-H7 (Clone SK1) from BD Biosciences (San Jose, CA, USA). Next, cells were washed with PBS+ 1  %FBS and suspended in Fixation/Permeabilization Solution (BD Biosciences, San Diego, CA, USA). After permeabilization, cells were washed with Perm/Wash/Buffer (BD Biosciences, San Diego, CA, USA) and stained with monoclonal anti-bodies: anti-IFNγ–FITC (Clone B27), anti-IL-17A–PE (Clone N49-653), anti-TNF–FITC (Clone MAb11) and anti-IL-4–PE (Clone 8D4-8). In some cases, isotype controls: IgG1 κ–FITC (Clone MOPC-21) for IFNγ and TNF, IgG1κ–PE (Clone MOPC-21) for IL-17A and IL-4 were used (BD Biosciences, San Jose, CA, USA). All staining and permeabilization were performed for 20  min in the dark at 4  °C. After intracellular staining, cells were washed with Perm/Wash Buffer, suspended in PBS+ 1 %FBS and collected using a FACS Canto II flow cytometer from BD Biosciences (San Jose, CA, USA).StatisticsThe Shapiro–Wilk test was used to test normality of dis-tribution of all analyzed variables. Repeated measures ANOVA was used to test the difference in specific T lymphocyte subpopulations between three visits stud-ied. Subpopulations that significantly differed between three visits were further chosen for paired tests, compar-ing two visits as well as tests comparing a single visit of study and control groups using t test. All tests were per-formed in IBM SPSS Statistics (ver. 23). Results are pre-sented as mean ± SEM. P values <0.05 were considered as significant.ResultsIntracellular cytokine productionInfluence of seasonal allergen exposure on cytokine pro-duction was assessed by intracellular staining of IL-4, TNF, IFNγ and IL-17A. A significant increase in IL-4 was observed in CD4+ cells during pollen season (1.0 vs 2.1 vs 2.0 %) (Fig. 1a). There were no changes in the percent-ages of TNF+ nor IFNγ+ T cells during the visits (Fig. 1a and b). IL-17A was produced by CD4 cells in very small amounts and did not change significantly during pollen season (Fig. 1a).CD 45RA/RONext, to ascertain activation of the immune system caused by seasonal allergens, expression of CD45RA and CD45RO markers in CD4+ and CD8+ cells was investigated (Fig. 2a). The percentage of CD4+ CD45RA positive cells increased in allergic patients during pol-len season from 40.8 % at the beginning of pollen season to 43.7  % 2  weeks after onset of symptoms (P  =  0.03) (Fig. 2b). Among CD8 cells, a decrease in transient cells during pollen season was observed at the beginning of pollen season (15.0  %) and 2  weeks from the onset of symptoms (15.5  %) in comparison to before pollen sea-son (17.7 %) (V1–V2 P = 0.01; V1–V3 P = 0.03) (Fig. 1c). In all three groups, an increase in the percentage of CD45RO cells at the beginning of pollen season with a decrease 2  weeks later was observed, although only in CD3 cells this trend reached statistical significance (V1—32.8 % vs V2—35.1 % vs V3—32.1 %; P respectively 0.01 and 0.004) (data not shown). There were no differences in the percentage of CD45RA and CD45RO cells between allergic patents and the control group.Memory Cell SubsetsTo investigate the influence of allergen exposure on mem-ory cell subsets we determined percentages of naïve, cen-tral memory, effector memory and CD45RA+ effector cells in the group of CD4 and CD8 cells. Allergen expo-sure did not cause statistically significant changes in the group of CD4 memory cells in pollen-sensitive patients, although an increase in the percentage of CD45RA+ effector cells 2  weeks after the onset of symptoms was close to statistical significance (ANOVA P = 0.06) (Fig. 3a and b). In the group of CD8 cells, a decrease in the per-centage of central memory cells was observed during allergen exposure in comparison to the state before pollen season (10.1 vs 8.8 vs 9.1 % P = 0.01) (Fig. 4a and b).T cell subsetsWe also determined whether allergen exposure could influence the percentage of T cells. There were no statis-tically significant differences observed among percent-ages of CD4+ and CD8+ neither between visits nor in comparison with the control group (Additional file  1: Fig. S1b). The CD4/CD8 ratio also remained constant in allergic patients before and in the allergy season and did not differ from the control group.DiscussionWith regard to the increasing number of people suffering from allergies, understanding the mechanisms leading to the complex manifestation of symptoms is important in the search for effective treatment methods. As expected, coexistence of seasonal allergic rhinitis and asthma was observed in more than half of the individuals. Determi-nation of the role of T cells and their subsets in seasonal allergy may be crucial to understanding the mechanism of this reaction.Page 5 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 Natural allergen exposure caused a significant increase in IL-4 production by CD4 cells in pollen-sensitive patients. Our findings confirm the previous observa-tion by Wosinska-Becler et  al. describing an increase of IL-4 during the peak of birch season in comparison with non-pollen season in birch-sensitive patients [21]. In this group of patients a decrease in IFNγ production in comparison with alder season was observed, but no sig-nificant changes were present when compared with non-pollen season, which is also consistent with our results. A study performed in asthmatic children revealed that the percentage of CD4+ cells producing IL-4 and cells producing IFNγ is higher during acute exacerbations than at convalescence [22]. Another study in children with atopic asthma showed an increase in the percent-age of CD4 and CD8 cells producing IL-4 and a decrease in CD4 cells producing IFNγ in comparison with healthy controls, while the percentage of cells producing TNF remained unchanged [23]. In addition, the percentage of CD8 cells producing IL-4 spontaneously was higher in children with asthma in this study. Two other studies comparing patients with asthma and healthy controls did not demonstrate any changes in the percentage of cells producing IL-4. One of these studies reported a lower percentage of CD4 cells producing IFNγ in these patients [24], while the second study observed a higher percent-age of CD4 and CD8 cells producing IFNγ in atopic asthmatic patients [25]. Bias of results showing changes in patients suffering from allergic asthma can be related to the various kinds of allergens that they were sensitive to (i.e. house dust, animals, moulds), while in our study exposition to seasonal allergen was investigated.Allergen provocation outside of pollen season in patients with asthma resulted in a decrease in IL-4+ CD4+ cells. In this study, changes in the number of IFNγ-producing CD4 cells depended on response type. A decrease in IFNγ-producing CD4 cells was observed in patients who presented only with early reaction to the allergen challenge, without late-phase reaction [26].Some studies report an increased percentage of Th17 cells in patients with allergic rhinitis. However, in most of these studies, patients allergic to perennial allergens [27, 28] or sensitive to seasonal and perennial allergens were involved [29]. Another study describes the influence 0 1 2 3 IL-4 percentage of cells within CD4 a  * * b    # # $ 0 10 20 30 40 IFNγ percentage of cells within CD4 V1 V2 V3 CTRL 0 10 20 30 40 IFNγ percentage of cells within CD8 V1 V2 V3 CTRL 0 20 40 TNF percentage of cells within CD4 0 20 40 TNF percentage of cells within CD8 0,0 0,2 0,4 IL-17A percentage of cells within CD4 Fig. 1 Changes in intracellular cytokine production in T cell subsets during pollen season. Isolated PBMCs were stimulated with leukocyte activa‑tion cocktail and were cultured for 4 h. After this time, intracellular production of cytokines was detected in CD4+ T cells (a) and in CD8+ T cells (b). IL‑4 positive or IL‑17A positive T cells (a) and IFNγ positive or TNF positive T cells (a and b) are shown. V1—before allergy season, V2—during allergy season immediately following the appearance of symptoms, V3—2 weeks after onset of symptoms, CTRL—control group; data are shown as mean ± SEM; *P < 0.05  in paired samples t test; #P < 0.05 in unpaired samples t test; $P < 0.05 in repeated measures ANOVA, testing all three patients’ visits. Comparisons of cell populations for pairs of single patients’ visits were performed using paired samples t test, while comparisons of cell populations between single patients visit and control subjects were performed using unpaired samples t testPage 6 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 of perennial allergen challenge by nebulization on Th17 cells [30], however, less is known about changes over time caused by natural seasonal allergen exposure. It was shown that the percentage of IL-17A-producing CD4+ T cells may also depend on polysensitization of the patients and on patient’s sex [29]. Although an increased serum IL-17 level was observed in patients sensitive to peren-nial allergens, pollen allergens did not cause significant changes [29].In our study, we did not observe significant changes in the intracellular production of this cytokine. Our results are in opposition to Ciprandi et al. who describe a higher percentage of Th17 cells in pollen-sensitive allergic rhi-nitis patients than in the healthy controls, however, the control group in this study was very small and compari-son to the state before pollen season was not performed [31].Our findings demonstrate the influence of pollen sea-son on memory cells in patients suffering from allergic respiratory syndrome. We did not observe any changes in CD4+ nor CD8+ T cells caused by natural allergen exposure. Our results are consistent with those of Kalrs-son et al. who have shown an increase in CD4+ cells in patients suffering from allergic rhinitis during provoca-tion but not during natural antigen exposure [32]. After in vitro stimulation with P. pratense, an increased num-ber of circulating allergen-specific CD4+ T cells was seen. In addition, proliferation of CD4+ cells and in some cases, CD8+ cells was observed in grass pollen allergic patients [33]. In pollen-sensitive patients receptor density also changes throughout the year. In these individuals, Monteseirin et al. observed a decrease in the number of CD4+ receptors per cell in the spring [34].Exposure to seasonal allergens affected expression of CD45 RA/RO isoforms in pollen-sensitive patients. We observed an increase in CD4+ CD45RA+ cells 2 weeks from the beginning of allergy season in comparison with the onset of symptoms. These changes were accompa-nied by a decrease in transient CD8 cells during pol-len season. Although presence of the CD45RA marker 0 10 20 30 40 50 60 70 CD45RA CD45RO transient percentage of cells within CD8 V1 V2 V3 CTRL 0 10 20 30 40 50 60 70 CD45RA CD45RO transient percentage of cells within CD4 CD45RA FITC CD45RO PE 8DC4DC%6.81%7.24%9.86%0.04%4.21%7.71* * * a cb$ $ Fig. 2 Changes in CD45RA and CD45RO subpopulations of T cell subsets during pollen season. Distribution of CD45RA and CD45RO marker among CD4+ cells (a and b) and CD8+ cells (a and c) was analyzed. Cytometric example 2 weeks after the onset of symptoms is shown in (a). V1—before allergy season, V2—during allergy season immediately following the appearance of symptoms, V3—2 weeks after the onset of symptoms, CTRL—control group; data are shown as mean ± SEM; *P < 0.05 in paired samples t test; $P < 0.05 in repeated measures ANOVA, testing all three patients’ visits. Comparisons of cell populations for pairs of single patients’ visits were performed using paired samples t test, while comparisons of cell populations between single patients visit and control subjects were performed using unpaired samples t testPage 7 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 is characteristic for naïve cells and CD45RO maker for memory cells, re-call antigen stimulated change of CD4 cells from RA+ to RO+ phenotype is a gradual process during which two transitional subsets co-expressing RA and RO are present: CD45RAbright/RObright, which are present in very small amount, and CD45RAdull/ROdull expressing both isoforms at low level, possessing mixed features of CD45RA+ and CD45RO+ cells. Moreover, CD45RO+ cells under certain conditions can re-acquire the RA marker [35]. Cells co-expressing CD45RA and CD45RO have been described in patients with atopic asthma, and these subsets form 31–46 % of the T helper cells [36]. In our study transient cells formed on aver-age, depending on visit, 15.7–16.6  % of CD4 cells and 15.0–17.7  % of CD8 cells in allergen-sensitive patients and did not differ from the control group. In children with allergic asthma an increase in the absolute number of CD8+ T cells expressing CD45RO is associated with a decrease in percentage, but not in the absolute num-ber of CD4+ CD45RO positive cells when compared with healthy controls [37]. We did not observe any dif-ferences in the percentage of CD4 and CD8 RO positive cells between allergic patients and the control group. Although we have seen an increase in CD3 cells express-ing CD45RO marker at the beginning of allergen season with a decrease 2  weeks later, these changes were not significant either on CD4 or CD8 cells. Similar findings, representing transformation of lymphocytes from naïve into memory type cells caused by contact with allergen, were described previously by Pawlik et al. on CD4 cells, who however, observed an increase in CD4+ 45RO+ lymphocytes in the blood of patients with seasonal symptoms during allergy season [38]. A decrease in the percentage of CD3+ CD45RO+ cells two weeks after 0 10 20 30 40 50 60 naïve central memory effector  memory CD45RA+ effector percentage of cells within CD4 V1 V2 V3 CTRL a b CD45RA FITC CCR7 PE-Cy7 3V2V1V %5.82%8.139.4% 30.3% %7.23%3.337.3% 26.7% %9.92%3.9211.0% 29.7% central memory naïve effector memory CD45RA+ effector  CCR7 PE-Cy7 CD45RA FITC CTRL %1.03%5.52%9.9%5.43CD4 cells Fig. 3 Changes in CD4 memory cell subsets during pollen season. Among CD4 cells the following memory cell subsets were separated: naïve (CD45RA+ CCR7+), central memory (CD45RA− CCR7+), effector memory (CD45 RA− CCR7−), CD45RA+ effector (CD45RA+ CCR7−). Cytometric example (a) and changes in the percentages of the subsets (b) are shown. V1—before allergy season, V2—during allergy season immediately fol‑lowing the appearance of symptoms, V3—2 weeks after onset of symptoms, CTRL—control group; data are shown as mean ± SEMPage 8 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 the onset of symptoms in our study can be explained by migration of CD45RO+ cells into the inflammatory site [39]. The mechanisms of this process are complex and may include various factors such as oxidative stress, which lead to inflammation [40].Investigation of skin biopsies obtained from pollen-allergic patients challenged with intradermal injection of allergen demonstrated increased frequency of memory cells 24 h after challenge in comparison with stimulation with control solution, suggesting a role for these cells in the cutaneous late-phase reaction [41]. Immunocyto-chemical analysis of nasal mucosa of patients suffering from seasonal allergic rhinitis revealed an increase in CD4+ CD45RO+ cells during pollen season [42]. The presence of activated memory T cells in mucosa was also demonstrated using flow cytometry, however, there were no differences between allergic and non-allergic patients. Moreover, these findings were present only at the inflam-matory site and did not correlate with peripheral blood mononuclear cells [43].A recent study demonstrated an increased number of effector/memory T cells (CD4+CD25low) in patients with seasonal allergic rhinitis 6  h after nasal allergen challenge with grass pollen. This study described changes in peripheral blood cells, although allergen challenge was induced only once and may not have accurately reflected the changes caused by natural exposure during allergy season [44]. In patients with allergic rhinitis, the response to provocational exposure may be different from the response during pollen season [32].0 10 20 30 40 50 60 naïve central memory effector  memory CD45RA+ effector percentage of cells within CD8 V1 V2 V3 CTRL a b CD45RA FITC CCR7 PE-Cy7 3V2V1V %7.73%7.2124.0% 25.5% %7.44%6.0120.8% 23.9% %1.44%7.825.1% 22.1% central memory naïve effector memory CD45RA+ effector  * CCR7 PE-Cy7 CD45RA FITC CTRL %9.05%9.6%3.61%9.52CD8 cells *   $ Fig. 4 Changes in CD8 memory cell subsets during pollen season. Among CD8 cells the following memory cell subsets were separated: naïve (CD45RA+ CCR7+), central memory (CD45RA− CCR7+), effector memory (CD45 RA− CCR7−), CD45RA+ effector (CD45RA+ CCR7−). Cytometric example (a) and changes in percentages of the subsets (b) are shown. V1—before allergy season, V2—during allergy season immediately following the appearance of symptoms, V3—2 weeks after onset of symptoms, CTRL—control group; data are shown as mean ± SEM; *P < 0.05 in paired samples t test; $P < 0.05 in repeated measures ANOVA, testing all three patients’ visits. Comparisons of cell populations for pairs of single patients’ visits were performed using paired samples t test, while comparisons of cell populations between single patients visit and control subjects were performed using unpaired samples t testPage 9 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55 We observed a decrease in CD8 central memory cells during pollen season. These changes reflect the differ-entiation of memory cells in the allergic reaction, with CD45RA+ effector cells being the most differentiated type. A non-significant increase in CD45RA+ effector cell subpopulation of CD4 cells appears 2 weeks after the first presentation of symptoms (visit 3) when compared with the measurement performed at the onset of symp-toms (visit 2). This is probably due to the time needed to convert effector memory cells into CD45RA+ effec-tor cells. In this period of time all patients were receiving treatment with new antihistamines, which were shown to be highly effective in relieving symptoms of seasonal allergic rhinitis [45, 46]. This medication was not admin-istered during the previous visit (at the onset of symp-toms) and could have also affected our results. Although the influence of H2-blockers on CD4+ RO+ cells and suppressor cells was previously demonstrated [19], less is known about the influence of new H1-blockers on these cells. However, the effect of the first generation H1-blocker, clemastine, on natural killer and antibody-dependent cellular cytotoxicity activities of lymphocytes have been described [47].ConclusionsIn summary, our data shows that natural seasonal aller-gen exposure in patients with allergic respiratory syn-drome affects T cell activation and their memory status, without altering Th1 and Th17 responses. Additional studies are required to better understand the complexity of cellular reactions in patients with allergic respiratory syndrome.AbbreviationsCCR: C–C chemokine receptor; CD: cluster of differentiation; EDTA: ethylenedi‑aminetetraacetic acid; FBS: fetal bovine serum; FSC: forward‑scattered; IFNγ: interferon γ; IgE: immunoglobulin E; IL: interleukin; LSM: lymphocyte separa‑tion medium; PBMC: peripheral blood mononuclear cells; PBS: phosphate‑buffered saline; SSC: side‑scattered; Th: T helper; TNF: tumor necrosis factor.Authors’ contributionsAS performing flow cytometry measurements, cytometric analysis of acquired data, interpretation of data, preparation of the manuscript, table and figures. BJH study design, patient recruitment and clinical assessment, acquisition of clinical data, revising the manuscript critically for important intellectual Additional fileAdditional file 1: Fig. 1. T cell populations in allergic patients and in the control group. Lymphocytes were gated based on forward‑scattered and side‑scattered light (FSC/SSC). Next, the population of CD3+ cells was selected. Among this group, subpopulations of CD4+ and CD8+ cells were separated (a). Next, changes in the T cell populations in allergic patients during pollen season and comparison with the control group were determined (b). V1—before allergy season, V2—during allergy season immediately following the appearance of symptoms, V3—2 weeks after onset of symptoms, CTRL—control group; data are shown as mean±SEM.content. GO patient recruitment and clinical assessment. GW acquisition of clinical data. MS statistical analysis of data. AS performing flow cytometry measurements. PM performing flow cytometry measurements. JM performing flow cytometry measurements. TS patient recruitment and clinical assess‑ment, revising the manuscript critically for important intellectual content. MCG revising the manuscript critically for important intellectual content. TPM interpretation of data, revising the manuscript critically for important intellec‑tual content, general supervision of the research group. All authors read and approved the final manuscript.Author details1 Translational Medicine Laboratory, Department of Internal and Agricultural Medicine, School of Medicine, Jagiellonian University, Skarbowa 1, 31‑121 Cra‑cow, Poland. 2 Institute of Cardiovascular and Medical Sciences, University of Glasgow, Glasgow, UK. 3 Department of Dental Prophylaxis and Experimen‑tal Dentistry, Dental School, Jagiellonian University, Cracow, Poland. 4 Oral Sciences Research Group, Glasgow Dental School, School of Medicine, College of Medical, Veterinary and Life Sciences, University of Glasgow, Glasgow, UK. 5 Institute of Infection, Immunity and Inflammation, University of Glasgow, Glasgow, UK. AcknowledgementsThe authors would like to thank Kevin Luc, MD for professional editing and proofreading of the manuscript.Competing interestsThe authors declare that they have no competing interests.Availability of data and materialsThe dataset supporting the conclusions of this article will be available to the Editors and Reviewers upon request.Ethics approval and consent to participateInvestigation protocol was approved by the Jagiellonian University Bioethics Committee, Cracow, Poland (KBET/249/B/2012). Written consent was obtained from all subjects prior to enrollment in the study.FundingThis work was supported by a postdoctoral fellowship Mobilnosc Plus (1280/MOB/IV/2015/0 to TM and 1079/MOB/2013/0 and 1079/1/MOB/13/2014/0 to AS) from the Polish Ministry of Science and ImmunoTension from the European Commission (project reference 631773).Received: 12 May 2016   Accepted: 4 October 2016References 1. Pawankar R, Canonica GW, Holgate ST, Lockey RF: WAO White Book on Allergy 2011–2012: Executive Summary. 2011. 2. Li CW, de Chen H, Zhong JT, Lin ZB, Peng H, Lu HG, Yang Y, Yin J, Li TY. Epi‑demiological characterization and risk factors of allergic rhinitis in the gen‑eral population in Guangzhou City in china. PLoS One. 2014;9:e114950. 3. Ihler F, Canis M. Ragweed‑induced allergic rhinoconjunctivitis: current and emerging treatment options. J Asthma Allergy. 2015;8:15–24. 4. Samolinski B, Sybilski AJ, Raciborski F, Tomaszewska A, Samel‑Kowalik P, Walkiewicz A, Lusawa A, Borowicz J, Gutowska‑Slesik J, Trzpil L, et al. Preva‑lence of rhinitis in Polish population according to the ECAP (Epidemiology of Allergic Disorders in Poland) study. Otolaryngol Pol. 2009;63:324–30. 5. Togias A. Rhinitis and asthma: evidence for respiratory system integration. J Allergy Clin Immunol. 2003;111:1171–83 (quiz 84). 6. Dullaers M, De Bruyne R, Ramadani F, Gould HJ, Gevaert P, Lambrecht BN. The who, where, and when of IgE in allergic airway disease. J Allergy Clin Immunol. 2012;129:635–45. 7. Liu Y, Zeng M, Liu Z. Th17 response and its regulation in inflammatory upper airway diseases. Clin Exp Allergy. 2015;45:602–12. 8. Ciprandi G, De Amici M, Murdaca G, Fenoglio D, Ricciardolo F, Marseglia G, Tosca M. Serum interleukin‑17 levels are related to clinical severity in allergic rhinitis. Allergy. 2009;64:1375–8.Page 10 of 10Schramm et al. Allergy Asthma Clin Immunol  (2016) 12:55  9. Qiu Q, Lu H, Lu C, Chen S, Han H. Variations in TGF‑beta, IL‑10, and IL‑17 after specific immunotherapy and correlations with symptoms in patients with allergic rhinitis. J Investig Allergol Clin Immunol. 2012;22:311–2. 10. Plebanski M, Saunders M, Burtles SS, Crowe S, Hooper DC. Primary and secondary human in vitro T‑cell responses to soluble antigens are mediated by subsets bearing different CD45 isoforms. Immunology. 1992;75:86–91. 11. Sallusto F, Lenig D, Forster R, Lipp M, Lanzavecchia A. Two subsets of memory T lymphocytes with distinct homing potentials and effector functions. Nature. 1999;401:708–12. 12. Larsson K, Lindstedt M, Lundberg K, Dexlin L, Wingren C, Korsgren M, Greiff L, Borrebaeck CA. CD4+ T cells have a key instructive role in edu‑cating dendritic cells in allergy. Int Arch Allergy Immunol. 2009;149:1–15. 13. Harari A, Vallelian F, Pantaleo G. Phenotypic heterogeneity of antigen‑specific CD4 T cells under different conditions of antigen persistence and antigen load. Eur J Immunol. 2004;34:3525–33. 14. Kinnunen T, Nieminen A, Kwok WW, Narvanen A, Rytkonen‑Nissinen M, Saarelainen S, Taivainen A, Virtanen T. Allergen‑specific naive and mem‑ory CD4+ T cells exhibit functional and phenotypic differences between individuals with or without allergy. Eur J Immunol. 2010;40:2460–9. 15. Wambre E, Bonvalet M, Bodo VB, Maillere B, Leclert G, Moussu H, Von Hofe E, Louise A, Balazuc AM, Ebo D, et al. Distinct characteristics of seasonal (Bet v 1) vs. perennial (Der p 1/Der p 2) allergen‑specific CD4(+) T cell responses. Clin Exp Allergy. 2011;41:192–203. 16. Smith‑Norowitz TA, Silverberg J, Norowitz KB, Bluth MH, Chice S, Joks R, Nowakowski M, Durkin HG. Two distinct T cell subsets, CD4+ and CD8+ CD60+, and their cytokines are required for in vitro induction of human ragweed‑specific memory IgE responses. J Immunol. 2008;181:4761–9. 17. Palma‑Carlos AG, Palma‑Carlos ML, Santos MC, Melo A. Cytokines and adhesion molecules in respiratory allergy. Allerg Immunol (Paris). 1995;27:178–81. 18. Carlos AG, Carlos ML, Santos MA, Melo A. Cells and cytokines in pollinosis. Allerg Immunol (Paris). 1998;30:204–6. 19. Testa B, Mesolella C, Testa D, Mesolella M, Testa F, D’Alessio O. Sup‑pressor T cell subsets in allergic rhinitis patients. Acta Otolaryngol. 1996;116:876–82. 20. Assing K, Bodtger U, Poulsen LK. Seasonal dynamics of chemokine recep‑tors and CD62L in subjects with asymptomatic skin sensitization to birch and grass pollen. Allergy. 2006;61:759–68. 21. Wosinska‑Becler K, Plewako H, Hakansson L, Rak S. Cytokine production in peripheral blood cells during and outside the pollen season in birch‑aller‑gic patients and non‑allergic controls. Clin Exp Allergy. 2004;34:123–30. 22. Kuo ML, Huang JL, Yeh KW, Li PS, Hsieh KH. Evaluation of Th1/Th2 ratio and cytokine production profile during acute exacerbation and convalescence in asthmatic children. Ann Allergy Asthma Immunol. 2001;86:272–6. 23. Machura E, Mazur B, Rusek‑Zychma M, Barc‑Czarnecka M. Cytokine pro‑duction by peripheral blood CD4+ and CD8+ T cells in atopic childhood asthma. Clin Dev Immunol. 2010;2010:606139. 24. Wong CK, Ho CY, Ko FW, Chan CH, Ho AS, Hui DS, Lam CW. Proinflamma‑tory cytokines (IL‑17, IL‑6, IL‑18 and IL‑12) and Th cytokines (IFN‑gamma, IL‑4, IL‑10 and IL‑13) in patients with allergic asthma. Clin Exp Immunol. 2001;125:177–83. 25. Cho SH, Stanciu LA, Begishivili T, Bates PJ, Holgate ST, Johnston SL. Peripheral blood CD4+ and CD8+ T cell type 1 and type 2 cytokine production in atopic asthmatic and normal subjects. Clin Exp Allergy. 2002;32:427–33. 26. Muratov V, Barck C, Bylin G, Kallstrom E, Hallden G, van Hage M, Elvin K, Lundahl J. Allergen challenge alters intracellular cytokine expression. Scand J Immunol. 2005;62:161–7. 27. Xuekun H, Qintai Y, Yulian C, Gehua Z. Correlation of gammadelta‑T‑cells, Th17 cells and IL‑17 in peripheral blood of patients with allergic rhinitis. Asian Pac J Allergy Immunol. 2014;32:235–9. 28. Li CW, Lu HG, de Chen H, Lin ZB, de Wang Y, Li TY. In vivo and in vitro studies of Th17 response to specific immunotherapy in house dust mite‑induced allergic rhinitis patients. PLoS One. 2014;9:e91950. 29. Tsvetkova‑Vicheva VM, Gecheva SP, Komsa‑Penkova R, Velkova AS, Lukanov TH. IL‑17 producing T cells correlate with polysensitization but not with bronchial hyperresponsiveness in patients with allergic rhinitis. Clin Transl Allergy. 2014;4:3. 30. Bajoriuniene I, Malakauskas K, Lavinskiene S, Jeroch J, Sakalauskas R. Th17 response to Dermatophagoides pteronyssinus is related to late‑phase airway and systemic inflammation in allergic asthma. Int Immunophar‑macol. 2013;17:1020–7. 31. Ciprandi G, Filaci G, Battaglia F, Fenoglio D. Peripheral Th‑17 cells in aller‑gic rhinitis: new evidence. Int Immunopharmacol. 2010;10:226–9. 32. Karlsson MG, Hellquist HB. Phenotype switch and activation of T lympho‑cytes in patients with allergic rhinitis. ORL J Otorhinolaryngol Relat Spec. 1994;56:166–72. 33. Rimaniol AC, Garcia G, Till SJ, Capel F, Gras G, Balabanian K, Emilie D, Humbert M. Evaluation of CD4+ T cells proliferating to grass pollen in seasonal allergic subjects by flow cytometry. Clin Exp Immunol. 2003;132:76–80. 34. Monteseirin J, Guardia P, Delgado J, Llamas E, Palma J, Conde J. Variations of the cellular antigens CD4 and CD8 in pollinic patients during the spring. Allergol Immunopathol (Madr). 1994;22:9–17. 35. Hamann D, Baars PA, Hooibrink B, van Lier RW. Heterogeneity of the human CD4+ T‑cell population: two distinct CD4+ T‑cell subsets characterized by coexpression of CD45RA and CD45RO isoforms. Blood. 1996;88:3513–21. 36. Lara‑Marquez ML, Deykin A, Krinzman S, Listman J, Israel E, He H, Chris‑tiani DC, Perkins DL, Finn PW. Analysis of T‑cell activation after bronchial allergen challenge in patients with atopic asthma. J Allergy Clin Immunol. 1998;101:699–708. 37. Machura E, Mazur B, Pieniazek W, Karczewska K. Expression of naive/memory (CD45RA/CD45RO) markers by peripheral blood CD4+ and CD8+ T cells in children with asthma. Arch Immunol Ther Exp (Warsz). 2008;56:55–62. 38. Pawlik I, Mackiewicz U, Lacki JK, Wiktorowicz K, Konys J. The differences in the expression of CD45 isoforms on peripheral blood lymphocytes derived from patients with seasonal or perennial atopic allergy. Tohoku J Exp Med. 1997;182:1–8. 39. Werfel S, Massey W, Lichtenstein LM, Bochner BS. Preferential recruitment of activated, memory T lymphocytes into skin chamber fluids during human cutaneous late‑phase allergic reactions. J Allergy Clin Immunol. 1995;96:57–65. 40. Konior A, Schramm A, Czesnikiewicz‑Guzik M, Guzik TJ. NADPH oxidases in vascular pathology. Antioxid Redox Signal. 2014;20:2794–814. 41. Lessin SR, Benoit BM, Li G, Moskovitz A, Zweiman B. Quantitative analysis of T‑cell receptor beta variable‑gene usage in cutaneous late‑phase reactions: implications for T‑lymphocyte recruitment in cutaneous inflam‑mation. Clin Diagn Lab Immunol. 1999;6:85–8. 42. Karlsson MG, Davidsson A, Hellquist HB. Increase in CD4+ and CD45RO+ memory T cells in the nasal mucosa of allergic patients. APMIS. 1994;102:753–8. 43. Wolfram C, Rasche C, Audring H, Wahls M, Worm M. Isolation and phe‑notypic characterization of mucosal nasal lymphocytes by direct ex vivo analysis. Eur Arch Otorhinolaryngol. 2009;266:677–83. 44. Shamji MH, Bellido V, Scadding GW, Layhadi JA, Cheung DK, Calderon MA, Asare A, Gao Z, Turka LA, Tchao N, et al. Effector cell signature in periph‑eral blood following nasal allergen challenge in grass pollen allergic individuals. Allergy. 2015;70:171–9. 45. Kuna P, Bachert C, Nowacki Z, van Cauwenberge P, Agache I, Fouquert L, Roger A, Sologuren A, Valiente R. Efficacy and safety of bilastine 20 mg compared with cetirizine 10 mg and placebo for the symptomatic treat‑ment of seasonal allergic rhinitis: a randomized, double‑blind, parallel‑group study. Clin Exp Allergy. 2009;39:1338–47. 46. Bachert C, Kuna P, Sanquer F, Ivan P, Dimitrov V, Gorina MM, van de Heyning P, Loureiro A. Comparison of the efficacy and safety of bilastine 20 mg vs desloratadine 5 mg in seasonal allergic rhinitis patients. Allergy. 2009;64:158–65. 47. Nair MP, Schwartz SA. Effect of histamine and histamine antagonists on natural and antibody‑dependent cellular cytotoxicity of human lympho‑cytes in vitro. Cell Immunol. 1983;81:45–60.",
    "Link": "https://core.ac.uk/download/74230778.pdf"
}