{
    "Title": "Renewable Energy Target review",
    "Authors": "Climate Change Authority",
    "Year": "No year available",
    "Abstract": "SUMMARY \n\nThis is the Climate Change Authority\\u27s second review of the Renewable Energy Target (RET). The RET targets reductions in greenhouse gas emissions from the electricity sector and thereby contributes significantly to reducing Australia\\u27s overall emissions.\n\nIn its 2012 review of the RET, the Authority found that the RET was stimulating considerable investment in renewable energy and argued that a stable and predictable policy was essential to sustain this investment. It concluded that no major changes were warranted to the overall RET design, but suggested some minor operational changes.\n\nThe uncertain future of the Authority until recently has limited the time available to conduct this review. Largely for that reason, the Authority has focused on what, it its view, are the most important issues. The Authority has also drawn on both its 2012 Authority review, and on the review conducted this year by a panel headed by Mr Dick Warburton AO LVO.\n\nThe RET and Australia\\u27s emissions reduction goals \n\nIn 2010, when the Large-scale Renewable Energy Target (LRET) was set at 41,000 GWh, it was estimated that this contribution, with contributions from the Small-scale Renewable Energy Scheme (SRES) and other pre-existing renewables (notably hydro), would together represent at least 20 per cent of Australia’s (then) projected total electricity demand in 2020. Given that electricity accounts for approximately one-third of Australia’s emissions of greenhouse gases, renewable sources were seen as making a significant contribution to Australia’s broader emissions reduction goals.\n\nReducing emissions in the electricity sector plays a pivotal role in climate change policies around the world. Unchecked climate change is widely seen as posing serious risks for the Australian community and its economy. Together with the broader international community, Australia has agreed to a goal of limiting global warming to no more than 2 degrees Celsius above pre-industrial levels to avoid the worst impacts of climate change. This requires concerted action by all countries— including Australia—to reduce their greenhouse gas emissions. The RET, as currently legislated, is a significant part of Australia’s policy response to that challenge.\n\nThe RET arrangements were envisaged to deliver ‘at least 20 per cent’ of Australia’s electricity from renewable sources by 2020 and are projected to reduce Australia\\u27s emissions by 58 million tonnes of carbon dioxide equivalent (Mt CO2-e) over 2015–20, and by much larger amounts in later periods.\n\nThe RET arrangements are not perfect but, in the Authority’s view, they are effective in reducing emissions (at reasonable cost) in the centrally important electricity sector. Given the absence of effective alternative measures bearing upon this sector, the Authority does not favour any significant scaling back of the 2020 LRET target of 41,000 GWh",
    "Keywords": "No keywords available",
    "Publisher": "Climate Change Authority",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n  \n \nDECEMBER  \n2014 REPORT \nRENEWABLE ENERGY \nTARGET REVIEW \n Published by the Climate Change Authority \nwww.climatechangeauthority.gov.au \nISBN: 978-0-9925422-3-8 \n© Commonwealth of Australia 2014 \nThis work is licensed under the Creative Commons Attribution 3.0 Australia Licence. To view a copy \nof this license, visit http://creativecommons.org/licenses/by/3.0/au \nThe Climate Change Authority asserts the right to be recognised as author of the original material in \nthe following manner: \n or  \n© Commonwealth of Australia (Climate Change Authority) 2014. \nIMPORTANT NOTICE – PLEASE READ \nThis document is produced for general information only and does not represent a statement of the \npolicy of the Commonwealth of Australia. The Commonwealth of Australia and all persons acting for \nthe Commonwealth preparing this report accept no liability for the accuracy of or inferences from the \nmaterial contained in this publication, or for any action as a result of any person’s or group’s \ninterpretations, deductions, conclusions or actions in relying on this material. \n  \n  \nREPORT: 2014 RET REVIEW  | 3 \n ACKNOWLEDGEMENTS \nThe Authority would like to thank the people and organisations who contributed time and expertise to \nthis review and in the process enhanced the quality of the review.  \nVarious government departments and public agencies have also assisted the work of the Authority, \nincluding the Department of the Environment, Clean Energy Regulator, Australian Energy Market \nOperator, Australian Energy Market Commission, Clean Energy Finance Corporation and \nDepartment of Industry.  \nOver the course of the review, the Authority has received submissions from individuals, environment \norganisations, electricity generators and retailers, business and electricity sector peak bodies, and \nelectricity sector investors.  \n \n  \n4 | REPORT: 2014 RET REVIEW \n \n CONTENTS \nAcknowledgements 4 \nSummary      7 \nConclusions and recommendations 10 \nChapter 1. About this review 12 \n1.1. The Climate Change Authority 12 \n1.2. Approach and context 12 \n1.3. Scope of review and report structure 13 \n1.4. Consultation 14 \nChapter 2. The Renewable Energy Target and Australia's emissions reduction task 15 \n2.1. Introduction 15 \n2.2. The Renewable Energy Target—its operation and impacts 16 \n2.3. Australia's emissions reduction task 21 \n2.4. The role of the electricity sector 22 \n2.5. Is the RET an appropriate policy instrument? 25 \nChapter 3. The Large-scale Renewable Energy Target 30 \n3.1. Feasibility of the current Large-scale Renewable Energy Target 30 \n3.2. Case for adjusting the Large-scale Renewable Energy Target 37 \n3.3. Exemptions for emissions-intensive, trade-exposed industries 41 \n3.4. The Renewable Energy Target after 2020 44 \nChapter 4. The Small-scale Renewable Energy Scheme 45 \n4.1. The Authority's 2012 conclusions and subsequent developments 45 \n4.2. Impacts of the SRES 48 \n4.3. SRES assistance for solar PV and value for money 51 \n4.4. Conclusions on assistance for PV under the SRES 52 \nChapter 5. Other issues for the review 54 \n5.1. Diversity of access and uptake 54 \n5.2. Future statutory reviews 55 \nAppendix A Public consultation 56 \nAppendix B Requirements for Authority Renewable Energy Target reviews 57 \nAppendix C Outcomes of previous reviews 59 \nGlossary      65 \nAbbreviations and acronyms 70 \nReferences     73 \n \n  \nREPORT: 2014 RET REVIEW  | 5 \n Figures \nFigure 1 Proposed re-phase for LRET targets 8 \nFigure 2 Generation by fuel source, Australia, 2001–2013 18 \nFigure 3 Share of renewables in Australian electricity generation, 2001–2013 19 \nFigure 4 Generation and displacement from solar PV and hot water, 2001–2013 19 \nFigure 5 Changes in emissions intensity of Australia's electricity supply to 2050—\n2 and 3 degree scenarios 23 \nFigure 6 Australia's current and projected share of renewables in electricity generation to \n2050, various scenarios 24 \nFigure 7 Profit by generator type with and without the RET, 2015–2040 28 \nFigure 8 Large fossil fuel power stations acquired or commissioned, 2009–2014 29 \nFigure 9 Annual LRET targets 2001–2030 37 \nFigure 10 Proposed re-phase for LRET targets 40 \nFigure 11 Emissions intensity and electricity intensity of selected activities eligible for \npartial exemptions from RET costs 43 \nFigure 12 Trends in Australian PV system costs, 2000–2013 46 \nFigure 13 Share of installed PV capacity by system size, 2009–2014 47 \nFigure 14  Options for an accelerated phase-out of PV assistance 53 \n \nTables \nTable 1 Projected share of renewables in 2020, different RET reviews 17 \nTable 2 Estimates of the cost of emissions reductions of the RET from ACIL Allen \nmodelling 20 \nTable 3 Large-scale renewables project pipeline 31 \nTable 4 Illustrative re-phase of the 2020 LRET target—two examples 41 \nTable 5 Submissions received 56 \n \nBoxes \nBox 1 ‘At least 20 per cent' and the 41,000 GWh target 17 \nBox 2 Comparing commissioned modelling of the RET 34 \nBox 3 Treatment of commercial-scale PV in the RET 49 \nBox 4 Estimating the cost-effectiveness of assisting PV under the SRES 52 \n \n6 | REPORT: 2014 RET REVIEW \n \n SUMMARY \nThis is the Climate Change Authority's second review of the Renewable Energy Target (RET). The \nRET targets reductions in greenhouse gas emissions from the electricity sector and thereby \ncontributes significantly to reducing Australia's overall emissions. \nIn its 2012 review of the RET, the Authority found that the RET was stimulating considerable \ninvestment in renewable energy and argued that a stable and predictable policy was essential to \nsustain this investment. It concluded that no major changes were warranted to the overall RET \ndesign, but suggested some minor operational changes.  \nThe uncertain future of the Authority until recently has limited the time available to conduct this \nreview. Largely for that reason, the Authority has focused on what, it its view, are the most important \nissues. The Authority has also drawn on both its 2012 Authority review, and on the review conducted \nthis year by a panel headed by Mr Dick Warburton AO LVO.  \nThe RET and Australia's emissions reduction goals \nIn 2010, when the Large-scale Renewable Energy Target (LRET) was set at 41,000 GWh, it was \nestimated that this contribution, with contributions from the Small-scale Renewable Energy Scheme \n(SRES) and other pre-existing renewables (notably hydro), would together represent at least \n20 per cent of Australia’s (then) projected total electricity demand in 2020. Given that electricity \naccounts for approximately one-third of Australia’s emissions of greenhouse gases, renewable \nsources were seen as making a significant contribution to Australia’s broader emissions reduction \ngoals. \nReducing emissions in the electricity sector plays a pivotal role in climate change policies around the \nworld. Unchecked climate change is widely seen as posing serious risks for the Australian \ncommunity and its economy. Together with the broader international community, Australia has \nagreed to a goal of limiting global warming to no more than 2 degrees Celsius above pre-industrial \nlevels to avoid the worst impacts of climate change. This requires concerted action by all countries—\nincluding Australia—to reduce their greenhouse gas emissions. The RET, as currently legislated, is a \nsignificant part of Australia’s policy response to that challenge. \nThe RET arrangements were envisaged to deliver ‘at least 20 per cent’ of Australia’s electricity from \nrenewable sources by 2020 and are projected to reduce Australia's emissions by 58 million tonnes of \ncarbon dioxide equivalent (Mt CO2-e) over 2015–20, and by much larger amounts in later periods. \nThe RET arrangements are not perfect but, in the Authority’s view, they are effective in reducing \nemissions (at reasonable cost) in the centrally important electricity sector. Given the absence of \neffective alternative measures bearing upon this sector, the Authority does not favour any significant \nscaling back of the 2020 LRET target of 41,000 GWh. \nREPORT: 2014 RET REVIEW  | 7 \n Possible extension of end year for the Large-scale Renewable Energy Target \nIn its 2012 review, the Authority considered the feasibility of achieving the 2020 LRET target. It \nconcluded that the task was challenging but could be met, provided there was ongoing confidence on \nthe part of renewables investors and assuming that the carbon price remained in place. Since then, \nconfidence in the industry has waned and now investment has tapered off, on the back of the erosion \nof bipartisan support, continuing uncertainty about possible changes and the repeal of the carbon \nprice. \nConfidence within the industry that bipartisan support for the LRET can be restored quickly in a \nconvincing manner is essential to have a strong chance of achieving the 2020 goal of 41,000 GWh. \nAt this time this is looking rather problematic. \nAnother change which has occurred since the 2012 review is that the projected demand for electricity \nin the National Electricity Market in 2020 has declined by about 16 per cent. This would imply a \nsomewhat greater adjustment on the part of incumbent generators than was previously envisaged. \nHaving regard to these various changes—and to upholding the credibility of the present LRET \ntarget—the Authority recommends that the present target be preserved but the current 2020 \ntimeframe for achieving it be extended by, say, up to three years (Figure 1). As discussed in the \nreport, two consequential changes would flow from the adoption of this recommendation: \n• the annual LRET targets should be re-phased after 2017  \n• to assist delayed projects to recoup their costs, the end date for the LRET would need to be \nextended by at least the same number of years as the 2020 target was deferred. \nFIGURE 1 PROPOSED RE-PHASE FOR LRET TARGETS \n \nSource: Climate Change Authority \n8 | REPORT: 2014 RET REVIEW \n \n Exemptions \nExemptions from RET costs are provided to some business activities based on their overall \nemissions intensity, regardless of whether those emissions are related to electricity use. Providing \nassistance with electricity costs to businesses that are not particularly electricity intensive leads to \nanomalies and places greater costs onto non-exempt electricity users. If broadening of assistance is \nconsidered, it should be based on need, the best measure of which in this context is electricity \nintensity. \nThe role of the RET after 2020 \nThe challenges of climate change are ongoing and Australia will need to pursue policies capable of \nreducing its emissions well into future. \nThe government proposes to set Australia's post-2020 emissions reduction targets in the first half of \n2015. \nThe Authority noted in its 2012 review that the RET was not a ‘first best’ approach to reducing \nemissions in the electricity sector. A more comprehensive approach that encouraged or discouraged \ndifferent types of generation on the basis of their emissions intensity would be better in this sector in \nthe long term. In the absence of such an approach, however, the Authority believes that increases in, \nand extensions of, the existing RET targets should remain an option in the period beyond 2020, as \nshould expanding arrangements to cover a wider set of technologies. \nRooftop solar under the Small-scale Renewable Energy Scheme \nThe small-scale solar photovoltaic (PV) industry has been very successful in installing rooftop solar \nsystems for Australian households, community groups and small businesses. Assistance provided \nunder the SRES has encouraged this growth but, as costs have fallen, the case for maintaining \ncurrent levels of support has become less compelling. Some evidence also suggests that subsidising \nsmall-scale PV at these levels is a relatively expensive way of reducing emissions from the electricity \nsector. \nThat said, the cost impacts on electricity consumers are modest and the gradual phase-out of the \nscheme is to commence shortly. Any more rapid phase-out should be designed to avoid disruptive \ncycles in the industry. \nREPORT: 2014 RET REVIEW  | 9 \n CONCLUSIONS AND RECOMMENDATIONS \nCONCLUSIONS NUMBER PAGE \nSubstantial reductions in electricity sector emissions over the coming decades—\nincluding through greater deployment of renewables—must be a key focus for \nAustralia in playing its part in reducing global emissions and the risks of \ndangerous climate change. \nC 1 25 \nThe Renewable Energy Target arrangements are currently the primary policy \ninstruments for electricity sector decarbonisation, and no more cost-effective and \nscalable measures are in prospect at this time. Their overall impacts on \nelectricity consumers are quite modest, and are mitigated through the provision \nof targeted assistance. \nC 2 29 \nIf any further exemptions from electricity costs under the RET are to be granted, \nthis should be on the basis of electricity intensity, rather than emissions intensity. \nC 3 43 \nSubsidising household PV under the SRES is a relatively expensive way to \nreduce emissions in the electricity sector. The Authority, however, has not \nrecommended any changes, largely because the SRES assistance will shortly \nbegin to phase out, and the overall costs are relatively modest. \nC 4 53 \nNo changes should be made to the Renewable Energy Target framework to \npromote diversity of renewable technologies at this time. \nC 5 55 \nIn the interest of maintaining investor confidence in the industry, the frequency of \nstatutory reviews of the RET should be changed from every two years to every \nfour years. For the same reason, if bipartisan agreement were to be reached on \nany revisions to the current 2020 LRET target, those revised arrangements \nshould be outside the scope of future reviews. \nC 6 55 \n \n10 | REPORT: 2014 RET REVIEW \n \n RECOMMENDATIONS NUMBER PAGE \nGiven the sharp decline in investor confidence, the resulting slowdown in \ninvestment, and the further reduction in projected electricity demand, the \ngovernment should: \n• defer the 2020 target for the LRET by, say, up to three years and \n• extend the scheme as a whole by at least the same amount of time, with a \nview to providing sufficient time for projects to recover their costs. \nGiven the large overhang of certificates, there is no case to reduce the annual \ntargets until after 2017. \nR.1 41 \nOver the longer term increased recourse to renewables in electricity generation \nis essential to Australia’s efforts to reduce its total greenhouse gas emissions. In \nthe absence of effective alternatives, RET arrangements will have to carry much \nof this burden, so consideration should be given—at the appropriate time—to the \nnature and timeframe of possible RET arrangements in the post 2020 period. In \nparticular, the government should consider increasing and extending targets, \nand expanding arrangements to cover a wider set of technologies. \nR.2 44 \nREPORT: 2014 RET REVIEW  | 11 \n CHAPTER 1. ABOUT THIS REVIEW \nThis chapter outlines the scope and context of the Climate Change Authority’s 2014 \nRenewable Energy Target (RET) review. It provides information about the Authority and \nits approach to the review. \n1.1. THE CLIMATE CHANGE AUTHORITY \nThe Climate Change Authority ('Authority') is an independent statutory agency, established to \nprovide expert advice on Australian climate change policy, including through a scheduled series of \nreviews of climate programs and legislation.  \nThe Authority currently comprises a Chair (Mr Bernie Fraser) and four members with expertise \nincluding in climate science, economics, and public policy. Its work is guided by a set of principles \nunder the Climate Change Authority Act 2011 (Cth), which requires the Authority to have regard to \nthe following matters: \n• economic efficiency \n• environmental effectiveness \n• equity \n• the public interest \n• the impact on households, business, workers and communities \n• the development of an effective global response to climate change \n• Australia’s foreign policy and trade objectives  \n• any additional principles the Authority considers relevant.  \n1.2. APPROACH AND CONTEXT \nThe Authority's requirements for reviewing the RET are set out in the Renewable Energy (Electricity) \nAct 2000 (Cth) (the REE Act) and Climate Change Authority Act 2011 (Cth) (see Appendix B). Any \nrecommendations must be consistent with the objects of the REE Act (s. 3) which are to: \n• encourage the additional generation of electricity from renewable sources \n• reduce emissions of greenhouse gases in the electricity sector \n• ensure that renewable energy sources are ecologically sustainable. \nThe Authority reviewed the RET in 2012. In that review the Authority emphasised the role of the RET \nin reducing emissions and the importance of a stable and predictable policy environment to its \nsuccess. It concluded that no major changes were warranted to the overall scheme, but suggested \nsome minor operational changes.  \n12 | REPORT: 2014 RET REVIEW \n \nThe Authority conducted its 2012 review against the policy backdrop existing at that time. Since then, \nsignificant changes have occurred. In particular, the carbon pricing mechanism has been repealed \nand the outlook for electricity demand is more subdued than it was in 2012.  \nThe government initiated a new review of the RET in 2014 by a panel headed by \nMr Dick Warburton AO LVO, and supported by a secretariat located within the Department of \nthe Prime Minister and Cabinet. The report of the Expert Panel (hereafter, the 'Warburton review' \nreport) was released in August 2014. The review concluded that the cost of the RET outweighed its \nbenefits and that significant change was required. The review recommended that: \n• the Large-scale Renewable Energy Target (LRET) be either closed to new entrants or modified \nso that targets to 2020 are set one year in advance and increase by half of projected additional \nelectricity demand in that year.  \n• the Small-scale Renewable Energy Scheme (SRES) be either terminated immediately or phased \nout more rapidly (by 2020 rather than 2030). \nA full list of the Authority's 2012 recommendations and those of the 2014 Warburton review are at \nAppendix C. Consistent with its 2012 report and in line with its legislative requirements, the \nAuthority's 2014 RET review pays particular attention to: \n• the objective of reducing emissions (both now and in the longer term)  \n• the research demonstrating the crucial role that decarbonisation of the electricity sector will play \nas Australia and the world move to a low-emissions economy.   \nThe Authority concluded in its 2012 review that two-yearly reviews of the RET risked undermining \npolicy stability and investment in the sector and recommended that they occur only every four years \n(CCA 2012, p. 39); this recommendation has not been implemented and the Authority's statutory \nobligation to conduct this review remains in place.  \n1.3. SCOPE OF REVIEW AND REPORT STRUCTURE \nThis review covers a small number of issues which the Authority believes are of most significance at \nthis time. The lingering uncertainty about the future of the Authority has also necessitated the fairly \nnarrow focus of the review. As appropriate, the Authority has drawn on previous consultation and \nanalysis from both the 2012 Authority review and this year’s Warburton review.  \nThe important issues considered by the Authority include: \n• The role of the electricity and renewables sectors in contributing to the goal of keeping global \naverage warming to below 2 degrees (chapter 2).  \n• The case for rescheduling the LRET target; the appropriateness of current assistance to \nemissions-intensive, trade-exposed activities; and the role of the RET after 2020 (chapter 3).  \n• Whether any changes should be made to the level of assistance provided to small-scale solar \nphotovoltaic (PV) generation under the SRES (chapter 4).  \n• Whether any changes to the RET design to promote access by more diverse renewable \ntechnologies are warranted; and the appropriate frequency of statutory reviews of the RET \n(chapter 5).  \nThe limited scope of this review has meant that some questions, such as the treatment of larger, \ncommercial-scale PV, could not be addressed on this occasion. For the same reason the Authority  \ndid not commission additional economic modelling of the electricity sector for this review, but has \ndrawn on several previous exercises including modelling commissioned for the Authority’s earlier \nreview and the Warburton review. \n ABOUT THIS REVIEW | 13 \n \n1.4. CONSULTATION  \nThe Authority has reviewed the public submissions made to the Warburton review, and met with and \nsecured input from interested stakeholders (see Appendix A for a list of submissions received). The \nAuthority would like to thank the people and organisations who contributed time and expertise to the \nreview. \n14 | REPORT: 2014 RET REVIEW \n CHAPTER 2. THE RENEWABLE ENERGY \nTARGET AND AUSTRALIA'S \nEMISSIONS REDUCTION TASK \nThe RET works by creating a market for additional renewable electricity that supports \ninvestment in new renewable generation capacity.  \nThis chapter outlines the operation and impacts of the RET and places them in the broader \ncontext of Australia's emissions reduction goals. \nIt examines Australian and international research on the transition to a low-emissions \neconomy. This suggests major decarbonisation of electricity systems by 2050 is required to \nreduce the risks of dangerous climate change. Two consistent findings of this research are \nthat significantly more needs to be done both before and beyond 2020 to reduce electricity \nsector emissions, and that renewable energy is likely to play a major role in this task.  \nThis chapter also considers the extent to which the RET is the ‘right’ policy instrument for \nreducing electricity sector emissions. It finds that the RET can make significant emissions \nreductions at reasonable cost, with modest impacts on electricity consumers.  \n \n2.1. INTRODUCTION \nThe RET arrangements are designed to deliver the equivalent of at least 20 per cent of Australia's \nelectricity from renewable sources by 2020 (see Box 1). The term 'equivalent' is used because the \nscheme includes displacement technologies, such as solar water heaters, which reduce electricity \ndemand rather than generate electricity.  The primary legislation for the RET, the REE Act, sets out \nthe formal objects of the Act which are to: \n• encourage the additional generation of electricity from renewable sources \n• reduce emissions of greenhouse gases in the electricity sector \n• ensure that renewable energy sources are ecologically sustainable. \nThe RET's objectives should be seen in the context of Australia's broader goal of contributing to \nglobal efforts to reduce the risks posed by climate change.  \n \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 15 \n \n2.2. THE RENEWABLE ENERGY TARGET—ITS OPERATION AND \nIMPACTS \n2.2.1. HOW THE RET WORKS \nThe RET works by creating a market for additional renewable electricity that supports investment in \nnew renewable generation capacity. It places a legal obligation on entities that purchase wholesale \nelectricity (mainly electricity retailers) to surrender a certain number of certificates to the Clean \nEnergy Regulator (CER) each year. These certificates are generated by accredited renewable power \nstations and eligible small-scale renewable technologies. Each certificate represents one megawatt \nhour (MWh) of additional renewable energy for compliance purposes; the certificates are tradeable \nand can be 'banked' for use in later compliance years. If a liable entity does not surrender the \nnumber of certificates required, a 'shortfall charge' of $65/MWh applies to the outstanding amount. \nCosts incurred by purchasing certificates are tax-deductible, while the payment of the shortfall \ncharge is not. Assistance with the costs of the RET is provided to eligible emissions-intensive, \ntrade-exposed businesses. Generators producing and consuming their own electricity \n(‘self-generators’) are exempt. \nSince 2011, the RET has operated as two schemes—the Large-scale Renewable Energy Target \n(LRET) and the Small-scale Renewable Energy Scheme (SRES).  \nThe LRET supports large-scale renewable energy projects, such as wind and large-scale solar \ngenerators, by helping to bridge the cost between renewable and fossil-fuel generation. It sets \nannual targets for the amount of large-scale renewable energy; these targets rise to 41,000 GWh in \n2020 and stay constant at that level until the scheme ends in 2030 (see Figure 9 in chapter 3). These \nannual targets are allocated among liable parties in proportion to their purchases of wholesale \nelectricity.  \nThe SRES helps households, small businesses and community groups with the upfront cost of \ninstalling small-scale renewable systems, such as rooftop solar photovoltaic (PV) systems and solar \nhot water heaters. The SRES has no fixed annual targets; rather, liable entities are obliged to \npurchase all of the certificates generated from the installation of eligible small-scale systems. Unlike \nthe LRET, where certificates are generated in arrears, owners of eligible small-scale technologies \nreceive certificates upfront for the amount of renewable electricity the system is 'deemed' to create \nover a given period. This approach reduces the administrative burden on households and the CER. \nThe scheme will phase out gradually (from 2017 or 2022 depending on the technology), with the \nnumber of years of deeming reducing by one each year until the scheme ends in 2030. Small-scale \ntechnology certificates (STCs) can be sold through the Clearing House for $40; this provides a price \ncap for the scheme, the level of which can be altered by the Minister.  \nThe Authority's 2012 RET review provides further detail about the operation of the two schemes.  \n \n16 | REPORT: 2014 RET REVIEW \n BOX 1 ‘AT LEAST 20 PER CENT' AND THE 41,000 GWh TARGET \nThe RET aims to ensure that ‘the equivalent of at least 20 per cent of Australia’s electricity generation comes from \nrenewable resources by 2020’ (Explanatory Memorandum, REE Amendment Bill 2009 (Cth)). To meet this target, \nthe legislation specifies a fixed amount of large-scale electricity generation each year, providing clear signals about \nthe amount of large-scale generation capacity required to meet the targets. The legislated 2020 LRET target is \n41,000 GWh. The amount of renewable energy in Australia in 2020 was never going to be exactly 20 per cent. It will \nbe higher or lower depending on several factors, including overall demand for electricity. The SRES is uncapped. \nIn its 2012 RET review, the Authority considered the merits of fixed versus floating targets and preferred a fixed \ntarget, based on the argument that setting gigawatt hour targets to achieve a particular share of demand would \nrequire continuous revision, leading to significant uncertainty about the amount of investment required to meet the \ntarget. \nEstimates of the share of electricity that will be supplied by renewable generation in 2020 vary depending on both \nthe method used (for example, what counts as renewable energy) and the projections of future electricity supply and \nrenewable energy generation.  \nThe RET (and Mandatory Renewable Energy Target (MRET) before it) was designed to encourage additional \nrenewable electricity generation, so generation from pre-existing renewable plant needs to be considered when \nestimating the total share of renewables in a given year. This means there are three distinct components that affect \nthe share of renewable energy:  \n• electricity demand  \n• eligible generation under the RET (both large-scale and small-scale) \n• 'below baseline' generation from renewable generators that existed before the MRET ('pre-existing' renewable \ngenerators). Pre-existing renewable generators are allocated baselines based on their average historical output and \nare eligible to receive certificates for output above these baselines. The amount of generation below their baselines \nneeds to be added to generation from the RET to get the total amount of renewable generation.    \nWhen the initial 20 per cent by 2020 target was translated to a fixed gigawatt hour amount in 2007, Australia-wide \nelectricity supply was projected to be about 300,000 GWh in 2020 and below-baseline generation was expected to \nbe about 15,000 GWh per year (CCA 2012, p. 43). With a RET of 45,000 GWh per year by 2020, this translated into \na total renewable energy contribution of 60,000 GWh per year, equivalent to 20 per cent of (then) forecast demand \nin 2020. When the RET was split, the LRET target was revised to 41,000 GWh in 2020 (and through to 2030) and \nthe SRES was left uncapped, but notionally allocated at least 4,000 GWh. \nOver time, projections have changed, increasing the projected share of renewable energy in 2020. In 2012, the \nAuthority projected the share of renewables in 2020 would be about 26 per cent. The updated forecasts included in \nthe Warburton review project a 2020 renewables share of 26 per cent (if displacement from solar hot water is \nexcluded) or 28 per cent (if it is included, as per the Authority's analysis, which was based on previous approaches). \nTable 1 compares the modelling outputs and resulting share of renewables from the two reviews.  \nTABLE 1 PROJECTED SHARE OF RENEWABLES IN 2020, DIFFERENT RET REVIEWS \n LRET \ntarget \n(GWh) \nBelow \nbase-\nline \ngen. \n(GWh) \nSolar PV \n(GWh) \nSHW  \n(GWh \ndisplaced) \nTotal  \nrenewables  \n(GWh) \nTotal  \ngeneration  \n(GWh) \nShare of \nrenewables in \n2020 (%) \nCCA 2012 \nRET Review \n(p. 43) \n41,000 14,300 7,900 3,000 66,200 258,500 26 \n2014 \nWarburton \nreview (pp. \n126-130) \n41,000 16,150 9,920 \n3,500  \n(not in \nWarburton \nmethod) \n70,570 255,300 28 \nSource: Climate Change Authority based on CCA 2012 and Warburton review 2014 \n \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 17 \n \n \n2.2.2. RENEWABLES CAPACITY AND GENERATION SO FAR \nThe recent Warburton review found that the RET has been successful in promoting additional \ngeneration from renewable sources. Over 2001–2014, more than 400 renewable power stations with \na total capacity of more than 5,000 MW were installed under the RET—equivalent to about \n10 per cent of Australia's current grid-connected capacity (Climate Change Authority calculation \nbased on Warburton review 2014 and Energy Supply Association of Australia (ESAA) 2014). About \nthree-quarters of this is wind power; the rest includes biomass, hydro, landfill gas and solar \n(Warburton review 2014, p. 8). Figures 2 to 4 show the increase in renewable generation over 2001–\n2013. The amount of renewable energy generation almost doubled over the period, from about \n17,800 GWh in 2001–02 to about 32,500 GWh in 2012–13, with the share of renewables rising from \neight to 13 per cent over the same period.  \nSo far, about 2.2 million small-scale renewable systems have been installed under the RET (Clean \nEnergy Regulator 2014a). About 1.3 million of these are small-scale solar PV systems, which have \nbeen installed by more than 10 per cent of Australian households (ACIL Allen 2013a, p. viii).  \nTo date, the emissions reductions from the RET have been relatively small, because annual targets \nhave been relatively low. Modelling by SKM for the Clean Energy Council estimated that Australia’s \nemissions over 2001–2012 were 22.5 Mt CO2-e lower with the RET in place (SKM 2012, p. 1). This is \nequivalent to about 10 per cent of Australia's current annual electricity sector emissions (CCA 2014, \np. 159). \nFIGURE 2 GENERATION BY FUEL SOURCE, AUSTRALIA, 2001–2013 \n \nNote: Other (renewables) includes bagasse (wood), biogas and geothermal. Other (non-renewables) includes oil products and \nmulti-fuel-fired power plants. Year refers to financial year ending June. Solar PV includes rooftop solar; generation includes off-\ngrid. \nSource: BREE 2014 \n18 | REPORT: 2014 RET REVIEW \n \nFIGURE 3 SHARE OF RENEWABLES IN AUSTRALIAN ELECTRICITY GENERATION, 2001–2013 \n \nSource: Climate Change Authority based on BREE 2014 \n \nFIGURE 4 GENERATION AND DISPLACEMENT FROM SOLAR PV AND HOT WATER, 2001–2013 \n \nNote: 'SWH'= solar water heater. \nSource: Warburton review 2014 \n2.2.3. PROJECTED IMPACTS OF THE RET AND THEIR DISTRIBUTION \nThe rest of this section looks at RET’s likely future performance, resource costs and the distribution \nof those costs. As mentioned, the Authority has not conducted any new modelling for this review, but \nhas drawn on a number of published studies on the impacts of the RET, including the modelling by \nACIL Allen commissioned for the Warburton review and by SKM MMA for the Authority's 2012 \nreview. Box 2 in chapter 3 compares these and other recent studies. \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 19 \n \nThe RET is projected to deliver substantial volumes of emissions reductions in the future: modelling \nfor the Warburton review (2014, p. 41) estimates that (relative to a scenario in which the RET was \nrepealed) the current RET would reduce emissions by: \n• 58 Mt CO2-e over 2015–2020—about the same as annual emissions from all of Australia’s \npassenger cars and light commercial vehicles (CCA 2014a)  \n• 299 Mt over 2015–2030—about half of Australia’s current total annual emissions (CCA 2014b). \nThese projected emissions reductions result from increasing the amount of renewables in the \ngeneration mix, which has an economic cost. The cost of the RET is commonly measured by its \nincremental resource cost to the electricity sector; that is, the difference between the net present \nvalue (NPV) of the resources allocated to the electricity sector with or without the RET in place. The \nincremental resource costs include the costs of building and running a renewable plant, minus the \navoided fuel costs of displaced fossil fuel plant, other avoided running costs, and any avoided capital \ncosts. The RET generally raises the capital cost of generation, which is partly offset by lower ongoing \ncosts. ACIL Allen estimated the additional resource cost of the current RET to 2030 at \n$10,430 million in NPV terms relative to a situation of no RET (in 2014 dollars, ACIL Allen 2014, \np. 116). \nDividing the incremental resource cost of the RET by its emissions reductions gives the average \ncost per tonne, a measure of the policy's cost effectiveness. The Warburton review provides \nestimates of the average cost of emissions reductions from the RET, the LRET and solar PV under \nthe SRES, calculated in two different ways (Table 2). It estimates the cost of the LRET from 2014–\n2030 to be $32 per tonne (when future emissions reductions are not discounted), or $62 per tonne \n(when the emissions reductions are discounted at the same rate as future resource costs). \nSubsidising rooftop PV is more expensive per tonne of emissions reductions, at $95 per tonne \nwithout discounting. The method of estimating the cost per tonne of emissions reductions under the \nRET is discussed further in section 4.3. \nTABLE 2 ESTIMATES OF THE COST OF EMISSIONS REDUCTIONS OF THE RET FROM ACIL \nALLEN MODELLING  \n Cost per tonne ($/tCO2-e)  \n \n \n2014–2030 2014–2040 \n RET LRET Rooftop PV RET LRET Rooftop PV \nUndiscounted \nemissions reductions 35 32 95 25 22 79 \nDiscounted emissions \nreductions 68 62 175 62 56 185 \nNote: ‘undiscounted emissions reductions’ means that future emissions reductions are not discounted relative to those today. \n‘Discounted emissions reductions’ means that emissions reductions in the future are discounted at the same rate as future \nresource costs (a 7 per cent real discount rate). The Authority considers the estimate with undiscounted emissions is the more \nappropriate measure. See text for further details.  \nSource: Warburton review 2014 \nThe Authority considers the estimate with undiscounted emissions is the more appropriate measure. \nUnlike holdings of money, over the timeframes and volumes of emissions reductions considered \nhere, a tonne of emissions reductions in the future is as valuable as a tonne now, as it has the same \nconsequences for climate change outcomes. In its 2012 review, the Authority did not discount future \n20 | REPORT: 2014 RET REVIEW \n \nemissions reductions, and estimated the average cost of the RET to be $40 per tonne (in 2012 \ndollars).  \nLooking beyond the resource cost of the RET, the scheme has distributional impacts on households \nand businesses. These impacts arise from changes in the wholesale and retail prices of electricity \nwhich affect electricity consumers' purchasing power and the profits of existing generators. These \nprice changes are different from the 'costs of the RET to the economy'—they involve transfers from \nsome households or businesses to others. \nRetail electricity prices are made up of the costs of generating, transmitting, distributing and selling \nthe electricity to end users. The overall impact of the RET on retail prices is the net impact of two \nmain effects that work in different directions: \n• The RET tends to lower wholesale electricity prices—because the RET increases the available \nsupply of electricity from sources with lower operating costs than fossil fuel generation. \n• The RET tends to raise the retail component of electricity prices—retailers have to purchase \ncertificates to acquit their RET liabilities, the costs of which are passed on to customers. \nExisting generators are affected in two ways. Increased generation displaces fossil-fuelled plant \noutput. Also, lower wholesale prices mean they make less money for the electricity they sell.  \nThe impact on households and other retail customers depends on the relative size of the wholesale \nand retail price effects. For a particular level of renewable capacity, the larger the wholesale price \neffect, the smaller the overall cost impact on consumers; the magnitude of these impacts is \ndiscussed in section 2.5.  \n2.3. AUSTRALIA'S EMISSIONS REDUCTION TASK  \nClimate change poses serious risks for the Australian community and its economy. Together with the \nbroader international community, Australia has agreed to a goal of limiting average global warming to \nno more than 2 degrees Celsius above pre-industrial levels to avoid the worst impacts of climate \nchange. This requires large and ongoing reductions in greenhouse gas emissions by all countries, \nincluding Australia.  \nAustralia’s emissions were about 600 Mt CO2-e in 2012, 2.5 per cent above 2000 levels (CCA 2014, \np. 86). With the currently legislated RET in place, but without other strong policies, the most recent \nofficial estimates projected that emissions would grow to 685 Mt in 2020, 17 per cent above 2000 \nlevels (Treasury and Department of Industry, Innovation, Climate Change, Science, Research and \nTertiary Education (DIICCSRTE) 2013). The next set of official projections is expected to be lower, \nreflecting the effects of structural changes in the Australian economy, behavioural change and the \nimpacts of past policies, including energy efficiency (see, for example, Frontier Economics 2014). \nEven if the growth in emissions slows, however, absolute emissions are likely to grow in the absence \nof additional strong policies. \nAustralia has an international undertaking to reduce its emissions by 5–25 per cent by 2020, relative \nto 2000 levels, and is considering its goals for reductions beyond 2020. The government has \nindicated it will make decisions on post-2020 targets in the first half of 2015. \nIn its Targets and Progress review, the Authority considered Australia’s current (and prospective) \nemissions reduction goals. It recommended a long-term emissions budget for Australia that is \nconsistent with the 2 degrees goal, and corresponding short-term and medium-term targets of: \n• a minimum 15 per cent reduction compared with 2000 levels by 2020 (which increased to \n19 per cent when taking account of surplus emissions units carried over from the first \ncommitment period of the Kyoto Protocol)  \n• between 40 and 60 per cent reductions compared with 2000 levels by 2030 (CCA 2014, p. 10). \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 21 \n \nBased on the available evidence, the Authority concluded that Australia’s minimum 5 per cent 2020 \ntarget is inadequate, because it does not keep pace with the action taken by many other countries \nand is inconsistent with the 2 degrees goal (CCA 2014, pp. 121–2).  \nSince that review climate scientists have reaffirmed their conclusions about the risks ahead, and \nsome of the world’s largest emitters have announced commitments for post-2020 action: \n• The United States has pledged to reduce its net greenhouse gas emissions by 26 to \n28 per cent—compared with 2005 levels—by 2025 (White House 2014). \n• China has pledged to peak CO2 emissions by 2030 and to increase its non-fossil fuel share of \nenergy to around 20 per cent by that year. \n• The European Union has pledged to cut greenhouse gases by at least 40 per cent from 1990 \nlevels by 2030 (Barroso 2014). \n2.4. THE ROLE OF THE ELECTRICITY SECTOR  \nThe electricity sector features prominently in Australian and international research on reducing \ngreenhouse gas emissions, with a consistent finding that limiting warming to no more than 2 degrees \nwould require virtual decarbonisation of global electricity systems by 2050 (Sachs et al., 2014, p. 32; \nIPCC 2014b p. 64, IEA 2014a p. 125).  \nThe electricity sector is important for three reasons:  \n• It accounts for a significant share of current emissions—one-third of Australia's total emissions \nand 28 per cent of total global emissions (CCA 2014, p. 246, Audoly et al. 2014, p. 1). \n• Deep cuts in electricity sector emissions are technically feasible with currently known \ntechnologies, and more cost-effective than deep cuts in some other sectors. \n• Low- and zero-emission electricity generation can be a precursor to feasible, least-cost \ndecarbonisation pathways for the sectors that use energy. \nThe survey of decarbonisation pathways by the Intergovernmental Panel on Climate Change (IPCC \n2014b) found that in least-cost pathways consistent with less than 2 degrees of warming, the \nelectricity sector is decarbonised more rapidly, whereas deep reductions in emissions in some other \nsectors accrue after 2050 (IPCC 2014b pp. 6-86). In these scenarios, renewables are projected to \nreplace fossil fuels as the dominant source of electricity generation by 2050. In the International \nEnergy Agency’s (IEA’s) 2 degree scenario, for example, renewables are projected to surpass 70 per \ncent of global generation capacity by 2050, with fossil fuels declining to just over 20 per cent and \nnuclear maintaining its current share of seven per cent (IEA 2014a, p. 125). The importance of \ndecarbonising global electricity supplies for reducing energy emissions is reflected in the IEA's \n(2014b) advice to policy-makers in the lead up to the climate change negotiations in Lima this month: \nelectricity sector decarbonisation is one of five priority actions on the IEA's list for reducing energy \nsector emissions. \nSubstantial decarbonisation of electricity supply facilitates decarbonisation for energy-consuming \nsectors, as electricity can displace the direct use of fossil fuels for energy (IEA 2014a, pp. 127-128; \nSachs et al. 2014, pp. 12-13). Recent modelling for Australia conducted as part of a multi-country \nUnited Nations project (Pathways to Deep Decarbonisation in 2050) provides examples:   \n• In industry, emissions could fall 60 per cent on 2012 levels by 2050, driven substantially by \ndecarbonisation of the electricity supply and electrification of industrial processes (ClimateWorks \nAustralia et al. 2014a, p. 25). \n• Emissions from Australian buildings could be virtually eliminated by 2050 through a combination \nof energy efficiency and switching from gas to electricity for all heating, hot water and cooking \n(ClimateWorks Australia et al. 2014b, p. 120). \n22 | REPORT: 2014 RET REVIEW \n \n• Emissions from road transport, which currently accounts for the vast majority of transport \nemissions, could be reduced by about 70 per cent by 2050 (ClimateWorks Australia et al. 2014b \np.69, CCA 2014b p.17). Much of this is due to a substantial shift towards electric and hybrid light \nvehicles. Emissions from cars and light commercial vehicles are projected to fall by around \n85 per cent between 2012-2050, while kilometres travelled grow by about 75 per cent over the \nsame period (ClimateWorks Australia 2014b p. 67, p.69).  \nAustralia's current trends lag well behind these projections. In 2012, the emissions intensity of \nAustralia's electricity supply was higher than China’s and 87 per cent above the OECD average (IEA \n2014c, pp. II.61-3). Even with the currently legislated RET (but without other strong policies): \n• the emissions intensity of Australia's electricity supply is projected to decline only slightly, from \n0.78 tonnes of carbon dioxide equivalent per megawatt hour (tCO2-e/MWh) in 2012 to \n0.69 tCO2-e/MWh in 2030 (CCA 2014, p. 250)  \n• absolute emissions from electricity generation are projected to grow.  \nFor Australia to get onto a cost-effective pathway consistent with global action to limit warming to no \nmore than 2 degrees, the emissions intensity of its electricity would need to fall rapidly. Modelling \nconducted for the Authority's Targets and Progress review projected about a 70 per cent reduction \non 2012 emissions intensity levels by 2030, and about a 90 per cent reduction by 2050. This trend is \nprojected to hold even in the case of weaker global action—a scenario consistent with limiting \nwarming to 3 degrees found emissions intensity would fall 15 per cent below 2012 levels by 2030 \nand about 65 per cent by 2050 (Figure 5). \nFIGURE 5 CHANGES IN EMISSIONS INTENSITY OF AUSTRALIA'S ELECTRICITY SUPPLY TO \n2050—2 AND 3 DEGREE SCENARIOS \n  \nNote: The 2 degree scenario is the 'high' scenario and the 3 degree scenario the 'central policy' scenario from modelling for the \nAuthority’s Targets and Progress review. Both scenarios assume a fixed carbon price to July 2014, with the 2 and 3 degree \nscenarios reaching $65/t CO2-e and $27/t CO2-e in 2020, respectively. Prices are in real 2012 Australian dollars.  \nSource: Climate Change Authority 2014 based on Treasury and DIICCSRTE 2013 and ACIL Allen 2013b  \nThis modelling—and the projected decline in emissions intensity—reflects a strong shift from fossil \nfuel to renewable generation, with the share of total renewable generation increasing from \n12 per cent in 2012 to about 70 per cent in 2030 in the 2 degree scenario, and to about 25 per cent \nin the 3 degree scenario (Figure 6).  \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 23 \n \nThe Pathways to Deep Decarbonisation modelling discussed above reinforces these findings. It \nsuggests that even if other zero- or low-emissions technologies are deployed—such as nuclear and \ncarbon capture and storage (CCS)—renewables would still dominate the generation mix \n(ClimateWorks Australia et al. 2014b). The project investigated three pathways for electricity \ngeneration consistent with the Authority's recommended long-term emissions budget for Australia, \nnamely: a 100 per cent renewable grid scenario; a scenario in which CCS is included in the possible \ntechnology mix; and a scenario in which CCS and nuclear are included (ClimateWorks Australia et \nal. 2014a p.22, 2014b pp. 42-5). Even in the nuclear and CCS scenarios, renewables are projected \nto account for more than 70 per cent of total generation in 2050. \nFIGURE 6 AUSTRALIA'S CURRENT AND PROJECTED SHARE OF RENEWABLES IN ELECTRICITY \nGENERATION TO 2050, VARIOUS SCENARIOS   \n \nNote: Generation is calculated in GWh sent out. ‘Renewables’ includes hydro, wind, geothermal, biomass, solar thermal and solar \nPV (including rooftop solar). Generation displaced by solar water heating is not included in the share of renewables. Non-\nrenewable generation includes coal, gas, cogeneration, liquid fuel, black coal with carbon capture and storage (CCS) and gas with \nCCS. CCS technology plays a larger role under a 2 degree scenario from 2030 resulting in a lower share of renewables in 2050 \nthan in the 3 degree scenario. \nSource: Climate Change Authority based on ACIL Allen 2013b \n \nThe modelling discussed above projects a major and expanding role for large-scale renewables \nthrough to 2050. On the other hand, some changes underway in the electricity sector—including \nrapid reductions in small-scale battery costs—could result in a more decentralised electricity sector in \nthe future. This raises the question of whether near-term investment in large-scale renewables may \nbe stranded if the grid was to become much more decentralised over the coming decades. \nWhile it is impossible to know how the sector will evolve, modelling for the CSIRO’s Future Grid \nForum (Graham et al. 2013, pp.53, 68, 84) provides some insights. Even across scenarios resulting \nin extremely different levels of centralised electricity generation in 2050, investment in large-scale \nrenewables to 2020 is reasonably similar. This suggests near-term investment in large-scale \nrenewables could be robust to a range of possible futures. \nIn summary, the available studies consistently find: \n• Significantly more will need to be done to reduce emissions beyond 2020 to keep Australia on a \npath towards limiting global warming to no more than 2 or even 3 degrees. \n• Renewables are likely to play a major role in decarbonising future electricity supplies.  \n24 | REPORT: 2014 RET REVIEW \n CONCLUSION \nC 1. Substantial reductions in electricity sector emissions over the coming decades—\nincluding through greater deployment of renewables—must be a key focus for Australia \nin playing its part in reducing global emissions and the risks of dangerous climate \nchange.  \n \n2.5. IS THE RET AN APPROPRIATE POLICY INSTRUMENT?  \nIn its 2012 review, the Authority concluded that while the RET was not a perfect policy, the benefits \nof any changes should be assessed in light of their implications for ongoing investment in \nrenewables. Since then, many stakeholders have suggested the RET should be reduced or \nabolished, arguing that: \n• lower cost emissions reductions exist elsewhere  \n• the Emissions Reduction Fund (ERF) should be the main policy in the economy and the \nelectricity supply sector  \n• the distribution of costs (including their incidence on existing fossil fuel generators) is \nundesirable.  \nThe Authority’s responses are listed below and elaborated in the subsequent sections: \n• some cheaper emissions reductions are available elsewhere, but policy needs to consider the \nsize and cost of the overall emissions reduction task \n• within the electricity supply sector, it is doubtful that the prospective alternative policies would \ndeliver comparable reductions \n• the size and incidence of the RET's impacts do not warrant reductions in the targets. \nThis section expands upon each point in turn. \n2.5.1. SOME CHEAPER REDUCTIONS ARE AVAILABLE, BUT POLICY NEEDS \nTO CONSIDER THE SIZE AND COST OF THE OVERALL TASK \nAs discussed in section 2.4, decarbonising the electricity supply sector is a critical part of Australia's \ntransition to a low-emissions economy; this requires policies capable of making substantial \nreductions in electricity sector emissions.  \nSome lower-cost emissions reduction opportunities do exist in Australia outside the electricity supply \nsector, and the Authority expects that some of these will be picked up by the ERF (CCA 2014c) or \nother current policies.  \nThe existence of such opportunities, however, is not sufficient to conclude that the RET is too \nexpensive. Policy-makers need to consider the overall size of Australia's emissions reduction task \nand the costs for achieving not just some but all of the reductions required to meet Australia's \ntargets. This includes considering the cost of the most expensive of those units (the ‘marginal cost’ or \nthe cost ‘at the margin’).  \nThe government's latest estimate of Australia's emissions reduction task is 421 Mt between 2015 \nand 2020 (Department of the Environment 2014). This is based on results of modelling by the \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 25 \n \nAustralian Treasury for the Authority’s Targets and Progress review (Treasury and DIICCSRTE \n2013), which suggests that to achieve even Australia’s minimum 2020 commitment of a 5 per cent \nemissions reduction target domestically would cost up to $65 per tonne (in 2012 dollars) at the \nmargin with the carbon pricing mechanism in place. That modelling assumed that the current RET \nremained in place. If the RET target were to be weakened or abolished, more emissions reductions \nwould be required elsewhere and the marginal cost of delivering those additional reductions would \nbe expected to be at least as high.  \nSustained weak electricity demand means that the emissions reduction task to 2020 is likely to be \nsmaller than previously estimated. Frontier Economics (2014, p. 7), for example, estimates that \ndownward revisions to electricity demand forecasts will lower Australia's emissions reduction task by \n142–196 Mt over 2014–2020. This would reduce the marginal cost of achieving the minus 5 per cent \ntarget. That said, there is no guarantee that it would reduce the cost to a level less than the average \ncost per tonne of a lower RET. \nAt an average cost of $35 per tonne to 2030 (Table 2), the Authority believes the RET is making a \nreasonably cost-effective contribution to emissions reductions in a strategically important sector—\nboth out to 2020 and beyond, when steeper reductions will be required.  \n2.5.2. WITHIN THE ELECTRICITY SUPPLY SECTOR, PROSPECTIVE \nALTERNATIVES ARE UNLIKELY TO DELIVER COMPARABLE \nREDUCTIONS \nPolicies to reduce emissions from electricity can operate in one or more of the following five ways:  \n• using existing lower emissions plant more intensively ('fuel-switching') \n• improving the efficiency of existing fossil-fuel power stations so that they produce fewer \nemissions per unit of electricity \n• retiring higher emissions plant  \n• building new zero- or low-emissions generation (large- or small-scale)  \n• reducing the demand for electricity by improving household and business energy efficiency.  \nImproving energy efficiency can often provide substantial low cost (or even financially beneficial) \nways of reducing Australia's emissions (see for example CCA 2014a, p. 160). This can reduce \noverall electricity demand, but will not reduce the emissions intensity of the electricity supply. \nThe government is implementing the ERF as the centrepiece of its climate policy to reduce \nemissions across the economy. As discussed in the Authority’s Carbon Farming Initiative review \n(CCA 2014c), the crediting part of ERF (as currently designed) is not well suited to encouraging new \nzero- or low-emissions plant because the contract period is short relative to the life of the large \ninfrastructure investment. It could encourage efficiency improvement at existing plants, but is less \nsuited to encouraging fuel-switching, as reductions are assessed at the facility level, rather than \nacross the generation fleet as a whole.  \nThe government is also designing a ‘safeguard mechanism’ to complement the ERF crediting \nmechanism. This remains under development (and is planned to commence from 1 July 2016), and \nthe ERF White Paper notes that the application of the safeguard mechanism to the electricity sector \nwould be a matter for industry consultation, given the interactions with other policies such as the \nRET. Given these uncertainties, there is no basis at this time to assume the ERF will be effective in \ndelivering comparable volumes of emissions reductions to the RET at lower prices.  \nRenewable deployment policies like the RET reduce emissions through encouraging new \nzero-emissions plant. While performance depends on the specifics of the design, schemes like the \nLRET are considered to be a relatively cost-effective way of reducing electricity sector emissions. \n26 | REPORT: 2014 RET REVIEW \n \nThe Productivity Commission’s 2011 review of more than 1,000 emissions reduction policies in nine \ncountries concluded that, while emissions trading schemes delivered the lowest cost emissions \nreductions (by using all five of the options above), schemes to encourage the deployment of \nlarge-scale renewable energy were the next most cost-effective set of policies in the electricity supply \nsector. Within those policies, renewable energy targets such as Australia’s were found to be more \ncost effective than schemes that set the price for, rather than the quantity of, renewables \n(Productivity Commission 2011, pp. xiv, 80–1). \nIn the Authority’s view, the RET is the only currently prospective policy instrument in the electricity \nsupply sector that can be relied upon to deliver sizeable volumes of emissions reductions.   \n2.5.3. THE SIZE AND INCIDENCE OF THE RET'S IMPACTS DO NOT WARRANT \nREDUCTIONS IN THE TARGETS \nAnother objection to the RET raised by some stakeholders (see section 3.2) is that, even if its overall \ncosts are reasonable, the burden on particular groups (in particular on existing fossil fuel generators) \nis too high.  \nAs outlined in section 2.2.3, consumers and electricity generators share the costs of the RET and the \nimpact of the RET on consumer prices is the net impact of two main effects that work in different \ndirections.  \nACIL's modelling for the Warburton review indicated that the RET would have almost no impact on \nconsumer prices over the period 2015–2030: \n• the wholesale and retail price impacts of the RET are projected to offset each other in NPV \nterms to 2030 \n• over the period to 2040, the RET is projected to make households better off.  \nThe impacts of reducing the current RET are discussed further in section 3.2.  \nIn the near term, the RET is projected to increase retail electricity prices by a small amount, with a \ntypical household projected to pay about $250 more in total over the period 2015–2020 (in present \nvalue terms). This is considered a modest impact and is mitigated through the provision of targeted \nassistance (see AEMC 2014, p. 198 for current electricity concessions). Beyond 2020, the RET is \nprojected to reduce retail prices by a small amount, which is why the net impact over the period to \n2030 is projected to be neutral.  \nOther modelling exercises point to similarly modest impacts on household bills. Modelling by \nSKM MMA for the Authority's 2012 RET review suggested that, on average, the RET would increase \nhousehold electricity bills by $15 per year over 2012–13 to 2030–31 (in 2012 dollars, CCA 2012, \np. 150). Looking across other recent modelling exercises on the impacts of the RET (see Box 2), \nsome project that the RET slightly lowers retail prices and some that it slightly raises them, but the \nprojected changes in household bills are modest in either direction.  \nThe RET’s impact on electricity bills for commercial and non-exempt industrial users are also \nconsidered to be modest. ACIL Allen’s modelling for the Warburton review indicated that the RET \nwould increase electricity prices for commercial and industrial customers to 2020, but lower them in \nthe period out to 2040 (Warburton review 2014, p.37). Modelling by SKM MMA projected that the \nRET would increase average electricity bills for small and medium enterprises by $17 per year over \nthe period 2012–13 to 2030–31 (in 2012 dollars; CCA 2012, p. 151). When these costs are \nexpressed as a share of electricity bills, they tend to be higher than for households because \nbusinesses generally have lower electricity tariffs (CCA 2012, p. 151).  \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 27 \n \nThe impacts of RET costs on very large energy users are difficult to assess because they generally \nhave private bilateral contracts with their electricity retailer; the most emissions-intensive users \nreceive partial assistance for the impacts of the RET on their electricity costs (see section 3.3).  \nThe RET lowers revenue and profits for thermal generators, relative to a situation of no RET. \nFigure 7 compares profitability by generator type between these two scenarios. It shows that the net \npresent value of profits to black and brown coal-fired generators are about 40 and 38 per cent lower \nwith the RET. Conversely, profits for wind generators are higher with the RET in place. Electricity \ngenerators’ profits are also affected by the current over-supply of generation capacity, which is \ncausing low wholesale prices. A substantial adjustment task lies ahead for the electricity sector, as \nolder plant eventually exit the market, regardless of the level of the RET (section 3.1.2).   \nGiven their relatively high emissions intensity, it is difficult to imagine any effective policy to reduce \ngreenhouse gases which had no impact on coal-fired generators. If the revenue impacts on \nincumbents were a primary concern for government, it could consider providing direct assistance, \nrather than weakening the policy causing the impacts. Two considerations argue against that course. \nFirst, the current owners of many large coal- and gas-fired power stations acquired the assets in full \nknowledge of the 41,000 GWh 2020 target—as many of these plants were purchased after plans to \nexpand the RET were announced. The government published a paper on expanding and extending \nthe RET in July 2008 (COAG Working Group on Climate Change and Water 2008). Plans to \nintroduce state-based renewable schemes, which would have had a comparable effect (and which \nthe Commonwealth arrangements subsumed) were announced even earlier. Figure 8 lists thermal \npower stations with a capacity of 500 MW or more that were acquired or commissioned by private \nbusinesses from 2009 onwards. These assets represent 55 per cent of the total capacity of the \nlargest power stations and 10 out of the 24 largest power stations by number. \nSecond, the government has already given a total of $2 billion in carbon price compensation to the \n10 most emissions-intensive coal-fired generators by way of assistance with the impacts of a carbon \nprice (Climate Change Authority calculation based on Clean Energy Regulator 2014b). The most \nemissions-intensive of these received about half a billion dollars each. The carbon price has since \nbeen repealed but generators are not obliged to repay this assistance. \nFIGURE 7 PROFIT BY GENERATOR TYPE WITH AND WITHOUT THE RET, 2015–2040 \n \nNote: The without RET scenario assumes the RET ceases operation from 1 January 2015 and any mechanism used to \ncompensate investments made under the RET, if one were introduced, does not affect wholesale or retail price outcomes (ACIL \nAllen 2014, p. ii). The with RET scenario assumes the current RET remains in place. ACIL Allen calculated profit measure as \nmodelled pool revenues (energy and LGCs), less fixed operating and maintenance costs and variable generating costs.  \nSource: Warburton review 2014, based on ACIL Allen 2014 \n28 | REPORT: 2014 RET REVIEW \n \nFIGURE 8 LARGE FOSSIL FUEL POWER STATIONS ACQUIRED OR COMMISSIONED, 2009–2014  \n \nNote: For the purposes of this analysis, large power stations are those over 500 MW capacity. Name of commissioning or \npurchasing entity in brackets. Analysis covers the period 2009–2014; purchases and commissions only occurred from 2011 \nonwards. TPG purchased Alinta in 2011. Excludes plant purchased or commissioned by state-owned generators.  \nSource: Climate Change Authority based on ACIL Allen 2014 and public announcements listed in References \nThe Authority concludes that, in the absence of other policies, the RET remains the central policy \ninstrument for reducing electricity sector emissions. The overall impacts on electricity consumers are \nmodest and, where appropriate, best mitigated through the provision of targeted assistance to \nvulnerable households and electricity-intensive businesses. It is difficult to be persuaded that existing \nfossil-fuelled generators are being unfairly burdened by the RET’s impacts, given the timing of many \npurchase decisions and the payment of compensation for a carbon price that has since been \nwithdrawn.  \nCONCLUSION \nC 2. The Renewable Energy Target arrangements are currently the primary policy \ninstruments for electricity sector decarbonisation, and no more cost-effective and \nscalable measures are in prospect at this time. Their overall impacts on electricity \nconsumers are quite modest, and are mitigated through the provision of targeted \nassistance. \n THE RENEWABLE ENERGY TARGET AND AUSTRALIA'S EMISSIONS REDUCTION TASK | 29 \n CHAPTER 3. THE LARGE-SCALE \nRENEWABLE ENERGY TARGET \nThis chapter considers the role of the Large-scale Renewable Energy Target (LRET) in the \ncurrent policy context, including the level of the LRET and exemptions for \nemissions-intensive, trade-exposed (EITE) industries.  \nFirst, it examines whether the current 2020 LRET target remains feasible, and the best \ncourse of action if this is not the case. It concludes that there is no case to reduce the target, \nbut there is a case for deferring the current 2020 LRET target, for example by up to three \nyears, to provide additional time to ensure it can be met. \nSecond, it considers the eligibility criteria for determining partial exemptions for \ntrade-exposed businesses, concluding that present anomalies should not be extended in the \nevent that assistance is expanded in the future.  \nFinally, it explores the role of the LRET post-2020 and recommends the government \nconsider, in the absence of more comprehensive policies, an expanded role for the LRET \nafter 2020 capable of delivering substantial decarbonisation in the electricity sector. \n \n3.1. FEASIBILITY OF THE CURRENT LARGE-SCALE RENEWABLE \nENERGY TARGET \nGiven the repeal of the carbon price, and doubts about the capacity of the Emissions Reduction \nFund and safeguard mechanism to drive necessary emissions reductions in the electricity sector, the \nLRET will likely be called upon to play a greater role in the decarbonisation of Australia's electricity \nsector out to 2020 and beyond.  \nIn its 2012 RET review, the Authority considered the feasibility of the 2020 target and concluded that \nthe target was challenging but achievable provided that a price on carbon remained. Since that time \nseveral developments have occurred which have undermined investor confidence in this sector and \nraised doubts about the feasibility of achieving the LRET in 2020. In particular, the erosion of \nbipartisan support for the target and the prospect of major changes has seen investment in \nlarge-scale renewable projects in 2014 fall to levels not seen since 2002 (Bloomberg New Energy \nFinance 2014, p. 1).  \nIn light of these developments, the Authority has considered: \n• whether the current 2020 target is still ‘technically feasible’ (that is, can the required new \ncapacity be built) \n• whether it is still 'financially feasible' (that is, will it be financed) \n• how might the current LRET target be modified if there are reasonable doubts about its \nachievability. \n30 | REPORT: 2014 RET REVIEW \n \n3.1.1. TECHNICAL FEASIBILITY \nThe first question around the feasibility of any 2020 target is whether it is physically possible to meet. \nRecent estimates put the amount of new large-scale renewable capacity required to meet the full \n41,000 GWh target by 2020 at just below 9,000 MW (Warburton review 2014, p. 29). Meeting this \ntarget would require sustaining higher build rates than Australia has achieved to date. Assuming \nrelatively small amounts of construction in 2015, it would require an average annual build rate of \nabout 1,800 MW over 2016–2020, almost three times the highest annual rate to date of 655 MW \n(Climate Change Authority calculation from Clean Energy Council 2014, p. 6). \nOne aspect of the feasibility of achieving the target is whether inputs such as steel, components and \nconstruction equipment can be obtained. In recent work commissioned by the Clean Energy Council, \nROAM Consulting investigated the technical feasibility of meeting the 2020 target by conducting \ninterviews with industry experts (ROAM Consulting 2014, pp. 8–10). ROAM found there are no \nphysical constraints to meeting the target, with sufficient raw materials, components, labour and \nconstruction equipment available either domestically or (for some materials) overseas. Overall, and \ndespite the higher build rates required, ROAM concluded that it would be technically possible to build \nthe capacity required to meet the current 2020 target.  \nA second part of technical feasibility is whether there are enough potential projects sufficiently far \nadvanced that they could be constructed if current investor uncertainties were resolved. Table 3 \nprovides an estimate of the pipeline of new renewable projects by project status. The pipeline \nconsists of about 16,100 MW of wind farm projects and 1,700 MW of large-scale solar projects. \nAbout 7,700 MW of the total already has planning approval.  \nWhile it is difficult to be certain given the compressed timeframes to 2020, there would appear to be \nan adequate project pipeline and availability of inputs for the current 2020 target to still be considered \ntechnically feasible.    \nTABLE 3 LARGE-SCALE RENEWABLES PROJECT PIPELINE \nPROJECT STATUS  CAPACITY \n(MW) \nUndergoing approvals 10,050 \nApprovals finished, but other issues require resolution before financial close 1,600 \nReady to build in 2015–16 pending financial close 5,650 \nCommitted 500 \nTotal 17,800 \nNotes: Clean Energy Regulator (CER) information compiled from the Bureau of Resource and Energy Economics' Electricity \nGeneration Major Projects Database and Australian Energy Market Operator’s (AEMO’s) operation planning database, \ncomplemented with interviews conducted with project proponents. The CER has not independently substantiated all information \nprovided in these interviews. Information provided represents status at May 2014. \nSource: Information provided by the CER to the Climate Change Authority \n3.1.2. FINANCIAL FEASIBILITY \nFor the LRET to remain financially feasible:  \n• the combination of the wholesale electricity and Large-scale Generation Certificate (LGC) prices \nmust cover the costs of renewable generation  \n• the LGC price must not exceed the penalty price under the scheme (the 'shortfall charge')  \n THE LARGE-SCALE RENEWABLE ENERGY TARGET | 31 \n \n• finance would need to be available to fund the necessary new large-scale renewable energy \nprojects.  \nAt present, both wholesale electricity market and LGC prices are low, discouraging investment in \nnew renewable capacity. \nLGCs cover the gap between the costs of renewable and fossil fuel generation. Other things being \nequal, lower wholesale electricity market prices mean renewable generators need to earn more \nrevenue from LGCs. If, for example, a wind project required about $90/MWh to be commercially \nviable, with a wholesale electricity price of about $35/MWh, it would need an LGC price of about $55. \nIf the price of LGCs exceeds the shortfall charge, liable parties will probably choose to meet their \nliabilities by paying the charge, rather than purchasing renewable generation, with costs passed \nthrough to electricity consumers. \nCurrent low LGC prices are heavily influenced by uncertainty about the future of the LRET. Even if \nParliament reaches a conclusion soon, it could take some time for investor confidence to return, \nincreasing the cost and reducing the likelihood of investors financing the new renewables required to \nmeet any 2020 target.  \nThe rest of this section discusses the financial feasibility of the target in more detail. It covers views \nand analysis on meeting the existing 2020 target, the causes and implications of low wholesale and \nLGC prices, and the potential availability of finance for new generation. \nThe current 2020 target and the shortfall charge \nIn submissions to the Warburton review,1 participants expressed conflicting views about whether the \nexisting target can be met without triggering the shortfall charge. \nIf a liable entity does not surrender the number of certificates required under the LRET or the SRES, \na shortfall charge applies to the outstanding amount. The shortfall charge for both the LRET and \nSRES is a nominal price of $65/MWh. Costs incurred by purchasing certificates are tax-deductible, \nwhile the payment of the shortfall charge is not. Liable parties could therefore purchase certificates at \na higher price (a tax effective price of about $93/MWh, assuming a company tax rate of 30 per cent), \nbefore they were financially worse off than paying the shortfall charge (assuming the company is in a \ntax-paying position). If the LGC price exceeds the shortfall charge, then liable entities will probably \nchoose to pay the shortfall charge, so the amount of renewable energy for that year would be below \nthe target level. Because the shortfall charge is not indexed, its value falls over time in real terms. By \n2020, the tax-effective shortfall charge is estimated to be worth $79/MWh in today's dollars (ROAM \nConsulting 2014, p. 19).2 \nInfigen submitted that there are sufficient large-scale renewable projects in the pipeline to reach the \nrequired capacity, provided regulatory certainty is restored. The Clean Energy Council agreed, citing \nits commissioned modelling from ROAM. Box 2 provides an overview of the different modelling \nexercises conducted on the RET.  \nSome participants, including the Australian Industry Group (AiG) and Origin Energy, noted that the \n2020 target is becoming increasingly difficult to achieve, with AiG citing the uncertain political \nenvironment as a key factor. \nOther participants, including AGL, the Australian Energy Market Commission (AEMC), Energy \nAustralia and the Energy Supply Association of Australia (ESAA), stated that the target can no longer \nbe achieved without triggering the shortfall charge. Energy Australia argued that the rapid build rate \nand suppressed wholesale prices would render new projects uneconomic. The AEMC cited \nmodelling by Frontier Economics that indicated the target would not be met due to low wholesale \n1 Quotations are taken from participants' submissions to both the Warburton and Climate Change Authority reviews as indicated. \nFor a list of submissions to the Authority review see Appendix A. \n2 In this chapter, all currency amounts are in real 2014 Australian dollars unless otherwise specified. \n32 | REPORT: 2014 RET REVIEW \n                                                          \n \nprices, low demand growth and repeal of the carbon price (Frontier Economics 2014, pp. 28–9). AGL \nstated that: \nAt current LGC and wholesale electricity market prices, new investments in renewable \nenergy projects cannot be justified economically. Given the market based policy \nmechanism of the RET and the energy-only market design of the National Electricity \nMarket (NEM) in particular, it is inconceivable that the investment in renewable projects \nrequired to meet the LRET will be forthcoming, particularly against the backdrop of the \nmanifest uncertainty in relation to broader energy policy.  (AGL, Warburton review \nsubmission, p. 1) \nModelling commissioned for the Warburton review projected that the 2020 target could be met \nwithout the LGC price exceeding the shortfall charge (ACIL Allen 2014, p. 14). This and other \ncommissioned modelling provides information about whether the current target would be met under a \nsituation in which projects are built relatively steadily to meet the current targets. This means that it is \nless informative about a situation in which the regulatory uncertainty to date, or further lengthy delays \nin reaching a political agreement on the RET reduce investment in renewables over the next year or \nso.  \nLarge-scale Generation Certificate prices \nTo ensure any LRET target is met through renewable generation, rather than retailers paying \npenalties, LGC prices should not exceed the shortfall charge, but they should be sufficient, in \ncombination with expected wholesale prices, to cover the costs of new renewable generation. At \npresent, LGC prices are low for two main reasons:  \n• a surplus of certificates created by small-scale solar PV (these were created before the RET was \nsplit into the LRET and SRES)  \n• expectations of future cuts to the 2020 target.  \nAccounting for 2013 surrenders, there are currently about 26 million surplus LGCs (ACIL Allen \n2014, p. 14), suppressing prices and making it more difficult for projects to reach financial close. The \nInvestor Group on Climate Change (IGCC) commented on the effect of this LGC oversupply in its \nsubmission to the Warburton review: \nWe understand that energy suppliers have sufficient accumulated [LGCs] such that they \nwould not need to enter the market to purchase additional [LGCs] for some time. For \nexample, AGL indicated in 2013 that they had sufficient supply of [LGCs] for 5 years of \nobligations under the scheme. If as a result of weakening the RET, there is still a surplus \nof [LGCs] in the market for some years, further new build of assets may be delayed as a \nresult of depressed LGC prices. (IGCC, Warburton review submission, p. 7) \nMore important, however, is that current low LGC prices principally reflect the view of likely cuts to \nthe current 2020 target. In a recent paper, Nelson et al. noted: \nFirms expect the target to be altered, and so LGC prices have softened and investment \nhas hence been delayed. Now such little time is left to meet the target that policy makers \nwill almost certainly as a minimum vary the target to avoid manifest policy failure or \nabandon the existing policy altogether, producing a second wave of dynamic \ninconsistency. (Nelson et al. 2014, p. 2) \nThe CER estimates that the volume-weighted average market price for an LGC will be about $30 in \n2015 (CER 2014), with this forward price reflecting anticipated cuts to the LRET \n(PricewaterhouseCoopers Australia (PwC) 2014, p. 8). This, in combination with current low \nwholesale prices, is significantly below required returns for new wind projects of at least $80/MWh \n(Bloomberg New Energy Finance 2013, p. 1). \n THE LARGE-SCALE RENEWABLE ENERGY TARGET | 33 \n BOX 2 COMPARING COMMISSIONED MODELLING OF THE RET \nAlmost a dozen modelling exercises have been conducted on the RET in recent years. While there are \ndifferences in approach and input assumptions, they are more notable for their overall similarity than their \ndifferences. For previous RET reviews, Warburton (2014) and the Authority (2012) commissioned modelling \nfrom ACIL Allen and SKM MMA, respectively. Other exercises include: \n• Deloitte Access Economics (commissioned by the Australian Chamber of Commerce and Industry, the \nBusiness Council of Australia and the Minerals Council of Australia, 2014) \n• Frontier Economics (commissioned by AEMC, 2014) \n• Jacobs (commissioned by the Climate Institute, World Wildlife Fund and the Australian Conservation \nFoundation, 2014) \n• Oakley Greenwood (commissioned by ESAA, 2014) \n• ROAM Consulting (commissioned by the Clean Energy Council, 2014) \n• Schneider (2014).  \nSome of these modelling exercises indicate that the current 2020 target can be met without exceeding the \nshortfall charge; others indicate that the shortfall charge is triggered before the target is met. In general, the \ndifferent modelling exercises indicate that, other things being equal, lower electricity demand, higher \nrenewable technology costs and lower gas prices reduce the likelihood of the target being met. Frontier \nEconomics' modelling, incorporating all of these assumptions, is the only one of these exercises finding that \nnot even a ‘real’ 20 per cent target (that is, a target based on 20 per cent of current estimated demand in 2020) \ncould be met.  \nAll exercises show that reducing the LRET improves revenue for fossil fuel generators and that overall impacts \non retail electricity prices are modest. Some project retail prices would be slightly lower, and some slightly \nhigher with the abolition of LRET: \n• ACIL Allen modelling projects that if the RET is repealed, households would be no better or worse off in the \nperiod to 2030 (ACIL Allen 2014, p. 32).  \n• Deloitte estimates that repeal of the RET would reduce the household bills on average by around $49 per year \n(Deloitte 2014, p. 19). This represents three per cent of a typical household bill of around $1,400. \n• Jacobs estimates that repeal of the RET would increase electricity prices by between 2.1 and 8.3 per cent over \nthe period to 2030 (Jacobs 2014, p. 27). \nSome participants have questioned the technology cost and carbon pricing assumptions of the ACIL Allen \nmodelling conducted for the Warburton review. The assumptions, sources and results from ACIL Allen's \nmodelling are generally similar to those from the Authority's 2012 commissioned modelling:  \n• Electricity demand—both are based on the Australian Energy Market Operator’s (AEMO’s) medium growth \nforecasts for demand in the National Electricity Market (NEM). Since 2012 the projected demand for electricity \nin the National Electricity Market in 2020 has declined by about 16 per cent (Climate Change Authority \ncalculation from AEMO 2012 and 2014a). \n• Technology costs—both are based on the Australian Energy Technology Assessment published by the Bureau \nof Resource and Energy Economics. \n• Gas prices—both forecast the gas price to reach around $9 per gigajoule by 2020. \nOne area of difference is the 'below baseline' generation for 'pre-existing' generators (largely hydro \ngenerators). As described in Box 1, the magnitude of output below baseline levels from pre-existing generators \nis important when determining how much additional renewable energy is required to meet a 'real' 20 per cent \ntarget (if that were a policy goal). In general, higher output from pre-existing generators means that a smaller \namount of additional renewable generation is required to meet a given overall share of renewables. In 2012, \nthe Authority estimated 2020 generation from these sources of about 14,300 GWh, whereas in 2014 ACIL \nAllen estimated output from pre-existing generators of about 16,000 GWh. Actual long-run output will depend \non rainfall levels, which can affect the output of hydro generators. \n \n34 | REPORT: 2014 RET REVIEW \n \nWholesale electricity prices \nLow current and expected future wholesale prices, caused largely by excess capacity in the \nelectricity market, are also making it harder to invest in large-scale renewable energy projects, given \ncurrent low LGC prices. \nWhile the RET is certainly adding capacity, it is neither the sole nor primary cause of oversupply. \nOther drivers include weakening demand for electricity and barriers and disincentives to exit for \nincumbent, ageing generators. Reasons why even very old plant might not be exiting now include: \n• The bulk of capital costs are sunk, and operating costs of most plants are quite low—so as long \nas revenues exceed operating costs, plants are likely to keep running.  \n• 'First-mover disadvantage'—generators that exit earlier make remaining generators (including \ntheir competitors) better off because reductions in supply increase wholesale market prices, \nother things being equal. \n• Uncovered site remediation costs—these are potentially very high for some generators and \nholdings of bonds intended to cover these costs may be inadequate, exposing firms to large \nliabilities should the site be closed (Nelson et al. 2014, pp. 15–16). \n• Uncertainty about the future policy environment—where investors perceive a possibility that \ngenerators could be paid to retire, they may continue to operate plant for longer than otherwise \nplanned on the prospect they could be paid to close down.  \nPotential options to address the oversupply of generating capacity include: \n• Let the market resolve the imbalance—allow the persistently low wholesale price to force \ngenerators from the market, particularly as large maintenance expenditure decisions fall due. \nThere is some evidence this is starting to happen—in the NEM about 1,300 MW of mothballed \ngeneration has recently been or is soon to be permanently retired. About 1,150 MW remains \nmothballed and more mothballing is planned for the future (Climate Change Authority based on \nAEMO 2013; AEMO 2014b).  \n• Industry-supported plant closure—an ongoing revenue stream is provided by the electricity \nsupply industry (which, in turn, would presumably be funded by electricity consumers) to fund \nthe permanent closure of excess generation capacity. \n• Taxpayer funding of plant closure. \n• Direct regulation—for example, power stations could be required to close once they reach a \ncertain age (Nelson et al. 2014, pp. 19–22). \nSelecting the right response is a very important issue for electricity consumers and the electricity \nsupply industry. The retirement of some existing fossil fuel capacity would certainly make it easier to \ninvest in new renewables or any other type of low-emissions plant. Ultimately, these new \ninvestments are essential if Australia is to transition to a low-emissions economy. \nDetailed consideration of the appropriateness of government intervention to deal with excess supply \nis beyond the scope of this review. The Authority observes, however, that there would be significant \nequity and precedent issues associated with options that require other parties paying to meet the \nremediation obligations that properly belong to generators. The Authority also notes that closing a \nsmall number of coal-fired power stations would have a limited impact on Australia's emissions in the \nshort term, to the extent that the lost output was replaced by increased output from other coal-fired \npower stations. \nThe Authority’s concerns about equity issues are shared across state and federal governments. In \nDecember 2014, the Council of Australian Governments (COAG) Energy Council stated (p.1) that it \ndoes not support assistance to generators to exit the market and ‘opposes the transferral of the costs \nof retiring assets onto consumers or taxpayers’. The Council will consider whether there are any \n THE LARGE-SCALE RENEWABLE ENERGY TARGET | 35 \n \nmaterial barriers to orderly exit and task AEMO with further work on pathways to ensure the exit of \ngenerators does not create risks for electricity system security. \nAvailability and cost of finance for new renewable generation \nA critical issue in determining the overall feasibility of meeting the LRET is whether prospective new \nprojects will be able to secure the necessary finance.  \nTo date, investment in new renewable generation to meet the RET has often, but not always, been \nbased on power purchase agreements (PPAs). PPAs are long-term agreements between a \nrenewable energy generator and an electricity retailer with obligations to surrender LGCs. The \nretailer typically agrees to purchase all electricity generated, with pricing for the LGCs and electricity \ncovering the cost of the renewable investment. A PPA assists the renewable energy project in \nobtaining finance for construction, because potential investors know that it has a guaranteed price for \nits output. Retailers can benefit by contracting access to the LGCs required to meet their LRET \nliability, shielding themselves from unexpected increases in future LGC spot market prices.   \nFor a renewable energy project, the alternative to signing a PPA is to be a ‘merchant’ generator. \nMerchant generators can rely on spot prices for both electricity and LGCs—or can hedge against \nfuture uncertainties through short-term forward contracts. The lack of a guaranteed price for their \noutput increases the risk relative to a generator with a PPA, which is reflected in higher risk \npremiums for finance. \nAs part of this review, the Authority held bilateral meetings with a number of banks and equity \ninvestors to better understand the conditions under which investment in new large-scale renewable \nenergy projects would be commercially feasible. Taking these discussions into account, as well as \nevidence presented in submissions, the Authority concludes that: \n• Bipartisan support is critical. Agreement between the two major political parties on the level \nand timing of the LRET would restore confidence to make investments in new capacity. Many \nstakeholders have highlighted the need for this commitment to unequivocal, even in the face of \ncontinued lobbying for the target to be cut. Given the extent of uncertainty and disruption caused \nby the recent period of policy uncertainty, investor confidence may take some time to return. \n• Surplus LGCs are suppressing prices and making it more difficult to invest. This suggests \nthat if changes are made to the level or timing of the annual targets, then the targets to 2017 \nshould not be altered, to assist with running down the surplus. \n• Sufficient generation to meet the target is unlikely to be financed without arrangements \nsuch as PPAs that provide certainty about future revenue streams. Given the suppressed \nwholesale price and uncertain outlook for electricity demand, PPAs (or mechanisms that provide \nsimilar certainty) are important for investors (PwC 2014). While investments can be made on a \nmerchant basis, the increased risk raises the costs of finance, which will likely make some \npotential projects uneconomic. \n• The current scheme end date of 2030 will likely curtail the volume of projects that are \nfinancially feasible. The IGCC noted that investors typically need 12, and preferably 15 years, \nof LGC revenue for a project to be commercially viable. Given the time required for investors to \nregain confidence, project developments may only begin in earnest from 2016 or 2017; even if \ndevelopments started again in 2015 new projects would not be operational until 2017 at the \nearliest. The short remaining period for LGC creation would mean recovering costs from fewer \ncertificates, potentially causing the required LGC price to rise above the shortfall charge. An \nextension of the scheme's horizon would reduce the certificate prices required to raise the same \nproject revenues.   \n• Frequent reviews of the LRET create uncertainty which discourages investment in the \nsector. Investors suggested that legislated reviews should be removed altogether, or \nundertaken less frequently (see chapter 5). \n36 | REPORT: 2014 RET REVIEW \n \nIn the near term, the Authority's view is that there is no difficulty in meeting annual targets under the \nLRET, because of the large overhang of LGCs and the gentle increase in the annual target levels. \nFrom 2017 to 2020, however, the annual targets increase steeply from 25,181 GWh to 41,000 GWh \n(Figure 9). This sharp increase, in combination with the current market conditions and political \nuncertainty, could make meeting the target too challenging a task, even if an early bipartisan \nagreement on the LRET were reached. Options for dealing with this situation are discussed in the \nfollowing sections. \nFIGURE 9 ANNUAL LRET TARGETS 2001–2030 \n \nNotes: Targets from 2001–2010 are for the RET as a whole. Annual targets exclude allowance for waste coal mine gas \ngeneration. Since 2011 the RET has operated as the SRES and LRET; as part of the split the targets were re-phased to reduce \nthe number of excess certificates. This included increasing the 2012 and 2013 targets, and slightly reducing the targets from \n2016–18 to balance the adjustment. \nSource: Warburton review 2014 \n \n3.2. CASE FOR ADJUSTING THE LARGE-SCALE RENEWABLE \nENERGY TARGET \n3.2.1. LEVEL OF THE 2020 TARGET \nIn 2012, the Authority considered arguments for changing the level of the LRET. At the time, the \nAuthority considered that, on balance, the level of the target should not be changed. This judgement \nwas largely based on providing stability, predictability and investor confidence for the LRET and \nclimate policy more broadly. \nSince then, the risk of the LRET not being met has increased significantly. If liable parties meet their \nRET obligations by paying penalties rather than surrendering certificates, this increases consumer \nelectricity prices for no environmental benefit. This is a situation to be avoided. Not only would it \nimpose costs on consumers, but it could undermine public confidence in climate policies and erode \nsupport for mitigation measures. \nIn submissions to this review and the Warburton review, some participants, including incumbent \ngenerators and emissions-intensive businesses, argued that the target should be reduced to a 'real' \n20 per cent target (that is, one based on 20 per cent of either current estimated or actual electricity \ndemand in 2020) or be abolished completely. Four main reasons were advanced—the LRET does \nnot represent low-cost emissions reductions, the difficulty of meeting the current target, the \n THE LARGE-SCALE RENEWABLE ENERGY TARGET | 37 \n \noversupply of capacity in the market and the LRET’s large impact on trade-exposed industries. \nStanwell, for example, submitted: \nStanwell supports efficient, industry wide approaches to emissions abatement at least \ncost to the Australian economy. The current RET does not meet this criteria. (Stanwell, \nsubmission to the Climate Change Authority, p. 1) \nOther participants, largely renewable energy proponents and non-government organisations, argued \nthat substantial investment and planning had occurred based on the current target, and that its level \nshould be maintained. WWF Australia noted: \nThe RET has … mobilised national and international investment and built a strong \ndomestic renewable energy industry which will be important to Australia’s future \neconomic prosperity. The renewable energy target has mobilised around $20 billion in \ninvestment to date and will generate nearly $15 billion more by 2020 under the current \ntarget. Reducing the RET would threaten these investments and harm Australia’s \nreputation as a reliable investment destination. (WWF Australia, submission to the \nClimate Change Authority, p. 2) \nThe modelling conducted for the Warburton review indicates that reducing the target to a 'real' \n20 per cent target (25,500 GWh in the ACIL Allen modelling) would: \n• Reduce the amount of new large-scale renewable capacity built between 2014–2020 from about \n8,200 MW to 3,200 MW (a reduction of about 60 per cent). \n• Reduce the LGC price in 2014 by about $14, which is 26 per cent lower than with the current \nRET. LGC prices would be consistently more than 10 per cent lower to 2030. \n• Improve coal-fired generators' aggregate profits to 2030 by about $9.3 billion in NPV terms \n($6.6 billion for black coal; $2.7 billion for brown coal).  \n• Reduce investment in the renewables sector from about $14 billion to around $6 billion over the \nperiod to 2030. \n• Lower household bills slightly to 2020, then increase them slightly to 2030, resulting in a \ncumulative increase of $118 over 2015–2030 in NPV terms. \n• Increase cumulative emissions by 39  Mt CO2-e over the period 2015–20 and 190 Mt CO2-e over \nthe period 2015–30 (ACIL Allen 2014, pp. 40–50; Warburton review 2014, pp. 51–2). \nMany participants acknowledged the need to make provisions for existing projects in the event the \ntarget is cut. The Business Council of Australia (BCA) noted: \nRecognising that investments have now been made under the scheme, the scheme \ncannot be scrapped without stranding assets and creating issues of sovereign risk. \nTherefore, any amendments to the RET should seek to not adversely affect investments \nthat have already been made and should be mindful of their impact on investments \ncurrently being planned or already subject to approval. (BCA, Warburton review \nsubmission, p. 15) \nThe design and implementation of appropriate transitional assistance for existing projects would not \nbe straightforward. Providing standardised assistance by fixing an LGC price would likely lead to \nwindfall gains or losses for individual projects. Project-specific measures would avoid this problem, \nbut implementation would be more complex. For example, criteria would need to be established for \nassessing what were reasonable expectations of the LGC price on commencement of a project and \nwho bore the risk for a reduction in the price under each contract. In addition, providing transitional \nassistance to existing projects raises the costs of any weakening of the LRET targets. These costs \nare likely to be borne ultimately by electricity consumers or taxpayers. \n38 | REPORT: 2014 RET REVIEW \n \nAny sizeable reduction in the target would also retard the decarbonisation of Australia’s electricity \nsector. As outlined in section 2.4, the electricity sector will play an important role in Australia's \ntransition to a low-emitting economy. Cuts to the RET now would require more rapid emissions \nreductions in the sector later, and more reductions to be made up from elsewhere to meet Australia’s \n2020 target. At this time, there is no evidence that emissions reductions of the scale required from \nthe electricity supply sector could be obtained more cheaply through the ERF.  \nThe importance of the RET in reducing Australia's emissions was noted by some stakeholders, \nincluding AiG: \nIf the RET were removed or significantly scaled back, there would be a much larger gap \nbetween likely emissions and Australia’s commitment to reduce greenhouse gas \nemissions to at least five per cent below 2000 levels by 2020. The cost and difficulty of \nbridging this gap through other policies could be significant, particularly if low-cost \ninternational abatement options are excluded. (AiG, Warburton review submission, p. 4) \nIt should be noted that the RET was always intended to deliver ‘at least 20 per cent’ renewables and \nhad the goal of subsuming the existing and planned state-based targets that existed when it was \ndeveloped (Explanatory Memorandum, REE Amendment Bill 2009 (Cth)).  \nIn the Authority’s view, the changed circumstances since its last review do not warrant a reduction in \nthe target. In particular, there is no compelling justification for reducing the target to a level \nrepresenting 20 per cent of an updated electricity demand forecast for 2020. There is no reason to \nthink that 20 per cent is the ‘right’ amount of renewable energy. As noted above, a significant \nreduction in the target would not decrease consumer prices and would not provide a satisfactory \nsolution to the current oversupply problem. It would, however, defer investment in renewable \ngeneration, leading to higher electricity sector emissions, making it harder for Australia to achieve the \ndeeper emissions reductions required beyond 2020. While modelling indicates that maintaining the \ncurrent target level reduces fossil fuel generators' profits, it is likely that any effective mitigation policy \nwill have this kind of effect. The next section considers the Authority’s preferred option for adjusting \nthe LRET.  \n3.2.2. RESCHEDULING THE LRET TARGETS \nThe current target of 41,000 GWh of renewable energy in 2020 is looking increasingly challenging to \nachieve. Rather than cutting the 2020 target, the Authority suggests that consideration be given to \nextending the end year for achieving the target. This could help to restore confidence in the scheme, \nand provide the industry with some 'breathing space' to resume building the required capacity, \nfollowing the disruptions of recent years. It would also provide some extra time for incumbent \ngenerators to adjust to further falls in projected electricity demand in 2020—for example, projected \ndemand for electricity in the NEM in 2020 has declined by about 16 per cent since 2012. \nFigure 10 shows a proposed reschedule, which:  \n• retains the current annual targets to 2017 to run down the present surplus of certificates  \n• extends the end date for operation of the LRET by at least the same number of years as the \n41,000 GWh target is extended to ensure projects built later in the period have enough time to \nrecoup the cost of their investments.  \n THE LARGE-SCALE RENEWABLE ENERGY TARGET | 39 \n \nFIGURE 10 PROPOSED RE-PHASE FOR LRET TARGETS \n \nSource: Climate Change Authority \nRecent modelling of the LRET has not specifically analysed the effects of deferring the 41,000 GWh \ntarget. A few stakeholders have commented on the case for deferring the current 2020 LRET target. \nThe Major Energy Users Association submitted that: \nThe proposition by some liable parties to extend the transition period (to 41,000 GWh \nLRET) beyond 2020 while ramping up the target in the years between 2020 and 2030 \n(e.g. the 30/30 proposition) suggests a reasoned compromise. It avoids the heavy \nshort-term burden on industry and consumers, but provides ongoing signals for \ninvestment in renewable energy as demand grows and/or international agreements \nemerge. (Major Energy Users Association, Warburton review submission, p. 48) \nSchneider has modelled an LRET scenario where the targets are reshaped, with obligations reduced \nin the near term (to 2020) and added at the back end of the scheme (2020 to 2030), with overall \nobligations the same. This modelling suggests that deferring the target in this way would have a \nminimal impact on overall emissions (Schneider 2014, pp. 8–10). \n3.2.3. THE AUTHORITY'S VIEW \nOn balance, the Authority considers it is better to extend the 2020 target and increase confidence it \ncan be met, than to retain the target and miss it.  \nGiven the doubts about achieving the LRET target by 2020 discussed earlier—reflecting policy \nuncertainty and low investor confidence—this approach would seem to be a pragmatic basis for \nmoving forward.  \nA 'minimal change' approach would be to extend the targets by up to three years—and extend the \nend of the scheme by at least the same amount of time (Table 4). Any new LRET schedule should \ntake account of the current LGC surplus, and leave targets to 2017 unchanged. The revised \nschedule should also take account of the time required for restoration of investor confidence and the \nphysical construction of required capacity. \n40 | REPORT: 2014 RET REVIEW \n \nTABLE 4 ILLUSTRATIVE RE-PHASE OF THE 2020 LRET TARGET—TWO EXAMPLES \n LRET Targets (GWh) \nYear Current 2-year extension 3-year extension \n2017 \n25,181 25,181 25,181 \n2018 29,781 28,345 27,818 \n2019 34,381 31,509 30,454 \n2020 41,000 34,672 33,091 \n2021 41,000 37,836 35,727 \n2022 41,000 41,000 38,364 \n2023 41,000 41,000 41,000 \nEnding 2030 2032 (at the earliest) 2033 (at the earliest) \nNote: The table provides illustrative examples of extending the target by two or three years and extending the scheme by at least \nthe same amount of time. Given the large overhang of certificates, there is no case to reduce the annual targets until after 2017. \nSource: Climate Change Authority \nRECOMMENDATION \nR.1. Given the sharp decline in investor confidence, the resulting slowdown in investment, \nand the further reduction in projected electricity demand, the government should: \n• defer the 2020 target for the LRET by, say, up to three years and \n• extend the scheme as a whole by at least the same amount of time, with a view to \nproviding sufficient time for projects to recover their costs. \nGiven the large overhang of certificates, there is no case to reduce the annual targets \nuntil after 2017. \n \n3.3. EXEMPTIONS FOR EMISSIONS-INTENSIVE, TRADE-EXPOSED \nINDUSTRIES \nThis section considers whether the current basis for assisting particular businesses with RET costs \nremains appropriate. \nPartial exemptions are provided for businesses undertaking emissions-intensive, trade-exposed \n(EITE) activities on the basis that RET costs reduce the competiveness of businesses competing in \nan international environment.  \nThe current RET partial exemption framework determines eligibility and assistance rates based on \nan activity's overall emissions intensity, regardless of the extent to which those emissions are related \n THE LARGE-SCALE RENEWABLE ENERGY TARGET | 41 \n \nto electricity use. Emissions intensity is determined using historical data and the exemption is only \napplicable to the portion of RET costs associated with expansion of the original 9,500 GWh MRET. \nHighly EITE activities are eligible to receive a 90 per cent exemption of their incremental RET costs, \nwhile moderately EITE activities are eligible for a 60 per cent exemption. In 2013, this translated to \nan exemption rate of about 75 per cent for highly EITE activities and about 50 per cent for \nmoderately EITE activities (Warburton review 2014, p. 79).  \nThere is some (understandable) confusion between 'exemption' and 'liability' under the RET. Most \nEITE businesses are not liable entities. Liable entities under the RET are those that acquire \nelectricity from the wholesale market or electricity direct from a generator—in practice, primarily \nelectricity retailers. When EITE businesses receive assistance with RET costs, overall RET liabilities \nremain unchanged, so RET costs are passed through to a smaller set of non-exempt customers.  \nExemptions are provided through Partial Exemption Certificates issued by the CER to EITE \nbusinesses. The value of the exemption takes into account the assistance rate and a range of other \ninputs, including:  \n• electricity use per unit of output for the activity—each activity has a specified industry average \nelectricity baseline, the value of which is predetermined from historical data and is set in \nregulations  \n• output—the quantity of relevant product is submitted to the CER by the EITE business every \nyear \n• proportion of electricity use from a given site that incurs a RET liability.  \nThe Authority considered the assistance for EITE activities in its 2012 RET review, but did not form a \nconclusion. At the time, the carbon pricing mechanism included a similar assistance regime for the \nsame activities, leading the Authority to recommend the Productivity Commission consider the issue \nas part of its broader review of carbon pricing assistance. With the repeal of the carbon price, the \nAuthority has considered whether the eligibility criteria remain appropriate.  \nProviding assistance based on emissions intensity, rather than electricity intensity, leads to some \nanomalies. Figure 11 shows the emissions intensities and electricity intensities of selected activities \nand the thresholds for assistance. Based on the current eligibility thresholds, some activities, such as \nlime and ammonium nitrate, are highly emissions-intensive, but not particularly electricity-intensive. \nThese activities receive a high level of exemption from RET costs, despite having lower electricity \nintensities than some moderately emissions-intensive activities, such as tissue paper manufacturing.  \nProviding assistance with electricity costs to businesses that are not particularly electricity intensive \nplaces a greater burden on non-exempt electricity users. In the Authority's view, any changes to \nassistance with RET costs should be based on need and the best measure of need in this context is \nelectricity intensity. If broadening of assistance is considered, it should be based on electricity \nintensity. \n42 | REPORT: 2014 RET REVIEW \n \nFIGURE 11 EMISSIONS INTENSITY AND ELECTRICITY INTENSITY OF SELECTED ACTIVITIES \nELIGIBLE FOR PARTIAL EXEMPTIONS FROM RET COSTS  \n \nNote: The emissions intensity for each activity includes scope 2 (electricity) emissions, with 1 MWh of electricity use converted to \n1 tCO2-e. All numbers in this figure have been provided as midpoints of ranges to protect commercial confidentiality. The eligibility \nthreshold for highly EITE activities is 2,000 tCO2-e/$ million revenue and for moderately EITE activities it is 1,000 tCO2-e/$ million \nrevenue. (There are also thresholds based on tCO2-e/$ million value added; activities are eligible for assistance if they qualify \nunder either metric.) Data was originally provided to the Department of Climate Change and Energy Efficiency for the purpose of \nestablishing the eligibility of EITE activities under the Jobs and Competiveness Program and Renewable Energy Target \nexemption scheme. Emissions data was provided for the financial years ending 2007 and 2008, and revenue data was provided \nfor the financial year ending 2005 to the second half of 2008. \nSource: Climate Change Authority based on data provided by the Department of the Environment  \n \nCONCLUSION \nC 3. If any further exemptions from electricity costs under the RET are to be granted, this \nshould be on the basis of electricity intensity, rather than emissions intensity. \n \n \n THE LARGE-SCALE RENEWABLE ENERGY TARGET | 43 \n \n3.4. THE RENEWABLE ENERGY TARGET AFTER 2020  \nChapter 2 included comparisons of the projected emissions intensity of Australia's electricity supply \nin 2030 under low-emissions pathways with those under the current RET. This highlighted that more \nwill need to be done beyond 2020 for Australia to follow a transition path consistent with global action \nto reduce the risks of dangerous climate change. This does not, of itself, necessarily mean that the \nRET should be maintained indefinitely, or increased or extended. Indeed, the Authority would like to \nsee a more comprehensive approach to the electricity sector which would encourage all forms of \nzero- and low-emissions generation technologies, and discourage more emissions-intensive forms of \ngeneration, in a more cost-effective way than is attainable through the RET alone. That approach, \nhowever, seems some way off, and in the meanwhile further increases in and of RET targets \npost-2020 should be considered.  \nAs part of any consideration of increased and extended RET targets, eligibility for certificate creation \nshould also be reconsidered. The RET might be modified, for example, to become a low-emissions \ntarget through the inclusion of other zero- or low-emissions technologies.  This could include waste \ncoal-mine methane generation plants, plants burning industrial waste gases derived from fossil fuels, \npotentially coal or gas carbon capture and storage plant, and, if ever permitted by law, nuclear \nenergy. Certificates created for non-zero-emissions plant could be discounted relative to \nzero-emissions plant.  \nConsistent with the conclusions drawn in its 2012 RET review, the Authority believes that issues of \ninvestor confidence and regulatory risk remain highly relevant to investors in renewables and should \nbe taken into account when considering future policy options.  \nThe Authority has recently been asked to conduct a special review under section 59 of the Climate \nChange Authority Act 2011 over the next 18 months. This will cover future national emissions \nreduction targets, emissions trading and other plausible measures relevant to Australia pursuing its \npost-2020 emissions reductions targets. Stakeholder views on policy options for the electricity sector \nwill be sought as part of this review. \nRECOMMENDATION \nR.2. Over the longer term increased recourse to renewables in electricity generation is \nessential to Australia’s efforts to reduce its total greenhouse gas emissions. In the \nabsence of effective alternatives, RET arrangements will have to carry much of this \nburden, so consideration should be given—at the appropriate time—to the nature \nand timeframe of possible RET arrangements in the post 2020 period. In particular, \nthe government should consider increasing and extending targets, and expanding \narrangements to cover a wider set of technologies.   \n \n \n44 | REPORT: 2014 RET REVIEW \n CHAPTER 4. THE SMALL-SCALE RENEWABLE \nENERGY SCHEME \nThe SRES provides support for small-scale renewable technologies, including small-scale \nsolar PV. Owners of eligible small-scale technologies receive tradeable certificates upfront \nfor the amount of renewable electricity the system is 'deemed' to create over a given period, \nwhich they generally assign to the installer in exchange for a lower system price. \nInstallations of solar PV have exceeded expectations and so far, about 1.3 million solar PV \nsystems have been installed under the RET, producing about 3,800 GWh of electricity in \n2013. \nThis chapter focuses on solar PV and considers whether the level of assistance provided \nunder the SRES should be adjusted, and, if so, how. It considers the impacts of the SRES \nand whether the benefits achieved represent value for money for Australia as a whole.  \nIt concludes that subsidising PV under the SRES is a relatively expensive way of reducing \nemissions from the electricity sector, but does not see any strong case for urgent change, \ngiven that the overall costs are relatively modest and assistance will start phasing out from \n2017. If any changes are introduced, they should be gradual to avoid creating disruption in \nthe sector.  \n4.1. THE AUTHORITY'S 2012 CONCLUSIONS AND SUBSEQUENT \nDEVELOPMENTS \nIn its 2012 review (CCA 2012, p. 65), the Authority identified four potentially problematic issues with \nthe design of the SRES, but did not recommend any fundamental changes. Those issues were:  \n• the uncapped nature of the scheme means that the SRES can account for a relatively large \nshare of total RET costs for consumers under certain circumstances \n• unlike the LRET, the subsidy provided to small-scale systems does not automatically reduce \nwith falling technology costs, meaning that government intervention is required to reduce \nassistance rates \n• there was no legislated end date for the scheme (this has now changed) \n• paying for 15 years of generation upfront ('deeming') was unlikely to be justifiable for larger solar \nPV systems below the eligibility threshold of 100 kilowatts (kW).  \nThe Authority considered a number of options for addressing these issues, including recombining the \nSRES and LRET, and introducing certificate discounting that the Minister could initiate under \npre-specified conditions. On balance, the Authority opted to propose modest adjustments to guard \nagainst possible booms and high costs, rather than any major and likely disruptive changes. \n THE SMALL-SCALE RENEWABLE ENERGY SCHEME | 45 \n \nSpecifically, the Authority recommended lowering the eligibility threshold for solar PV and adding an \nend date to the scheme; the second of these was accepted and the scheme will now end in 2030.  \nAt the time, the Authority noted that more disruptive options, such as recombining the LRET and \nSRES, might have been justified if the uptake of small-scale systems was expected to continue its \nstrong growth. It found, however, that as the factors driving the boom—sharp falls in system costs, \ngenerous payments for exported electricity through state-based feed-in tariffs, and 'multiplier' credits \nfor solar PV—were no longer present, and installations were expected to stabilise. This seems to be \noccurring—data from the Clean Energy Regulator (2014) shows that system installations in 2013 (the \nlast year for which data are complete) were actually 44 per cent lower than their 2011 peak.  \nThat said, with the exception of the legislated end date, the design issues and consequent risks that \nthe Authority identified in 2012 remain today. Data from the Australian PV Institute indicate that since \n2012, costs for PV modules and overall PV systems have continued to decline, albeit at slower rates \n(Figure 12). The average system size and the share of larger systems is rising (Figure 13); this \nincreases the compliance costs of the SRES, other things being equal. Typical module prices fell \nfrom $1.50 per Watt in 2012 to $0.75 per Watt last year; installed prices for typical small residential \nsystems dropped less rapidly, falling from $3 to about $2.50 per Watt. Very recently, there have been \nreports (see for example Edis 2014) that some suppliers have been offering prices as low as \n$1 per Watt for fully installed systems after SRES assistance, implying a total installed price of \n$1.60 per Watt.  \nFIGURE 12 TRENDS IN AUSTRALIAN PV SYSTEM COSTS, 2000–2013 \n \n \nNote: Prices are prior to any assistance under the SRES and are in nominal dollars.  \nSource: Climate Change Authority based on Australian PV Institute 2013  \nArguments for maintaining current levels of support have become less compelling with the decline in \nupfront costs. \nStakeholder views on the SRES are polarised. Liable entities, large energy users, peak electricity \nand some business peak bodies favoured scaling back or phasing out assistance on the grounds \nthat solar is now a cost-effective economic investment for households and no longer requires a \nsubsidy. Other stakeholders involved in the small-scale market argued that the SRES should be \nretained in its current form because of the public benefits it creates. \n \n46 | REPORT: 2014 RET REVIEW \n \n \nFIGURE 13 SHARE OF INSTALLED PV CAPACITY BY SYSTEM SIZE, 2009–2014 \n \nNote: 10 kW includes systems of 10–100 kW. \nSource: ACIL Allen 2014 \nSubmissions3 from the Australian Industry Greenhouse Network, Business Council of Australia, and \nEnergy Networks Association argued for abolition. Others supported an accelerated phase-out, \nsuggesting a range of approaches including capping the scheme, reducing the length of deeming \nperiods and applying a discount factor to certificates. AiG proposed regular and predictable \nadjustments using a formula that accounts for changes in the consumer cost of small-scale \ntechnologies and retail electricity prices. \nStakeholders advocating the SRES be retained highlighted the impacts on the industry should the \nscheme be abolished, and argued that it has beneficial impacts on electricity prices and has driven \nimprovements in industry standards and innovation. The Australian PV Institute, REC Agents \nAssociation, Yingli Solar and SunWiz argued that the growth of distributed PV reduced reliance on \nhigher cost generators during extreme temperature events, helping suppress wholesale power \nprices. The Clean Energy Council (CEC), REC Agents Association, Australian Solar Council and \nAustralian PV Institute argued that rooftop solar will also deliver future benefits by deferring upgrades \nto the electricity network.  \nMany stakeholders in the industry pointed to the structure and wide geographical distribution of \nemployment in small-scale renewables, and argued that abolishing the SRES would result in the loss \nof thousands of jobs. SunWiz argued that reducing or abolishing the SRES would increase upfront \ncosts and payback periods for PV systems, and have a substantial impact upon their affordability and \ndemand. The REC Agents Association pointed to the benefits of the SRES to the industry to date, \narguing it has helped drive scale, resulting in lower costs through the industry supply chain and \ninnovations in the marketing, delivery and installation of solar systems. The CEC argued that the \nSRES plays a vital role in ensuring high standards of quality assurance and safety within the industry \nbecause only PV systems designed and installed by accredited parties can access the SRES.  \n3 References to submissions in this chapter are those made to the Authority if the organisation made a submission to the Authority \n(see Appendix A), otherwise references are to organisations’ submissions to the Warburton review.  \n THE SMALL-SCALE RENEWABLE ENERGY SCHEME | 47 \n                                                          \n \nWhether the level of assistance provided under the SRES should be adjusted and, if so, how, are \nreasonable questions to be asking.  Because assistance for PV systems is paid up-front, changing \nthe level of assistance will have no effect on households who have already installed PV—there is no \n'stranded' asset risk for such households. Rapid step changes, however, could significantly disrupt \ninstallation businesses.  \nIn considering assistance under the SRES, the Authority has looked at: \n• the impacts of the SRES \n• whether the benefits achieved represent value for money for Australia as a whole \n• the need for a smooth transition if assistance were to be reduced, to avoid the risk of serious \ndisruption in the installation industry. \nTwo preliminary points should be noted. First, the discussion here should not be interpreted as \nrelating to assistance for technologies other than solar PV. In this limited review, the Authority has \nconfined its focus to solar PV because it makes up the overwhelming majority of certificate creation \nunder SRES (over 90 per cent of certificates in 2013) (Climate Change Authority calculation from IES \n2014, p. 10). Modelling commissioned for the Warburton review suggests that this dominance will \ncontinue, with solar PV projected to make up 75 per cent of cumulative certificates created over \n2015–2030 (Climate Change Authority calculation from data underlying ACIL Allen 2014, p. 17).  \nSecond, this analysis focuses on household PV rather than larger, commercial-scale PV; time and \nresources have prevented the Authority from considering commercial-scale PV in this review; Box 3 \nprovides an overview of the issues.  \n4.2. IMPACTS OF THE SRES  \nSmall-scale PV has private and wider social costs and benefits. In addition to the net private benefits \nfor households, installation of small-scale PV has three sources of wider social impact:  \n• emissions reductions associated with displacement of electricity from the grid \n• the 'network impacts' of PV installations on the broader systems that transmit and distribute \nelectricity from generators to consumers \n• growth of the small-scale PV industry. \n4.2.1. HOUSEHOLD COSTS AND BENEFITS OF PV \nAs with measures to improve household energy efficiency, barriers to the uptake of PV can include \nprice or other factors, some of which SRES addresses through an upfront subsidy. Installing \nhousehold solar PV has net financial benefits for households—the reduction in ongoing electricity \nbills from self-generation is likely to more than offset the upfront cost of installing a PV system. Net \nfinancial benefits would probably accrue even without the SRES, but by providing an upfront \npayment4 to households, the scheme lowers initial expenses and shortens the payback period. The \nupfront payment represents the amount of renewable energy the system is 'deemed' to create over a \ngiven time frame, and increases with system size and the ‘quality of the solar resource’ (that is, the \nsunniness of the broad location). This support will decrease from 2017 as the deeming period \nreduces by one year each year until the scheme ends in 2030.  \n \n4 Technically, the SRES allows households who install solar PV to create tradeable certificates. In practice, the vast majority of \nhouseholds assign these certificates to the installer in exchange for a reduction in the installation price, hence the shorthand \n‘payment’. \n48 | REPORT: 2014 RET REVIEW \n                                                          \n BOX 3 TREATMENT OF COMMERCIAL-SCALE PV IN THE RET \nIn its 2012 review, the Authority noted the risk that future increases in installations of \ncommercial-scale solar PV could increase the volume of STCs and therefore the costs of the \nuncapped SRES. The Authority recommended reducing the eligibility threshold for PV and \nthat the government conduct further consultations to determine an appropriate threshold. \nSystems over the threshold would be incorporated in the LRET with five-year deeming. Earlier \nthis year, the Warburton review made a similar recommendation, specifying an SRES \neligibility limit of 10 kW (see Appendix C). \nInstalled capacity of systems over 10 kW grew by an estimated 150 per cent over 2012–13, \nalbeit from a very low base. Much of this growth was encouraged by grants from the \nnow-discontinued Clean Technology Investment Program (Green Energy Markets 2014, \np. 32). The Warburton review (2014, p. 74) notes the presence of barriers to uptake that would \nreduce the likelihood of a significant future boom in commercial-scale PV, such as the fact that \nindustrial businesses pay lower electricity tariffs than households, and often rent their \npremises. \nThat said, as the market for household solar PV becomes more saturated, PV suppliers will \nlikely increase their efforts to target business customers, including through offering \narrangements such as solar leasing that would lower some of these barriers. This entails \nsome risk of a boom in these systems, which would cause a rapid increase in SRES costs. \nBoth the renewable energy industry and the CER have raised concerns at the high \ncompliance costs associated with shifting larger systems into the LRET. The Clean Energy \nCouncil (2014) reports that installing and checking the more sophisticated meters required \nwould increase installation costs by several thousand dollars. The CER would experience very \nlarge increases in applications for accreditation.  \nMoving larger systems into the LRET is but one approach to managing the risks to future \nSRES cost blowouts (and would require a solution to the high transaction costs problem to be \nviable). Other options are:  \n• retaining commercial-scale PV in the SRES but issuing certificates more frequently (either \nfewer years of upfront deeming or at intervals in arrears)  \n• retaining commercial-scale PV in the SRES with a more rapid phase-out of deeming.  \nThe Authority believes further consideration of the consequences of these options is \nwarranted, but it has not been possible in the course of this review. \n \nThe average upfront cost of installing a 3 kW solar system (a common system size) is estimated at \nabout $7,670 in 2014 (Green Energy Markets 2014, p. 27). SRES payments cover about one-third of \nthis cost; on average across states and territories, this lowers the simple payback period of a 3 kW \nsystem from 10 to about seven years (Warburton review 2014 p. 66). As the deeming period reduces \nin future, the absolute value of this upfront payment will fall by about $160 per year in nominal \nterms.5 \n5 Climate Change Authority calculation based on an STC price of $38, a 3 kW system and solar zone data from Renewable \nEnergy (Electricity) Regulations 2001 (Cth), schedule 5. It is a simple average across solar zones that determine the volume of \nSTCs deemed in one year to create an Australia-wide approximation. \n THE SMALL-SCALE RENEWABLE ENERGY SCHEME | 49 \n                                                          \n \nIn addition to net financial benefits, households also receive non-monetary benefits from installing \nPV. Many get satisfaction, for example, from reducing their reliance on energy retailers and feel that \ngenerating renewable energy at home is a 'practical' or direct way of contributing to Australia's \nemissions reduction task.  \nThe funds for the SRES subsidy are ultimately provided by electricity consumers as a whole. Liable \nparties under the RET—generally electricity retailers—have to surrender certificates created by \nrenewable energy from small-scale technologies: retailers pass the costs of purchasing these \ncertificates onto their customers. In 2014, SRES costs were estimated to make up 1.6 per cent of an \naverage household electricity bill (ACIL Allen 2014, p. 24); SRES costs would represent a larger \nshare of commercial bills because commercial users generally have lower electricity tariffs. \n4.2.2. SOCIAL COSTS AND BENEFITS OF PV \nEmissions reductions \nGenerating electricity from solar PV displaces emissions-intensive grid electricity. So far, about \n1.3 million solar PV systems have been installed under the RET, producing about 3,800 GWh of \ngeneration in 2013 (Warburton review 2014 pp. 8,10). This total embraces all of the solar PV \nsubsidised by the SRES, including systems that households would have installed in the absence of \nSRES. The emissions reductions properly attributable to policy depend on the number of ‘additional’ \ninstallations the SRES has encouraged.  \nAssessing ‘additionality’ is difficult, given the judgments that have to be made about how many \nsystems would be installed without SRES. Modelling by SKM MMA for the Authority's 2012 RET \nreview, and by ACIL Allen for the Warburton review, provides two estimates of the additional systems \nthat might be encouraged by the SRES in future: \n• ACIL Allen projected that about 2,800 MW of solar PV would be installed over 2015–2020 \nwithout the SRES and 3,700 MW would be installed with the SRES in place; this suggests about \none-quarter of projected installations to 2020 might be additional (Climate Change Authority \ncalculation from data underlying Warburton review 2014, p. 69). ACIL also projects ‘additional’ \nemissions reductions of 15 Mt CO2-e over the period to 2030 (ACIL Allen 2014, p. 116).  \n• SKM MMA projected about 3,400 MW of solar PV without the SRES and 3,500 with the SRES in \nplace over 2012–13 to 2020–21, suggesting fewer than five per cent of installations would be \nadditional (Climate Change Authority calculation from SKM MMA 2012). \nIt is possible that the proportion of 'additional' systems encouraged by the SRES is falling over time. \nThe lower the pre-subsidy upfront costs, the shorter the payback period, so, other things being equal, \nfalls in upfront costs are likely to raise the share of uptake that would occur regardless of the policy.  \nImpacts on the electricity network \nDifferent electricity consumers place different demands on the networks that transmit and distribute \nelectricity. Air conditioning, for example, can impose heavy demands at peak times, increasing \nnetwork costs. Solar PV can reduce a consumer’s demand on the network during peak times, but \nalso uses the network to export generation surplus to the household’s requirements. Current \napproaches to network pricing do not accurately reflect the costs and benefits created by different \nconsumers. As a result, network pricing can tend to over- or under-encourage the installation and \nuse of technologies such as PV and air conditioning.   \nThe introduction of more cost-reflective network pricing is an important issue for the electricity sector. \nIt is beyond the scope of this review, but is currently being addressed through other channels, such \nas Australian Energy Market Commission rule changes (AEMC 2014a). \n50 | REPORT: 2014 RET REVIEW \n \nAvailable estimates of the impact of PV on networks differ, but generally indicate that PV either \nimposes much smaller costs on other network customers than air conditioning does, or provides net \nbenefits (NERA 2014, APVI 2013). A recent case study used modelled PV data to estimate that a \nhousehold with a 2.5 kW north-facing PV system receives a reduction in their network charges that is \napproximately $120 per year greater than value of the reduction in network costs caused by the PV \nsystem. In contrast, a case study in respect of a large air conditioning unit found the additional \nnetwork costs were approximately $680 per year more than the extra network charges paid by the \nhousehold (NERA 2014 cited in AEMC 2014b, pp. 28–9). \nImpacts on the installation industry \nThe final wider social impact of households' demand for PV is that businesses exist across Australia \nto satisfy it. Any changes to the level of assistance provided through the SRES would affect the \nowners and employees of these businesses and their suppliers. This is not directly relevant to the \nlevel of assistance provided under the SRES, but it does have implications for the manner in which \nany changes to the SRES are introduced. Sudden changes in government subsidies, for example, \ncan have damaging effects on the owners and employees of businesses providing the subsidised \ngood. The report of the Royal Commission into the Home Insulation Program details many examples \nof the impacts of such policy changes on the lives and wellbeing of business owners and staff, and \nwas critical of how these issues were handled. It describes some of the impacts of that program's \nsudden termination in the following terms: \n… many businesses found themselves with an immediate freezing of their cash flow. As a \nresult, many businesses had ongoing commitments to suppliers with forward orders that \ncould not be met. Businesses were left with commitments on property leases, vehicles, \nequipment, and held insulation stock which could not be moved and no longer had any \nappreciable value. Some businesses had a liability to financial institutions, sold or \ndisposed of vehicles, stock and equipment at a loss, or had to sell their family home to \nmeet their business debts. (Hanger 2014, p. 287) \nThis highlights the need for any changes to assistance arrangements under the SRES to be \nintroduced in ways which avoid creating potential 'boom-bust' situations.   \n4.3. SRES ASSISTANCE FOR SOLAR PV AND VALUE FOR MONEY \nThere is at least a strong suggestion that the SRES may subsidise a reasonably large volume of \ninstallations that would occur anyway. Even when viewed in terms of the probable additional \ninstallations, it appears that reducing emissions by installing small-scale solar PV is a relatively \nexpensive way to reduce emissions in the electricity sector.  \nAs discussed in section 2.2.3, the appropriate measure of the cost per tonne of emissions reductions \nis the incremental net present value of the resource cost divided by the incremental undiscounted \nemissions reductions delivered by the policy. Published estimates of the cost per tonne of emissions \nreductions from the SRES calculated in this way are very limited. ACIL Allen’s modelling for the \nWarburton review generated projections of about $95 per tonne of CO2-e over the period to 2030 for \nsolar PV (in 2014 dollars; Warburton review 2014, p. 42). This modelling incorporates a levelised \ncost of energy (a measure of the cost of generating electricity from a technology that includes \nbuilding and running costs) of about $190/MWh, which is about double the estimated levelised cost \nof wind (about $80–$100/MWh) (ACIL Allen 2014, p 115). Both estimates omit some avoided \nresource costs (see Box 4).  \n THE SMALL-SCALE RENEWABLE ENERGY SCHEME | 51 \n \nWhat is clear, however, is that the cost per tonne of emissions reductions from solar PV under the \nSRES is relatively expensive compared with: \n• the LRET, which is projected to create about 20 times the volume of additional emissions \nreductions at an average of about one-third of the unit cost over the period to 2030 (ACIL Allen \n2014, p. 116) and \n• with what the modelling commissioned by the Authority (Treasury and DIICCSRTE 2013) \nsuggests might be required to achieve the minus 5 per cent 2020 target domestically through \nefficient policy (about $65 per tonne in 2020, in 2012 dollars).  \nBOX 4 ESTIMATING THE COST-EFFECTIVENESS OF ASSISTING PV UNDER THE SRES \nThe appropriate measure of the cost per tonne of emissions reductions is the incremental net \npresent value of the resource cost divided by the incremental undiscounted emissions reductions \ndelivered by the policy. Ideally, the incremental NPV of the resource should incorporate: \n• the incremental upfront costs of solar PV  \n• its avoided resource costs, which can come about through both \n- reduced generation from large-scale plant  \n- any (positive or negative) impacts on the electricity network.  \nIn practice, impacts on the electricity network are often excluded from these calculations for the RET, \ngiven they are difficult to estimate.  \nACIL Allen’s modelling estimates the cost per tonne of emissions reductions under the SRES at \nabout $95 per tonne of CO2-e over the period to 2030 when compared with a no RET scenario \n(ACIL Allen 2014, p. 116). The modelling estimates the cost per tonne of emissions reductions from \nthe RET as a whole, then apportions it between the LRET and SRES by calculating the \ncost per tonne for the SRES and assigning the remaining resource costs and avoided emissions to \nthe LRET (Kelp 2014). The cost per tonne for the SRES is calculated as the incremental upfront \ncosts of PV divided by the emissions displaced by the incremental PV installations. When compared \nwith the 'ideal' approach outlined above, this omits some avoided resource costs. That said, the \nlarger the share of PV that would be installed anyway, the smaller these incremental second-order \neffects would be.   \n \n4.4. CONCLUSIONS ON ASSISTANCE FOR PV UNDER THE SRES \nOverall, the Authority concludes that there is reasonable evidence that SRES support for small-scale \nPV is a relatively expensive way to reduce emissions from the electricity sector. At the same time, \nthe cost impacts on electricity consumers generally are modest and the scheme is to start phasing \nout in 2017. This scheduled phase out could conceivably be accelerated while taking care to avoid \nserious disruption in the industry, by avoiding large ‘steps’ in the rate of deeming, which are likely to \nencourages rushes of installations before assistance rates change.  \n52 | REPORT: 2014 RET REVIEW \n \nBy way of illustration, a still smooth but slightly more rapid phase-out might involve reducing deeming \nby 1.5 or three years each year over 2015–2025 or 2015–2020, respectively. This would reduce \ncompliance costs for electricity retailers, with possible modest flow-on savings to electricity users. \nFigure 14 illustrates these possibilities, and compares them with the current policy and the \nWarburton review's accelerated phase-out option (its other recommended option was immediate \nabolition). \nFIGURE 14  OPTIONS FOR AN ACCELERATED PHASE-OUT OF PV ASSISTANCE \n   \nSource: Climate Change Authority based on Warburton review \n \nCONCLUSION \nC 4. Subsidising household PV under the SRES is a relatively expensive way to reduce \nemissions in the electricity sector. The Authority, however, has not recommended \nany changes, largely because the SRES assistance will shortly begin to phase \nout, and the overall costs are relatively modest. \n THE SMALL-SCALE RENEWABLE ENERGY SCHEME | 53 \n CHAPTER 5. OTHER ISSUES FOR THE REVIEW \nThis chapter considers two issues—the diversity of access and uptake for renewable \ntechnologies under the RET, and the role and appropriate frequency for statutory reviews of \nthe scheme. The first issue is a statutory requirement of the Authority's RET reviews.  \nOn both issues, the Authority is inclined to reiterate the conclusions made in its 2012 \nreviews, namely that no change should be made to the RET to encourage particular \ntechnologies, and that statutory reviews should be conducted every four years rather than \nevery two years. \n5.1. DIVERSITY OF ACCESS AND UPTAKE \nThe Authority has a statutory obligation to review diversity of access of renewable technologies to \nthe scheme.  \nIn its 2012 RET review, the Authority considered various measures that could be used to promote \ndiversity of access and uptake, including: \n• Multipliers, which could be applied to certificates from particular technologies to increase their \nuptake.  \n• A cap, which could be used to limit the total amount of generation from a particular technology, \nincreasing the share of the target available to other eligible technologies.  \n• Banding, which would set a quota for total generation from each eligible technology. By \nassigning particular targets to different technologies, banding allows each technology the space \nto evolve without potentially being 'crowded out' by other technologies that might be cheaper in \nthe short term.  \nThe design of the LRET—which is neutral between renewable technologies—encourages the \ndeployment of the lowest cost technologies, thereby minimising the costs to consumers of meeting a \ngiven target.  \nIn 2012, the Authority concluded that the adoption of any measure to promote diversity within the \nRET, such as expanding the use of multipliers, or introducing banding or caps, would increase the \ncosts of the scheme to consumers, and to the community as a whole. The Authority's view remains \nthat the present approach should continue and that the current level of diversity of access is \nappropriate at this time. As recommended in section 3.4, the question of access to the scheme would \nwarrant further consideration in the event the LRET were to be increased and extended in the period \nbeyond 2020.  \n54 | REPORT: 2014 RET REVIEW \n CONCLUSION \nC 5. No changes should be made to the Renewable Energy Target framework to promote \ndiversity of renewable technologies at this time.  \n \n5.2. FUTURE STATUTORY REVIEWS \nCurrently, the REE Act requires the Authority to conduct reviews of the RET every two years. When \nthe Authority considered the review schedule in 2012 it concluded that full reviews every four years \nwould provide an appropriate balance between policy flexibility and investor certainty. This is a \nposition shared with many stakeholders—in submissions to the Warburton review and the Authority, \nthe vast majority of participants addressing this issue argued for less frequent reviews—or no \nstatutory reviews at all. \nStatutory reviews that are transparent, predictable and principles-based are a valuable part of the \ngovernance of any major policy. In the context of the RET, they allow the tracking of progress \ntowards nominated targets and evaluation of performance based on the goals of the scheme. They \nalso allow actual and potential problems to be identified—and possible solutions to be explored in a \nformal (if stretched) timeframe. \nAs recent experience has demonstrated, frequent reviews of the RET in an environment lacking \nbipartisan political support for the scheme can cause investment and employment in the renewables \nindustry to stall and fall. The Authority looks forward to an early resolution of uncertainty surrounding \nthe RET, and especially the 2020 LRET target. In that event, the level and timing of the re-negotiated \n2020 LRET target could be deemed to be outside the scope of future RET reviews.  \nA likely major issue for consideration in the next statutory review (assuming this is in 2018) is the \npossible role of the RET in the period beyond 2020, including its place in the overall post-2020 policy \nframework. As noted earlier, in the absence of more comprehensive, cost-effective measures to \nreduce emissions in the electricity sector, consideration would need to be given to increasing and \nextending the RET targets post 2020, along with eligibility for certificate creation (see section 3.4).  \nThe Authority remains of the view that its previous suggestion that statutory reviews of the RET \noccur every four years strikes a reasonable balance between the need for policy flexibility and the \nrisks to investor confidence created by too frequent reviews. \nCONCLUSION \nC 6. In the interest of maintaining investor confidence in the industry, the frequency of \nstatutory reviews of the RET should be changed from every two years to every \nfour years. For the same reason, if bipartisan agreement were to be reached on \nany revisions to the current 2020 LRET target, those revised arrangements should \nbe outside the scope of future reviews.  \n OTHER ISSUES FOR THE REVIEW | 55 \n APPENDIX A PUBLIC CONSULTATION \nThe Authority is required to conduct public consultation for all of its reviews. Given the limited time \navailable to conduct the review, the Authority did not release an issues paper or draft report. \nNevertheless, throughout the review, the Authority consulted with a wide range of interested parties, \nincluding energy retailers, energy users, investors and the renewable energy industry. The Authority \nalso drew on its previous work as well as the public submissions, analysis (including modelling) and \nreport of the recent Warburton review.  \nStakeholders were also invited to provide submissions to the Authority. Table 5 lists the individuals \nand organisations that provided submissions. These are available on the Authority’s website at: \nwww.climatechangeauthority.gov.au/submissions/submissions-received. \nTABLE 5 SUBMISSIONS RECEIVED  \n  \nAGL Alstom \nAustralian Financial Markets Association Australian Petroleum Production & Exploration \nAssociation \nAustralian Sugar Milling Council  Barbara J. Fraser  \nClean Energy Council  CWP Renewables  \nEnergy Networks Association  Energy Supply Association of Australia  \nHydro Tasmania  Minerals Council of Australia  \nOrigin Energy  Peter Cook  \nRecurrent Energy  Senvion Australia  \nStanwell Corporation  Trustpower  \nWWF Australia   \n56 | REPORT: 2014 RET REVIEW \n APPENDIX B REQUIREMENTS FOR \nAUTHORITY RENEWABLE \nENERGY TARGET REVIEWS \nThe Climate Change Authority Act 2011 (Cth) (the CCA Act) and Renewable Energy (Electricity) Act \n2000 (Cth) (the REE Act) establish the legislative requirements for the Authority's RET review. \nTogether, they cover requirements for timing, scope and conduct of the reviews. The relevant parts \nof both of these Acts are reproduced below:  \n• Section 12 of the CCA Act sets out general principles that the Authority must have regard to in \nconducting reviews. \n• Section 162 of the REE Act sets out the Authority’s specific requirements for reviewing the RET. \nThe Authority's principles (section 12 of the CCA Act)  \nIn performing its functions, the Authority must have regard to the following principles: \n(a) the principle that any measures to respond to climate change should: \n• be economically efficient; and \n• be environmentally effective; and \n• be equitable; and \n• be in the public interest; and \n• take account of the impact on households, business, workers and communities; and \n• support the development of an effective global response to climate change; and \n• be consistent with Australia’s foreign policy and trade objectives; \n(b) such other principles (if any) as the Authority considers relevant. \nPeriodic reviews of operation of renewable energy legislation (section 162 of the REE Act) \n(1) The Climate Change Authority must conduct reviews of the following: \n(a) the operation of this Act and the scheme constituted by this Act; \n(b) the operation of the regulations; \n(c) the operation of the Renewable Energy (Electricity) (Large-scale Generation Shortfall Charge) Act \n2000; \n(d) the operation of the Renewable Energy (Electricity) (Small-scale Technology Shortfall Charge) \nAct 2010; \n(e) the diversity of renewable energy access to the scheme constituted by this Act, to be considered \nwith reference to a cost benefit analysis of the environmental and economic impact of that access. \nPublic consultation \n(2) In conducting a review, the Climate Change Authority must make provision for public \nconsultation. \nReport \n(3) The Climate Change Authority must: \n APPENDIX B REQUIREMENTS FOR AUTHORITY RENEWABLE ENERGY TARGET REVIEWS | 57 \n \n(a) give the Minister a report of the review; and \n(b) as soon as practicable after giving the report to the Minister, publish the report on the Climate \nChange Authority’s website. \n(4) The Minister must cause copies of a report under subsection (3) to be tabled in each House of \nthe Parliament within 15 sitting days of that House after the review is completed. \nFirst review \n(5) The first review under subsection (1) must be completed before the end of 31 December 2012. \nSubsequent reviews \n(6) Each subsequent review under subsection (1) must be completed within 2 years after the \ndeadline for completion of the previous review. \n(7) For the purposes of subsections (4), (5) and (6), a review is completed when the report of the \nreview is given to the Minister under subsection (3). \nRecommendations \n(8) A report of a review under subsection (1) may set out recommendations to the Commonwealth \nGovernment. \n(9) In formulating a recommendation that the Commonwealth Government should take particular \naction, the Climate Change Authority must analyse the costs and benefits of that action. \n(10) Subsection (9) does not prevent the Climate Change Authority from taking other matters into \naccount in formulating a recommendation. \n(11) A recommendation must not be inconsistent with the objects of this Act. \n(12) If a report of a review under subsection (1) sets out one or more recommendations to the \nCommonwealth Government, the report must set out the Climate Change Authority’s reasons for \nthose recommendations. \nGovernment response to recommendations \n(13) If a report of a review under subsection (1) sets out one or more recommendations to the \nCommonwealth Government: \n(a) as soon as practicable after receiving the report, the Minister must cause to be prepared a \nstatement setting out the Commonwealth Government’s response to each of the recommendations; \nand \n(b) within 6 months after receiving the report, the Minister must cause copies of the statement to be \ntabled in each House of the Parliament. \n(14) The Commonwealth Government’s response to the recommendations may have regard to the \nviews of the following: \n(a) the Climate Change Authority; \n(b) the Regulator; \n(c) such other persons as the Minister considers relevant. \n58 | REPORT: 2014 RET REVIEW \n APPENDIX C OUTCOMES OF PREVIOUS \nREVIEWS \nThis appendix lists the recommendations from previous RET reviews for easy reference (the \nAuthority’s 2012 review and the 2014 Warburton review).  \nThe Authority's 2012 Renewable Energy Target review  \nRecommendation 1 \nThe frequency of scheduled reviews should be amended from every two years to every four years, \nso the next scheduled review would be in 2016. \nRecommendation 2 \nThe form of the Large-scale Renewable Energy Target should continue to be expressed in legislation \nin terms of a fixed gigawatt-hour (GWh) level. \nRecommendation 3 \nThe existing Large-scale Renewable Energy Target of 41,000 GWh and interim targets should be \nmaintained in their current form. \nRecommendation 4 \nThe RET review in 2016 is an appropriate time to consider adjusting the targets beyond 2020 in light \nof the policy and economic conditions prevailing at that time. \nRecommendation 5 \nThe Small-scale Renewable Energy Scheme should remain separate to the Large-scale Renewable \nEnergy Target. \nRecommendation 6 \nThe threshold for solar photovoltaic units in the Small-scale Renewable Energy Scheme should be \nreduced from 100kW to, say, 10kW. The CCA recommends the Government conduct further \nconsultation with stakeholders to determine an appropriate threshold. Units over the small-scale \nthreshold would be included in the Large-scale Renewable Energy Target with five year deeming. \nRecommendation 7 \nThe ministerial power to lower the price cap should be retained to provide an immediate cost-\ncontainment mechanism should installations of small-scale systems boom. \nRecommendation 8 \nThe Small-scale Renewable Energy Scheme should be phased out by reducing deeming so that \nrenewable energy generation is not rewarded after 2030. \nRecommendation 9 \nThe Clearing House should be amended to a ‘deficit sales facility’ whereby new certificates would \nonly be placed in the Clearing House when it is in deficit. \nRecommendation 10 \nThe requirement to submit a solar hot water heater and small generation unit return should be \nremoved from the Renewable Energy (Electricity) Act 2000. \n APPENDIX C OUTCOMES OF PREVIOUS REVIEWS | 59 \n \nRecommendation 11 \nThe requirement to provide the out-of-pocket expense data for a small generation unit installation \nshould be removed from the Renewable Energy (Electricity) Regulations 2001. \nRecommendation 12 \nThere should be no change to primary point of liability or the size threshold for coverage of grids. \nRecommendation 13 \nLarge electricity consumers should be permitted to opt-in to assume direct liability for RET \nobligations. The Government should consult further with stakeholders to develop a detailed approach \nto opt-in that is efficient for both large electricity users and retailers. The CCA considers that the New \nSouth Wales Greenhouse Gas Reduction Scheme opt-in model would be an appropriate starting \npoint for this detailed design work. \nRecommendation 14 \nNo changes be made to the process for calculating individual liability. \nRecommendation 15 \nThe relevant Renewable Power Percentage and Small-scale Technology Percentage should be \nrequired to be set prior to a compliance year, and preferably by 1 December of the preceding year. \nRecommendation 16  \nThe current arrangements for surrender of certificates (annual surrender for the Large-scale \nRenewable Energy Target; quarterly surrender for the Small-scale Renewable Energy Scheme) \nshould be maintained. \nRecommendation 17 \nThe Clean Energy Regulator should be able to refund over-surrendered certificates to a liable entity \nthat ceases to trade, or transfer over-surrendered certificates if a liable entity is acquired by another \nentity which takes on a RET liability. \nRecommendation 18 \nThe current settings for the shortfall charge should be maintained. However, the level of the shortfall \ncharge should be reconsidered by the CCA as part of its 2016 review of targets beyond 2020, or \nearlier if circumstances warrant. \nRecommendation 19 \nThe level of the emissions-intensive, trade-exposed exemption under the RET should be considered \nby the Productivity Commission as part of its broader review of the Jobs and Competitiveness \nProgram. \nRecommendation 20 \nThe Government should take into consideration the impact of the RET on the competitiveness of an \nemissions-intensive, trade-exposed industry in any request to the Productivity Commission’s review \nof the level of industry assistance under the carbon pricing mechanism and the RET. \nRecommendation 21 \nIn cases where the RET costs are passed through to emissions-intensive, trade-exposed \nbusinesses, Partial Exemption Certificates should be tradeable, and thereby able to be used by any \nliable entity to reduce liable electricity acquisitions. \n60 | REPORT: 2014 RET REVIEW \n \nRecommendation 22 \nThe Government should consider opportunities for efficiencies through the alignment of application \nprocesses and data requirements for emissions-intensive, trade-exposed industries under the Jobs \nand Competitiveness Program and the RET. \nRecommendation 23 \nThe self-generator exemption should continue in its current form. \nRecommendation 24 \nArrangements should be developed to allow for incidental electricity offtakes under the self-\ngenerators exemption which provide community benefits in remote locations. \nRecommendation 25 \nNo change is necessary to the list of eligible sources or the accreditation process for the Large-scale \nRenewable Energy Target. \nRecommendation 26 \nExisting arrangements for waste coal mine gas should be maintained under the Large-scale \nRenewable Energy Target. \nRecommendation 27 \nThere should be no change to the Renewable Energy (Electricity) Act 2000 to allow for new waste \ncoal mine gas to be eligible. \nRecommendation 28 \nThe Government should explore whether the RET eligibility for native forest wood waste is likely to \nincrease the rate of logging of native forests. If it is not, then wood waste eligibility should be \nreinstated, subject to appropriate accreditation processes designed to ensure that no additional \nlogging occurs as a result. \nRecommendation 29 \nMaintain the Clean Energy Council as the sole accreditation body for installers under the Small-scale \nRenewable Energy Scheme. \nRecommendation 30 \nNew small-scale technologies should be included on a case-by-case basis for inclusion in the Small-\nscale Renewable Energy Scheme. \nRecommendation 31 \nNo additional new small-scale technologies should be made eligible in the Small-scale Renewable \nEnergy Scheme at this time. \nRecommendation 32 \nExisting arrangements for displacement technologies should be maintained.  \nRecommendation 33 \nNo change should be made to the Renewable Energy (Electricity) Act 2000 to allow additional \ndisplacement technologies. \n APPENDIX C OUTCOMES OF PREVIOUS REVIEWS | 61 \n \nRecommendation 34 \nNo change should be made to the RET framework to promote greater diversity. \nWarburton 2014 Renewable Energy Target review \nRecommendation 1 \nThe Renewable Energy Target (RET) should be amended in light of the changing circumstances in \nAustralia’s main electricity markets and the availability of lower cost emission abatement alternatives. \nRecommendation 2 \nThe Large-scale Renewable Energy Target (LRET) should be amended in one of the following two \nways: \nOption 1 – Closed to new entrants (‘grandfathering’) \nIn order to reduce the cost of the LRET and its impact on electricity markets, the Panel recommends \nthat the LRET should be closed to new entrants. \na. The LRET is closed to new renewable energy power stations (subject to limited exceptions \ndescribed below). The Clean Energy Regulator (CER) should set targets annually based on \nestimated output from accredited power stations. \nb. In addition to those renewable energy power stations already accredited under the scheme, \neligibility would be extended to: \ni. Renewable energy power stations already under construction. \nii. Renewable energy power stations to be constructed where project proponents can demonstrate \nthat there is full financial and contractual commitment to the project (e.g., final investment decision, \nengineering and procurement contract) within one month of the announcement of this approach. \nc. The last year of the operation of the LRET is 2030. \nor \nOption 2 – Share of growth in electricity demand \nIn order to provide support for new renewable power stations and contribute to Australia’s emissions \nreduction target while achieving less reduction than Option 1 in the cost of the LRET, the Panel \nrecommends that the target be set to allocate a share of growth in electricity demand to renewables \nin the following manner: \na. The target is set annually by the CER, increasing each year to 2020 by an amount equivalent to \n50 per cent of projected growth in national electricity demand, ensuring that new renewable energy \npower stations are only supported under the RET where electricity demand is increasing. \nb. Where national electricity demand is projected to remain flat or fall, the target is held at the \nprevious year’s level. \nc. From 2021 onwards, the target is fixed at the 2020 level until 2030, the last year of the operation of \nthe LRET. \nBased on current electricity demand forecasts, this approach would achieve a 20 per cent share of \nrenewables in the electricity generation mix by 2020. \n  \n62 | REPORT: 2014 RET REVIEW \n \nRecommendation 3 \nThe Small-scale Renewable Energy Scheme (SRES) should be amended in one of the following two \nways: \nOption 1 – Abolition \nIn order to address the cost of the SRES (and its effect on electricity markets), the Panel \nrecommends that it be closed immediately in the following manner: \na. The SRES should terminate upon announcement. \nb. Those who contracted before the announcement for the installation of a small-scale system should \nreceive the certificates they would have done. \nor \nOption 2 – Bring forward the phase-out of the SRES \nIn order to reduce the cost of the SRES while providing some support for new small-scale renewable \nenergy systems, the Panel recommends that the phase-out of the SRES be brought forward in the \nfollowing manner, to take effect immediately: \na. Bring forward the last year of operation of the SRES from 2030 to 2020. \nb. Reduce the period for which certificates may be created for rooftop solar PV systems from \n15 years to 10 years, and in each year from 2016 onwards further reduce the period for which \ncertificates may be created, as set out below: \nRooftop solar PV: period certificates may be created \nYEAR INSTALLED PERIOD \nPrior to announcement 15 years \nFrom announcement 10 years \n2016 9 years \n2017 8 years \n2018 7 years \n2019 6 years \n2020 5 years \n2021 Scheme closed \n \nc. Reduce system size eligibility threshold for rooftop solar PV systems from no more than100 \nkilowatts to no more than 10 kilowatts. \nd. Reduce the period for which certificates may be created for solar and heat pump water heaters by \none year each year, commencing in 2016, as set out below: \n APPENDIX C OUTCOMES OF PREVIOUS REVIEWS | 63 \n \nSolar and heat pump water heaters: period certificates may be created \nYEAR INSTALLED PERIOD \nPrior to 2016 10 years \n2016 9 years \n2017 8 years \n2018 7 years \n2019 6 years \n2020 5 years \n2021 Scheme closed \n \nRecommendation 4 \nThe current partial exemption arrangements for emissions-intensive trade-exposed businesses \nshould be maintained. \nRecommendation 5 \nThe self-generation exemption should be amended to extend the one kilometre radius restriction and \nto permit self-generators to supply incidental amounts of electricity (below a set threshold) to third \nparties without attracting a RET liability. The Government should consult with affected parties to \ndetermine an appropriate distance limit and threshold for incidental off-takes. \nRecommendation 6 \nThe Government’s commitment to the reinstatement of native forest wood waste as a renewable \nenergy source under the LRET should be implemented through the reintroduction of the relevant \nregulations in force prior to 2011. \nRecommendation 7 \nThe requirement for statutory reviews of the scheme should be removed from the Renewable Energy \n(Electricity) Act 2000. \n \n \n64 | REPORT: 2014 RET REVIEW \n GLOSSARY  \nTERM ACRONYM/ \nABBREVIATION \nEXPLANATION \nAustralian Energy \nMarket Operator \nAEMO The Australian Energy Market Operator was established in \n2009 and is responsible for the operation of the National \nElectricity Market, which includes the east and south-east \nregions of Australia (Queensland, New South Wales, \nVictoria, Tasmania and South Australia). \nbankable \ncertificates \n Renewable energy certificates for both the large-scale and \nsmall-scale market do not have an expiry date. They may \nbe purchased and held for any length of time before they \nare surrendered.  \ncertificate costs  The amount passed on by liable parties (generally \nelectricity retailers) to end-users to account for the costs of \npurchasing and surrendering Large-scale Generation \nCertificates (LGCs) and Small-scale Technology \nCertificates (STCs). \ncarbon pricing \nmechanism \n The carbon pricing mechanism created a price on \nemissions by requiring large emitters to report on and \nsurrender emissions units for their covered emissions. The \ncarbon pricing mechanism commenced operation on 1 \nJuly 2012 and was abolished with effect from 1 July 2014. \nClean Energy \nRegulator \nCER The Clean Energy Regulator is an independent statutory \nauthority that administers regulatory schemes relating to \ngreenhouse gas emissions reductions, including the \nRenewable Energy Target, the Carbon Farming Initiative \nand the National Greenhouse and Energy Reporting \nScheme. \nClimate Change \nAuthority \n‘the Authority’ Established on 1 July 2012, the Climate Change Authority \nprovides independent expert advice on Australian \nGovernment climate change mitigation initiatives. \ncommercial-scale \nPV \n Larger capacity rooftop solar PV installed on non-\nresidential premises.  \ncompliance period  A full calendar year, the period over which each annual \ntarget under the Renewable Energy Target must be \nachieved.  \nCouncil of \nAustralian \nGovernments \nCOAG The peak intergovernmental forum in Australia. The \nmembers of the Council of Australian Governments are the \nPrime Minister, State and Territory Premiers and Chief \nMinisters and the President of the Australian Local \nGovernment Association. \n GLOSSARY | 65 \n \nTERM ACRONYM/ \nABBREVIATION \nEXPLANATION \ndeeming  The estimation of the amount of electricity a solar panel or \nsmall-scale wind or hydro system generates, or the \nelectricity a solar water heater or heat pump displaces. \nDeeming allows the owners of these technologies to \nreceive their entitlement to small-scale technology \ncertificates before the system has produced or displaced \nthe electricity.  \nemissions-intensive \ntrade-exposed \nEITE Businesses conducting specified emissions-intensive \ntrade-exposed (EITE) activities are eligible for assistance \nunder the RET scheme. \ngigawatt hours GWh A measure of electricity generation or use over a period of \ntime (or energy). \nIntergovernmental \npanel on climate \nchange \nIPCC Scientific intergovernmental body that produces reports \nthat support the United Nations Framework Convention on \nClimate Change, which is the main international treaty on \nclimate change \nkilowatt kW A measure of power. \nkilowatt hour kWh A measure of electricity generation or use over a period of \ntime (or energy). \nKyoto Protocol   An agreement adopted under the United Nations \nFramework Convention on Climate Change in 1997. It \nentered into force in 2005. \nLarge-scale \nGeneration \nCertificate \nLGC Represents one megawatt hour of renewable energy \ngeneration. \nLarge-scale \nRenewable Energy \nTarget \nLRET Encourages the deployment of large-scale renewable \nelectricity projects such as wind farms. \nlevelised cost of \nelectricity \nLCOE A common tool for measuring and comparing power \ngeneration costs across different technologies. It \nrepresents the per kilowatt hour cost (in real dollars) of \nbuilding and operating a generation technology over an \nassumed financial life and duty cycle. \nliable entities  Entities that make wholesale acquisitions of electricity and \nare required by the legislation to surrender a specified \nnumber of renewable certificates or pay a renewable \nenergy shortfall charge.  \nMandatory \nRenewable Energy \nTarget \nMRET The Mandatory Renewable Energy Target began \noperation in 2001. It had a target of 9,500 gigawatt hours \nin 2010 (mandated out to 2020) and interim targets that \ngradually increased year on year.  \n66 | REPORT: 2014 RET REVIEW \n \nTERM ACRONYM/ \nABBREVIATION \nEXPLANATION \nmegawatt MW A measure of power (or demand). \nmegawatt hour MWh A measure of electricity generation/use over a period of \ntime (or energy). \nmerchant generator  A stand-alone electricity generator that does not have a \npower purchase agreement (PPA) with an electricity \nretailer, but rather sells its production to the spot and \nshort-term forward markets. \nmothballing  The preservation of a production facility without using it to \nproduce. Machinery in a mothballed facility is kept in \nworking order so that production may be restored quickly if \nneeded. \nmultiplier credits  Credits that are a multiple of the number of certificates that \nan eligible technology would generally be able to create. \nPreviously in place under the Small-scale Renewable \nEnergy Scheme. \nNational Electricity \nMarket \nNEM The National Electricity Market interconnects five regional \nmarket jurisdictions (Queensland, New South Wales, \nVictoria, South Australia and Tasmania). Western Australia \nand the Northern Territory are not connected to the \nNational Electricity Market. \nnative demand  Electricity load serviced by scheduled electricity \ngeneration, semi-scheduled generation and embedded \ngeneration (including rooftop solar PV). \nnet present value NPV Net present value is a standard method for using the time \nvalue of money to estimate future costs. It compares the \npresent value of money today to the present value of \nmoney in the future, taking inflation into account. \npartial exemption \ncertificate \nPEC The Renewable Energy (Electricity) Act 2000 and the \nRenewable Energy (Electricity) Regulations 2001 include \nprovisions to provide partial exemption from Renewable \nEnergy Target liability for electricity used in defined \nemissions-intensive trade-exposed activities. To obtain \nexemption, prescribed persons may apply to the Clean \nEnergy Regulator for a partial exemption certificate. \npower purchase \nagreement \nPPA A long-term agreement between an electricity generator \nand electricity retailer to purchase electricity generated \n(and in the case of renewable generators, LGCs). \n‘real’ 20 per cent \ntarget \n A 2020 LRET target based on 20 per cent of either current \nestimated or actual electricity demand in 2020. The current \n2020 LRET target is for a fixed amount of generation \n(41,000 GWh). \n GLOSSARY | 67 \n \nTERM ACRONYM/ \nABBREVIATION \nEXPLANATION \nRenewable Energy \nCertificate \nREC The term used for renewable energy certificates generated \nunder the Renewable Energy Target scheme prior to 2011. \nRenewable Energy \n(Electricity) Act \n2000 (Cth) \nREE Act The legislative framework for the Renewable Energy \nTarget scheme. \nRenewable Energy \n(Electricity) \nRegulations 2001 \nREE Regulation The detailed rules and provisions of the Renewable \nEnergy Target scheme. \nRenewable Energy \nTarget \nRET The Renewable Energy Target operates in two parts—the \nSmall-scale Renewable Energy Scheme and the \nLarge-scale Renewable Energy Target. \nRenewable Energy \nTarget review \nRET review The Climate Change Authority’s review of the Renewable \nEnergy Target. The review is defined in Section 162 of the \nRenewable Energy (Electricity) Act 2000 (Cth). \nshortfall charge  A charge that applies to the outstanding amount when a \nliable entity surrenders less than the required number of \ncertificates to meet obligations under the LRET or SRES. \nThe shortfall charge under both the LRET and SRES is \ncurrently set at $65. \nsolar photovoltaic PV A method of generating electricity by converting the sun’s \nenergy into electricity. \nsmall-scale PV  Rooftop solar PV installed on by households. Also referred \nto as ‘household PV’. \nSmall-scale \nRenewable Energy \nScheme \nSRES Supports the installation of small-scale systems, including \nsolar photovoltaic systems and solar water heaters, and \nsmall generation units. \nSmall-scale \nTechnology \nCertificate \nSTC Certificates created by small-scale technologies like solar \npanels and solar water heaters. \nSmall-scale \nTechnology \nCertificate Clearing \nHouse \nSTC Clearing \nHouse \nFacilitates the exchange of small-scale technology \ncertificates between buyers and sellers at the fixed price of \n$40 (excluding GST). \nthermal generators  A power station in which electricity is generated by the \nproduction of steam. The steam is typically produced by \nburning fossil fuels such as gas and coal.  \n68 | REPORT: 2014 RET REVIEW \n \nTERM ACRONYM/ \nABBREVIATION \nEXPLANATION \nWarburton review  A review of the Renewable Energy Target conducted in \n2014 by a panel headed by Dick Warburton AO LVO, \nsupported by a secretariat located within the Department \nof the Prime Minister and Cabinet. \n \n  \n GLOSSARY | 69 \n ABBREVIATIONS AND ACRONYMS \nTERM MEANING \nAEMC Australian Energy Market Commission \nAEMO Australian Energy Market Operator \nAiG Australian Industry Group \nAO Officer of the Order of Australia \nAPVI Australian Photovoltaic Institute \nBCA Business Council of Australia \nBNEF Bloomberg New Energy Finance \nBREE Bureau of Resources and Energy Economics \nCCA Climate Change Authority \nCCS Carbon capture and storage \nCEC Clean Energy Council \nCER Clean Energy Regulator \nCO2 Carbon dioxide \nCO2-e Carbon dioxide equivalent \nCOAG Council of Australian Governments \nCSIRO Commonwealth Scientific and Industrial Research Organisation \nCth Commonwealth \nDIICCSRTE Department of Industry, Innovation, Climate Change, Science, Research \nand Tertiary Education \nEITE Emission-intensive trade-exposed \nERF Emissions Reduction Fund \nESAA Energy Supply Association of Australia \nGWh Gigawatt hour \nIEA International Energy Agency \n70 | REPORT: 2014 RET REVIEW \n \nTERM MEANING \nIES Intelligent Energy Systems \nIGCC Investor Group on Climate Change \nIPCC Intergovernmental Panel on Climate Change \nkW Kilowatt \nkWh Kilowatt hour \nLGC Large-scale Generation Certificate \nLRET Large-scale Renewable Energy Target \nLVO Lieutenant of the Royal Victorian Order \nMRET Mandatory Renewable Energy Target \nMt Million tonnes \nMW Megawatt \nMWh Megawatt hour \nNPV Net present value \nOECD Organisation for Economic Cooperation and Development \nPPA Power Purchase Agreement \nPV Photovoltaic \nPwC PricewaterhouseCoopers \nREC Renewable Energy Certificate \nREE Act Renewable Energy (Electricity) Act 2000 (Cth) \nRET Renewable Energy Target \nSKM  Sinclair Knight Merz  \nSKM MMA Sinclair Knight Merz and McLennan Magasanik Associates \nSRES Small-scale Renewable Energy Scheme \nSTC Small-scale Technology Certificate \nSWH Solar water heater \n ABBREVIATIONS AND ACRONYMS | 71 \n \nTERM MEANING \nt Tonne \nWh Watt hour \n72 | REPORT: 2014 RET REVIEW \n REFERENCES \nCHAPTER 1 \nClimate Change Authority Act 2011 (Cth). \nClimate Change Authority 2012, Renewable Energy Target Review—Final Report, Melbourne. \nRenewable Energy (Electricity) Act 2000 (Cth). \nRenewable Energy (Electricity) (Large-scale Generation Shortfall Charge) Act 2010 (Cth). \nRenewable Energy (Electricity) (Small-scale Technology Shortfall Charge) Act 2010 (Cth).  \nWarburton review (Expert Panel), 2014, Renewable Energy Target Scheme—Report of the Expert \nPanel, Canberra. \nCHAPTER 2 \nACIL Allen 2013a, Drivers of domestic PV uptake—characteristics of households with solar \nphotovoltaic systems, report to the Australian Renewable Energy Agency, Canberra. \nACIL Allen 2013b, Electricity Sector Emissions—Modelling of the Australian Generation Sector, \nreport to Department of Industry, Innovation, Climate Change, Science, Research and Tertiary \nEducation (DIICCSRTE), Canberra. \nACIL Allen Consulting 2014, RET Review modelling—Market modelling of various RET policy \noptions, Report to the RET Review Expert Panel, Melbourne. \nAGL 2012, AGL completes purchase of Loy Yang A power station and adjacent mine, viewed \n8 December 2014, \nwww.agl.com.au/about-agl/media-centre/article-list/2012/jun/agl-completes-purchase-of-loy-yang-a-\npower-station-and-adjacent-mine.  \nAGL 2014, AGL completes acquisition of Macquarie Generation assets, viewed 8 December 2014, \nwww.agl.com.au/about-agl/media-centre/article-list/2014/september/agl-completes-acquisition-of-\nmacquarie-generation-assets.  \nAudoly, R, Vogt-Schilb, A & Guivarch, A, 2014 Pathways Toward Zero-Carbon Electricity Required \nfor Climate Stabilization, Policy Research Working Paper 7075, World Bank Group.  \nAustralian Energy Market Commission (AEMC) 2014, Distribution network pricing arrangements, \nRule determination, 27 November 2014, Sydney. \nBarroso, J, 2014, Statement by President Barroso following the first day of the European Council of \n23-24 October 2014, viewed 4 December 2014, http://europa.eu/rapid/press-release_SPEECH-14-\n719_en.htm. \nBREE 2014, 2014 Australian energy statistics, BREE, Canberra, July. \nClean Energy Regulator 2014a, Small-Scale Installations by Postcode, Clean Energy Regulator, \nCanberra, viewed 27 November 2014, http://ret.cleanenergyregulator.gov.au/REC-Registry/Data-\nreports. \nClean Energy Regulator 2014b, Coal-fired generation assistance, Clean Energy Regulator, \nCanberra, viewed 19 December 2014,  \nhttp://www.cleanenergyregulator.gov.au/Carbon-Pricing-Mechanism/Industry-Assistance/coal-fired-\ngenerators/Pages/default.aspx. \n REFERENCES | 73 \n \nClimate Change Authority (CCA) 2012, Renewable Energy Target Review—Final Report, Melbourne. \nCCA 2014a, Targets and Progress Review—Final Report, Melbourne. \nCCA 2014b, Light Vehicle Emissions Standards for Australia—Research Report, Melbourne. \nClimate Change Authority 2014c, Carbon Farming Initiative Review, Melbourne. \nClimateWorks Australia, Australian National University 2014a, Pathways to Deep Decarbonisation in \n2050-How Australia can prosper in a low carbon world—Initial Project Report, ClimateWorks \nAustralia, Melbourne. \nClimateWorks Australia, Australian National University, CSIRO & Centre for Policy Studies 2014b, \nPathways to Deep Decarbonisation in 2050—How Australia can prosper in a low carbon \nworld-Technical report, ClimateWorks Australia, Melbourne. \nCOAG Working Group on Climate Change and Water 2008, Design Options for the Expanded \nNational Renewable Energy Target Scheme, Canberra. \nDepartment of Environment 2014, Emissions Reduction Fund White Paper, Canberra. \nEnergy Australia 2013, Energy Australia acquires Mt Piper and Wallerawang power stations, viewed \n8 December 2014, \nwww.energyaustralia.com.au/about-us/media-centre/current-news/ea-acquires-mtpiper-wallerawang. \nEnergy Supply Association Australia (ESAA) 2014, Australian electricity markets, viewed \n4 December 2014, http://www.esaa.com.au/policy/australian_electricity_markets_1_1_1. \nExplanatory Memorandum, Renewable Energy (Electricity) Amendment Bill 2009 (Cth). \nFrontier Economics 2014, Can Australia still meet its emissions target with changes in the RET?, \nFrontier Economics, September 2014. \nGDF SUEZ 2012, Full ownership of International Power: GDF SUEZ reaches a strategic milestone \nfor development in high growth markets, viewed 8 December 2014, \nwww.gdfsuez.com/en/journalists/press-releases/full-ownership-of-international-power-gdf-suez-\nreaches-a-strategic-milestone-for-development-in-high-growth-markets/. \nGraham, P, Brinsmead, T, Dunstall, S, Ward, J, Reedman, L, Elgindy, T, Gilmore, J, Cutler, N, \nJames, G, Rai, A, & Hayward, J 2013, Modelling the Future Grid Forum Scenarios, CSIRO, \nCanberra. \nInternational Energy Agency 2014a, Energy technology perspectives 2014—Harnessing electricity's \npotential, IEA, Paris. \nInternational Energy Agency 2014b, The Way Forward—Five Key Actions to Achieve a Low-Carbon \nEnergy Sector, IEA, Paris. \nInternational Energy Agency 2014c, IEA Statistics—CO2 emissions from Fuel Combustion, IEA, \nParis. \nIntergovernmental Panel on Climate Change (IPCC) 2014a, Working Group III Contribution to the \nFifth Assessment Report, Climate Change 2014- Mitigation, Summary for Policy Makers, Cambridge \nUniversity Press, Cambridge. \nIPCC, 2014b. Working Group III Contribution to the Fifth Assessment Report, Climate Change \n2014—Mitigation, Cambridge University Press, Cambridge. \nOrigin Energy 2013, Origin to acquire Eraring Energy and enter into new fuel supply arrangements, \nviewed 8 December 2014, \nwww.originenergy.com.au/news/article/asxmedia-releases/1499. \n74 | REPORT: 2014 RET REVIEW \n \nProductivity Commission 2011, Carbon emissions policies in key economies, Research report, \nCanberra. \nRenewable Energy (Electricity) Act 2000 (Cth). \nSachs, J, Tubiana, L, Guerin, E, Waisman, H, Mas, C, Colombier, M & Schmidt-Traub, G, 2014. \nPathways to Deep Decarbonisation—Interim 2014 Report, United Nations' Sustainable Development \nSolutions Network (SDSN) and Institute for Sustainable Development and International Relations \n(IDRI), New York and Paris. \nSKM 2012, Benefit of the Renewable Energy Target to Australia's Energy Markets and Economy—\nReport to the Clean Energy Council. \nThe Australian 2011, Lenders take charge of utility Alinta Energy,16 March, viewed \n8 December 2014, \nwww.theaustralian.com.au/business/lenders-take-charge-of-utility-alinta-energy/story-e6frg8zx-\n1226022097297. \nTreasury and the Department of Industry, Innovation, Climate Change, Science, Research and \nTertiary Education (DIICCSRTE) 2013, Climate change mitigation scenarios, Report for the Climate \nChange Authority in support of its Caps and Targets Review, Canberra.  \nWarburton review (Expert Panel), 2014, Renewable Energy Target Scheme—Report of the Expert \nPanel, Canberra. \nThe White House 2014, U.S.-China Joint Announcement on Climate Change and Clean Energy \nCooperation—fact sheet, 11 November, viewed 27 November 2014, www.whitehouse.gov/the-press-\noffice/2014/11/11/fact-sheet-us-china-joint-announcement-climate-change-and-clean-energy-c. \nCHAPTER 3 \nACIL Allen Consulting 2014, RET Review modelling—Market modelling of various RET policy \noptions, Report to the RET Review Expert Panel, Melbourne. \nAGL 2014, AGL to mothball South Australian generating units, viewed 10 December 2014,  \nwww.agl.com.au/about-agl/media-centre/article-list/2014/december/agl-to-mothball-south-australian-\ngenerating-units. \nAustralian Energy Market Operator (AEMO) 2012, National Electricity Forecasting Report 2012, \nSydney. \nAEMO 2013, 2013 Electricity Statement of Opportunities, Sydney. \nAEMO 2014a, 2014 National Electricity Forecasting Report 2014, Sydney. \nAEMO 2014b, 2014 Electricity Statement of Opportunities, Sydney. \nBloomberg New Energy Finance (BNEF) 2013, Australia LCOE update: Wind cheaper than coal and \ngas, 31 January, Melbourne. \nBNEF 2014, Investment freeze in Australia Continues, 3 October, Melbourne. \nClean Energy Council (CEC) 2014, Practical, social and financial considerations for meeting the \n2020 Renewable Energy Target, Melbourne. \nClean Energy Regulator (CER) 2014, Volume weighted average market price for a renewable energy \ncertificate (REC) / large-scale generation certificate (LGC), Canberra, viewed 21 November 2014,  \nhttp://ret.cleanenergyregulator.gov.au/For-Industry/Emissions-Intensive-Trade-Exposed/Volume-\nWeighted-Average-Market-Price/market-price. \n REFERENCES | 75 \n \nClimate Change Authority (CCA) 2012, Renewable Energy Target Review— Final Report, \nMelbourne. \nCOAG Energy Council 2014, Meeting Communique, 11 December, Adelaide. \nDeloitte 2014, Assessing the impact of the renewable energy target, Report to the Australian \nChamber of Commerce and Industry, Melbourne. \nExplanatory Memorandum, Renewable Energy (Electricity) Amendment Bill 2009 (Cth). \nFrontier Economics 2014, RET Review Analysis, Report to the Australian Energy Market \nCommission (AEMC), Melbourne. \nHRL Limited 2014, Media Release-Study underway to repower Energy Brix Australia Corporation \nbriquette factory - temporary closure at end August 2014, viewed 8 December 2014,  \nwww.hrl.com.au/media-release-29th-july-2014/w1/i1041955/. \nJacobs 2014, Impacts of Changes to the RET on Electricity Market Participants, Report to the \nClimate Institute, Australian Conservation Foundation and WWF-Australia, Melbourne. \nNelson, T, Reid, R & McNeill, J 2014, Energy-only markets and renewable energy \ntargets-complementary policy or policy collision?, AGL Applied Economic and Policy Research, \nSydney. \nOakley Greenwood 2014, A report on the implications of the RET and generation over-supply, \nSydney. \nPricewaterhouseCoopers Australia (PwC) 2014, State of the Debt Markets for the Energy Supply \nIndustry, Report to the Energy Supply Association of Australia, Melbourne. \nROAM Consulting 2014, RET policy analysis, Report to the Clean Energy Council, Brisbane. \nSchneider Electric 2014, Australia's Large-scale Renewable Energy Target—Three Consumer \nBenefits, Sydney. \nSinclair Knight Merz and McLennan Magasanik Associates (SKM MMA) 2012, Modelling the \nRenewable Energy Target, Report to the Climate Change Authority, Sydney. \nWarburton review (Expert Panel) 2014, Renewable Energy Target Scheme—Report of the Expert \nPanel, Canberra. \nCHAPTER 4 \nACIL Allen Consulting 2014, RET Review modelling—Market modelling of various RET policy \noptions, report to the RET Review Expert Panel, Melbourne. \nAustralian Energy Market Commission (AEMC) 2014a, Distribution network pricing arrangements, \nRule determination, 27 November 2014, Sydney. \nAustralian Energy Market Commission (AEMC) 2014b, Distribution network pricing arrangements, \nDraft rule determination, 28 August 2014, Sydney. \nAustralian PV Institute 2013, Impacts of PV, AC, other technologies and tariffs on consumer costs—\nreport to the Centre for Policy Development. \nAustralian PV Institute 2014, Australian PV in Australia Report 2013, APVI. \nClimate Change Authority (CCA) 2012, Renewable Energy Target Review—Final Report, Melbourne. \nCCA 2014, Targets and Progress Review—Final Report, Melbourne. \n76 | REPORT: 2014 RET REVIEW \n \nClean Energy Council 2014, Briefing paper—the impacts of changes to the SRES threshold, CEC, \nMelbourne. \nClean Energy Regulator 2014, Small-Scale Installations by Postcode, viewed 27 November 2014, \nhttp://ret.cleanenergyregulator.gov.au/REC-Registry/Data-reports. \nEdis, T 2014, '$1 per watt solar – it’s here now', Climate Spectator, 7 November, viewed 4 December \n2014,  \nwww.businessspectator.com.au/article/2014/11/7/solar-energy/1-watt-solar-%E2%80%93-its-here-\nnow.  \nGreen Energy Markets 2014, Small-scale technology certificates—Data modelling for 2014 to 2016, \nReport to Clean Energy Regulator, Melbourne. \nHanger, I 2014, Report of the Royal Commission into the home insulation program, Commonwealth \nof Australia, Canberra. \nIntelligent Energy Systems (IES) 2014, Small-scale technology certificates forecasts—2014 to 2016,, \nSydney. \nKelp, O 2014, Personal communications between Owen Kelp of ACIL Allen and the Climate Change \nAuthority. \nNERA Economic Consulting 2014, Efficiency of tariffs for current and emerging technologies, report \nto the Australian Energy Market Commission, Sydney. \nRenewable Energy (Electricity) Regulations 2001 (Cth). \nSinclair Knight Merz and McLennan Magasanik Associates (SKM MMA) 2012, Modelling the \nRenewable Energy Target, Report to the Climate Change Authority, Sydney. \nTreasury and the Department of Industry, Innovation, Climate Change, Science, Research and \nTertiary Education (DIICCSRTE) 2013, Climate change mitigation scenarios, Report for the Climate \nChange Authority in support of its Caps and Targets Review, Canberra.  \nWarburton review (Expert Panel) 2014, Renewable Energy Target Scheme—Report of the Expert \nPanel, Canberra. \nCHAPTER 5 \nClimate Change Authority (CCA) 2012, Renewable Energy Target Review—Final Report, Melbourne. \nWarburton review (Expert Panel) 2014, Renewable Energy Target Scheme—Report of the Expert \nPanel, Canberra. \nAPPENDICES  \nClimate Change Authority 2012, Renewable Energy Target Review—Final Report, Melbourne. \nClimate Change Authority Act 2011 (Cth). \nRenewable Energy (Electricity) Act 2000 (Cth). \nWarburton review (Expert Panel) 2014, Renewable Energy Target Scheme—Report of the Expert \nPanel, Canberra. \n REFERENCES | 77 \n \n \n78 | REPORT: 2014 RET REVIEW \n",
    "Link": "https://core.ac.uk/download/pdf/30673002.pdf"
}