{
    "Title": "Treadmill exercise within lower body negative pressure protects leg lean tissue mass and extensor strength and endurance during bed rest.",
    "Authors": "Feiveson, Alan H, Hargens, Alan R, Lee, Stuart MC, Macias, Brandon R, Schneider, Suzanne M, Watenpaugh, Donald E",
    "Year": "No year available",
    "Abstract": "Leg muscle mass and strength are decreased during reduced activity and non-weight-bearing conditions such as bed rest (BR) and spaceflight. Supine treadmill exercise within lower body negative pressure (LBNPEX) provides full-body weight loading during BR and may prevent muscle deconditioning. We hypothesized that a 40-min interval exercise protocol performed against LBNPEX 6&nbsp;days&nbsp;week(-1) would attenuate losses in leg lean mass (LLM), strength, and endurance during 6° head-down tilt BR, with similar benefits for men and women. Fifteen pairs of healthy monozygous twins (8 male and 7 female pairs) completed 30&nbsp;days of BR with one sibling of each twin pair assigned randomly as the non-exercise control (CON) and the other twin as the exercise subject (EX). Before and after BR, LLM and isokinetic leg strength and endurance were measured. Mean knee and ankle extensor and flexor strength and endurance and LLM decreased from pre- to post-BR in the male CON subjects (P&nbsp;&lt;&nbsp;0.01), but knee extensor strength and endurance, ankle extensor strength, and LLM were maintained in the male EX subjects. In contrast, no pre- to post-BR changes were significant in the female subjects, either CON or EX, likely due to their lower pre-BR values. Importantly, the LBNPEX countermeasure prevents or attenuates declines in LLM as well as extensor leg strength and endurance. Individuals who are stronger, have higher levels of muscular endurance, and/or have greater LLM are likely to experience greater losses during BR than those who are less fit",
    "Keywords": "No keywords available",
    "Publisher": "eScholarship, University of California",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "UC San Diego\nUC San Diego Previously Published Works\nTitle\nTreadmill exercise within lower body negative pressure protects leg lean tissue mass and \nextensor strength and endurance during bed rest.\nPermalink\nhttps://escholarship.org/uc/item/65g7z3d4\nJournal\nPhysiological reports, 4(15)\nISSN\n2051-817X\nAuthors\nSchneider, Suzanne M\nLee, Stuart MC\nFeiveson, Alan H\net al.\nPublication Date\n2016-08-01\nDOI\n10.14814/phy2.12892\n \nPeer reviewed\neScholarship.org Powered by the California Digital Library\nUniversity of California\nORIGINAL RESEARCH\nTreadmill exercise within lower body negative pressure\nprotects leg lean tissue mass and extensor strength and\nendurance during bed rest\nSuzanne M. Schneider1, Stuart M. C. Lee2, Alan H. Feiveson3, Donald E. Watenpaugh4,\nBrandon R. Macias2 & Alan R. Hargens5\n1 University of New Mexico, Albuquerque, New Mexico\n2 Wyle Science, Technology, and Engineering Group, Houston, Texas\n3 NASA Johnson Space Center, Houston, Texas\n4 University of North Texas Health Science Center, Fort Worth, Texas\n5 University of California, San Diego, California\nKeywords\nBody composition, head down tilt, isokinetic,\nmicrogravity, muscle atrophy, spaceflight.\nCorrespondence\nSuzanne M. Schneider, University of New\nMexico, Albuquerque, NM 87111.\nE-mail: sschneid@unm.edu\nFunding Information\nThis study was supported by National\nAeronautics and Space Administration Grants\nNAG9-1425, NNX10AM18G, NNX12AL66G\nand NIH grant M01 RR-00827 (to the UCSD\nGCRC).\nReceived: 4 June 2016; Revised: 17 July\n2016; Accepted: 19 July 2016\ndoi: 10.14814/phy2.12892\nPhysiol Rep, 4 (15), 2016, e12892, doi:\n10.14814/phy2.12892\nAbstract\nLeg muscle mass and strength are decreased during reduced activity and non-\nweight-bearing conditions such as bed rest (BR) and spaceflight. Supine tread-\nmill exercise within lower body negative pressure (LBNPEX) provides full-body\nweight loading during BR and may prevent muscle deconditioning. We\nhypothesized that a 40-min interval exercise protocol performed against\nLBNPEX 6 days week\n\u00011 would attenuate losses in leg lean mass (LLM),\nstrength, and endurance during 6° head-down tilt BR, with similar benefits\nfor men and women. Fifteen pairs of healthy monozygous twins (8 male and\n7 female pairs) completed 30 days of BR with one sibling of each twin pair\nassigned randomly as the non-exercise control (CON) and the other twin as\nthe exercise subject (EX). Before and after BR, LLM and isokinetic leg strength\nand endurance were measured. Mean knee and ankle extensor and flexor\nstrength and endurance and LLM decreased from pre- to post-BR in the male\nCON subjects (P < 0.01), but knee extensor strength and endurance, ankle\nextensor strength, and LLM were maintained in the male EX subjects. In con-\ntrast, no pre- to post-BR changes were significant in the female subjects, either\nCON or EX, likely due to their lower pre-BR values. Importantly, the LBNPEX\ncountermeasure prevents or attenuates declines in LLM as well as extensor leg\nstrength and endurance. Individuals who are stronger, have higher levels of\nmuscular endurance, and/or have greater LLM are likely to experience greater\nlosses during BR than those who are less fit.\nIntroduction\nDecreased lower body muscle mass, strength, and endur-\nance frequently are observed in non-weight-bearing con-\nditions such as limb immobilization, bed rest (BR), and\nspaceflight (Adams et al. 2003). These skeletal muscle\nchanges are attributed to gravitational unloading, reduced\nmuscle perfusion (Schneider and Convertino 2011),\nreduced physical activity (Blanc et al. 2000), and during\nspaceflight to reduced caloric intake (Stein 2001). Baldwin\n(Baldwin et al. 1996) reviewed the effects of microgravity\non the biochemical properties of muscle and suggested\nthat unloading alters the sensitivity of selected muscle\nfibers to anabolic factors such as growth hormone, insu-\nlin-like growth factor, glucocorticoids, or thyroid hor-\nmones, thus reducing protein synthesis and increasing\ndegradation. During and after spaceflight, the ensuing\nfunctional reductions in muscle power, strength, and\nendurance may limit an astronaut’s ability to complete\ntasks or to safely egress the spacecraft in the event of an\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nThis is an open access article under the terms of the Creative Commons Attribution License,\nwhich permits use, distribution and reproduction in any medium, provided the original work is properly cited.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 1\nPhysiological Reports ISSN 2051-817X\nemergency (Ryder et al. 2013). Muscle weakness also may\nincrease susceptibility to reloading and/or fall-induced\ninjuries and increase reconditioning time after flight.\nThe use of exercise countermeasures began early in US\nand Russian space programs and continues to be a pri-\nmary method to protect muscle mass and strength. How-\never, exercises employed have not fully prevented muscle\natrophy and strength losses during spaceflight, and indi-\nvidual responses are highly variable (Ploutz-Snyder et al.\n2014). Shuttle and the International Space Station aerobic\nin-flight exercise hardware provide only partial weight\nbearing (cycle ergometer or treadmill exercise with the\nsubject tethered to the treadmill using a body harness\nwith bungee cords or a spring-loaded device) (Cavanagh\net al. 2005, 2010). While it is generally accepted that\nresistive exercise is the most effective approach to main-\ntain muscle function during spaceflight (Baldwin et al.\n1996), high-load resistive exercise devices were not avail-\nable until the International Space Station (Trappe et al.\n2009; Korth 2015; Loehr et al. 2015).\nIsokinetic muscle strength testing from both Shuttle\nand ISS crews suggests that treadmill exercise running\nprovides some level of protection (Trappe et al. 2009;\nHayes et al. 2013), but the question remains as to\nwhether the effectiveness of this countermeasure could be\nenhanced with full body weight or greater loading. With\nthe current harness system, astronauts can typically only\ntolerate 70–80% of the one body-weight loading while\nwalking or running on the treadmill. Formulating an\neffective aerobic exercise protocol which preserves muscle\nwould be critical for astronauts who do not perform\nhigh-intensity resistive exercise, either due to discomfort\nassociated with heavy loads (loading equivalent to body\nweight plus training load), injury, or failure of the resis-\ntive hardware device (Lee et al. 2014; Loehr et al. 2015).\nOver the past 2.5 decades, we have developed and\ntested an exercise device that allows supine walking and\nrunning on a vertically oriented treadmill within a lower\nbody negative pressure chamber (LBNPEX) (Hargens et al.\n1991). We have demonstrated that this device produces\nfootward loading, footward fluid distribution, and cardio-\nvascular responses comparable to those experienced dur-\ning normal ambulatory conditions in normal Earth\ngravity (1-g) (Boda et al. 2000). Furthermore, we have\nreported that this form of exercise during BR prevents\nincreased bone resorption (Smith et al. 2003; Zwart et al.\n2007), maintains aerobic and sprint capacity (Lee et al.\n2007, 2009; Schneider et al. 2009), maintains back\nstrength and function (Cao et al. 2005; Macias et al.\n2007), and attenuates the decline in orthostatic tolerance\n(Watenpaugh et al. 2007; Guinet et al. 2009). However,\nwhile this countermeasure prevents plantar muscle\nstrength loss during 15 days of BR (Watenpaugh et al.\n2000), we had not performed a comprehensive evaluation\nof the effectiveness of LBNPEX alone to attenuate reduc-\ntions in leg lean mass (LLM), strength, or endurance dur-\ning longer duration BR when muscle strength and\nendurance losses are greater.\nAdditionally, considering that women comprise a sig-\nnificant proportion (30%) of the active astronaut corps\n(Harm et al. 2001; Ploutz-Snyder et al. 2014), it is impor-\ntant to investigate the effects of sex on adaptations to BR\nand exercise countermeasures. The evidence is conflicting\nabout whether sex differences exist in muscle decondi-\ntioning during unloading. Several authors suggest that\nmen have greater deconditioning, perhaps related to lar-\nger muscle fibers (Lindboe and Platou 1982; Miles et al.\n2005), greater relative number of type II myofibers (Miller\net al. 1993), a greater sensitivity to peripheral neuromotor\ninhibition (Koryak 1999), and/or to effects of male or\nfemale hormones to alter protein turnover during unload-\ning (Smith and Mittendorfer 2012). On the other hand,\nTrappe et al. (2007) report that women have greater\nlosses in muscle mass and strength than men during sepa-\nrate BR protocols. Few studies have directly compared\nmale and female subjects during identical BR conditions\n(e.g., duration and diet) and while performing the same\ncountermeasures.\nThe purpose of this study was to evaluate the effective-\nness of an LBNPEX protocol for preventing losses in leg\nlean tissue mass, strength, and endurance during 30 days\nof 6° head-down tilt BR, a space flight analog. Male and\nfemale monozygous twins were studied before and after\nbed rest, with one serving as a control and the other per-\nforming the LBNPEX countermeasure, to examine specifi-\ncally the effect of sex on BR-induced adaptations and\nexercise countermeasures. We hypothesized that LBNPEX\nwould prevent BR-induced losses in LLM and in isoki-\nnetic muscle strength and endurance, and that the\nLBNPEX countermeasure would be equally effective for\nmen and women.\nMethods\nOverall protocol\nThis study was part of a larger investigation of the protec-\ntive effects of LBNPEX on physiologic adaptations to BR.\nSpecifically, we previously reported results from these\nsubjects in the areas of upright aerobic capacity (Lee et al.\n2007, 2009), orthostatic tolerance (Watenpaugh et al.\n2007), spine and trunk conditioning (Cao et al. 2005;\nMacias et al. 2007), renal stone risk (Monga et al. 2006),\nand bone metabolism (Smith et al. 2003; Zwart et al.\n2007). Protocols were reviewed and approved by the\nInstitutional Review Boards of University of California-\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 2\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nTreadmill Exercise Within LBNP For Muscle Strength S. M. Schneider et al.\nSan Diego (UCSD) and NASA Johnson Space Center\n(JSC). Subjects received verbal and written explanation of\nall procedures and signed statements of informed consent\nprior to participation. The study protocol has been\ndetailed in previous reports, but is repeated with specific\nreference to the data described herein.\nFifteen pairs of healthy identical twins (8 male and 7\nfemale) volunteered to participate in this study. Subjects\nreceived complete physical examinations from qualified\nphysicians and were admitted to the General Clinical\nResearch Center (GCRC) at UCSD for the duration of\nthe study. They were admitted to the GCRC 6 days\nprior to the start of BR for a period of ambulatory con-\ntrol during which they underwent familiarization and\ntwo pre-BR testing sessions. Subjects then completed a\nperiod of strict 6° head-down tilt BR for 30 days. Sub-\njects were not allowed to be in upright posture at any\ntime. Urination, defecation, showering, and transport to\nand from all testing and countermeasure sessions were\nconducted in head-down or horizontal posture. Within\neach twin pair, one twin was randomly assigned (coin\nflip) to the non-exercise control (CON) group and the\nother twin to the exercise countermeasure group (EX).\nThis assignment occurred after completion of all pre-BR\nbaseline data collection to ensure group assignment\ncould not influence or bias those data. Under the\nassumption that subjects from the same twin pair are\nmore alike than subjects who are not genetically identi-\ncal, this partially hierarchical experimental design per-\nmits accurate evaluation of the effect of exercise and the\ninteraction of exercise with sex on the pre- to post-BR\nchange, albeit at the expense of having less accurate\nevaluation of the overall effect of sex (see Statistical\nanalyses).\nThe GCRC dietary staff prepared a diet consisting of\n55% carbohydrate, 15% protein, and 30% fat, and dietary\nrecords were maintained to insure consistency for all sub-\njects. Initial caloric consumption was prescribed for each\nsubject using the Harris–Benedict equations, adjusting for\nself-reported activity level (correction factor: 1.4–1.5) prior\nto admission to the GCRC. Thereafter, caloric consump-\ntion was adjusted such that subjects maintained their body\nweight within \u00031.0 kg. Body weight was measured in the\nsupine position each morning before breakfast.\nMuscle strength and endurance tests\nLeg muscle strength and endurance were tested three\ntimes, twice before BR, and once on BR day 28. Pre-BR\nsessions were separated by at least 48 h. Muscle strength\nand endurance tests were conducted while subjects were\nsupine, and all tests were conducted on the right leg.\nTests used a standard clinical isokinetic dynamometer\n(Biodex System 2, Biodex Medical Systems, Inc., Shirley,\nNY). Range of motion was set for each subject and held\nconstant across testing sessions. Before data collection at\neach testing speed, subjects completed warm-up and prac-\ntice repetitions of extension and flexion through the\nentire range of motion consisting of five repetitions at\napproximately 50% of perceived maximal effort followed\nby two to three repetitions at 100% maximal effort. Sub-\njects rested for at least 2 min between practice repetitions\nand data collection. Gravity correction was employed to\nremove the effect of limb and limb adapter weight from\nthe torque measurement.\nWith the exception that tests were performed while\nsubjects were supine to avoid violation of the in-bed rest\nposture, the testing protocols here are similar to those\nused in previous bed rest studies and in astronauts before\nand after long-duration space flight (Lee et al. 2014; Eng-\nlish et al. 2015). Isometric knee extensor and flexor\nstrengths were tested at 1.05 rad (60°) of knee flexion\nfrom full knee extension. Four maximal efforts were held\nfor 5 sec, separated by 30 sec of rest. Isokinetic extensor\nand flexor strength of the knee were tested at\n1.05 rad•sec\u00011 (60°•sec\u00011) across a range of motion of\n0.35 rad to 1.66 rad (20° to 95°) of knee flexion from full\nextension (0 rad, 0°). Isokinetic extensor and flexor\nstrength of the ankle were tested at 1.05 rad•sec\u00011\n(60°•sec\u00011) across a range of motion from 0.35 rad (20°)\nof dorsiflexion to 0.70 rad (40°) of plantarflexion. The\nanatomical neutral position was defined as 0 rad (0°). All\nisokinetic strength tests were performed such that subjects\nexerted a maximal effort in only one direction within\neach set of repetitions. At the end of the range of motion,\nsubjects were instructed to relax, and the test operator\nreturned the limb to the starting position. Subjects per-\nformed six maximal repetitions of each movement. For\nthe assessment of knee extensor and flexor endurance,\nsubjects performed 21 maximal repetitions in both direc-\ntions in the same test without pauses or pacing at\n2.09 rad•sec\u00011 (120°•sec\u00011) across the same range of\nmotion as the strength tests. Using similar procedures in\nour laboratory, isokinetic tests have a high degree of relia-\nbility (ICC > 0.90), except for ankle dorsiflexion\n(ICC = 0.67) (Lee et al. 2014).\nPeak torque was determined for each repetition of\nmaximal effort during isometric and isokinetic testing.\nKnee isokinetic endurance was calculated as total amount\nof work performed for repetitions 2 through 21. Previous\nexperience in our laboratory has shown that subjects do\nnot obtain a maximal effort in the first repetition of knee\nextension. The summation of work was calculated sepa-\nrately for extension and flexion.\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 3\nS. M. Schneider et al. Treadmill Exercise Within LBNP For Muscle Strength\nLean tissue mass\nA whole-body scan was acquired pre-BR and on the sec-\nond day after BR using Dual energy X-ray absorptiometry\n(DXA, GE Lunar, Model DPY-1Q, Madison, WA). Lean\nmass was determined for each leg from the whole-body\nscan, and the results summed across both legs to repre-\nsent total LLM. Within subjects, the same operator who\nwas blinded to subject group and gender, conducted the\npre- and post-BR scans and the same technician calcu-\nlated LLM. Whole-body composition results have been\nreported previously (Lee et al. 2007, 2009).\nExercise countermeasure\nThe exercise device used for this study was the same as\nused in our previous 5-day (Lee et al. 1997) and 15-day\nBR studies (Watenpaugh et al. 2000). The device consists\nof a partial vacuum chamber in which subjects ran com-\nfortably on a vertically oriented treadmill (PaceMaster\nSX-Pro, Aerobics Inc., Little Falls, NJ). The level of LBNP\n(decompression) and the size of the waist seal aperture\nwere adjusted such that 1.0 times body weight was\nachieved with a LBNP level of 50–60 mmHg. Thereafter,\nthe level of LBNP was increased during BR across the\nexercise sessions as tolerated by the subjects with the goal\nof achieving 1.2 times body weight by the end of the\n30 days BR period, but not to exceed 60 mmHg. For the\nmale twins, during the final 2 weeks of BR, six subjects\nexercised for at least three sessions at 1.05–1.1 BW, and\nthree completed some of their exercise sessions at\n1.2 BW. For the female twins, four subjects exercised at\nleast three sessions at 1.05 BW and one subject exercised\nat 1.1 BW for an entire session.\nEX subjects performed 40 min of exercise 6 days week\u00011.\nTarget exercise intensities for this protocol consisted of\n7 min at 40% of pre-BR VO2pk, 3 min at 60%, 2 min at\n40%, 3 min at 70%, 2 min at 50%, 3 min at 80%, 2 min\nat 60%, 3 min at 80%, 2 min at 50%, 3 min at 70%, 2 min\nat 40%, 3 min at 60%, and 5 min at 40%. After completion\nof the exercise protocol, LBNP was maintained for 5 min\nwhile the subjects resisted the suction pressure against the\nvertical treadmill belt. Pre-BR, VO2pk was measured using\na graded treadmill test to volitional fatigue. As previously\ndescribed (Lee et al. 2007, 2009), the treadmill protocol\nconsisted of 5 min of level walking at 4.8 km h\u00011 (3 mph)\nand then three, 3-min stages of increasing exercise intensity\n(approximately 65%, 75%, and 85% of pre-bed rest\nVO2peak) at 0% grade. After the third running stage, tread-\nmill speed was held constant, but the grade was increased\nin increments of 3%•min\u00011 until test termination. VO2pk\nwas determined as the average of the highest VO2 measured\nin two consecutive 30-sec samples.\nStatistical analyses\nCommensurate with the partially hierarchical design of\nthe study, in which twin pairs within sex was the whole-\nplot factor and exercise/control was the subplot factor\nwithin each pair, we used “split-plot” ANOVA to test for\ngender effects, exercise effects, and their interaction where\nthe dependent variable was the change from pre- to post-\nBR in LLM and in each of 10 muscle strength or endur-\nance outcomes. For purposes of these comparisons,\n“change” was defined as the post-BR measurement minus\nthe maximum of the two pre-BR measurements. In this\ntype of ANOVA, the error term for comparing sexes is\nbased on the between-twin variance, whereas the error\nterm for assessing the effect of exercise and the interac-\ntion between exercise and gender is based on the within-\npair variance. As a result, if subjects from the same twin\npair are more alike than subjects from different pairs,\nCON versus EX comparisons would be more powerful in\nthis study design than they would be in a completely ran-\ndomized study (e.g., 30 subjects without pairing). On the\nother hand, sex comparisons under this design would\nhave less power. For each outcome, we assessed the effi-\nciency of using twin pairs in the design by a post-test\nevaluation of the twin-pairs-within-sex factor. This is\nessentially a comparison of between-pair differences to\nwithin-pair differences after the effects of sex and exercise\nare removed.\nFor some outcomes, the above ANOVA model was\naugmented to include the pre-BR maximum as a covari-\nate (ANCOVA model) to see if the amount of change\ncould be predicted from pre-BR levels taking exercise into\naccount. The ANCOVA analyses were intended to address\nthe question of whether sex differences in change after BR\ncould be explained by the generally higher strength and\nendurance levels of the male subjects pre-BR, with and/or\nwithout exercise. However, it is well known that using\ncovariates with substantial measurement errors or nonre-\npeatability can lead to biased inference (Greene 2000). To\nprevent this error, we first checked for the exogeneity of\nthe covariates using instrumental variable regression\n(IVR) with LLM as the instrument. LLM is well suited for\nIVR as applied here because it is fairly well correlated\nwith all the outcomes studied and also is a very repeatable\nmeasurement. However, because of its lower power, we\ndid not use IVR for direct inference on the effect of exer-\ncise or sex, but only for checking covariate exogeneity.\nThus, after IVR, if the hypothesis of covariate exogeneity\nwas in reasonable doubt (P < 0.15) for a given outcome,\nwe did not attempt to adjust for pre-BR outcome levels,\nin which case comparisons were made with ANOVA.\nAfter all analyses, linear regression models, equivalent to\nthe above ANOVAs were used to estimate means and\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 4\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nTreadmill Exercise Within LBNP For Muscle Strength S. M. Schneider et al.\nconfidence intervals for several comparisons of interest.\nAll statistical analyses were performed using Stata Version\n13.1 software (Statacorp, Inc., College Station, TX).\nThe reporting level of statistical significance was set at\nP < 0.05; however, it should be kept in mind that ANOVAs\nwere run for each of 11 outcomes, with three tests per\nANOVA (main effects of sex and exercise, plus the interac-\ntion). As a result, we recognize that some of the reported\neffects with P < 0.05 could have arisen by chance. Methods\nfor controlling the family-wise error rate to 0.05, such as\nBonferroni, Sidak, or Hochberg (Hochberg 1988) are con-\nservative and would eliminate consideration of results with\nP > 0.005, even if applied separately to the 11 tests made\nfor each ANOVA factor. Alternative methods that control\nthe false discovery rate, such as the one proposed by\nBenjamini et al. (Benjamini et al. 2006), are not feasible\nbecause there were not enough tests in our study (33 total)\nfor these methods to be reliable. Therefore, rather than risk\nmissing potentially important effects, we report changes as\nbeing “significant” if P < 0.05 in the Results section, but\nleave interpretation to the reader in light of the overall\nstudy.\nResults\nPre-bed rest comparisons\nAnthropometric statistics for pre-BR age, body mass,\nheight, and aerobic capacity (VO2pk) are shown for the\nCON and EX groups by sex in Table 1. There were no sig-\nnificant differences between twin pairs. Males had higher\nvalues for weight, height, and aerobic capacity than\nfemales.\nBefore BR, there were no significant differences between\nCON and EX within sex for LLM or any strength measure-\nment. When comparing the pre-BR values between men\nand women, the women had significantly (P < 0.01 to\nP < 0.03) smaller values of LLM, concentric knee extensor\nand flexor strength, isometric knee flexor strength, concen-\ntric knee flexor endurance, and concentric ankle flexor\nstrength. There were no significant sex differences in the\npre-BR values for isometric knee extensor strength, con-\ncentric knee extensor endurance, or concentric ankle flexor\nstrength.\nEffect of bed rest\nMean and standard deviation for each outcome variable\nare shown for CON and EX groups by sex in Table 2.\nP-values shown for outcomes flagged by asterisks apply to\nthe predicted mean change accounting for the influence\nof the maximum pre-BR score as a covariate. Analyses for\nother outcomes did not use the maximum pre-BR score\nas a covariate because it failed the test for exogeneity (ad-\nditional details provided in the legend for Table 3). Mean\nextensor (\u000120% to \u000110%) and flexor (\u000113% to \u00019%)\nstrength and endurance decreased significantly from pre-\nto post-BR in all measures except for isometric strength\nin male CON subjects. LBNPEX mitigated knee and ankle\nextensor strength losses, however, significant decrements\nin knee (\u000112% to \u000110%) and ankle (\u00017%) strength\nlosses were observed. Neither female group, CON nor EX,\nexperienced significant decreases in any muscle strength\nor endurance measure during BR. Similarly, mean LLM\ndecreased significantly (\u00017%) after BR in the male CON\nsubjects, but there was no evidence of a significant change\nin leg LLM in the male EX subjects, female CON, or\nfemale EX subjects.\nEffect of exercise\nFor extensor strength and endurance outcomes, we found\nthat the effect of pre-BR muscle performance on post-BR\nperformance was different between CON and EX groups.\nThis difference was most evident for knee extensor endur-\nance (P = 0.002, Fig. 1) and less for knee extensor\nstrength (P = 0.063, Fig. 2). For example, CON subjects\nwith higher pre-BR performance had greater loss in knee\nextensor endurance than those with lower initial perfor-\nmance. By contrast, EX subjects experienced little\nTable 1. Pre-bed rest subject anthropometrics (mean \u0003 SD).\nMen Women\nControl\n(n = 8)\nExercise\n(n = 8)\nControl\n(n = 7)\nExercise\n(n = 7)\nAge (years) 27 \u0003 5 27 \u0003 5 24 \u0003 3 24 \u0003 3\nBody mass (kg)* 69.4 \u0003 10.9 66.5 \u0003 9.5 57.8 \u0003 11.5 55.3 \u0003 8.4\nHeight (cm)* 175.7 \u0003 13.6 173.5 \u0003 13.0 164.5 \u0003 10.3 164.5 \u0003 9.3\nVO2pk (mL kg\n\u00011 min\u00011)* 51.9 \u0003 2.7 52.8 \u0003 2.7 44.0 \u0003 1.6 44.4 \u0003 1.9\n*Significant differences between men and women, ANOVA, P < 0.05. There are no significant differences between CON and EX groups.\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 5\nS. M. Schneider et al. Treadmill Exercise Within LBNP For Muscle Strength\nT\na\nb\nle\n2\n.\nM\nea\nn\n(\u0003\nSD\n)\nm\nu\nsc\nle\nst\nre\nn\ng\nth\nan\nd\nen\nd\nu\nra\nn\nce\nb\nef\no\nre\n(P\nre\n)\nan\nd\naf\nte\nr\nb\ned\nre\nst\n(P\no\nst\n),\nth\ne\nm\nea\nn\np\ner\nce\nn\nt\nch\nan\ng\ne\n(D\n)\nfr\no\nm\np\nre\n-\nto\np\no\nst\n-b\ned\nre\nst\n,\nan\nd\nth\ne\nef\nfe\nct\no\nf\nb\ned\nre\nst\no\nn\nea\nch\nva\nri\n-\nab\nle\nw\nit\nh\nin\ng\nro\nu\np\ns.\nM\nea\nsu\nre\nU\nn\nit\ns\nM\nen\nW\no\nm\nen\nPr\ne\nPo\nst\nD\nP\nPr\ne\nPo\nst\nD\nP\nC\no\nn\ntr\no\nl\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nex\nte\nn\nsi\no\nn\n*\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n1\n8\n9\n\u0003\n4\n4\n1\n5\n1\n\u0003\n3\n7\n\u00012\n0\n%\n0\n.0\n0\n0\n4\n1\n1\n3\n\u0003\n3\n1\n1\n0\n2\n\u0003\n3\n1\n\u00011\n0\n%\n0\n.2\n2\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nfl\nex\no\nr\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n8\n8\n\u0003\n1\n5\n7\n7\n\u0003\n1\n3\n\u00011\n3\n%\n0\n.0\n0\n0\n9\n5\n2\n\u0003\n1\n2\n4\n8\n\u0003\n1\n1\n\u00018\n%\n0\n.1\n1\nIs\no\nm\net\nri\nc\nkn\nee\nex\nte\nn\nsi\no\nn\n*\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n2\n2\n1\n\u0003\n5\n9\n1\n9\n8\n\u0003\n6\n3\n\u00011\n0\n%\n0\n.0\n2\n1\n4\n7\n\u0003\n4\n1\n1\n2\n4\n\u0003\n3\n4\n\u00011\n6\n%\n0\n.0\n2\nIs\no\nm\net\nri\nc\nkn\nee\nfl\nex\nio\nn\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n8\n2\n\u0003\n1\n5\n7\n6\n\u0003\n2\n0\n\u00017\n%\n0\n.1\n1\n4\n9\n\u0003\n1\n0\n4\n6\n\u0003\n1\n0\n\u00016\n%\n0\n.3\n7\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nex\nte\nn\nsi\no\nn\n*\nTo\nta\nl\nW\no\nrk\nN\n-m\n2\n4\n5\n8\n\u0003\n7\n4\n3\n2\n1\n1\n2\n\u0003\n5\n3\n1\n\u00011\n4\n%\n0\n.0\n0\n0\n0\n1\n4\n4\n2\n\u0003\n3\n5\n3\n1\n4\n0\n0\n\u0003\n3\n7\n9\n\u00013\n%\n0\n.3\n6\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nfl\nex\nio\nn\nTo\nta\nl\nW\no\nrk\nN\n-m\n1\n3\n2\n2\n\u0003\n2\n7\n2\n1\n1\n2\n0\n\u0003\n1\n9\n8\n\u00011\n5\n%\n0\n.0\n0\n0\n2\n8\n0\n1\n\u0003\n1\n7\n9\n7\n0\n2\n\u0003\n2\n0\n4\n\u00011\n2\n%\n0\n.0\n3\nC\no\nn\nce\nn\ntr\nic\nan\nkl\ne\nex\nte\nn\nsi\no\nn\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n9\n4\n\u0003\n1\n8\n8\n1\n\u0003\n2\n6\n\u00011\n4\n%\n0\n.0\n0\n0\n5\n5\n4\n\u0003\n1\n4\n4\n9\n\u0003\n1\n2\n\u00019\n%\n0\n.0\n9\nC\no\nn\nce\nn\ntr\nic\nan\nkl\ne\nfl\nex\nio\nn\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n3\n2\n\u0003\n7\n2\n9\n\u0003\n7\n\u00019\n%\n0\n.0\n0\n4\n2\n2\n\u0003\n4\n2\n1\n\u0003\n6\n\u00015\n%\n0\n.1\n0\nLe\ng\nle\nan\nti\nss\nu\ne\nm\nas\ns\nLe\nan\nm\nas\ns\nkg\n1\n8\n.5\n\u0003\n4\n.2\n1\n7\n.2\n\u0003\n3\n.2\n\u00017\n%\n0\n.0\n0\n0\n2\n1\n2\n.4\n\u0003\n1\n.4\n1\n2\n.3\n\u0003\n1\n.3\n\u00011\n%\n0\n.7\n8\nEx\ner\nci\nse\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nex\nte\nn\nsi\no\nn\n*\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n1\n8\n3\n\u0003\n4\n8\n1\n7\n3\n\u0003\n5\n7\n\u00015\n%\n0\n.2\n1\n1\n1\n2\n\u0003\n2\n4\n1\n0\n4\n\u0003\n2\n8\n\u00017\n%\n0\n.3\n5\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nfl\nex\no\nr\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n8\n6\n\u0003\n2\n4\n7\n7\n\u0003\n2\n6\n\u00011\n0\n%\n0\n.0\n0\n3\n5\n0\n\u0003\n1\n1\n5\n0\n\u0003\n1\n3\n0\n%\n0\n.8\n6\nIs\no\nm\net\nri\nc\nkn\nee\nex\nte\nn\nsi\no\nn\n*\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n2\n0\n6\n\u0003\n5\n5\n1\n9\n7\n\u0003\n6\n1\n\u00014\n%\n0\n.2\n8\n1\n3\n6\n\u0003\n3\n2\n1\n2\n1\n\u0003\n3\n1\n\u00011\n1\n%\n0\n.1\n0\nIs\no\nm\net\nri\nc\nkn\nee\nfl\nex\nio\nn\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n8\n4\n\u0003\n2\n5\n7\n4\n\u0003\n2\n1\n\u00011\n2\n%\n0\n.0\n1\n5\n0\n\u0003\n1\n1\n4\n5\n\u0003\n9\n\u00011\n0\n%\n0\n.1\n8\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nex\nte\nn\nsi\no\nn\n*\nTo\nta\nl\nW\no\nrk\nN\n-m\n2\n2\n7\n2\n\u0003\n9\n1\n1\n2\n2\n0\n9\n\u0003\n9\n7\n8\n\u00013\n%\n0\n.1\n6\n1\n4\n0\n3\n\u0003\n3\n6\n0\n1\n4\n4\n0\n\u0003\n3\n9\n8\n+\n3\n%\n0\n.4\n2\nC\no\nn\nce\nn\ntr\nic\nkn\nee\nfl\nex\nio\nn\nTo\nta\nl\nW\no\nrk\nN\n-m\n1\n2\n8\n3\n\u0003\n4\n8\n8\n1\n1\n2\n3\n\u0003\n3\n6\n0\n\u00011\n2\n%\n0\n.0\n0\n1\n7\n6\n5\n\u0003\n1\n4\n6\n7\n0\n5\n\u0003\n1\n5\n3\n\u00018\n%\n0\n.1\n6\nC\no\nn\nce\nn\ntr\nic\nan\nkl\ne\nex\nte\nn\nsi\no\nn\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n8\n7\n\u0003\n2\n3\n8\n3\n\u0003\n2\n1\n\u00015\n%\n0\n.2\n7\n5\n2\n\u0003\n1\n2\n5\n5\n\u0003\n1\n1\n+\n6\n%\n0\n.4\n2\nC\no\nn\nce\nn\ntr\nic\nan\nkl\ne\nfl\nex\nio\nn\nPe\nak\nTo\nrq\nu\ne\nN\n-m\n3\n0\n\u0003\n7\n2\n8\n\u0003\n8\n\u00017\n%\n0\n.0\n0\n2\n2\n1\n\u0003\n3\n2\n0\n\u0003\n4\n\u00015\n%\n0\n.0\n3\nLe\ng\nle\nan\nti\nss\nu\ne\nm\nas\ns\nLe\nan\nm\nas\ns\nkg\n1\n7\n.0\n\u0003\n3\n.9\n1\n6\n.5\n\u0003\n3\n.2\n\u00013\n%\n0\n.1\n0\n1\n2\n.3\n\u0003\n1\n.3\n1\n2\n.5\n\u0003\n1\n.4\n+\n2\n%\n0\n.4\n2\n*A\nn\nal\nys\nis\np\ner\nfo\nrm\ned\nw\nit\nh\nth\ne\np\nre\n-b\ned\nre\nst\nsc\no\nre\nas\na\nco\nva\nri\nat\ne.\nW\nit\nh\nB\no\nn\nfe\nrr\no\nn\ni\nad\nju\nst\nm\nen\nt\nfo\nr\nm\nu\nlt\nip\nle\nsa\nm\np\nlin\ng\n,\na\nco\nn\nse\nrv\nat\niv\ne\nin\nte\nrp\nre\nta\nti\no\nn\nis\nth\nat\na\nP\nva\nlu\ne\no\nf\n<\n0\n.0\n1\n2\n5\nis\nsi\ng\nn\nifi\nca\nn\nt.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 6\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nTreadmill Exercise Within LBNP For Muscle Strength S. M. Schneider et al.\ndiscernible effect of pre-BR performance on change. We\nwere unable to test for this effect for the flexor muscles\nbecause of the high variability in the pre-BR scores.\nUsing a piece-wise linear model to plot the CON total\nwork data in Figure 1, with one linear slope for total\nwork less than 2000 N-m and a second linear slope for\nvalues greater than 2000 N-m, a breakpoint of 1982 N-m\nwas found with a fairly large 95% confidence interval\n(1367, 2597), suggesting that the individuals, male or\nfemale, with a pre-BR value below the breakpoint had lit-\ntle change in muscle endurance during BR.\nThere was no evidence of interaction between sex and\nexercise on the pre- to post-BR change in any of the mus-\ncle strength or endurance measures (Table 3). Similarly,\nthere was no overall effect of sex. We found that the\nmean loss was significantly less for EX subjects (male and\nfemales) only for ankle extensor strength (P = 0.013) and\nknee extensor endurance (P = 0.023).\nWithout adjusting for pre-BR LLM, mean LLM tended\nto decrease as a result of BR to a lesser extent in female\nsubjects (Females: +0.6%, Males: \u00015%; P = 0.060) and\nalso in EX subjects (EX: \u00010.9%, CON: \u00014.7%; P = 0.049,\nFig. 3), but there was no evidence of an interaction\n(P = 0.336) between exercise and sex. In addition, after\nadjusting for pre-BR scores, there also was no evidence of\neither sex or exercise effects on LLM loss.\nTwin-pair design efficiency\nFor five of the nine outcomes studied (concentric knee\nflexion endurance [total work], concentric ankle flexion,\nconcentric ankle extension, LLM, and concentric knee\nextension endurance [total work]), the split-plot design\nusing matched twin pairs was more efficient for testing\nthe effect of exercise (P < 0.05) than using unmatched\nsubjects. Conversely, for the other four outcomes, there\nTable 3. Inference on the effects of sex, exercise, pre-bed rest score (Pre-BR), and on the relative efficiency of using matched twins in the\ndesign (Twin), on the change score from pre- to post-bed rest. Entries are P-values for testing the null hypothesis of no effect.\nOutcome Mode Sex Exercise Exercise 9 Sex Pre-BR* Pre-BR 9 Exercise* Twin\nConcentric knee extension Peak Torque 0.86 0.14 0.66 0.64 0.06 0.62\nConcentric knee flexor Peak Torque 0.05 0.36 0.71 0.33\nIsometric knee extension Peak Torque 0.82 0.45 0.66 0.71 0.27 0.56\nIsometric knee flexion Peak Torque 0.47 0.38 0.69 0.10\nConcentric knee extension Total Work 0.75 0.02 0.40 0.41 0.002 0.03\nConcentric knee flexion Total Work 0.24 0.30 0.98 0.004\nConcentric ankle extension Peak Torque 0.28 0.01 0.70 0.01\nConcentric ankle flexion Peak Torque 0.45 0.55 0.97 0.005\nLeg lean tissue mass Lean mass 0.06 0.05 0.34 0.03\n*Inference on the effect of pre-bed rest score as a covariate in explaining pre-post change is valid only for the most repeatable outcomes (test\nfor exogeneity not rejected; P > 0.15). Others not shown.\nFigure 1. Change in knee extensor muscle endurance (total work) in the control and exercise countermeasure male twins (solid circles) and\nfemale twins (open triangles) after 30 days of bed rest.\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 7\nS. M. Schneider et al. Treadmill Exercise Within LBNP For Muscle Strength\nwas no evidence that the split-plot design was useful for\nthe goal of evaluating exercise.\nDiscussion\nThe question we addressed in this study was whether the\nlosses of LLM, strength and endurance during BR are pre-\nvented by an interval-style treadmill exercise program\nwithin LBNP and whether there are sex differences in the\nBR effects or countermeasure efficacy. This almost daily\n(6 days week\u00011) moderate aerobic exercise program with-\nout resistance exercise prevented the loss of LLM and\nresulted in smaller decreases in leg extensor strength and\nendurance during 30 days of BR. Protection of muscle\nfunction by an aerobic exercise training program during a\nmodel of disuse/unloading has direct implications for\nastronauts in space, for ambulation-impaired patients,\nand for prevention of muscle atrophy in the elderly. In\naddition, we observed that there is a sex-specific differ-\nence with respect to the BR-induced loss of strength and\nLLM; male CON subjects experienced losses while the\nfemale CON subjects did not. However, these differences\nmay relate to the pre-BR levels of muscle fitness, and\ntherefore may not be a true sex effect.\nGround-based evidence that aerobic\nexercise preserves muscle function\nAerobic exercise is not the traditional modality chosen to\nincrease muscle mass or strength. However, the question\nof whether aerobic exercise offers benefits against muscle\ndeconditioning is a slightly different question that recently\nhas been considered in both the clinical literature and in\nspace flight studies. Harber and coworkers, for example,\nFigure 2. Change in knee extensor strength (peak torque) in the control and exercise countermeasure male twins (sold circles) and female\ntwins (open triangles) after 30 days of bed rest.\nFigure 3. Change in leg lean mass in the control and exercise countermeasure male twins (solid circles) and female twins (open triangles) after\n30 days of bed rest.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 8\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nTreadmill Exercise Within LBNP For Muscle Strength S. M. Schneider et al.\nperformed a series of studies to determine whether mod-\nerate cycle exercise is sufficient to increase thigh muscle\nmass in sedentary men (Harber et al. 2012) and women\n(Harber et al. 2009; Konopka et al. 2010). Their subjects\nexercised for 12 weeks at 60–80% VO2pk, 3–4 days per\nweek. Moderate aerobic exercise increased quadriceps\nmuscle volume and, more specifically, Myosin Heavy\nChain1 myofiber cross-sectional area. Schwartz and\ncoworkers (Schwartz et al. 1991) also reported similar\nthigh muscle hypertrophy in elderly men during a pro-\ngram of walking and jogging. Harber and coworkers\n(Harber et al. 2012) considered their findings “particu-\nlarly important for older individuals, as a single-mode\nexercise program increased muscle mass and aerobic\ncapacity, which are two primary risk factors associated\nwith the negative health outcomes of aging”. Thus, devel-\noping a training program that is time efficient and not\nunduly fatiguing would improve adherence.\nFew studies exist in which muscle measurements are\nreported from subjects who perform aerobic exercise to\nprevent muscle deconditioning during BR or other mod-\nels of limb unloading. From these studies, we can obtain\nsome insights into the intensity of exercise required to\nprotect muscle function. Suzuki and coworkers (Suzuki\net al. 1994) had men and women performing cycle exer-\ncise for 1 h day\u00011 at a mild intensity (40% VO2pk), and\nfound no benefit from this exercise to preserve leg mass\nor strength during 10 or 20 days of BR. Sato and cowork-\ners (Sato et al. 2010), on the other hand, employed a sim-\nilar interval exercise protocol as used in this study during\n10 days of unilateral lower limb suspension. This aerobic\nprotocol performed on a cycle ergometer on alternate\ndays maintained thigh muscle volume in 10 male subjects.\nIt is important to note that Suzuki and coworkers\nemployed supine cycle exercise while Sato and coworkers\nutilized the upright unilateral lower limb suspension\nmodel exposing the lower leg to a hydrostatic blood pres-\nsure gradient. LBNPEX simulates the upright transmural\npressure hydrostatic pressure gradient using vacuum on\nlower body tissues. Therefore, exercise conducted with\nvasculature exposed to upright hydrostatic pressure loads\nmay provide an important component to protect against\nlower limb muscle strength loss.\nTreadmill exercise to maintain muscle\nfunction during unloading\nIn addition to the cardiovascular benefits during space-\nflight, treadmill exercise originally was viewed as a\nmethod to counteract the changes in lower body muscle\nmass and strength and to preserve motor coordination\n(Nicogossian et al. 1994). In the US space program, only\npassive treadmills were available for the first 10 years of\nSpace Shuttle flights, until a motorized treadmill with a\nvibration isolation system (TVIS) was deployed in 1999.\nThe motorized mode was postulated to be more effective\nthan the passive mode in maintaining bone and muscle\nbecause it allows greater rates of change in force produc-\ntion during walking or running (Davis et al. 1996). How-\never, even with modification of the treadmill harness\ndesign to distribute the loading between shoulders and\nwaist more evenly, crewmembers performing treadmill\nexercise on ISS do not exercise against full-body loading\nbecause of harness discomfort (Cavanagh et al. 2005,\n2010; Genc et al. 2006). Genc and coworkers (Genc et al.\n2006) speculated that peak forces may be blunted even\nfurther during treadmill exercise on ISS by the slight\nmovements of the vibration isolation system, and the for-\nward-leaning posture (“Groucho walking”) of crewmem-\nbers using the harness system. Thus, lower loading forces,\naltered biomechanics during ambulation, and possible\nground reaction force buffering by the isolation system\nmay be responsible for the limited effectiveness of flight\ntreadmill exercise to protect muscle during previous and\ncurrent space flights.\nIt is our hypothesis that an LBNPEX device which\nallows for 100% body weight or greater loading, may pro-\nvide for better protection of leg muscle mass and strength\nin microgravity than the current tethered treadmill device\nwith which crewmembers are unable to comfortably exer-\ncise with loads approaching full body weight (Cavanagh\net al. 2010; Loehr et al. 2015). We previously documented\nthat LBNPEX for only 45 min, 3–4 days week\n\u00011 together\nwith a flywheel-resistive exercise protocol maintained aer-\nobic capacity (Schneider et al. 2009) and thigh muscle\nvolume (Trappe et al. 2007) during 60 days of BR in\nwomen. LBNPEX allows normal walking and running\nbiomechanics (Boda et al. 2000), without the kinematic\nchanges in gait associated with a tethered treadmill system\nthat reduce peak forces during exercise (McCrory et al.\n2002). By adjusting the level of negative pressure and the\nsize of the waist seal opening, we can independently\nmanipulate the degree of cardiovascular strain and mus-\nculoskeletal weight bearing. Subjects in the LBNPEX device\nare able to ambulate comfortably at even greater than one\nbody mass footward loading for at least 45 min without\ndiscomfort. If we can maintain full-body loading and nor-\nmal biomechanics during exercise in microgravity, this\ncountermeasure should be effective in maintaining skeletal\nmuscle integrity (McCrory et al. 1999).\nBloomfield (Bloomfield 2006) suggests that decreases in\nlower limb blood flow and perfusion pressure during\nmicrogravity reduce the effectiveness of impact loading\nduring exercise to maintain bone mass. The reduction in\nperfusion and pressure oscillations in the lower body in\nmicrogravity are believed to alter the process of\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 9\nS. M. Schneider et al. Treadmill Exercise Within LBNP For Muscle Strength\nmechanotransduction. We propose that by applying\nLBNP during microgravity exercise, we can restore lower\nbody hemodynamics and tissue fluid pressures to levels\nsimilar to upright exercise on Earth and that possible\nbenefits of this form of exercise may protect skeletal and\nvascular smooth muscle as well as bone mass. In rat\nhind-limb suspension studies, the chronic reduction in\nskeletal muscle blood pressure and flow is associated with\nreduced metabolic activity and muscle atrophy (Colleran\net al. 2000). We also suggest that enhancing muscle\nhemodynamics during LBNPEX may provide an effective\nstimulus to restore muscle vascular tone and perfusion,\nand thus preserve muscle metabolism and the activity of\ngrowth factors to preserve muscle mass.\nLBNPEX preserves leg lean mass and\nstrength during BR\nConsistent with our hypothesis, our LBNPEX protocol pre-\nvents the loss of LLM observed in our CON subjects and in\nprevious BR studies (Convertino 1996; Adams et al. 2003).\nFrom our protocol, we cannot conclude whether this effect\nis due solely to the effective application of body loading\nduring exercise, or whether simulating 1-g blood hemody-\nnamics and interstitial pressure gradients in the legs con-\ntributes to this beneficial response. Decrements in leg\nmuscle strength are consistently reported after 30 days of\nBR without exercise countermeasures (Convertino 1996;\nAdams et al. 2003). After about 30 days of BR, decreases in\nknee and ankle extensor strength are greater than decreases\nin flexor strength (Convertino 1996). The strength losses in\nour CON subjects are consistent with this previous litera-\nture at our slower testing velocities. However, at the\n2.09 rad sec\u00011 testing velocity, extensor and flexor losses\nwere similar. LBNPEX attenuated the decreases in extensor\nstrength and endurance during BR. Interestingly, however,\nLBNPEX was less effective in attenuating the losses in flexor\nstrength or endurance. This may be due to the lesser degree\nof deconditioning of the flexor muscles, or to the fact that\nwalking and running movements produce approximately\ntwice the mean muscle force (as a percentage of maximal\nforce) in leg extensor muscles as compared to leg flexor\nmuscles (Besier et al. 2009). In microgravity where extensor\nmovements are reduced or eliminated and extensor muscles\nare more severely impaired (Baldwin et al. 1996), exercise\ncountermeasures that specifically target the extensor mus-\ncles may be required.\nSex differences in muscle responses during\nBR\nOur results are interesting and potentially controversial,\nin that we found a greater loss of LLM and muscle\nstrength and endurance during BR in men than in\nwomen. We suggest that men in general may have a\ngreater loss of lean tissue mass because of their pre-BR\nlarger proportion of lean tissue mass and the selective loss\nof lean tissue versus fat tissue during BR. We previously\nhave reported that the loss of LLM and strength in\nwomen who do not exercise during BR is proportional to\ntheir pre-BR condition (Lee et al. 2014).\nIt is generally thought that women have slower changes\nin muscle mass in response to training or detraining (Ivey\net al. 2000; Mittendorfer and Rennie 2006). A slower\ntraining response is often attributed to lower levels of\ntestosterone in women, resulting in a blunted response of\nmuscle protein synthesis in response to overload stimula-\ntion (Mittendorfer and Rennie 2006). On the other hand,\nestrogens exert a protective effect to retain muscle mass\nin postmenopausal women (Dieli-Conwright et al. 2009;\nMessier et al. 2011) and to enhance the recovery of mus-\ncle mass in mice after hindlimb suspension (McClung\net al. 2006). Another possible reason for differences in the\nloss of muscle mass with detraining may be sex differ-\nences in the type and size of individual muscle fibers.\nLindboe and coworkers (Lindboe and Platou 1982)\nobserved that men have a faster rate of thigh muscle atro-\nphy than women after knee surgery. They attributed this\nto the fact that men have larger and more numerous\nType II muscle fibers, which atrophy at a faster rate than\nType I myofibers. Women generally have smaller Type I\nand Type II myofibers (Simoneau and Bouchard 1989;\nMiller et al. 1993; Staron et al. 2000). Yamamoto and\ncoworkers (Yamamoto et al. 1997) also noted in 11 men\nand 7 women during 20 days of BR that the rate of loss\nof leg muscle mass was greater in the men.\nThe most striking sex difference we observed in muscle\nfunction is a lack of loss of leg extensor endurance during\nBR. Greater muscular endurance in women is frequently\nnoted (Russ and Kent-Braun 2003; Hunter et al. 2004,\n2006; Yoon et al. 2007), even when subjects are matched\nfor strength (Hunter et al. 2004). This endurance differ-\nence disappears under conditions of ischemia, suggesting\na role for differences in peripheral muscle metabolism or\nperfusion (Russ and Kent-Braun 2003). One theory pro-\nposes that women’s greater endurance is due to a greater\nproportion of Type I fibers (Simoneau and Bouchard\n1989), although this depends on the muscle group studied\n(Staron et al. 2000). Our study is the first to show that\nleg extensor endurance is not compromised in women\nduring a 30-days exposure to BR. However, we believe\nthis is not a true sex effect but rather it is due to the\nsmaller endurance of the women pre-BR. We determined\nusing a piece-wise linear model that subjects with a knee\nextensor endurance less than approximately 1892 N-m\nhad no significant loss of endurance during bed rest,\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 10\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nTreadmill Exercise Within LBNP For Muscle Strength S. M. Schneider et al.\nwhile those with greater endurance had a decline related\nto their pre-BR value. None of the female subjects in this\nstudy had an endurance value higher than this value.\nOnly two of the CON males had endurance values below\nthis threshold, perhaps resulting in the greater endurance\nloss of the male CON group.\nImplications for design of future studies\nHargens and Vico recently commented on the majority of\nstudy designs (e.g., different subjects in each group, cross-\nover design) that are used in space flight analog studies to\nexamine the effectiveness of countermeasures to decondi-\ntioning (Hargens and Vico 2016). The authors suggest that\nstatistical power is reduced when studying unmatched\ngroups with differences in pre-BR condition and individual\nvariability in the responses to BR. When a cross-over design\nis used, an incomplete recovery from a previous BR expo-\nsure or repeated exposures to unloading may influence the\nresults. In our analyses, we document that using matched\ntwin pairs is a more efficient way of testing for differences\nin the majority of muscle outcome measures studied here.\nFrom this small group of subjects, it is unclear why the\nsplit-plot design using identical twin subjects was not more\nefficient for all measures, but the result likely reflects differ-\nences within twin pairs due to environmental and behav-\nioral factors as they age; that is, an identical genotype does\nnot imply an identical phenotype. However, planners of\nfuture BR studies might consider the split-plot design,\nalthough it is more difficult to find strongly matched sub-\njects (such as twin pairs) willing to undergo BR. Using\nidentical twins exposed to the same BR and testing condi-\ntions, preferably with twins participating in BR concur-\nrently, should decrease between subject variability for most\noutcome measures (Hargens and Vico 2016).\nConclusions\nBased on our results, we suggest that treadmill exercise\noptimized using LBNPEX is as an important complemen-\ntary exercise countermeasure to maintain LLM, strength,\nand endurance during spaceflight in both men and\nwomen. Although resistive exercises are more specific and\neffective for this purpose, some future space flight mis-\nsions may not permit the currently available high-inten-\nsity resistive exercise platform or there may be individual\ncrewmembers who cannot or should not perform an\nintense resistive exercise routine. In such scenarios,\nLBNPEX may maximize the effectiveness of in-flight or\nplanetary partial-gravity treadmill exercise by increasing\nfootward loading to the 1-g levels or greater and perhaps\nby simulating hemodynamics of 1-g exercise. Other bene-\nficial features of the LBNPEX countermeasure include its\nproven effects to protect aerobic capacity (Watenpaugh\net al. 2000; Lee et al. 2007, 2009), sprint capacity\n(Lee et al. 2007, 2009), and bone (Smith et al. 2003;\nZwart et al. 2007) and to provide natural gait patterns\nsimilar to that of ambulation in 1-g. Exercise countermea-\nsures to maintain lean body mass and preserve muscle\nendurance may be especially important for astronauts\nwith higher levels of muscle fitness, given that their level\nof muscle deconditioning is proportional to their pre-BR\n(and pre-space flight) condition. LBNPEX also may have\nground-based applications to prevent muscle changes with\ndisuse, disease, and aging.\nAcknowledgments\nThe authors gratefully acknowledge the enthusiastic par-\nticipation of our 30 outstanding twins, excellent technical\nsupport of the University of California San Diego\n(UCSD), and the excellent staff working at UCSD General\nClinical Research Center (GCRC). We thank Drs. Christo-\npher Rogers and R. Scott Meyer for maintaining the\nhealth and well-being of our volunteers. We also thank\nAmy Langemack, Dr. Debbie O’Leary, Dr. Scott Smith,\nDr. Kunihiko Tanaka, Jill Monroe, Eli Groppo, Maneesh\nBawa, Monique Keehan, Eva Brzezinski, Erin O’Brien, Dr.\nAlan Moore, and Mark Guilliams for their respective con-\ntributions to the success of this project. We also appreci-\nate the helpful edits and clinical insights to this\nmanuscript by Dr. Burke Gurney, of the Physical Therapy\nDepartment at the University of New Mexico.\nReferences\nAdams, G. R., V. J. Caiozzo, and K. M. Baldwin. 2003. Skeletal\nmuscle unweighting: spaceflight and ground-based models.\nJ. Appl. Physiol. (1985) 95:2185–2201.\nBaldwin, K. M., T. P. White, S. B. Arnaud, V. R. Edgerton, W.\nJ. Kraemer, R. Kram, et al. 1996. Musculoskeletal\nadaptations to weightlessness and development of effective\ncountermeasures. Med. Sci. Sports Exerc. 28:1247–1253.\nBenjamini, Y., A. M. Krieger, and D. Yekutieli. 2006. Adaptive\nlinear step-up procedures that control the false discovery\nrate. Biometrika 93:491–507.\nBesier, T. F., M. Fredericson, G. E. Gold, G. S. Beaupr\u0001e, and S.\nL. Delp. 2009. Knee muscle forces during walking and\nrunning in patellofemoral pain patients and pain-free\ncontrols. J. Biomech. 42:898–905.\nBlanc, S., S. Normand, C. Pachiaudi, J. O. Fortrat, M. Laville,\nand C. Gharib. 2000. Fuel homeostasis during physical\ninactivity induced by bed rest. J. Clin. Endocrinol. Metab.\n85:2223–2233.\nBloomfield, S. A. 2006. Does altered blood flow to bone in\nmicrogravity impact on mechanotransduction? J.\nMusculoskelet. Neuronal Interact. 6:324–326.\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 11\nS. M. Schneider et al. Treadmill Exercise Within LBNP For Muscle Strength\nBoda, W. L., D. E. Watenpaugh, R. E. Ballard, and A. R.\nHargens. 2000. Supine lower body negative pressure exercise\nsimulates metabolic and kinetic features of upright exercise.\nJ. Appl. Physiol. (1985) 89:649–654.\nCao, P., S. Kimura, B. R. Macias, T. Ueno, D. E. Watenpaugh,\nand A. R. Hargens. 2005. Exercise within lower body\nnegative pressure partially counteracts lumbar spine\ndeconditioning associated with 28-day bed rest. J. Appl.\nPhysiol. (1985) 99:39–44.\nCavanagh, P. R., A. A. Licata, and A. J. Rice. 2005. Exercise\nand pharmacological countermeasures for bone loss during\nlong-duration space flight. Gravit. Space Biol. Bull. 18:39–\n58.\nCavanagh, P. R., K. O. Genc, R. Gopalakrishnan, M. M.\nKuklis, C. C. Maender, and A. J. Rice. 2010. Foot forces\nduring typical days on the international space station. J.\nBiomech. 43:2182–2188.\nColleran, P. N., M. K. Wilkerson, S. A. Bloomfield, L. J. Suva,\nR. T. Turner, and M. D. Delp. 2000. Alterations in skeletal\nperfusion with simulated microgravity: a possible\nmechanism for bone remodeling. J. Appl. Physiol. (1985)\n89:1046–1054.\nConvertino, V. A. 1996. Exercise and adaptation to\nmicrogravity environments. Pp. 815–843 in M. J. Fregly and\nC. M. Blatteis, eds. Handbook of physiology. Oxford\nUniversity Press, New York.\nDavis, B. L., P. R. Cavanagh, H. J. Sommer, and G. Wu. 1996.\nGround reaction forces during locomotion in simulated\nmicrogravity. Aviat. Space Environ. Med. 67:235–242.\nDieli-Conwright, C. M., T. M. Spektor, J. C. Rice, F. R. Sattler,\nand E. T. Schroeder. 2009. Influence of hormone\nreplacement therapy on eccentric exercise induced myogenic\ngene expression in postmenopausal women. J. Appl. Physiol.\n(1985) 107:1381–1388.\nEnglish, K. L., S. M. C. Lee, J. A. Loehr, R. J. Ploutz-Snyder,\nand L. L. Ploutz-Snyder. 2015. Isokinetic strength changes\nfollowing long-duration spaceflight on the ISS. Aerosp. Med.\nHum. Perform. 86:68–77.\nGenc, K. O., V. E. Mandes, and P. R. Cavanagh. 2006. Gravity\nreplacement during running in simulated microgravity.\nAviat. Space Environ. Med. 77:1117–1124.\nGreene, W. H. 2000. Instrumental variable estimation and\nmeasurement error. Pp. 370–387 in Econometric analysis.\nPrentice Hall, Upper Saddle River, NJ.\nGuinet, P., S. M. Schneider, B. R. Macias, D. E. Watenpaugh,\nR. L. Hughson, A. P. Le Traon, et al. 2009. WISE-2005:\neffect of aerobic and resistive exercises on orthostatic\ntolerance during 60 days bed rest in women. Eur. J. Appl.\nPhysiol. 106:217–227.\nHarber, M. P., A. R. Konopka, M. D. Douglass, K. Minchev, L.\nA. Kaminsky, T. A. Trappe, et al. 2009. Aerobic exercise\ntraining improves whole muscle and single myofiber size\nand function in older women. Am. J. Physiol. Regul. Integr.\nComp. Physiol. 297:R1452–R1459.\nHarber, M. P., A. R. Konopka, M. K. Undem, J. M. Hinkley,\nK. Minchev, L. A. Kaminsky, et al. 2012. Aerobic exercise\ntraining induces skeletal muscle hypertrophy and age-\ndependent adaptations in myofiber function in young and\nolder men. J. Appl. Physiol. (1985) 113:1495–1504.\nHargens, A. R., and L. Vico. 2016. Long-duration bed\nrest as an analog to microgravity. J. Appl. Physiol.\n120:891–903.\nHargens, A. R., R. T. Whalen, D. E. Watenpaugh, D. F.\nSchwandt, and L. P. Krock. 1991. Lower body negative\npressure to provide load bearing in space. Aviat. Space\nEnviron. Med. 62:934–937.\nHarm, D. L., R. T. Jennings, J. V. Meck, M. R. Powell, L.\nPutcha, C. P. Sams, et al. 2001. Invited review: gender issues\nrelated to spaceflight: a NASA perspective. J. Appl. Physiol.\n(1985) 91:2374–2383.\nHayes, J. C., W. E. Thornton, M. E. Guilliams, S. M. C. Lee,\nK. MacNeill, and A. D. Moore Jr. 2013. Exercise: developing\ncountermeasure systems for optimizing astronaut\nperformance in space. Pp. 289–313 in W. H. Paloski, D.\nRisin and P. Stepaniak, eds. Biomedical results of the space\nshuttle program. US Government Printing Office,\nWashington, DC.\nHochberg, Y. 1988. A sharper Bonferroni procedure for\nmultiple tests of significance. Biometrika 75:800–802.\nHunter, S. K., A. Critchlow, I.-S. Shin, and R. M. Enoka. 2004.\nMen are more fatigable than strength-matched women when\nperforming intermittent submaximal contractions. J. Appl.\nPhysiol. (1985) 96:2125–2132.\nHunter, S. K., J. E. Butler, G. Todd, S. C. Gandevia, and J. L.\nTaylor. 2006. Supraspinal fatigue does not explain the sex\ndifference in muscle fatigue of maximal contractions. J.\nAppl. Physiol. (1985) 101:1036–1044.\nIvey, F. M., S. M. Roth, R. E. Ferrell, B. L. Tracy, J. T.\nLemmer, D. E. Hurlbut, et al. 2000. Effects of age, gender,\nand myostatin genotype on the hypertrophic response to\nheavy resistance strength training. J. Gerontol. A Biol. Sci.\nMed. Sci. 55:M641–M648.\nKonopka, A. R., M. D. Douglass, L. A. Kaminsky, B.\nJemiolo, T. A. Trappe, S. Trappe, et al. 2010. Molecular\nadaptations to aerobic exercise training in skeletal muscle\nof older women. J. Gerontol. A Biol. Sci. Med. Sci.\n65:1201–1207.\nKorth, D. W. 2015. Exercise countermeasure hardware\nevolution on ISS: the first decade. Aerosp. Med. Hum.\nPerform. 86:A7–A13.\nKoryak, Y. 1999. The effects of long-term simulated\nmicrogravity on neuromuscular performance in men and\nwomen. Eur. J. Appl. Physiol. 79:168–175.\nLee, S. M., B. S. Bennett, A. R. Hargens, D. E. Watenpaugh, R.\nE. Ballard, G. Murthy, et al. 1997. Upright exercise or\nsupine lower body negative pressure exercise maintains\nexercise responses after bed rest. Med. Sci. Sports Exerc.\n29:892–900.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 12\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nTreadmill Exercise Within LBNP For Muscle Strength S. M. Schneider et al.\nLee, S. M. C., S. M. Schneider, W. L. Boda, D. E.\nWatenpaugh, B. R. Macias, R. S. Meyer, et al. 2007. Supine\nLBNP exercise maintains exercise capacity in male twins\nduring 30-day bed rest. Med. Sci. Sports Exerc. 39:1315–\n1326.\nLee, S. M. C., S. M. Schneider, W. L. Boda, D. E.\nWatenpaugh, B. R. Macias, R. S. Meyer, et al. 2009. LBNP\nexercise protects aerobic capacity and sprint speed of female\ntwins during 30 days of bed rest. J. Appl. Physiol. (1985)\n106:919–928.\nLee, S. M. C., S. M. Schneider, A. H. Feiveson, B. R. Macias,\nS. M. Smith, D. E. Watenpaugh, et al. 2014. WISE-2005:\ncountermeasures to prevent muscle deconditioning during\nbed rest in women. J. Appl. Physiol. (1985) 116:654–667.\nLindboe, C. F., and C. S. Platou. 1982. Disuse atrophy of\nhuman skeletal muscle. An enzyme histochemical study.\nActa Neuropathol. (Berl) 56:241–244.\nLoehr, J. A., M. E. Guilliams, N. Petersen, N. Hirsch, S.\nKawashima, and H. Ohshima. 2015. Physical training for\nlong-duration spaceflight. Aerosp. Med. Hum. Perform. 86:\nA14–A23.\nMacias, B. R., P. Cao, D. E. Watenpaugh, and A. R. Hargens.\n2007. LBNP treadmill exercise maintains spine function and\nmuscle strength in identical twins during 28-day simulated\nmicrogravity. J. Appl. Physiol. (1985) 102:2274–2278.\nMcClung, J. M., J. M. Davis, M. A. Wilson, E. C. Goldsmith,\nand J. A. Carson. 2006. Estrogen status and skeletal muscle\nrecovery from disuse atrophy. J. Appl. Physiol. (1985)\n100:2012–2023.\nMcCrory, J. L., D. R. Lemmon, H. J. Sommer, B. Prout, D.\nSmith, D. W. Korth, et al. 1999. Evaluation of a Treadmill\nwith Vibration Isolation and Stabilization (TVIS) for use on\nthe International Space Station. J. Appl. Biomech. 15:292–\n302.\nMcCrory, J. L., H. A. Baron, S. Balkin, and P. R. Cavanagh.\n2002. Locomotion in simulated microgravity: gravity\nreplacement loads. Aviat. Space Environ. Med. 73:625–631.\nMessier, V., R. Rabasa-Lhoret, S. Barbat-Artigas, B. Elisha, A.\nD. Karelis, and M. Aubertin-Leheudre. 2011. Menopause\nand sarcopenia: a potential role for sex hormones. Maturitas\n68:331–336.\nMiles, M. P., D. P. Heil, K. R. Larson, S. B. Conant, and S. M.\nSchneider. 2005. Prior resistance training and sex influence\nmuscle responses to arm suspension. Med. Sci. Sports Exerc.\n37:1983–1989.\nMiller, A. E., J. D. MacDougall, M. A. Tarnopolsky, and D. G.\nSale. 1993. Gender differences in strength and muscle fiber\ncharacteristics. Eur. J. Appl. Physiol. 66:254–262.\nMittendorfer, B., and M. J. Rennie. 2006. Swings and\nroundabouts for muscle gain and loss: differences between\nsexes? J. Appl. Physiol. (1985) 100:375–376.\nMonga, M., B. Macias, E. Groppo, M. Kostelec, and A.\nHargens. 2006. Renal stone risk in a simulated microgravity\nenvironment: impact of treadmill exercise with lower body\nnegative pressure. J. Urol. 176:127–131.\nNicogossian, A. E., C. F. Sawin, and A. I. Grigoriev. 1994.\nCountermeasures to space deconditioning. Pp. 447–467 in\nA. E. Nicogossian, C. L. Huntoon and S. L. Pool, eds. Space\nphysiology and medicine. Lea & Febiger, Philadelphia, PA.\nPloutz-Snyder, L., S. Bloomfield, S. M. Smith, S. K. Hunter, K.\nTempleton, and D. Bemben. 2014. Effects of sex and gender\non adaptation to space: musculoskeletal health. J. Womens\nHealth 23:963–966.\nRuss, D. W., and J. A. Kent-Braun. 2003. Sex differences in\nhuman skeletal muscle fatigue are eliminated under ischemic\nconditions. J. Appl. Physiol. (1985) 94:2414–2422.\nRyder, J. W., R. E. Buxton, E. Goetchius, M. Scott-Pandorf, K.\nJ. Hackney, J. Fiedler, et al. 2013. Influence of muscle\nstrength to weight ratio on functional task performance.\nEur. J. Appl. Physiol. 113:911–921.\nSato, K., K. Katayama, N. Hotta, K. Ishida, and H. Akima.\n2010. Aerobic exercise capacity and muscle volume after\nlower limb suspension with exercise countermeasure. Aviat.\nSpace Environ. Med. 81:1085–1091.\nSchneider, S. M., and V. A. Convertino. 2011. Physiological\nsystems and their responses to condition of microgravity\nand bed rest. Pp. 640–666 in P. A. Farrell, M. J. Joyner and\nV. J. Caiozzo, eds. ACSM’s advanced exercise physiology.\nLippincott Williams & Wilkins, Philadelphia, PA.\nSchneider, S. M., S. M. C. Lee, B. R. Macias, D. E.\nWatenpaugh, and A. R. Hargens. 2009. WISE-2005: exercise\nand nutrition countermeasures for upright VO2pk during\nbed rest. Med. Sci. Sports Exerc. 41:2165–2176.\nSchwartz, R. S., W. P. Shuman, V. Larson, K. C. Cain, G. W.\nFellingham, J. C. Beard, et al. 1991. The effect of intensive\nendurance exercise training on body fat distribution in\nyoung and older men. Metabolism 40:545–551.\nSimoneau, J. A., and C. Bouchard. 1989. Human variation in\nskeletal muscle fiber-type proportion and enzyme activities.\nAm. J. Physiol. 257:E567–E572.\nSmith, G. I., and B. Mittendorfer. 2012. Similar muscle protein\nsynthesis rates in young men and women: men aren’t from\nMars and women aren’t from Venus. J. Appl. Physiol.\n(1985) 112:1803–1804.\nSmith, S. M., J. E. Davis-Street, J. V. Fesperman, D. S. Calkins,\nM. Bawa, B. R. Macias, et al. 2003. Evaluation of treadmill\nexercise in a lower body negative pressure chamber as a\ncountermeasure for weightlessness-induced bone loss: a bed\nrest study with identical twins. J. Bone Miner. Res. 18:2223–\n2230.\nStaron, R. S., F. C. Hagerman, R. S. Hikida, T. F. Murray, D.\nP. Hostler, M. T. Crill, et al. 2000. Fiber type composition\nof the vastus lateralis muscle of young men and women. J.\nHistochem. Cytochem. 48:623–629.\nStein, T. P. 2001. Nutrition in the space station era. Nutr. Res.\nRev. 14:87–118.\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 13\nS. M. Schneider et al. Treadmill Exercise Within LBNP For Muscle Strength\nSuzuki, Y., T. Murakami, Y. Haruna, K. Kawakubo, S. Goto,\nY. Makita, et al. 1994. Effects of 10 and 20 days bed rest on\nleg muscle mass and strength in young subjects. Acta\nPhysiol. Scand. Suppl. 616:5–18.\nTrappe, T. A., N. A. Burd, E. S. Louis, G. A. Lee, and S. W.\nTrappe. 2007. Influence of concurrent exercise or nutrition\ncountermeasures on thigh and calf muscle size and function\nduring 60 days of bed rest in women. Acta Physiol. (Oxf)\n191:147–159.\nTrappe, S., D. Costill, P. Gallagher, A. Creer, J. R. Peters, H.\nEvans, et al. 2009. Exercise in space: human skeletal muscle\nafter 6 months aboard the International Space Station. J.\nAppl. Physiol. (1985) 106:1159–1168.\nWatenpaugh, D. E., R. E. Ballard, S. M. Schneider, S. M. Lee,\nA. C. Ertl, J. M. William, et al. 2000. Supine lower body\nnegative pressure exercise during bed rest maintains upright\nexercise capacity. J. Appl. Physiol. (1985) 89:218–227.\nWatenpaugh, D. E., D. D. O’Leary, S. M. Schneider, S. M. C.\nLee, B. R. Macias, K. Tanaka, et al. 2007. Lower body\nnegative pressure exercise plus brief postexercise lower body\nnegative pressure improve post-bed rest orthostatic\ntolerance. J. Appl. Physiol. (1985) 103:1964–1972.\nYamamoto, T., N. Sekiya, S. Miyashita, H. Asada, Y. Yano, K.\nMorishima, et al. 1997. Gender differences in effects of\n20 days horizontal bed rest on muscle strength in young\nsubjects. J. Gravit. Physiol. 4:S31–S36.\nYoon, T., B. Schlinder Delap. E. E. Griffith, and S. K. Hunter.\n2007. Mechanisms of fatigue differ after low- and high-force\nfatiguing contractions in men and women. Muscle Nerve\n36:515–524.\nZwart, S. R., A. R. Hargens, S. M. C. Lee, B. R. Macias, D. E.\nWatenpaugh, K. Tse, et al. 2007. Lower body negative\npressure treadmill exercise as a countermeasure for bed rest-\ninduced bone loss in female identical twins. Bone 40:529–537.\n2016 | Vol. 4 | Iss. 15 | e12892\nPage 14\nª 2016 The Authors. Physiological Reports published by Wiley Periodicals, Inc. on behalf of\nthe American Physiological Society and The Physiological Society.\nTreadmill Exercise Within LBNP For Muscle Strength S. M. Schneider et al.\n",
    "Link": "https://core.ac.uk/download/323064285.pdf"
}