{
    "Title": "Mass-deformed ABJM Theory and LLM Geometries: Exact Holography",
    "Authors": "Jang, Dongmin, Kim, Yoonbai, Kwon, O-Kab, Tolla, D. D.",
    "Year": "No year available",
    "Abstract": "We present a detailed account and extension of our claim in arXiv:1610.01490.\nWe test the gauge/gravity duality between the ${\\cal N} = 6$ mass-deformed ABJM\ntheory with U$_k(N)\\times$U$_{-k}(N)$ gauge symmetry and the 11-dimensional\nsupergravity on LLM geometries with SO(4)/${\\mathbb Z}_k$\n$\\times$SO(4)/${\\mathbb Z}_k$ isometry, in the large $N$ limit. Our analysis is\nbased on the evaluation of vacuum expectation values of chiral primary\noperators from the supersymmetric vacua of mass-deformed ABJM theory and from\nthe implementation of Kaluza-Klein holography to the LLM geometries. We focus\non the chiral primary operator with conformal dimension $\\Delta = 1$. We show\nthat $\\langle {\\cal O}^{(\\Delta=1)}\\rangle= N^{\\frac32} \\, f_{(\\Delta=1)}$ for\nall supersymmetric vacuum solutions and LLM geometries with $k=1$, where the\nfactor $f_{(\\Delta)}$ is independent of $N$. We also confirm that the vacuum\nexpectation value of the the energy momentum tensor is vanishing as expected by\nthe supersymmetry. We extend our results to the case of $k\\ne 1$ for LLM\ngeometries represented by rectangular-shaped Young-diagrams. In analogy with\nthe Coulomb branch of the ${\\cal N} = 4$ super Yang-Mills theory, we argue that\nthe discrete Higgs vacua of the mABJM theory as well as the corresponding LLM\ngeometries are parametrized by the vevs of the chiral primary operators.Comment: 44 pages, 1 figure, major corrections in section 3 and 5, references\n  added, title change",
    "Keywords": "No keywords available",
    "Publisher": "'Springer Science and Business Media LLC'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "ar\nX\niv\n:1\n61\n2.\n05\n06\n6v\n2 \n [h\nep\n-th\n]  \n16\n M\nar \n20\n17\nMass-deformed ABJM Theory and LLM Geometries:\nExact Holography\nDongmin Jang1, Yoonbai Kim1, O-Kab Kwon1, D. D. Tolla1,2\n1Department of Physics, BK21 Physics Research Division, Institute of Basic Science,\nSungkyunkwan University, Suwon 440-746, South Korea\n2University College,\nSungkyunkwan University, Suwon 440-746, South Korea\ndongmin@skku.edu, yoonbai@skku.edu, okab@skku.edu, ddtolla@skku.edu\nAbstract\nWe present a detailed account and extension of our claim in arXiv:1610.01490.\nWe test the gauge/gravity duality between the N = 6 mass-deformed ABJM theory\nwith Uk(N)×U−k(N) gauge symmetry and the 11-dimensional supergravity on LLM\ngeometries with SO(4)/Zk ×SO(4)/Zk isometry, in the large N limit. Our analysis is\nbased on the evaluation of vacuum expectation values of chiral primary operators from\nthe supersymmetric vacua of mass-deformed ABJM theory and from the implementa-\ntion of Kaluza-Klein holography to the LLM geometries. We focus on the chiral pri-\nmary operator with conformal dimension ∆ = 1. We show that 〈O(∆=1)〉 = N 32 f(∆=1)\nfor all supersymmetric vacuum solutions and LLM geometries with k = 1, where the\nfactor f(∆) is independent of N . We also confirm that the vacuum expectation value of\nthe the energy momentum tensor is vanishing as expected by the supersymmetry. We\nextend our results to the case of k 6= 1 for LLM geometries represented by rectangular-\nshaped Young-diagrams. In analogy with the Coulomb branch of the N = 4 super\nYang-Mills theory, we argue that the discrete Higgs vacua of the mABJM theory as\nwell as the corresponding LLM geometries are parametrized by the vevs of the chiral\nprimary operators.\n1\nContents\n1 Introduction 3\n2 Vacua of the mABJM Theory and the LLM Geometries 5\n2.1 Supersymmetric vacua of the mABJM theory . . . . . . . . . . . . . . . . . 6\n2.2 LLM geometries and their droplet picture . . . . . . . . . . . . . . . . . . . 7\n3 Vevs of CPOs in mABJM Theory 9\n3.1 CPOs in ABJM theory . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n3.2 vevs of CPO in mABJM Theory . . . . . . . . . . . . . . . . . . . . . . . . . 11\n4 KK Reduction and Gauge Invariant Modes 12\n4.1 11-dimensional gravity equations of motion . . . . . . . . . . . . . . . . . . . 12\n4.2 Fluctuations on AdS4 × S7 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n4.3 Expansion in S7 spherical harmonics . . . . . . . . . . . . . . . . . . . . . . 15\n4.4 Gauge invariant fluctuations . . . . . . . . . . . . . . . . . . . . . . . . . . . 17\n4.5 KK reduction . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18\n4.5.1 The equations for spin zero fields . . . . . . . . . . . . . . . . . . . . 19\n4.5.2 The equations for spin one fields . . . . . . . . . . . . . . . . . . . . . 20\n4.5.3 The equations for spin two fields . . . . . . . . . . . . . . . . . . . . 21\n5 Exact KK Holography for LLM Geometries 22\n5.1 Asymptotic expansion of the LLM geometries . . . . . . . . . . . . . . . . . 22\n5.2 Asymptotic expansions for the physical modes in 4 dimensions . . . . . . . . 27\n5.3 Comparison with field theory results . . . . . . . . . . . . . . . . . . . . . . 28\n6 Conclusion 30\nA Spherical Harmonics on S7 32\nA.1 Scalar Spherical Harmonics . . . . . . . . . . . . . . . . . . . . . . . . . . . 32\nA.2 Vector Spherical Harmonics . . . . . . . . . . . . . . . . . . . . . . . . . . . 33\nA.3 Scalar spherical harmonics on S7 with SO(4)× SO(4) symmetry . . . . . . . 34\nA.4 CI1=2 and C(∆=1) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 35\nB Asymptotic Expansions 36\nC Proof of (5.132) 39\n2\n1 Introduction\nGauge/gravity duality conjecture states an equivalence between a theory of quantum gravity\nin (d + 1)-dimensional spacetime and a quantum field theory (QFT) on the d-dimensional\nboundary of the spacetime [1–3]. In its original context [1], the duality was conjectured for\nstring/M theory on AdSd+1 × X , with a compact internal manifold X , and conformal field\ntheory (CFT) living on d-dimensional boundary of the AdS space. Having the application\nto realistic theories like QCD in mind, the extension of the conjecture to non-conformal field\ntheories was pursued soon after [4]. In particular, the conjecture was extended to QFTs that\nare obtained from the CFTs either by adding relevant operators to the action or considering\nvacua where the conformal symmetries are broken spontaneously. A d-dimensional QFT,\nwhich is obtained as a result of either of those deformations, is dual to a string/M theory on\na spacetime geometry which is asymptotically AdSd+1 × X . However, there is no complete\nformulation of string/M theory on a curved background. Hence, the duality is mainly tested\nin the limit of a weakly curved classical gravity, which corresponds to taking the limits of\nlarge N as well as large ’t Hooft coupling constant λ, N being the rank of the gauge group.\nOne of the tests of gauge/gravity duality involves the calculation of the vacuum expec-\ntation values (vevs) of gauge invariant operators in the large N and λ limits. On the field\ntheory side, the calculation follows the usual perturbation expansion where the divergences\nin the bare quantities are subtracted using the standard renormalization procedure. When\nthose gauge invariant operators are chiral primary operators (CPOs) in highly supersymmet-\nric gauge theories, the vevs are protected from quantum corrections by the supersymmetry\nand they are determined in the classical limit. The corresponding procedure on the gravity\nside goes as follows. Given a supergravity solution which is asymptotically AdSd+1 × X , it\nis expanded in terms of harmonic functions on the compact manifold. The compactification\nresults in towers of Kaluza-Klein (KK) modes in (d + 1)-dimensional gravity theory. The\ngauge/gravity correspondence dictates that for every gauge invariant operator on the field\ntheory side there is a corresponding gravity field among these KK modes. The vev of the\ngauge invariant operator is then determined by applying the holographic renormalization\nprocedure [5] to those KK modes in the (d+1)-dimensional gravity theory [6–8]. For a CPO\nof conformal dimension ∆, the vev which is obtained using this procedure is proportional to\nthe coefficient of z∆ in the asymptotic expansion of the dual scalar field, z being the holo-\ngraphic coordinate of the AdS space. This procedure was implemented to determine the\nvevs of CPOs in the Coulomb branch of the N = 4 super Yang-Mills (SYM) theory and the\ndual type IIB string theory on a spacetime geometry which is asymptotically AdS5×S5 [6,7].\nIn [9], we reported a summary of our work which shows an exact gauge/gravity du-\nality relation for large N . Our analysis is based on the 3-dimensional mass-deformed\n3\nAharony-Bergman-Jafferis-Maldacena theory (mABJM) of massive M2-branes, which has\nN = 6 supersymmetry and Uk(N)×U−k(N) gauge symmetry, where k is the Chern-Simons\nlevel [10, 11]. The mass-deformed theory is obtained from the original ABJM theory [12]\nby adding a relevant deformation which preserves the full supersymmetry as well as the\ngauge symmetry while the conformal symmetry is completely broken and the SU(4) global\nsymmetry is reduced to SU(2)×SU(2)×U(1). The mABJM theory supports sets of discrete\nHiggs vacua, which are expressed in terms of the GRVV matrices with numerical valued\nmatrix elements [11]. The calculation of the vevs of CPOs in the large N limit is possible\ndue to the existence of these discrete vacua.\nSince the mABJM theory is obtained from the deformation of a CFT by relevant opera-\ntors, the spacetime geometry of the dual gravity theory should be asymptotically AdS4×X .\nIt was predicted that for the gauge theory describing massive M2-branes, the dual gravity\ntheory is M-theory on the 11-dimensional Lin-Lunin-Maldacena (LLM) geometry [13, 14].\nIndeed, the LLM geometry with Zk orbifold and SO(2,1)×SO(4)/Zk×SO(4)/Zk isometry\nis asymptotically AdS4 × S7/Zk. In line with this prediction a one-to-one correspondence\nbetween the vacua of the mABJM theory and the LLM geometry was obtained [15,16]. See\nalso [17–19] for related works.\nIn this paper, we quantitatively test the above gauge/gravity duality in terms of the\nvevs of CPOs. On the field theory side, some of the classical vacuum solutions are protected\nfrom quantum corrections due to the high number of supersymmetry. The vevs of CPOs\nare determined by those supersymmetric vacua. We calculate the vevs of the CPO with\nconformal dimension ∆ = 1 for all possible supersymmetric vacua of the mABJM theory\nfor large N and general k. On the gravity theory side, we start with equations of motion on\nAdS4×S7 background in 11-dimensional supergravity. In order to obtain the 4-dimensional\nequations of motion, we implement the KK reduction procedure on S7. The LLM solutions\nwere obtained in some unknown gauge. In order to solve the 4-dimensional equations using\nthe LLM solutions, we need to write the equations with gauge invariant combinations for KK\nmodes1. In general, the KK reduction leads to cubic or higher order interaction terms among\nthe KK modes, which results in non-linear equations of motion. When we are interested\nonly in the CPO with conformal dimension ∆ = 1, the linearized equations are sufficient.\nHowever, for CPOs with ∆ ≥ 2, one has to consider non-linear equations [21], where some\nnon-trivial field redefinitions are required to relate 4-dimensional and 11-dimensional fields.\nSee [6, 22–24] for non-linear results on the AdS5 × S5 background. Here we focus on the\n∆ = 1 case. According to the gauge/gravity dictionary [2, 3], we read the vevs from the\n1For the linearized equations of motion on AdS4 × S7 background in de Donder gauge, see [20]. It is\nimportant to note that, recovering the equations of motion of gauge invariant fields from those of the fields\nin the de Donder gauge is not straightforward.\n4\nasymptotic expansions of the KK scalar modes. As a result, we obtain an exact holographic\nrelation which is given by\n〈O(∆=1)〉 = N 32 f(∆=1), (1.1)\nwhere we consider the k = 1 case, f(∆) is a function of the conformal dimensions and also\ndepends on some parameters of the LLM solutions, but does not depend on N . For a given\nN the number of supersymmetric vacua is equal to the partition of N and the above result\nis valid for all supersymmetric vacua [15,16]. We also extend this result to k > 1, however,\nfor some specific types of the LLM solutions.\nThe paper is organized as follows. In section 2, we summarize the one-to-one corre-\nspondence between the discrete supersymmetric vacua of the mABJM theory and the LLM\nsolutions with Zk orbifold. In section 3, we discuss CPOs in the ABJM theory and obtain\nthe vevs of the operators in the case ∆ = 1. In section 4, we apply the KK reduction\nto 11-dimensional supergravity equations of motion and obtain linearized equations for 4-\ndimensional gauge invariant KK modes. In section 5, we use the method of holographic\nrenormalization to read the vevs of CPO with ∆ = 1 from the asymptotic expansion of\nthe LLM solutions and compare the field theory and the gravity results. In section 6, we\ndraw some conclusions and discuss some future directions as well. We also include three\nappendixes where we discuss some general features of spherical harmonics on S7, give some\ndetails about asymptotic expansions of the LLM solutions as well as the proof of equation\n(5.132).\n2 Vacua of the mABJM Theory and the LLM Geome-\ntries\nThe N = 6 ABJM theory with U(N)k × U(N)−k gauge group is a superconformal CS\nmatter theory with CS level k and it describes the low energy dynamics of N coincident\nM2-branes on the C4/Zk orbifold fixed point [12]. One interesting feature of the ABJM\ntheory is that it allows supersymmetry preserving mass deformation [10, 11]. That is, the\nresulting mass-deformed theory called the mABJM theory has still N = 6 supersymmetry\nthough the conformal symmetry of the original theory is broken under the deformation.\nThis deformation is achieved by adding some terms to the Lagrangian of the ABJM theory,\nwhich break the global SU(4) symmetry to SU(2) × SU(2) × U(1). Solving the classical\nvacuum equation of the mABJM theory, it was shown that the classical vacuum solutions\nare discrete and represented by the GRVV matrices [11]. Some vacuum solutions for given\nN and k are protected from quantum corrections and have one-to-one correspondence with\n5\nthe LLM geometries with Zk [15,16] quotient in 11-dimensional supergravity. In this section,\nwe briefly review the correspondence.\n2.1 Supersymmetric vacua of the mABJM theory\nTo reflect the global symmetry of the mABJM theory we split the 4-complex scalar fields\nas follows\nY A = (Za,W †a), (2.2)\nwhere A = 1, 2, 3, 4 and a, b = 1, 2. Then the vacuum equation of the mABJM theory,\nLbos = −Vbos = 0, is written as\nZaZ†bZ\nb − ZbZ†bZa = −\nµk\n2π\nZa, W †aWbW †b −W †bWbW †a = µk\n2π\nW †a,\nWaZ\nbWb −WbZbWa = 0, ZbWbZa − ZaWbZb = 0, (2.3)\nwhere µ is a mass parameter. The general solutions of the matrix equations in (2.3) have\nbeen found in the form of the GRVV matrices [11]. For given N and k, there are many\npossible solutions satisfying the equations in (2.3). A systematic way to classify the vacuum\nsolutions is to represent those as direct sums of two types of irreducible n× (n+1) matrices,\nM(n)a (a = 1, 2) and their Hermitian conjugates, M¯(n)a . These rectangular matrices are the\nGRVV matrices\nM(n)1 =\n\n\n√\nn 0√\nn−1 0\n. . .\n. . .√\n2 0\n1 0\n\n\n, M(n)2 =\n\n\n0 1\n0\n√\n2\n. . .\n. . .\n0\n√\nn−1\n0\n√\nn\n\n\n,\n(2.4)\nwhere n = 0, 1, · · · , N − 1. The vacuum solutions are given by\nZa0 =\n√\nµk\n2π\n\n\nM(n1)a\n. . .\nM(ni)a\n0(ni+1+1)×ni+1\n. . .\n0(nf+1)×nf\n\n\n,\n6\nW †a0 =\n√\nµk\n2π\n\n\n0n1×(n1+1)\n. . .\n0ni×(ni+1)\nM¯(ni+1)a\n. . .\nM¯(nf )a\n\n\n. (2.5)\nThe solution contains Nn rectangular matrices of the typeM(n)a and N ′n rectangular matrices\nof the type M¯(n)a . From now on we refer to Nn and N ′n as occupation numbers [15,16]. Here\nN0 and N\n′\n0 denote the numbers of empty columns and rows, respectively. Since Z\na and W †a\nare N ×N matrices, the occupation numbers, Nn and N ′n, should satisfy the following two\nconstraints,\nN =\nN−1∑\nn=0\n[(\nn+\n1\n2\n)\n(Nn +N\n′\nn)\n]\n,\n∞∑\nn=0\nNn =\n∞∑\nn=0\nN ′n. (2.6)\nAt quantum level, only a subset of these classical solutions, which satisfy the conditions,\n0 ≤ Nn ≤ k, 0 ≤ N ′n ≤ k, (2.7)\nremains to be supersymmetric [15].\n2.2 LLM geometries and their droplet picture\nThe LLM solution with SO(2,1)×SO(4)×SO(4) isometry in 11-dimensional supergravity is\nconjectured to be dual to the theory of massive M2-branes [13, 14]. Later, the mABJM\ntheory with CS level k = 1 is proposed to be the theory of massive M2-branes. For the\nmABJM theory with general k, one has to consider the Zk orbifold of the LLM geometry\nas the dual gravity theory [16].\nThe LLM geometry with Zk orbifold is given by\nds2 = −Gtt(−dt2 + dw21 + dw22) +Gxx(dx˜2 + dy˜2) +Gθθds2S3/Zk +Gθ˜θ˜ds2S˜3/Zk , (2.8)\nwhere ds2S3/Zk and ds\n2\nS˜3/Zk\nare metrics of the two S3’s with Zk orbifold and the warp factors\nare given by\nGtt = −\n\n4µ20y˜\n√\n1\n4\n− Z2\nf 2\n\n\n2/3\n, Gxx =\n\nf\n√\n1\n4\n− Z2\n2µ0y2\n\n\n2/3\n,\nGθθ =\n\n f y˜\n√\n1\n2\n+ Z\n2µ0\n(\n1\n2\n− Z)\n\n\n2/3\n, Gθ˜θ˜ =\n\n f y˜\n√\n1\n2\n− Z\n2µ0\n(\n1\n2\n+ Z\n)\n\n\n2/3\n(2.9)\n7\nwith\nf(x˜, y˜) =\n√\n1− 4Z2 − 4y˜2V 2, µ0 = µ\n4\n. (2.10)\nAs we see in (2.9), the geometry is completely determined by two functions, which are given\nby\nZ(x˜, y˜) =\n2NB+1∑\ni=1\n(−1)i+1(x˜−x˜i)\n2\n√\n(x˜−x˜i)2 + y˜2\n, V (x˜, y˜) =\n2NB+1∑\ni=1\n(−1)i+1\n2\n√\n(x˜−x˜i)2 + y˜2\n, (2.11)\nwhere x˜i’s are the positions of the boundaries between the black and the white regions and\nNB is the number of finite size black regions in the droplet representation, as we will see\nbelow. We also note that the two functions satisfy the relation, y˜dV = −⋆2 dZ with ǫy˜x˜ = 1.\nThe corresponding 4-form field strength is given by\nF4 = −d\n(\ne2Φh−2V\n) ∧ dt ∧ dw1 ∧ dw2 + µ−10 [V d(y˜2e2G) + h2e3G ⋆2 d(y˜2e−2G)] ∧ dΩ3\n+ µ−10\n[\nV d(y˜2e−2G)− h2e−3G ⋆2 d(y˜2e2G)\n] ∧ dΩ˜3, (2.12)\nwhere dΩ3 = −(sin θ/8)dθ ∧ dφ ∧ dψ, dΩ˜3 = −(sin θ˜/8)dθ˜ ∧ dφ˜ ∧ dψ˜ in the Euler coordi-\nnate system.2 The Zk quotient acts as\n(\nψ, ψ˜\n)\n→\n(\nψ + 4pi\nk\n, ψ˜ + 4pi\nk\n)\n[16, 25]. The 4-form\nfield strength in (2.12) can also be expressed in terms of Z(x˜, y˜) and V (x˜, y˜) by using the\nrelations [26, 27]\nh2 =\n√\n1\n4\n− Z2\ny˜\n, e2Φ =\n4y˜µ20\n√\n1\n4\n− Z2\nf 2\n, e2G =\n1\n2\n+ Z\n1\n2\n− Z . (2.13)\nWe note that the function Z(x˜, y˜) at y˜ = 0 has a value 1\n2\nif x˜2i−1 < x˜ < x˜2i and it has a\nvalue −1\n2\nif x˜2i < x˜ < x˜2i+1. Based on this fact, the LLM geometries are represented in terms\nof an infinite strip in the x˜-direction with regions of Z(x˜, 0) = −1\n2\ndenoted by black color\nand regions of Z(x˜, 0) = 1\n2\ndenoted by white color. This is called the droplet representation.\nSee the Fig.1. Since the function Z(x˜, 0) is −1\n2\nif x˜ < x˜1 and it is\n1\n2\nif x˜ > x˜2NB+1, NB being\nthe number of finite black regions, we note that the strip also contains an infinite black\nregion below x˜1 and an infinite white region above x˜2NB+1.\nFor every droplet picture there is a symmetric point such that the length of all finite\nsize black regions above this point is the same as the length of all finite size white regions\nbelow the point. This point is called the Fermi level x˜F , which is given by\nx˜F = x˜1 +\nNB∑\ni=1\n(x˜2i+1 − x˜2i). (2.14)\n2Vielbeins for S3 in terms of the Euler angles are given by σ1 = − sinψdθ + sin θ cosψdφ, σ2 =\ncosψdθ + sin θ sinψdφ, σ3 = dψ + cos θdφ with ranges of the angles, 0 ≤ θ ≤ pi, 0 ≤ φ ≤ 2pi, 0 ≤\nψ ≤ 4pi. The metric on the 3-sphere and the volume form with unit radius are written as ds2\nS3\n=\n1\n4\n(\ndθ2 + sin2 θdφ2 + (dψ + cos θdφ)2\n)\n.\n8\nThe strip is divided into excitation levels above and below the Fermi level, where each level\nhas length k. The levels are labeled by non-negative integers n = 0, 1, 2, · · · starting at the\nFermi level. A given droplet representation is then parametrized by a set of parameters\n{ln, l′n} with ln corresponding to the length of the black region in the n-th level above the\nFermi level and l′n corresponding to the length of the white region in the n-th level below the\nFermi level. Since the length of the black or white region in a given level cannot be bigger\nthan k these parameters should satisfy the condition 0 ≤ ln, l′n ≤ k, which is the same as\n(2.7). Actually, it have been suggested that there is one-to-one correspondence between the\nLLM solutions and the vacua of mABJM theory [16]. Since, the LLM solutions are classified\nby {ln, l′n}, while the field theory vacua are classified by the occupation numbers {Nn, N ′n},\nthe one-to-one correspondence is given by\n{ln, l′n} ⇐⇒ {Nn, N ′n}. (2.15)\nAn alternative representation of the LLM solutions is given in terms of Young diagrams.\nIn Young diagram representation, the lengths of the white and black regions correspond to\nthe lengths of the horizontal and vertical edges of the Young diagram, respectively. See\nFig.1 for the parametrization of droplet picture and Young diagram.\n3 Vevs of CPOs in mABJM Theory\nFor the Coulomb branch of the N = 4 SYM theory, the adjoint scalar fields X i’s satisfy\nthe vacuum equation [X i, Xj ] = 0, which means the matrix representations of the scalar\nfields describing the vacuum moduli are diagonal. As a result, the U(N) gauge symmetry\nis broken to U(1)N . The vacuum moduli preserve the N = 4 supersymmetry while the\nconformal symmetry is completely broken. The vevs of CPOs are non-renormalizable due\nto high supersymmetry and they can parametrize the Coulomb branch vacua. On the other\nhand, in the type IIB supergravity, some BPS solutions describing D3-branes distributed\nover finite region of the transverse space were obtained [28]. These solutions are asymptotic\nto AdS5 × S5. According to the gauge/gravity dictionary, the vevs of CPOs is read from\nthe asymptotic expansion of the dual scalar fields. Calculating the vevs of CPOs with lower\nconformal dimensions, the exact dual relations for the Coulomb branch of the N = 4 SYM\ntheory in the large N limit were tested in a systematic way [6, 7].\nNow we compare the mABJM theory and the Coulomb branch of the SYM theory.\nThere are some differences between these two theories. For instance, the mABJM theory\nis constructed by adding some relevant terms to Lagrangian of the ABJM theory and have\ndiscrete Higgs vacua with matrix representations composed of numerical elements, while for\n9\nxF\nx2j\nx2j+1\nx2j+2\nx2j-1\nl0\nl1\nl’1k\nk\nk\nk\nk\nk\nx2j+3\nl’n\nx1\nl’0=0\nln\nx2NB+1\nx2-x1\nx3-x2\nx2NB-x2NB-1\nx2NB+1-x2NB\n(a) (b)\nFigure 1: (a) A droplet representation of the LLM geometry with SO(2,1)×SO(4)/Zk×SO(4)/Zk\nisometry. The horizontal width does not correspond to any coordinate but added for clarity. (b)\nThe Young diagram corresponding to the droplet picture (a).\nthe Coulomb branch of the N = 4 SYM theory, the Lagrangian is undeformed, instead it is\ndefined by choosing some non-vanishing vacuum moduli, which are composed of continuous\nparameters. However, these two theories are similar in the sense that the theories are away\nfrom the UV fixed point and they preserve the full supersymmetry with the dual geometries\nasymptotic to AdS times a compact manifold. Based on these facts and the known results\nof the Coulomb branch of the N = 4 SYM theory, one can expect that similar phenomena\nmay happen for the Higgs vacua in the mABJM theory. That is, the Higgs vacua of the\nmABJM theory are parametrized by vevs of CPOs and those vevs are read from asymptotic\nexpansions of the LLM geometries using the holographic renormalization procedure.\nIn this section, we construct the CPO with ∆ = 1, which manifests the global symmetry\nof the mABJM theory. We also calculate the vevs of the oprator for all supersymmetric\nvacua of mABJM theory for general k in the large N limit.\n3.1 CPOs in ABJM theory\nThe gauge invariant CPOs of conformal dimension ∆ in the ABJM theory are given by\nO(∆) = C(∆)B1,··· ,BnA1,··· ,An Tr\n(\nY A1Y †B1 · · ·Y AnY †Bn\n)\n, (3.16)\n10\nwhere A,B · · · = 1, · · · , 4 and C(∆)B1,··· ,BnA1,··· ,An are symmetric in lower as well as upper indices\nand traceless when tracing over one lower index and one upper index. The CPO in (3.16)\nis written by manifesting the global SU(4) symmetry of the ABJM theory. On the other\nhand, in the mABJM theory the CPOs have to manifest the SU(2)×SU(2)×U(1) global\nsymmetry.\nIt is well known fact that the coefficients C\n(∆)B1,··· ,Bn\nA1,··· ,An are identified with the similar\ncoefficients CIi1···i2n , which defines the scalar spherical harmonics on S\n7 (see appendix A) [4].\nThese coefficients also satisfy the same orthonormality condition as those of the spherical\nharmonics;\nC\n(∆1)B1,··· ,Bn\nA1,··· ,An C¯\n(∆2)A1,··· ,An\nB1,··· ,Bn + (c.c.) = δ\n∆1∆2 . (3.17)\nTherefore, one can fix these coefficients knowing the corresponding coefficients of the spher-\nical harmonics on S7. In appendix A.3, we list the first few scalar spherical harmonics on\nS7, which are needed to read the coefficients for CPOs with lower conformal dimensions. In\nparticular, the coefficients of the CPO with ∆ = 1 are determined in appendix A.4 and the\noperator is given by\nO(∆=1) = 1\n2\n√\n2\nTr\n(\nZaZ†a −W †aWa\n)\n. (3.18)\n3.2 vevs of CPO in mABJM Theory\nHere we calculate the vevs of CPO with ∆ = 1 in mABJM theory. As we see in (3.16), the\nCPO we are considering is composed of the complex scalar fields Y A’s and their complex\nconjugates. For a given supersymmetric vacuum, the scalar fields near the vacuum are\nexpanded as\nY A = Y A0 + Yˆ\nA, (3.19)\nwhere Y A0 ’s (A = 1, 2, 3, 4) denote the vacuum solutions represented by the GRVV matri-\nces [11], and Yˆ A’s are field operators. Inserting (3.19) into (3.16) of a CPO with conformal\ndimension ∆, we obtain\n〈O(∆)〉m = O(∆)(Y A0 ) +\n∑\ni\n〈δO(∆)i 〉0 +\n1\nN\n−corrections, (3.20)\nwhere 〈· · · 〉m and 〈· · · 〉0 denote the vevs of operators in the mABJM theory and the ABJM\ntheory, respectively, and δO(∆)i is an operator containing at least one Yˆ A or Yˆ †A. The\n1\nN\n-corrections in (3.20) come from the contributions of multi-trace terms [29–31]. Here we\nalso note that quantum corrections of scalar fields are absent due to the high number of\n11\nsupersymmetry of the mABJM theory. The second term in (3.20) is a one point function in\na conformal field theory and is vanishing. Therefore, in the large N limit we have\n〈O(∆)(Y A)〉m = O(∆)(Y A0 ). (3.21)\nFor CPO with ∆ = 1 the vevs are obtained by plugging the vacuum solutions in (2.5)\ninto (3.18). Since Za0 is a block diagonal matrix, which contains Nn of the rectangular matrix\nM(n)a , while W †a0 contains N ′n of the matrix M¯(n)a , we have\nTr(Za0Z\n†\na0 −W †a0 Wa0) =\nµk\n2π\n∞∑\nn=0\n(Nn −N ′n)Tr(M(n)a M¯(n)a ) =\nµk\n2π\n∞∑\nn=0\n(Nn −N ′n)n(n + 1),\n(3.22)\nwhere in the last step we have used the rectangular matrices in (2.4). Then, we obtain\n〈O(∆=1)〉m = µk\n4\n√\n2π\n∞∑\nn=0\n(Nn −N ′n)n(n + 1). (3.23)\nThis result is valid for all supersymmetric vacua of mABJM theory with finite k in the large\nN limit.\n4 KK Reduction and Gauge Invariant Modes\nThe KK reduction of 11-dimensional gravity to 4 dimensions involves compactification of\nthe fields on S7.3 In this section we apply the KK reduction to the 11-dimensional gravity\non AdS4 × S7 to obtain 4-dimensional equation of motion on AdS4 background. Such KK\nreduction was carried out in the de Donder gauge in [20]. However, the LLM solutions of\nour interest in this paper are in a different gauge and can not be analyzed based on the\nresults obtained in the de Donder gauge. Therefore, we carry out the reduction in a generic\ngauge and write the equation of motion for gauge invariant dynamical fields.\n4.1 11-dimensional gravity equations of motion\nThe bosonic part of the 11-dimensional supergravity action is given by\nS =\n1\n16πG11\n∫\nd11x\n[√−g(R− 1\n48\nFpqrsF\npqrs\n)\n+\n1\n2(4!)2\nǫ˜p1p2p3q1···q4r1···r4Cp1p2p3Fq1···q4Fr1···r4\n]\n,\n(4.24)\n3The ABJM theory is dual to M-theory on AdS4 × S7/Zk. Here we consider k = 1 case, for simplicity.\nWe will extend our results to general k case eventually.\n12\nwhere we used the index notation p, q, r, · · · = 0, · · · , 10, ǫ˜0123···10 = −1 is the Levi-Civita\nsymbol. The 11-dimensional Newton’s gravitational constant is\nG11 =\n1\n32π2\n(2πlP)\n9, (4.25)\nwhere lP is the Planck constant. The functional variation of the action gives the following\nequations of motion for the metric and the 4-form field strength:\nRpq − 1\n2\ngpqR =\n1\n48\n(\n− 1\n2\ngpqFrstuF\nrstu + 4FpstuF\nstu\nq\n)\n,\n∂p(eF\npqrs) +\n1\n2 · (4!)2 ǫ˜\np1···p4q1···q4qrsFp1···p4Fq1···q4 = 0, (4.26)\nwhere e ≡ √−g. Using the index notation (µ, ν, ρ, · · · = 0, · · ·3), (a, b, c, · · · = 4, · · · 10) we\nwrite the AdS4 × S7 solution of the equations of motion in (4.26) as follows\nds2 =\nL2\n4ρ2\n(−dt2 + dw21 + dw22 + dρ2)+ L2ds2S7,\nFµνρσ = − 6\nL\nǫµνρσ, and it is zero otherwise. (4.27)\nHere ǫµνρσ =\n√|gAdS4| ǫ˜µνρσ is the Levi-Civita tensor for the AdS4 space, and L is the radius\nof S7.\n4.2 Fluctuations on AdS4 × S7\nWe consider a solution which is asymptotically AdS4 × S7 so that we can write it as\ngpq = gpq + hpq,\nCpqr = Cpqr + cpqr ⇐⇒ Fpqrs = Fpqrs + fpqrs, (4.28)\nwhere hpq, cpqr, fpqrs represent deviations from the AdS4 × S7 geometry and they become\nsmall fluctuations in the asymptotic region4. Plugging this back into (4.26), we obtain the\nfollowing equations of motion for hpq and fpqrs up to linear order,\n∇r∇phqr +∇r∇qhpr −∇2hpq −∇q∇phrr − Rhpq − gpq\n(−Rrshrs +∇r∇shrs −∇2hrr)\n+\n1\n48\n(\nFrstuF\nrstuhpq−4gpqhrsF rtuvF stuv\n)\n+\n1\n24\ngpqfpqrsF\npqrs\n− 1\n2\nhrsF\nr\nptuF\nstu\nq −\n1\n6\n(\nfprstF\nrst\nq + Fprstf\nrst\nq\n)\n= 0, (4.29)\n4We use a notation in which the objects in 11-dimensional supergravity are denoted by bold font symbols\nwhereas the AdS4 × S7 values of those objects are denoted by normal font symbols.\n13\n∂p(ef\npqrs) +\n1\n2\n∂p(eh\np\npF\npqrs) + 4∂p(eh\n[p\nt F\nqrs]t) +\n1\n(4!)2\nǫ˜p1···p4q1···q4qrsfp1···p4Fq1···q4 = 0. (4.30)\nIt is convenient to write the above equations for the AdS4 and S\n7 indices separately\n∇ρ∇µhνρ +∇ρ∇νhµρ +∇a∇µhνa +∇a∇νhµa − (∇ρ∇ρ +∇a∇a)hµν −∇µ∇ν(hρρ + haa) +\n6\nL2\nhµν\n− gµν\n[\n12\nL2\nhρρ −\n6\nL2\nhaa +∇ρ∇σhρσ +∇a∇bhab + (∇ρ∇a +∇a∇ρ)hρa − (∇ρ∇ρ +∇a∇a)(hσσ + hbb)\n]\n+\n1\n48\n(\nFρσλκF\nρσλκhµν−4gµνhρσF ρτλκF στλκ\n)\n+\n1\n24\ngµνfρστλF\nρστλ−1\n2\nhρσF\nρ\nµτλF\nστλ\nν\n− 1\n6\n(\nfµρστF\nρστ\nν + fνρστF\nρστ\nµ\n)\n= 0, (4.31)\n∇ρ∇µhaρ +∇ρ∇ahµρ +∇b∇µhab +∇b∇ahµb − (∇ρ∇ρ +∇b∇b)hµa −∇µ∇a(hρρ + hbb) +\n6\nL2\nhµa\n+\n1\n48\nFνρστF\nνρστhµa − 1\n6\nfaρστF\nρστ\nµ = 0, (4.32)\n∇ρ∇ahbρ +∇ρ∇bhaρ +∇c∇ahbc +∇c∇bhac − (∇ρ∇ρ +∇c∇c)hab −∇a∇b(hρρ + hcc) +\n6\nL2\nhab\n− gab\n[\n12\nL2\nhρρ −\n6\nL2\nhcc +∇ρ∇σhρσ +∇c∇dhcd + (∇ρ∇c +∇c∇ρ)hρc − (∇ρ∇ρ +∇c∇c)(hσσ + hdd)\n]\n+\n1\n48\n(\nFµνρσF\nµνρσhab−4gabhρσF ρτλκF στλκ\n)\n+\n1\n24\ngabfρστλF\nρστλ = 0, (4.33)\nand\n∇σfσµνρ +∇afaµνρ + 1\n2\n(∇σhλλ)F σµνρ +\n1\n2\nhλλ∇σF σµνρ\n+\n1\n2\n(∇σhaa)F σµνρ +\n1\n2\nhaa∇σF σµνρ + 4∇λ\n(\nh[λσ F\nµνρ]σ\n)\n+∇a\n(\nhaσF\nµνρσ\n)\n= 0, (4.34)\n∇σfσµνa +∇bf bµνa −∇λ(h aσ F µνλσ) = 0, (4.35)\n∇σfσµab +∇cf cµab = 0, (4.36)\n∇σfσabc +∇df dabc + 1\n(4!)2\nǫa1···a4ν1···ν4abcfa1···a4Fν1···ν4 = 0, (4.37)\nwhere we have used the identities ∇pf pqrs = 1e∂p\n(\nef pqrs\n)\nand∇p\n(\nh\n[p\nt F\nqrs]t\n)\n= 1\ne\n∂p(eh\n[p\nt F\nqrs]t).\n14\n4.3 Expansion in S7 spherical harmonics\nThe fluctuations hpq and cpqr can be expanded in S\n7 spherical harmonics as\nhµν(x, y) = h\nI1\nµν(x)Y\nI1(y),\nhµa(x, y) = v\nI7\nµ (x)Y\nI7\na (y) + s\nI1\nµ (x)∇aY I1(y),\nh(ab)(x, y) = t\nI27(x)Y I27(ab)(y) + v\nI7(x)∇(aY I7b) (y) + sI1(x)∇(a∇b)Y I1(y),\nhaa(x, y) = φ\nI1(x)Y I1(y),\ncµνρ(x, y) = s˜\nI1\nµνρ(x)Y\nI1(y),\ncµνa(x, y) = v˜\nI7\nµν(x)Y\nI7\na (y) + s˜\nI1\nµν(x)∇aY I1(y),\ncµab(x, y) = t˜\nI21\nµ (x)Y\nI21\n[ab] (y) + v˜\nI7\nµ (x)∇[aY I7b] (y),\ncabc(x, y) = t˜\nI35(x)Y I35[abc](y) + t˜\nI21(x)∇[aY I21bc] (y), (4.38)\nwhere x is the AdS4 coordinate and y is the S\n7 coordinate. For the definitions of the\nspherical harmonics on S7, see appendix A. The notation (ab) means symmetrized traceless\ncombination which is defined as\nT(ab) =\n1\n2\n(Tab + Tba)− 1\n7\ngabT\nc\nc, (4.39)\nwhere gab is a metric on S\n7. The notation [abc · · · ] means anti-symmetrization among\nindices, a, b, c, · · · , for instance,\nT[ab] =\n1\n2!\n(Tab − Tba). (4.40)\nThe expansion (4.38) follows the convention of [6, 32]. The expansions of the 4-form field\nstrength fluctuations fpqrs are read from f = dc,\nfµνρσ(x, y) = 4∇[µsI1νρσ](x)Y I1(y),\nfµνρa(x, y) = 3∇[µvI7νρ](x)Y I7a (y)− sI1µνρ(x)∇aY I1(y),\nfµνab(x, y) = 2∇[µtI21ν] (x)Y I21[ab] (y) + 2vI7µν(x)∇[aY I7b] (y),\nfµabc(x, y) = ∇µtI35(x)Y I35[abc](y)− 3tI21µ (x)∇[aY I21bc] (y),\nfabcd(x, y) = 4t\nI35(x)∇[aY I35bcd](y), (4.41)\nwhere we have used the fact that ∇[a∇b]Y I1(y) = 0, ∇[a∇bY I7c] (y) = 0, and ∇[a∇bYcd] = 0.\nWe note that, under the U(1) gauge transformation the 3-form gauge field transforms as\nc3 → dΛ(2). However, the 4-form field strength is invariant under this transformation. There-\nfore, the field strengths in (4.41) are written in terms of U(1) gauge invariant combinations\n15\nwhich are defined as\nsI1µνρ(x) ≡ s˜I1µνρ(x)− 3∇[µs˜I1νρ](x),\nvI7µν(x) ≡ v˜I7µν(x) +∇[µv˜I7ν] (x),\ntI21µ (x) ≡ t˜I21µ (x)−\n1\n3\n∇µt˜I21(x),\ntI35(x) ≡ t˜I35(x). (4.42)\nPlugging (4.38) and (4.41) into the (µ, ν)-components of fluctuation equations in (4.31)\nand projecting onto the scalar harmonics Y I1 , we obtain\n−\n(\n\u0003+ ΛI1 +\n8\nL2\n)\nhI1µν +∇µ∇ρhI1νρ +∇ν∇ρhI1µρ − gµν∇ρ∇σhI1ρσ\n+ gµν\n(\n\u0003+ ΛI1 − 22\nL2\n)\nhI1 −∇µ∇νhI1 + ΛI1\n(∇µsI1ν +∇νsI1µ )\n− 2gµνΛI1∇ρsI1ρ + gµν\n(\n\u0003+\n6\n7\nΛI1 +\n6\nL2\n)\nφI1 −∇µ∇νφI1 − 6gµνΛI1\n(1\n7\nΛI1 +\n1\nL2\n)\nsI1\n+\n4\nL\n∇[µsI1ρσλ]ǫ ρσλν +\n4\nL\n∇[νsI1ρσλ]ǫ ρσλµ −\n1\nL\ngµν∇[ρsI1σλτ ]ǫρσλτ = 0, (4.43)\nwhere \u0003 ≡ ∇µ∇µ. We have used the AdS4 × S7 solutions in (4.27) and the results of the\nintegrals of spherical harmonics listed in appendix A. The tracing over (µ, ν)-indices in\n(4.43) gives the following equation for scalar fields\n(\n2\u0003+ 3ΛI1 − 96\nL2\n)\nhI1 − 2∇µ∇νhµν − 6ΛI1∇µsI1µ\n+ 3\n(\n\u0003+\n8\n7\nΛI1 +\n8\nL2\n)\nφI1 − 24ΛI1\n(1\n7\nΛI1 +\n1\nL2\n)\nsI1 +\n4\nL\n∇[µsI1νρσ]ǫµνρσ = 0. (4.44)\nFrom the equation (4.32), we obtain the following two equations by projections onto\n∇aY I1 and gabY I7b , respectively(\n\u0003+\n24\nL2\n)\nsI1µ −∇µ∇νsI1ν −\n(6\n7\nΛI1 +\n6\nL2\n)\n∇µsI1 + 6\n7\n∇µφI1\n−∇νhI1µν +∇µhI1 −\n1\nL\nsI1ρστ ǫ\nρστ\nµ = 0, (4.45)\n−\n(\n\u0003+ ΛI7 +\n18\nL2\n)\nvI7µ +∇µ∇νvI7ν +\n(1\n2\nΛI7 +\n3\nL2\n)\n∇µvI7− 3\nL\n∇[νvI7λκ]ǫ νλκµ = 0. (4.46)\nFrom the equations (4.33), we obtain four scalar equations by projecting on four different\n16\nelements: gabY I1 , ∇(a∇b)Y I1 , ∇(aY b)I7 and Y (ab)I27 ,\n−12\n7\nΛI1∇µsI1µ −\n1\nL\n∇[µsI1νλκ]ǫµνλκ −\n30\n7\nΛI1\n(ΛI1\n7\n+\n1\nL2\n)\nsI1 +\n(\n\u0003+\n6\n7\nΛI1 +\n6\nL2\n)\nhI1\n+\n6\n7\n(\n\u0003+\n5\n7\nΛI1 +\n5\nL2\n)\nφI1 −∇µ∇νhI1µν = 0, (4.47)\n2∇µsI1µ =\n(\n\u0003− 5\n7\nΛI1\n)\nsI1 + hI1 +\n5\n7\nφI1, (4.48)\n\u0003vI7 − 2∇µvI7µ = −2∇µvˆI7µ = 0, (4.49)(\n\u0003+ ΛI27 − 2\nL2\n)\ntI27 = 0. (4.50)\nSimilarly, inserting (4.38) and (4.41) in to the equations of motion of fpqrs in (4.34)-\n(4.37), and projecting onto the appropriate spherical harmonic elements, we obtain the\nfollowing set of equations(\n\u0003+ ΛI1\n)\nsI1µνρ − 3∇δ∇[µsI1νρ]δ\n− 3\nL\nǫσµνρ∇σhI1 − 3\nL\nǫσµνρ∇σφI1 − 24\nL\n∇σhI1λ[σǫµνρ]λ −\n6\nL\nΛI1ǫµνρ\nσsI1σ = 0, (4.51)(\n\u0003+ ΛI7 +\n10\nL2\n)\nvI7µν −\n6\nL\nǫρσµν∇σvI7ρ = 0, (4.52)(\n\u0003+ ΛI21 +\n2\nL2\n)\ntI21µ = 0, (4.53)\n∇ρsI1ρµν +\n6\nL\nǫµνσ\nλ∇σsI1λ = ∇ρsˆI1ρµν = 0, (4.54)\n∇νvI21ν = 0, (4.55)\n∇νvI7νµ = 0, (4.56)[\n\u0003− 12\nL2\n+ ΛI35 − 6\n√\nµI35\nL\n]\nt˜I35+ = 0,[\n\u0003− 12\nL2\n+ ΛI35 +\n6\n√\nµI35\nL\n]\nt˜I35− = 0, (4.57)\nwhere µI35 = (I35+3)\n2\nL2\nand we have used the relation\nǫabc\na1a2a3a4∇a1Y I35a2a3a4 = ±3!\n√\nµI35Y I35abc . (4.58)\nto obtain the two equations in (4.57).\n4.4 Gauge invariant fluctuations\nSome of the fluctuations hpq and fpqrs are related to each other or to the background solution\nby diffeomorphic transformation. In other words, some of these fluctuations are generated by\n17\nthe variation of some other fluctuations or the background under the infinitesimal coordinate\ntransformation x′p = xp− ξp. Up to linear order, these gauge-dependent degrees of freedom\ntransform as,\nδ˜hpq = (∇pξq +∇qξp), δ˜fpqrs = −4∇[pξtFqrs]t. (4.59)\nTo obtain the gauge transformations of the 4-dimensional fields, we expand the gauge pa-\nrameter ξp(x, y) in terms of the spherical harmonics on S7 as\nξµ(x, y) = ξ\nI1\nµ (x)Y\nI1(y), ξa(x, y) = ξ\nI7\n(v)(x)Y\nI7\na (y) + ξ\nI1\n(s)(x)∇aY I1(y). (4.60)\nUsing (4.38), (4.41), and (4.60) in (4.59), we obtain the following transformations for\ngauge-dependent coefficients of the spherical harmonics\nδ˜hI1µν = ∇µξI1ν +∇νξI1µ , δ˜vI7µ = ∇µξI7(v), δ˜sI1µ = ∇µξI1(s) + ξI1µ ,\nδ˜tI27 = 0, δ˜vI7 = 2ξI7(v), δ˜s\nI1 = 2ξI1(s), δ˜φ\nI1 = 2ΛI1ξI1(s). (4.61)\nBased on these transformations, the following combinations are gauge invariant,\nφˆI1 = φI1 − ΛI1sI1 , vˆI7µ = vI7µ −\n1\n2\n∇µvI7, hˆI1µν = hI1µν −∇µs˜I1ν −∇ν s˜I1µ , (4.62)\nwhere s˜I1µ = s\nI1\nµ − 12∇µsI1 .\nSince the only non-vanishing component of the 4-form field strength is Fµνρσ, the non-\ntrivial equations in second part of (4.59) are\nδ˜fλµνρ = −4∇[λ\n(\nξI1σ Fµνρ]\nσ\n)\nY I1 , δ˜fµνρa = ξ\nI1\nσ Fµνρ\nσ∇aY I1. (4.63)\nThen, we obtain the following results\nδ˜sI1µνρ = −ξI1σ Fµνρσ, ∇[µδ˜sI1νρ] =\n1\n3\n(\nδ˜sI1µνρ + ξ\nI1\nσ Fµνρ\nσ\n)\n= 0, (4.64)\nThe remaining coefficients associated with fpqrs are all diffeomorphic invariant at linear\norder.\n4.5 KK reduction\nThe linear equations in subsection 4.3 are not all independent and some of the fields are gauge\ndegrees of freedom. In this subsection, we find equations of motion for gauge invariant fields\nintroduced perviously. We diagonalize those equations to identify the equations of motion\nfor physical modes.\n18\n4.5.1 The equations for spin zero fields\nUsing equations (4.44), (4.45), (4.47), (4.48), and (4.51), we obtain the following equations\nof motions for two gauge invariant scalar fields(\n\u0003+ ΛI1 +\n12\nL2\n)\nφˆI1 − 14\n3L2\nψˆI1 = 0, (4.65)(\n\u0003+ ΛI1\n)\nψˆI1 + 18\n(\n\u0003− 5\n7\nΛI1\n)\nφˆI1 = 0, (4.66)\nwhere the gauge invariant scalar fields are\nψˆI1 = (18hI1 − uI1), φˆI1 = (φI1 − ΛI1sI1) (4.67)\nwith\nuI1 ≡ Lǫµνρσ∇µsI1νρσ. (4.68)\nDiagonalizing equations (4.65) and (4.66), we write them in terms of the mass eigenstates(\n\u0003− (I1 + 6)(I1 + 12)\nL2\n)\nφˇI1 = 0,\n(\n\u0003− I1(I1 − 6)\nL2\n)\nψˇI1 = 0, (4.69)\nwhere we have introduced\nφˇI1 =\n(I1 + 7)\n[\n18(I1 − 1)φˆI1 + 7ψˆI1\n]\n14(I1 + 3)\n, ψˇI1 =\n(I1 − 1)\n[− 18(I1 + 7)φˆI1 + 7ψˆI1]\n14(I1 + 3)\n. (4.70)\nIn addition, from equations (4.50) and (4.57) we write the equations of motion for three\nmore fields which are already diagonal and gauge invariant\n(\n\u0003− I27(I27 + 6)\nL2\n)\ntˇI27 = 0, (4.71)(\n\u0003− (I35 + 3)(I35 + 9)\nL2\n)\ntˇI35+ = 0,\n(\n\u0003− (I35 + 3)(I35 − 3)\nL2\n)\ntˇI35− = 0, (4.72)\nwhere tˇI27 ≡ tI27 , tˇI35+ ≡ tI35+ , and tˇI35− ≡ tI35− .\nIn general, the KK reduction means to construct a 4-dimensional gravity action, in-\ncluding higher order interaction terms, from the equations of motion of fluctuation fields.\nWhen one goes beyond the linear order, the higher order terms involve higher derivatives,\nand then one needs to introduce some field redefinitions in order to have the corresponding\n4-dimensional gravity action. For instance, at quadratic order, such field redefinition was\nintroduced in [6, 7]\nSI = sˇI + JsIJnJm tˇ\nJn tˇJm + LsIJnJm∇µtˇJn∇µtˇJm , (4.73)\n19\nwhere sˇI represent any of the 11-dimensional fields, and SI is the corresponding 4-dimensional\nfield. The tˇJi represent all the fields that appear in the quadratic part of the equations of\nmotion. However, at linear order, which is what we are dealing with in this paper, these field\nredefinitions are trivial and the 11- and 4-dimensional fields are the same. Therefore, the\nfields φˇI1, ψˇI1, tˇI27 , tˇI35+ , tˇ\nI35\n− are the correct 4-dimensional spin-zero fields at the linear order\nand are denoted as ΦI1,ΨI1, T I27 , T I35+ , T\nI35\n− , respectively. Based on the parity transforma-\ntion of the original 11-dimensional fields (hpq is a tensor, cpqr is a pseudotensor), we note\nthat the first three fields ΦI1 ,ΨI1, T I27 are scalar fields while the last two fields T I35+ , T\nI35− are\npseudoscalar fields.\n4.5.2 The equations for spin one fields\nThere are three towers of KK vector modes. Combining equations (4.46), (4.49), (4.52),\nand (4.56), we obtain the following equations of motion for two of those KK modes(\n\u0003+ ΛI7 +\n18\nL2\n)\nvˆI7µ +\n3\nL2\nuˆI7µ = 0,(\n\u0003+ ΛI7 +\n6\nL2\n)\nuˆI7µ + 12\n(\n\u0003+\n12\nL2\n)\nvˆI7µ = 0, (4.74)\nwhere ΛI7 = − I7(I7+6)−1\nL2\n, and we have introduced the following gauge invariant combinations\nvˆI7µ ≡ vI7µ −\n1\n2\n∇µvI7,\nuˆI7µ ≡ Lǫµνρσ∇ν vˆI7ρσ with vˆI7µν = v˜I7µν +∇[µv˜I7ν] . (4.75)\nDiagonalizing the two equations in (4.74) gives the equations of motions for two mass eigen-\nstates (\n\u0003− I\n2\n7 + 12I7 + 23\nL2\n)\nvˇI7µ = 0,\n(\n\u0003− I\n2\n7 − 13\nL2\n)\nuˇI7µ = 0, (4.76)\nwhere\nvˇI7µ =\n2(I7 − 1)vˆI7µ − uˆI7µ\n4(I7 + 3)\n, uˇI7µ =\n2(I7 + 7)vˆ\nI7\nµ + uˆ\nI7\nµ\n4(I7 + 3)\n. (4.77)\nOn the other hand from (4.53) we get the equation of motion for one more KK vector\nmode (\n\u0003+ ΛI21 +\n2\nL2\n)\ntˇI21µ = 0, (4.78)\nwhere tˇI21µ is equivalent to t\nI21\nµ in (4.42).\n20\nLike in the case of the scalar fields, if we consider non-linear equations, the KK reduction\nwill involve non-trivial field redefinition of the type (4.73). However, at linear order, the\nabove three KK vector modes are the correct 4-dimensional physical modes and they are\ndenoted as V I7µ , U\nI7\nµ , and T\nI21\nµ . We note that the first two are vector fields while the third\none is a pseudovector field.\n4.5.3 The equations for spin two fields\nNext we consider the gauge invariant equations of motion for 2-tensor fields. Using equations\n(4.43), (4.45), (4.47), (4.48), (4.51), and (4.54), with some algebra, we obtain the following\nlinear order equations for gauge invariant tensor fields(\n\u0003+ ΛI1 +\n32\nL2\n)\nψˆI1µν −\n8\nL2\ngµνψˆ\nI1 +\n90\n7\n(\n\u0003+ ΛI1 +\n32\nL2\n)\nφˆI1µν −\n72\n7\n(\n3∇µ∇ν + 10\nL2\ngµν\n)\nφˆI1 = 0,\n5\n7\n(\n\u0003+ ΛI1 +\n44\nL2\n)\nφˆI1µν +\n2\nL2\nψˆI1µν −\n40\n7L2\ngµνφˆ\nI1 − 4\n3L2\ngµνψˆ\nI1 = 0, (4.79)\nwhere we have introduced the following gauge invariant tensor fields\nψˆI1µν ≡ 18hI1µν−uI1µν , φˆI1µν ≡\n7\n5\n(∇µsI1ν +∇νsI1µ −∇µ∇νsI1 − hI1µν) , (4.80)\nand we have defined\nuI1µν ≡\nL\n2\n(ǫ ρσλµ ∇νsI1ρσλ + ǫ ρσλν ∇µsI1ρσλ). (4.81)\nWe note that ψˆI1 ≡ ψˆI1µµ and φˆI1 ≡ φˆI1µµ are the gauge invariant scalar fields defined in\n(4.67).\nIn order to define the 4-dimensional spin two physical modes, we write (4.79) in terms\nof traceless tensor modes(\n\u0003+ ΛI1 +\n32\nL2\n)\nψˆI1(µν) +\n90\n7\n(\n\u0003+ ΛI1 +\n32\nL2\n)\nφˆI1(µν) −\n216\n7\n∇(µ∇ν)φˆI1 = 0,(\n\u0003+ ΛI1 +\n44\nL2\n)\nφˆI1(µν) +\n14\n5L2\nψˆI1(µν) = 0, (4.82)\nwhere ψˆI1(µν) = ψˆ\nI1\nµν − 14gµνψˆI1 and φˆI1(µν) = φˆI1µν − 14gµνφˆI1. Then we introduce the transverse\nand traceless spin two modes, which should satisfy the transverse condition ∇µ∇νhˆI1(µν) = 0,\nand diagonalized linear equation,\nhˇI1(µν) = φˆ\nI1\n(µν) +\n7\n30\nψˆI1(µν) +\n3L2\n(I1 + 2)(I1 + 4)\n∇(µ∇ν)φˆI1 − 7L\n2\n30(I1 + 2)(I1 + 4)\n∇(µ∇ν)ψˆI1.\n(4.83)\nUsing (4.82), we can write the linear equation for the diagonalized spin two KK modes as\n(\u0003−M2I1)hˇI1(µν) = 0, (4.84)\n21\nwhere M2I1 =\nI1(I1+6)−8\nL2\n.\nSimilar to the spin zero case, the equation of motion for spin two modes contains higher\nderivative terms starting from quadratic order. Therefore, one needs to introduce field\nredefinitions of the type (4.73) in order to absorb those higher derivative terms. Such field\nredefinition will result in the 4-dimensional spin two modes HI1(µν). However, at linear order,\nHI1(µν) = hˇ\nI1\n(µν) are the correct 4-dimensional spin two KK modes.\nTo summarize, the KK reduction of the bosonic sector of the 11-dimensional supergravity\nyields, three towers of scalar modes ΦI1 ,ΨI1, T I27, two towers of pseudoscalar modes T I35+\nand T I35− , two towers of vector modes V\nI7\nµ and U\nI7\nµ , one tower of pseudovector mode T\nI21\nµ ,\nand one tower of spin-two mode HI1(µν).\n5 Exact KK Holography for LLM Geometries\nIn this section, we want to obtain exact results for the vevs of the gauge invariant operators\nin small mass expansion by using KK renormalization method [6–8] and compare with\nthe field theory results of section 3. At leading order in the small mass parameter, the\nlinearized equations of motion discussed in the previous section are sufficient. From the\nasymptotic expansions of the LLM geometries, one can read the solutions of some physical\nmodes in 4-dimensional gravity, which are related to the vevs of gauge invariant operators.\nFor instance, the solutions of the KK mode, which are dual to the CPO with ∆ = 1, are\ncompletely determined from the leading asymptotic expansion of the LLM geometries.\n5.1 Asymptotic expansion of the LLM geometries\nAs discussed in section 2, the LLM solutions are completely determined by two functions\nZ(x˜, y˜) and V (x˜, y˜) in (2.11). With some algebra these functions can be written in terms of\nthe Legendre polynomials as follows\nZ(ρ, ξ) =\n1\n2\n[\nξ +\n∞∑\nn=1\n[\n(n+ 1)Pn+1(ξ)− 2ξnPn(ξ) + (n− 1)Pn−1(ξ)\n]\nCn\n(√\n2µ0ρ\n)n]\n,\nV (ρ, ξ) =\n2ρ\nL3\n[\n1 +\n∞∑\nn=1\nnPn(ξ)Cn\n(√\n2µ0ρ\n)n]\n, (5.85)\nwhere ρ = L\n3\n4r˜\n, ξ = x˜\nr˜\nwith r˜ =\n√\nx˜2 + y˜2, and Pn(ξ) are the Legendre polynomials. We have\ndefined [27]\nCn =\n2NB+1∑\ni=1\n(−1)i+1\n(\nx˜i\n2πl3Pµ0\n√\nA\n)n\n, (5.86)\n22\nwhere A = kN −∑NBj=1 t2j+1(k−t2j+1)2 is the area in the Young diagram representation of the\ngeometry and ti’s are the discrete torsions assigned at the boundary x˜i between the black\nand white strips in the droplet picture [16]. It can be shown that, the first two of the\nparameters Cn’s satisfy an identity:\nβ2 ≡ C2 − C21 = 2. (5.87)\nIn terms of the (ρ, ξ) coordinates, the metric of the LLM geometries in (2.8) is rewritten\nas\nds2 = −Gtt\n(−dt2 + dw21 + dw22)+Gρρ\n(\ndρ2 +\nρ2\n1− ξ2dξ\n2\n)\n+Gθθds\n2\nS3 +Gθ˜θ˜ds\n2\nS˜3\n, (5.88)\nwhere Gρρ =\nL6Gxx\n16ρ4\n.\nTo implement the method of holographic renormalization, we should rewrite the solution\nin terms of the Fefferman-Graham (FG) coordinate system [33], where the holographic\ndirection is well defined. In a geometry which is asymptotically AdSd+1 × X , the metric in\nthe FG coordinate system is given by\nds2 =\nL2AdS\nz2\n(\ndz2 + gij(z, y)dx\nidxj\n)\n+ g(z, y)ds2X , (5.89)\nwhere z denotes the holographic direction and g(z, y) is some warp factor for the compact\nspace. In order to rewrite the LLM metric (5.88) in the form (5.89) we use the coordinate\ntransformations\nρ = ρ(z, τ), ξ = ξ(z, τ), (5.90)\nwhich should satisfy two conditions\nGρρ\n(\n∂ρ\n∂z\n)2\n+\nρ2Gρρ\n1− ξ2\n(\n∂ξ\n∂z\n)2\n=\nL2\n4z2\n,\nGρρ\n(\n∂ρ\n∂z\n)(\n∂ρ\n∂τ\n)\n+\nρ2Gρρ\n1− ξ2\n(\n∂ξ\n∂z\n)(\n∂ξ\n∂τ\n)\n= 0. (5.91)\nThen we obtain\nds2 =\nL2\n4z2\n(\ndz2 +\n4z2\nL2\ng1(z, τ)\n(−dt2 + dw21 + dw22) )\n+ g2(z, τ)dτ\n2 + g3(z, τ)ds\n2\nS3 + g4(z, τ)ds\n2\nS˜3\n, (5.92)\nwhere\ng1(z, τ) = Gtt\n(\nρ(z, τ), ξ(z, τ)\n)\n,\ng2(z, τ) = Gxx\n(\nρ(z, τ), ξ(z, τ)\n) [(∂ρ\n∂τ\n)2\n+\nρ2\n1− ξ2\n(∂ξ\n∂τ\n)2]\n,\ng3(z, τ) = Gθθ\n(\nρ(z, τ), ξ(z, τ)\n)\n, g4(z, τ) = Gθ˜θ˜\n(\nρ(z, τ), ξ(z, τ)\n)\n. (5.93)\n23\nIt is non-trivial to solve the two conditions in (5.91) analytically. However, recalling the\nasymptotic behavior of the LLM geometry, we note that the coordinate transformations\nsatisfy the boundary conditions ρ(z, τ)|z→0 = z and ξ(z, τ)|z→0 = τ . To solve the conditions\n(5.91) in the asymptotic region, we use the following ansatze,\nρ(z, τ) = z\n(\n1 + a1zµ0 + a2z\n2µ20 + · · ·\n)\n,\nξ(z, τ) = τ + b1zµ0 + b2z\n2µ20 + · · · , (5.94)\nwhere the ai and bi are determined from (5.91),\na1 =\n1\n3\n√\n2\n(C31 − C3)τ,\na2 =\n1\n96\n(\n− 8C2C41 + 12C3C31 + 3\n(\nC22 − C4\n)\nC21 − 4C2C3C1 + C32 − 4C23 + 3C2C4\n)\n+\n1\n288\n(\n44C61 − 60C2C41 − 100C3C31 + 9\n(\n11C22 + 5C4\n)\nC21 − 12C2C3C1\n− 27C32 + 56C23 − 45C2C4\n)\nτ 2,\nb1 = − 1\n3\n√\n2\n(C31 − C3)(1− τ 2),\nb2 = − 1\n288\n(\n44C61 − 60C2C41 − 100C3C31 + 9\n(\n11C22 + 5C4\n)\nC21 − 12C2C3C1\n− 27C32 + 56C23 − 45C2C4\n)\nτ(1 − τ 2). (5.95)\nUsing the above coordinate transformations, the asymptotic expansions of the warp\nfactors gi(z, τ) are obtained and listed in appendix B. The expansions depend on the τ\ncoordinate on S7 so that we can use the results in appendix A.3 to replace the τ dependence\nin terms of the scalar harmonics on S7. Then we read the values of hI1ij (i, j = t, w1, w2), for\nI1 = 0, 2, 4, · · · ,\nh0ij =\n[\n− L\n2µ20\n720\n(\n17C61 − 51C2C41 − 28C3C31 + 72C22C21 + 42C2C3C1 − 45C32 − 7C23\n)\n+O(µ40)\n]\nηij ,\n(5.96)\nh2ij =\n[\n− L\n2µ0\n3z\n(\n2C31 − 3C2C1 + C3\n)\n+O(µ30)\n]\nηij, (5.97)\nh4ij =\n[ L2µ20\n36\n√\n10\n(\n28C61 − 84C2C41 + 28C3C31 + 9\n(\n7C22 − 15C4\n)\nC21 + 228C2C3C1\n− 135C32 − 128C23 + 135C2C4\n)\n+O(µ40)\n]\nηij , (5.98)\nwhere ηij = diag(−1, 1, 1). Noting that hI1zz = 0 in the FG coordinate, we obtain the values\n24\nof hI1 ≡ gijhI1ij = 4z\n2\nL2\nηijhI1ij ,\nh0 = −(µ0z)\n2\n60\n(\n17C61 − 51C2C41 − 28C3C31 + 72C22C21 + 42C2C3C1 − 45C32 − 7C23\n)\n+O(µ40),\n(5.99)\nh2 = −4µ0z\n(\n2C31 − 3C2C1 + C3\n)\n+O(µ30), (5.100)\nh4 =\n(µ0z)\n2\n3\n√\n10\n(\n28C61 − 84C2C41 + 28C3C31 + 9\n(\n7C22 − 15C4\n)\nC21 + 228C2C3C1\n− 135C32 − 128C23 + 135C2C4\n)\n+O(µ40). (5.101)\nIn appendix B we have also listed the expansions of the components of the 4-form field\nstrength. Using (4.41), we read the values of the scalar fields u˜I1 defined in (4.68) from\nǫµνρσfµνρσ = 4!ǫ\ntw1w2zftw1w2z, where ftw1w2z is listed in appendix B,\nu˜0 =\n3(µ0z)\n2\n10\n(\n7C61 − 21C2C41 + 12C22C21 + 6\n(\n2C21 − 3C2\n)\nC3C1 + 5C\n3\n2 + 3C\n2\n3\n)\n+O(µ40),\n(5.102)\nu˜2 = −48µ0z\n(\n2C31 − 3C2C1 + C3\n)\n+O(µ30), (5.103)\nu˜4 = −2(µ0z)\n2\n√\n10\n(\n4C61 − 12C2C41 + 4C3C31 + 9\n(\nC22 + 15C4\n)\nC21 − 276C2C3C1\n+ 136C23 + 135\n(\nC32 − C2C4\n) )\n+O(µ40). (5.104)\nIn order to read the values of the scalars φI1, we take the trace of hab,\nhaa = φ\nI1Y I1 = gab\n(\ngab − gab\n)\n= gabgab − 7. (5.105)\nThen the results are read from the asymptotic expansions of g3(z, τ) and g4(z, τ) in appendix\nB,\nφ0 =\n(µ0z)\n2\n15\n(\n14C61 − 42C2C41 + 4C3C31 + 39C22C21 − 6C2C3C1 − 10C32 + C23\n)\n+O(µ40),\n(5.106)\nφ2 = 4µ0z\n(\n2C31 − 3C2C1 + C3\n)\n+O(µ30), (5.107)\nφ4 =\n(µ0z)\n2\n3\n√\n10\n(− 124C61 + 372C2C41 − 124C3C31 + 9 (15C4 − 31C22)C21 − 84C2C3C1\n+ 104C23 + 135\n(\nC32 − C2C4\n) )\n+O(µ40). (5.108)\nThe values of the scalars sI1 are obtained from\n∇a∇bh(ab) = sI1∇a∇b∇(a∇b)Y I1 = 6sI1ΛI1\n(ΛI1\n7\n+\n1\nL2\n)\nY I1, (5.109)\n25\nby expanding,\n∇a∇bh(ab) = ∇a∇bgab − 1\n7\n\u0003hcc. (5.110)\nThen using appendix B we obtain\ns0 = −L\n2(µ0z)\n2\n630\n(\n14C61 − 42C2C41 + 4C3C31 + 39C22C21 − 6C2C3C1 − 10C32 + C23\n)\n+O(µ40),\n(5.111)\ns2 =\nL2µ0z\n3\n(\n2C31 − 3C2C1 + C3\n)\n+O(µ30), (5.112)\ns4 =\nL2(µ0z)\n2\n216\n√\n10\n(− 124C61 + 372C2C41 − 124C3C31 + 9 (15C4 − 31C22)C21 − 84C2C3C1\n+ 104C23 + 135\n(\nC32 − C2C4\n) )\n+O(µ40). (5.113)\nTo determine the graviton mode, in addition to hµν we also need the values of the tensor\nfields u˜µν defined in (4.81). We can rewrite the definition in (4.81)as\nu˜I1µνΛ\nI1Y I1 =\nL\n2\n(\nǫ ρσλµ ∇νsI1ρσλΛI1Y I1 + ǫ ρσλν ∇µsI1ρσλΛI1Y I1\n)\n. (5.114)\nOn the other hand, from (4.41), we see that ∇afµνρa = −sI1µνρΛI1Y I1. Using this into (5.114)\nand noting that, for the LLM geometry, the only non zero fµνρa is ftw1w2τ , we obtain the\nfollowing results\nu˜I1ijΛ\nI1Y I1 =3!\n4z\nL\n(4(1− τ 2)\nL2\n∂τFtw1w2τ −\n16τ\nL2\nFtw1w2τ\n)\nηij , (5.115)\nu˜I1zzΛ\nI1Y I1 =− 3!4z\n2\nL\n[4(1− τ 2)\nL2\n(\n∂τ∂zFtw1w2τ + 3\n1\nz\n∂τFtw1w2τ\n)− 16τ\nL2\n(\n∂zFtw1w2τ + 3\n1\nz\nFtw1w2τ\n)]\n.\nUsing again the results of appendix B, we read the values of u˜I1µν , for I1 = 2, 4, · · · . However,\nsince Λ0 = 0, we can not read u˜0µν .\nu˜2ij =\n(\n− 6L\n2µ0\nz\n(\n2C31 − 3C1C2 + C3\n)\n+O(µ30)\n)\nηij , (5.116)\nu˜4ij =\n(\n− L\n2µ20\n2\n√\n10\n(\n4C61 − 12C2C41 + 4C3C31 + 9\n(\nC22 + 15C4\n)\nC21 − 276C2C3C1 (5.117)\n+ 135C32 + 136C\n2\n3 − 135C2C4\n)\n+O(µ40)\n)\nηij ,\nu˜2zz =\n6L2µ0\nz\n(\n2C31 − 3C1C2 + C3\n)\n+O(µ30), (5.118)\nu˜4zz =\nL2µ20√\n10\n(\n4C61 − 12C2C41 + 4C3C31 + 9\n(\nC22 + 15C4\n)\nC21 − 276C2C3C1 (5.119)\n+ 135C32 + 136C\n2\n3 − 135C2C4\n)\n+O(µ40).\nFinally, the vector fields sI1µ , which are also needed to write the graviton mode, are zero,\nbecause for the LLM geometry hµa is zero.\n26\n5.2 Asymptotic expansions for the physical modes in 4 dimen-\nsions\nThe asymptotic expansions for the scalar and tensor fluctuations in the previous subsection\nare at least linear in the mass parameter µ0. If we truncate our results at µ0 order, the only\nnon-vanishing fields are the KK modes with I1 = 2. Keeping this in mind, we list the linear\norder asymptotic expansions of some of the scalar and tensor physical modes discussed in\nsubsection 4.5.\nPlugging the expansions of the previous subsection into (4.70), we obtain the asymptotic\nexpansions for ΦI1 and ΨI1,\nΦ0 = O(µ20), Φ2 = O(µ30), Φ4 = O(µ20),\nΨ0 = O(µ20), Ψ2 = −24β3µ0z +O(µ30), Ψ4 = O(µ20), (5.120)\nwhere\nβ3 ≡ 2C31 − 3C1C2 + C3. (5.121)\nThe solutions in (5.120) satisfy the linearized equation of motion (4.69).\nThe asymptotic expansions of the remaining three spin zero modes, T I27 , T I35+ , T\nI35− , in\n(4.71) cannot be determined without having the explicit form of vector and tensor spherical\nharmonics. However, those spin zero modes are not needed for our purpose here for the\nfollowing reason. In AdS/CFT correspondence [2, 3], the mass m2 of a scalar field on the\ngravity side is related to the conformal dimension ∆ of the dual gauge invariant operator\nby\nm2R2AdSd+1 = ∆(∆− d). (5.122)\nIn our case (R2AdS4 =\nL2\n4\n), where L is the S7 radius, we have\nm2L2 = 2∆(2∆− 6). (5.123)\nThen the conformal dimensions of the gauge invariant operators, which are dual to the spin\nzero fields are as follows:\n• For the scalar field ΨI1 we have\nI1(I1 − 6) = 2∆(2∆− 6)⇒ ∆ = I1\n2\n, {I1 = 2, 4, 6, · · · }. (5.124)\n• For the scalar field ΦI1 we have\n(I1 + 12)(I1 + 6) = 2∆(2∆− 6)⇒ ∆ = I1 + 12\n2\n, {I1 = 0, 2, 4, · · · }. (5.125)\n27\n• For the scalar field T I27 we have\n(I27 + 6)I27 = 2∆(2∆− 6)⇒ ∆ = I27 + 6\n2\n, {I27 = 2, 4, 6 · · · }. (5.126)\n• For the pseudoscalar field T I35− we have\n(I35 + 3)(I35 − 3) = 2∆(2∆− 6)⇒ ∆ = I35 + 3\n2\n, {I35 = 1, 3, 5, · · · }. (5.127)\n• For the pseudoscalar field T I35+ we have\n(I35 + 9)(I35 + 3) = 2∆(2∆− 6)⇒ ∆ = I35 + 9\n2\n, {I35 = 1, 3, 5, · · · }. (5.128)\nIn the above list, T I35+ and T\nI35− are pseudoscalars and cannot be the candidates for the dual\nscalar fields of CPOs. In addition, if we are interested in CPOs of lower conformal dimensions\n∆ = 1, 2, · · · , then ΦI1 and T I27 are also not the candidates. The only scalar fields which\ncan be dual to CPOs with lower conformal dimensions are ΨI1, with I1 = 2, 4, · · · . For a\nsimilar reason we also skip the asymptotic expansion of the vector fields in subsection 4.5.2.\nThe asymptotic expansions of the spin two KK modes are needed to obtain the vev of\nthe energy-momentum tensor in mABJM theory. Following the same procedure as the spin\nzero modes, from (4.83) we obtain the asymptotic expansions of the spin two modes\nH2(µν) = O(µ30), H4(µν) = O(µ40). (5.129)\nAt µ0 order, we obtain a result which is consistent with the fact that the mABJM theory\nis a supersymmetric theory and the vev of the energy-momentum tensor is vanishing. Fur-\nthermore, if we go beyond the linear order, the spin two KK modes are modified by field\nredefinition (4.73) and the vev of energy-momentum tensor should still be vanishing.\n5.3 Comparison with field theory results\nAccording to the holographic renormalization procedure [5], the vev of a CPO with confor-\nmal dimension ∆ is determined by the coefficient φ(∆) of z\n∆ in the asymptotic expansion of\nof a dual gauge invariant scalar fields Φ on the gravity side, i.e.\n〈O(∆)〉m = N\n2\n√\nλ\nNφ(∆) (5.130)\nwhere N is a numerical number depending on the normalization of the dual scalar field in\n11-dimensional supergravity, and λ is defined as λ = N/k in the ABJM theory. In the case\nk = 1, the overall normalization in (5.130) is reduced to N\n3\n2 . The N2/\n√\nλ-dependence in the\n28\nright-hand side of (5.130) is a peculiar behavior of the normalization factor in holographic\ndual relation for the M2-brane theory [12, 34, 35].\nIn the pervious subsection, we have shown that only the scalar modes ΨI1 have non-\ntrivial asymptotic expansions at linear order in µ0. At quadratic order or higher, more of\nthe scalar modes as well as the spin two modes have non-trivial asymptotic expansions.\nOn the other hand, holographic renormalization states that the dual operators of these\nextra modes should have vanishing vevs. In order to reconcile these differences we need the\nfield redefinition [6] of the type (4.73) to obtain the correct 4-dimensional fields. The field\nredefinition makes the asymptotic expansions of all the fields trivial except for ΨI1. We have\nobtained the asymptotic expansion of the scalar field Ψ2 in (5.120) while the vev of the dual\noperator was calculated in the subsection 3.2. Using the gauge/gravity duality relation in\n(5.130) and setting k = 1, these two results are related as\n〈O(1)〉m = N\n2\n√\nλ\nNψ(1) = −24N\n2\n√\nλ\nN β3µ0. (5.131)\nIn order to fix the normalization factor N, we use the identity\n∞∑\nn=0\n[\nn(n + 1)(ln − l′n)\n]\n=\nN3/2\n3\nβ3, (5.132)\nwhich is proved in appendix C. Then using (3.23) we rewrite the duality relation (5.131) as\nµ\n4\n√\n2π\n∞∑\nn=0\n[\nn(n+ 1)(Nn −N ′n)\n]\n= −72Nµ0\n∞∑\nn=0\n[\nn(n+ 1)(ln − l′n)\n]\n. (5.133)\nNow recalling that µ = 4µ0 and using the one-to-one correspondence (2.15) between the\noccupation numbers of the vacua in mABJM theory and the discrete torsions in the LLM\ngeometries, the normalization factor is fixed as N = −\n√\n2\n144pi\n. Therefore, the vev of the CPO\nwith conformal dimension ∆ = 1 is given by\n〈O(1)〉m = N\n3\n2µ0\n3\n√\n2 π\nβ3. (5.134)\nIn Young-diagram picture, β3 depends on the shape of a Young-diagram but not on the\nsize of the diagram, which means it is independent of the number of M2-branes. The result\n(5.134) is obtained for all possible supersymmetric vacua with largeN in the mABJM theory.\nThe N\n3\n2 -dependence in the right-hand side of (5.134) exactly matches the N dependence\nof the 11-dimensional Newton’s constant [34], which is fixed by the Bekenstein-Hawking\nentropy formula. As it is expected by the holographic relation, this N\n3\n2 behavior also agrees\nwith the total number of degrees of freedom of the M2-brane theory in large N limit [35].\nThe extension of the above results to k 6= 1 case is not straightforward. We postpone\nsuch extension in most general setup to future work. Instead, here we extend the results for\n29\nthe LLM geometries with rectangular shaped Young-diagram representations. In this case\nthe droplet representation has only one finite size black strip i.e. NB = 1. The exact dual\nrelation is then given by\n〈O(1)〉m = N\n√\nkN˜µ0\n3\n√\n2π\nβ3 =\nN\n√\nNN˜µ0\n3\n√\n2π\n√\nλ\nβ3, (5.135)\nwhere N˜ = A/k with A defined in (5.86) and we have introduced the ’t Hooft coupling\nconstant λ = N/k in the ABJM theory. In the large N limit, N˜ is reduced to N in (5.135).\n6 Conclusion\nIn this paper, we have calculated the vevs of the CPO with conformal dimension ∆ = 1\nfrom all discrete supersymmetric vacua of mABJM theory as well as from the dual LLM\nsolutions of 11-dimensional supergravity and found an exact holographic relation between\nthe two results with k = 1 in the large N limit. Due to computational difficulties, we\ntreated the case k 6= 1 only for the LLM geometry with rectangular Young diagram. On the\nfield theory side, the vevs of CPOs are protected from quantum corrections due to the high\nsupersymmetry of the mABJM theory and as a result they are completely determined by\nthe supersymmetric vacuum solutions in the large N limit. The CPOs are given by single\ntraces of products of the complex scalar fields in the mABJM and their vevs are obtained\nby evaluating those traces at the discrete supersymmetric vacua, which are represented\nby the GRVV matrices. On the gravity side, the gauge invariant 4-dimensional scalar\nfields which are dual to the CPOs were obtained from the KK reduction of 11-dimensional\nsupergravity. We showed that the gauge invariant fields obtained from the KK reduction\nof the 11-dimensional LLM solutions satisfy the 4-dimensional equations of motion. The\nequations of motion are satisfied order by order when we expand in powers of the mass\nparameter µ0. This expansion coincides with the asymptotic expansion in the holographic\ncoordinate z from which we read the vevs of the dual gauge invariant operators. For the CPO\nwith ∆ = 1, the vevs are given by the first order terms in the µ0 expansion of the dual gauge\ninvariant scalar fields. We have also carried out this procedure for the energy-momentum\ntensor in mABJM theory and its vev is vanishing. This result is expected because the theory\nis supersymmetric.\nIt seems that the discrete Higgs vacua of the mABJM theory as well as the corresponding\nLLM geometries are parametrized by the vevs of CPOs. In other words, knowing the vevs\nof enough number of CPOs, one can fully determine the shape of the droplet picture of the\nLLM geometry and hence the discrete Higgs vacua of the mABJM theory. For instance, the\nshape of the droplet with NB = 1 is fixed by the value of the vevs of the CPO with ∆ = 1 as\n30\nfollows. As it was discussed in subsection 2.2 the shape of the droplet is fixed by the values\nof x˜i with i = 1, · · · , 2NB + 1. For NB = 1, the values of x˜1, x˜2, and x˜3 are determined\nby C1, C2, and C3. For our coordinate choice C1 = 0, C2 = 2 from the identity (5.87)\nwhile C3 is determined by the vevs of CPO with ∆ = 1. Therefore, the supersymmetric\nvacua corresponding to the droplet with NB = 1 are parametrized by the vevs of CPO with\n∆ = 1. This is a meaningful result because, if we can calculate the vevs of enough number\nof CPOs, it is possible to project out the supersymmetric vacua from the full set of classical\nHiggs vacua in the mABJM theory at a given NB. Those supersymmetric vacua are in\none-to-one correspondence with the half-BPS LLM solutions. Our quantitative results for\nthe gauge/gravity correspondence contains partition of N different cases. However, we need\nto accumulate more analytic evidences for CPOs with ∆ (≥ 2) and k (≥ 1) to completely\ndetermine the supersymmetric vacua at arbitrary NB. We leave these issues for future\nstudy [21].\nRecently, it is reported that for the mABJM theory on S3, there is no gravity dual for\nthe mass parameter larger than a critical mass value [36]. See also [37–39]. Though the\nsetup is different from ours, where the mABJM theory is defined on R2,1, it is intriguing to\ninvestigate the gravity dual for our case in the large mass region and compare the results\nwith those of mABJM theory on S3.\nAcknowledgements\nThis work was supported by the National Research Foundation of Korea(NRF) grant with\ngrant number NRF-2014R1A1A2057066 and NRF-2016R1D1A1B03931090 (Y.K.), and NRF-\n2014R1A1A2059761 (O.K.).\n31\nA Spherical Harmonics on S7\nThe spherical harmonics on S7 are defined as follows\n∇2Y I1 = ΛI1Y I1 = − 1\nL2\nI1(I1 + 6)Y\nI1 , Scalar,\n∇2Y I7a = ΛI7Y I7a = −\n1\nL2\n(I27 + 6I7 − 1)Y I7a , Vector,\n∇2Y I27(ab) = ΛI27Y I27(ab) = −\n1\nL2\n(I227 + 6I27 − 2)Y I27(ab), Symmetric 2− Tensor,\n∇2Y I21[ab] = ΛI21Y I21[ab] = −\n1\nL2\n(I221 + 6I21 − 2)Y I21[ab] , antiSymmetric 2− Tensor,\n∇2Y I35[abc] = ΛI35Y I35[abc] = −\n1\nL2\n(I235 + 6I35 − 3)Y I35[abc], antiSymmetric 3− Tensor,\n∇aY I7a = ∇aY I27(ab) = ∇aY I21[ab] = ∇aY I35[abc] = 0,\ngabY I27(ab) = g\nabY I21[ab] = g\nabY I35[abc] = 0. (A.136)\nHere, when we write Y In, the subscript n denotes the number of components of the spherical\nharmonics.\nA.1 Scalar Spherical Harmonics\nThe scalar spherical harmonics on S7 are the restriction of\nY I1 =\n1\nLI1\nCI1i1···iI1x\ni1 · · ·xiI1 (A.137)\nto a seven-sphere, where xi with (i = 1, · · · , 8) are the Cartesian coordinates of IR8 and the\ncoefficients CI1i1···iI1 are totally symmetric and traceless. In order to evaluate integrals which\nare quadratic or cubic in the scalar harmonics, we use the following general formula\n1\nω7\n∫\nS7\nxi1 · · ·xi2m = 3L\n2m\n2m−1(m+ 3)!\n(\nall possible pairing\n)\n, (A.138)\nwhere all possible pairing means, δi1i2 for m = 1 , (δi1i2δi3i4 + δi1i3δi2i4 + δi1i4δi2i3), for m = 2\nand a similar contraction for higher m.\nNow consider\n1\nω7\n∫\nS7\nY I1Y J1 =\n1\nω7LI1+J1\n∫\nS7\nCI1i1···iI1C\nJ1\nj1···jJ1x\ni1 · · ·xiI1xj1 · · ·xjJ1 , (A.139)\nwhere ω7 =\npi4\n3\nis the surface area of S7. Recalling that the CI1 are traceless and also that\nthe integral vanishes if any of the xi left un-paired, we note that we get a non-zero value\nonly when I1 = J1\n1\nω7\n∫\nS7\nY I1Y J1 =\n1\nω7L2I1\n∫\nS7\nCI1i1···iI1C\nJ1\nj1,···jJ1x\ni1 · · ·xiI1xj1 · · ·xjJ1\n=\n3\n2I1−1(I1 + 3)!\nCI1i1,···iI1C\nJ1\nj1···jJ1\n(\nall possible pairing\n)\n. (A.140)\n32\nBecause of the tracelessness of CI1 , when we sum over the sets of indices i and j, we get\ncontributions only from the terms in which the i indices are paired with the j indices. Those\ntypes of pairing result in a complete contraction of the CI1 and CJ1 indices and the total\nnumber of such terms is I1!. Therefore we get\n1\nω7\n∫\nS7\nY I1Y J1 =\n3I1!\n2I1−1(I1 + 3)!\n〈CI1CJ1〉, (A.141)\nwhere 〈CI1CJ1〉 = CI1i1···iI1C\nJ1\ni1···iI1 . Actually, we normalize the scalar harmonics such that\n〈CI1CJ1〉 = δI1J1. Expressions involving derivatives can be evaluated by using integration\nby parts.\nA.2 Vector Spherical Harmonics\nConsider a vector field in IR8\nY I7p =\n1\nLI7\nV I7p,i1···iI7x\ni1 · · ·xiI7 , p = 1, · · · 8 (A.142)\nwith V I7p traceless and totally symmetric in the i1, · · · , iI7 indices. It also satisfy xpY I7p = 0.5\nThe vector spherical harmonics Y I7a on S\n7 is defined as the component of such vector field\ntangent to the S7 with the xi are restricted to the sphere. This can be written as\nY I7a = eˆ\np\naY\nI7\np =\n1\nLI7\neˆpaV\nI7\np,i1···iI7x\ni1 · · ·xiI7 , a = 1, · · · , 7, (A.143)\nwhere eˆp is the unit vector along the xp Cartesian coordinates of IR8 and eˆpa is its projection\nonto the ath unit vector tangent to S7. Those projections are actually given by\neˆpa =\n∂xp\n∂θa\n, (A.144)\nwhere θa are the coordinates of S7. In order to evaluate the integrals involving those vector\nharmonics we use the following procedure. Lets consider∫\nS7\nVag\nabVb (A.145)\nfor any two vectors Va, Vb tangent to S\n7 and gab is the metric on S\n7. Using the definitions\nin (A.143) we can write ∫\nS7\nVag\nabVb =\n∫\nS7\nVpeˆ\np\nag\nabeˆqbVq. (A.146)\nNow we can make the following replacement\neˆpag\nabeˆqb = γ\npq = δpq − npnq, (A.147)\n5We will use the index notation where p, q, · · · are the IR8 indices and a, b, · · · are the S7 indices.\n33\nwhere np = x\np\nL\nare the eight components of the unit normal vector to S7. This relation can\neasily be verified by using the standard polar coordinates in IR8. Therefore we can write∫\nS7\nVag\nabVb =\n∫\nS7\nVp(δ\npq − npnq)Vq. (A.148)\nNow we can evaluate the integrals of the vector harmonics by using the above results and\nfollowing the same procedure as those of the scalar harmonics. Lets see few examples\n1\nω7\n∫\nS7\ngabY I7a Y\nJ7\nb =\n1\nω7LI7+J7\n∫\nS7\n(δpq − npnq)V I7p,i1···iI7V\nJ7\nq,j1···jI7x\ni1 · · ·xiI7xj1 · · ·xjI7 . (A.149)\nRecalling that xpY I7p = 0, the second piece is zero. In general we can drop the second\nterm in (A.147) if at least one of the two vectors involved is a vector spherical harmonics.\nTherefore we have\n1\nω7\n∫\nS7\ngabY I7a Y\nJ7\nb =\n1\nω7L2I7\n∫\nS7\nV I7p,i1···iI7V\nJ7\np,j1···jI7x\ni1 · · ·xiI7xj1 · · ·xjI7 = 3I7!\n2I7−1(I7 + 3)!\n〈V I7V J7〉.\n(A.150)\nTensor spherical harmonics are also treated using procedures similar to that of vector spher-\nical harmonics.\nA.3 Scalar spherical harmonics on S7 with SO(4)× SO(4) symme-\ntry\nIn dealing with scalar equations of motion, we mainly need the scalar spherical harmonics\nwhich satisfy the following harmonic equation(\n∇2 + I1(I1 + 6)\nL2\n)\nY I1 =\n(\n1√\ng\n∂a\n(√\nggab∂b\n)\n+\nI1(I1 + 6)\nL2\n)\nY I1 = 0, (A.151)\nwhere gab is the metric on S\n7. We introduce the following coordinate on S7\nds2S7 = L\n2\n(\ndθ2 + cos2θds2S3 + sin\n2θds2\nS˜3\n)\n. (A.152)\nIn obtaing the AdS4×S7 as asymptotic limit of LLM geometry we saw that the θ coordinate\nof S7 is related to the α coordinate of LLM as θ = α/2. Actually, it is better use the\ncoordinate τ = cosα. Then we have\nds2S7 = L\n2\n(\n1\n4(1− τ 2)dτ\n2 +\n1 + τ\n2\nds2S3 +\n1− τ\n2\nds2\nS˜3\n)\n. (A.153)\nImposing the SO(4) × SO(4) symmetry, the spherical harmonics depend only on the τ\ncoordinate, which implies(\n1√\ng\n∂a\n(√\nggab∂b\n)\n+\nI1(I1 + 6)\nL2\n)\nY I1 = 0 =⇒\n[\n(1− τ 2)∂2τ − 4τ∂τ +\nI1(I1 + 6)\n4\n]\nY I1(τ) = 0.\n34\nThis is the hypergeometric equation with the following two independent solutions\nY I1(τ) = N I1 2F1\n(\n−I1\n4\n,\nI1 + 6\n4\n,\n1\n2\n; τ 2\n)\n, Y I1(τ) = N I1 2F1\n(\n−I1 − 2\n4\n,\nI1 + 8\n4\n,\n3\n2\n; τ 2\n)\n.\n(A.154)\nFor I1 = 4i, (i = 0, 1, 2, · · · ), the first solution is a polynomial and the first few terms are\nY 0 = 1, Y 4 =\n1\n8\n√\n10\n(1− 5τ 2), · · · . (A.155)\nFor later convenience lets invert these relation and write the following\nτ 2 =\nY 0 − 8√10 Y 4\n5\n, · · · . (A.156)\nOn the other hand, for I1 = 4i+2, (i = 0, 1, 2, · · · ), the second solution is a polynomial and\nthe first few terms are\nY 2 =\n1\n2\n√\n2\nτ, · · · , (A.157)\nwhich gives\nτ = 2\n√\n2 Y 2, · · · . (A.158)\nA.4 CI1=2 and C(∆=1)\nIn subsection 3.1, we have stated the fact that the coefficients CI1i1···iI1 , which defines the\nscalar spherical harmonics in (A.137) are related to the coefficients C\n(∆)A1···An\nB1···Bn of the CPOs\nin (3.16). In this appendix, we determine these coefficients in the particular case of CPO\nwith conformal dimension ∆ = 1. First lets determine C2ij from (A.137) and (A.157). Since\nthe solution in (A.157) is obtained by imposing the SO(4)× SO(4) symmetry, we rewrite\nthe scalar harmonics in (A.137) in a form that manifests this symmetry\nY 2 =\n1\nL2\n( 4∑\ni,j=1\nC2ijx\nixj +\n8∑\ni,j=5\nC2ijx\nixj\n)\n, (A.159)\nwith the R8 coordinates restricted to S7 are written as follows\nx1 = L\n(1 + τ\n2\n) 1\n2\ncos\n(θ\n2\n)\ncos\n(φ+ ψ\n2\n)\n, x2 = L\n(1 + τ\n2\n) 1\n2\ncos\n(θ\n2\n)\nsin\n(φ+ ψ\n2\n)\n,\nx3 = −L\n(1 + τ\n2\n) 1\n2\nsin\n(θ\n2\n)\nsin\n(φ− ψ\n2\n)\n, x4 = L\n(1 + τ\n2\n) 1\n2\nsin\n(θ\n2\n)\ncos\n(φ− ψ\n2\n)\n,\nx5 = L\n(1− τ\n2\n) 1\n2\ncos\n( θ˜\n2\n)\ncos\n( φ˜+ ψ˜\n2\n)\n, x6 = L\n(1− τ\n2\n) 1\n2\ncos\n( θ˜\n2\n)\nsin\n( φ˜+ ψ˜\n2\n)\n,\nx7 = −L\n(1− τ\n2\n) 1\n2\nsin\n( θ˜\n2\n)\nsin\n( φ˜− ψ˜\n2\n)\n, x8 = L\n(1− τ\n2\n) 1\n2\nsin\n( θ˜\n2\n)\ncos\n( φ˜− ψ˜\n2\n)\n. (A.160)\n35\nFrom (A.157) we notice that Y 2 depends only on the τ coordinate of S7. Therefore, the\ndependence on the remaining S7 coordinates should disappear in (A.159). This requirement\ngives\nC211 = C\n2\n22 = C\n2\n33 = C\n2\n44, C\n2\n55 = C\n2\n66 = C\n2\n77 = C\n2\n88, C\n2\nij = 0, for i 6= j. (A.161)\nThe traceless condition (C2ijδ\nij = 0) implies C211 = −C255 while the orthonormality condition\ngives C211 =\n1\n2\n√\n2\n.\nIn order to determine the coefficients of the CPOs, C\n(1)A\nB , we need to rewrite the scalar\nspherical harmonics in terms of C4 coordinates as\nY 2 =\n1\nL2\n( 2∑\nA,B=1\nC\n(1)A\nB yAy\n∗B +\n4∑\nA,B=3\nC\n(1)A\nB yAy\n∗B\n)\n, (A.162)\nwhere the C4 coordinates are given by\ny1 = x1 + ix2, y2 = x3 + ix4, y3 = x5 + ix6, y4 = x7 + ix8. (A.163)\nComparing (A.159) and (A.162) we obtain\nC\n(1)1\n1 =\nC211 + C\n2\n22\n2\n=\n1\n2\n√\n2\n, C\n(1)2\n2 =\nC233 + C\n2\n44\n2\n=\n1\n2\n√\n2\n,\nC\n(1)3\n3 =\nC255 + C\n2\n66\n2\n= − 1\n2\n√\n2\n, C\n(1)4\n4 =\nC277 + C\n2\n88\n2\n= − 1\n2\n√\n2\n,\nC\n(1)A\nB = 0, for A 6= B. (A.164)\nHence the CPO of conformal dimension ∆ = 1 is given by (3.18).\nB Asymptotic Expansions\nIn this appendix, we display the asymptotic expansion for the warp factors gi(z, τ) in (5.92)\nas well as for the various components of the 4-form field strength Fpqrs in (2.12) using the\nFG coordinates defined in (5.90). The expansion can be done to any desirable higher order\nbut we keep only up to µ20 for our purpose. Applying the ansatze (5.94) to the defining\nfunctions Z(ρ, ξ) and V (ρ, ξ) in (5.85), we obtain the following asymptotic expansions for\n36\nthe warp factors in FG coordinate system,\ng1(z, τ) =\nL2\n4z2\n[\n1− µ0z\n√\n2(2C31 − 3C2C1 + C3)τ\n3\n− (µ0z)\n2\n144\n(\n8C61 − 24C2C41 − 28C3C31 + 9\n(\n5C22 + 3C4\n)\nC21 − 12C2C3C1\n− 9C32 + 20C23 − 27C2C4\n)\n− (µ0z)\n2\n144\n(\n28C61 − 84C2C41 + 28C3C31 + 9\n(\n7C22 − 15C4\n)\nC21 + 228C2C3C1\n− 135C32 − 128C23 + 135C2C4\n)\nτ 2 + · · ·\n]\n,\ng2(z, τ) =\nL2\n4(1− τ 2)\n[\n1\n+\n(µ0z)\n2\n48\n(\n− 12C61 + 36C2C41 + 4C3C31 − 3\n(\n13C22 + 3C4\n)\nC21 + 12C2C3C1\n+ 7C32 − 8C23 + 9C2C4\n)\n+ · · ·\n]\n,\ng3(z, τ) =\nL2\n2\n(1 + τ)\n[\n1 + µ0z\n(2C31 − 3C2C1 + C3)(1 + τ)\n3\n√\n2\n+\n(µ0z)\n2\n72\n(\n8C61 − 24C2C41 − 4C3C31 + 9\n(\n3C22 + C4\n)\nC21 − 12C2C3C1\n− 3C32 + 8C23 − 9C2C4\n)\n+\n(µ0z)\n2\n96\n(\n76C61 − 228C2C41 + 28C3C31 + 3\n(\n69C22 − 5C4\n)\nC21 − 12C2C3C1\n− 63C32 − 8C23 + 15C2C4\n)\nτ\n+\n(µ0z)\n2\n288\n(\n124C61 − 372C2C41 + 124C3C31 + 9\n(\n31C22 − 15C4\n)\nC21 + 84C2C3C1\n− 135C32 − 104C23 + 135C2C4\n)\nτ 2 + · · ·\n]\n,\n37\ng4(z, τ) =\nL2\n2\n(1− τ)\n[\n1− µ0z (2C\n3\n1 − 3C2C1 + C3)(1− τ)\n3\n√\n2\n+\n(µ0z)\n2\n72\n(\n8C61 − 24C2C41 − 4C3C31 + 9\n(\n3C22 + C4\n)\nC21 − 12C2C3C1\n− 3C32 + 8C23 − 9C2C4\n)\n− (µ0z)\n2\n96\n(\n76C61 − 228C2C41 + 28C3C31 + 3\n(\n69C22 − 5C4\n)\nC21 − 12C2C3C1\n− 63C32 − 8C23 + 15C2C4\n)\nτ\n+\n(µ0z)\n2\n288\n(\n124C61 − 372C2C41 + 124C3C31 + 9\n(\n31C22 − 15C4\n)\nC21 + 84C2C3C1\n− 135C32 − 104C23 + 135C2C4\n)\nτ 2 + · · ·\n]\n.\nThe expansion for the components of the 4-form field strength are also obtained in the same\nmanner\nFtw1w2z(z, τ) = −\n3L3\n8z4\n[\n1− µ0z\n√\n2(2C31 − 3C2C1 + C3)τ\n3\n+\n(µ0z)\n2\n288\n(\n16C61 − 48C2C41 + 28C3C31 + 27\n(\nC22 − C4\n)\nC21 + 12C2C3C1\n− 15C32 − 20C23 + 27C2C4\n)\n+\n(µ0z)\n2\n288\n(\n4C61 − 12C2C41 + 4C3C31 + 9\n(\nC22 + 15C4\n)\nC21 − 276C2C3C1\n+ 135C32 + 136C\n2\n3 − 135C2C4\n)\nτ 2 + · · ·\n]\n,\nFtw1w2τ (z, τ) = −\nL3\n8z3\n[\nµ0z\n(2C31 − 3C2C1 + C3)√\n2\n− (µ0z)\n2\n48\n(\n4C61 − 12C2C41 + 4C3C31 + 9\n(\nC22 + 15C4\n)\nC21 − 276C2C3C1\n+ 135C32 + 136C\n2\n3 − 135C2C4\n)\nτ + · · ·\n]\n,\nFθφψz(z, τ) = −L\n3\n8z\n(1 + τ)2 sin θ\n[\nµ0z +\n(µ0z)\n2\n3\n√\n2\n(\n2C31 − 3C2C1 + C3\n)\n(1 + 6τ) + · · ·\n]\n,\nFθφψτ (z, τ) = −L\n3\n4\n(1 + τ) sin θ\n[\nµ0z +\n(µ0z)\n2\n6\n√\n2\n(\n2C31 − 3C2C1 + C3\n)\n(4 + 9τ) + · · ·\n]\n,\nFθ˜φ˜ψ˜z(z, τ) = −\nL3\n8z\n(1− τ)2 sin θ˜\n[\nµ0z − (µ0z)\n2\n3\n√\n2\n(\n2C31 − 3C2C1 + C3\n)\n(1− 6τ) + · · ·\n]\n,\nFθ˜φ˜ψ˜τ (z, τ) =\nL3\n4\n(1− τ) sin θ˜\n[\nµ0z − (µ0z)\n2\n6\n√\n2\n(\n2C31 − 3C2C1 + C3\n)\n(4− 9τ) + · · ·\n]\n.\n38\nC Proof of (5.132)\nIn this section we prove the relation (5.132). We start from the definition of C1\nC1 =\n1√\nN\n2NB+1∑\ni=1\n(−1)i+1mi, (C.165)\nwhere we have introduced the integers mi =\nx˜i\n2pil3\nP\nµ0\n. Separating the even and odd terms we\nrewrite C1 as\nC1 =\n1√\nN\n[\nm1 +\nNB∑\ni=1\n(m2i+1 −m2i)\n]\n=\n1\n2πl3Pµ0\n√\nN\n[\nx˜1 +\nNB∑\ni=1\n(x˜2i+1 − x˜2i)\n]\n. (C.166)\nThe term in the square bracket is the position of the Fermi level defined in (2.14). Here we\nchoose a coordinate system in which the zero of the x˜-coordinate is at the position of the\nFermi level i.e., x˜F = 0 and hence C1 = 0.\nWith the above choice of coordinate system, we notice that the β3 on the right hand\nside of (5.132) is equal to C3. However, for convenience we add\nC1\nN\nand write it as\nβ3 = −\n(\nC1\nN\n− C3\n)\n= − 1\nN3/2\n2NB+1∑\ni=1\n(−1)i+1(mi −m3i ). (C.167)\nWithout loss of generality, we choose a droplet in which the Fermi level lies in the black\nregion. See Fig.1. Then we can write β3 as\nN3/2β3 = −\n2j∑\ni=1\n(−1)i+1(mi −m3i )−\n2NB+1∑\ni=2j+1\n(−1)i+1(mi −m3i ), (C.168)\nwhere m2j is the position of the first boundary just below the Fermi level while m2j+1 is the\nposition of the first boundary just above the Fermi level. Since the Fermi level is at zero,\nwe can rewrite the above equation as\nN3/2β3 =\n2j∑\ni=1\n(−1)i+1(|mi| − |mi|3)−\n2NB+1∑\ni=2j+1\n(−1)i+1(|mi| − |mi|3). (C.169)\nUsing the relation\n|mi|−1∑\nn=0\nn(n + 1) = −1\n3\n(|mi| − |mi|3), (C.170)\nwe obtain\nN3/2\n3\nβ3 =\n[\n−\n2j∑\ni=1\n|mi|−1∑\nn=0\n+\n2NB+1∑\ni=2j+1\n|mi|−1∑\nn=0\n]\n(−1)i+1n(n+ 1). (C.171)\n39\nNoting that for the first double summation, mi’s are negative while they are positive for the\nsecond double summation, we write\nN3/2\n3\nβ3 =\n[\n−\n2j∑\ni=1\n−mi−1∑\nn=0\n+\n2NB+1∑\ni=2j+1\nmi−1∑\nn=0\n]\n(−1)i+1n(n+ 1). (C.172)\nNext lets expand the summations over i, which gives\nN3/2\n3\nβ3 =−\n[ −m1−1∑\nn=0\n−\n−m2−1∑\nn=0\n+ · · ·+\n−m2j−1−1∑\nn=0\n−\n−m2j−1∑\nn=0\n]\nn(n + 1)\n+\n[m2j+1−1∑\nn=0\n−\nm2j+2−1∑\nn=0\n+\nm2j+3−1∑\nn=0\n+ · · · −\nm2NB−1∑\nn=0\n+\nm2NB+1−1∑\nn=0\n]\nn(n+ 1). (C.173)\nWe combine the summations in each square brackets pair by pair, leaving the first term in\nthe second square bracket unpaired, to obtain\nN3/2\n3\nβ3 =−\n[ −m1−1∑\nn=−m2\n+\n−m3−1∑\nn=−m4\n+ · · ·+\n−m2j−1−1∑\nn=−m2j\n]\nn(n + 1)\n+\n[m2j+1−1∑\nn=0\n+\nm2j+3−1∑\nn=m2j+2\n+ · · ·+\nm2NB+1−1∑\nn=m2NB\n]\nn(n+ 1). (C.174)\nWe note that the summations in the first square bracket cover the white regions below the\nFermi level, while the summations in the second square bracket cover the black regions\nabove the Fermi level. However, we recall that in the k = 1 case, the occupation numbers\nln = 1 for the n\nth excitation level located in a black region above the Fermi level while ln = 0\nfor the nth excitation level located in a white region above the Fermi level. Similarly, the\noccupation numbers l′n = 1 for the n\nth excitation level located in a white region below the\nFermi level while l′n = 0 for the n\nth excitation level located in a black region below the Fermi\nlevel. Therefore, we can write the summations in first square bracket as summation over\nthe entire region below the Fermi level by introducing l′n and also second square bracket as\nsummation over the entire region above the Fermi level by introducing ln. Then we obtain\nN3/2\n3\nβ3 =\n∞∑\nn=0\n[\nn(n + 1)(ln − l′n)\n]\n, (C.175)\nwhich is what we have in (5.132).\nReferences\n[1] J. M. Maldacena, “The Large N limit of superconformal field theories and Int. J. Theor.\nPhys. 38, 1113 (1999) [Adv. Theor. Math. Phys. 2, 231 (1998)] [hep-th/9711200].\n40\n[2] S. S. Gubser, I. R. Klebanov and A. M. Polyakov, “Gauge theory correlators from\nnoncritical string theory,” Phys. Lett. B 428, 105 (1998) [hep-th/9802109].\n[3] E. Witten, “Anti-de Sitter space and holography,” Adv. Theor. Math. Phys. 2, 253\n(1998) [hep-th/9802150].\n[4] I. R. Klebanov and E. Witten, “AdS / CFT correspondence and symmetry breaking,”\nNucl. Phys. B 556, 89 (1999) [hep-th/9905104].\n[5] M. Henningson and K. Skenderis, “The Holographic Weyl anomaly,” JHEP 9807, 023\n(1998) [hep-th/9806087]; V. Balasubramanian and P. Kraus, “A Stress tensor for Anti-\nde Sitter gravity,” Commun. Math. Phys. 208, 413 (1999) [hep-th/9902121]; J. de\nBoer, E. P. Verlinde and H. L. Verlinde, “On the holographic renormalization group,”\nJHEP 0008, 003 (2000) [hep-th/9912012]; P. Kraus, F. Larsen and R. Siebelink, “The\ngravitational action in asymptotically AdS and flat space-times,” Nucl. Phys. B 563,\n259 (1999) [hep-th/9906127]; S. de Haro, S. N. Solodukhin and K. Skenderis, “Holo-\ngraphic reconstruction of space-time and renormalization in the AdS / CFT corre-\nspondence,” Commun. Math. Phys. 217, 595 (2001) [hep-th/0002230]; M. Bianchi,\nD. Z. Freedman and K. Skenderis, “How to go with an RG flow,” JHEP 0108, 041\n(2001) [hep-th/0105276]; D. Martelli and W. Mueck, “Holographic renormalization\nand Ward identities with the Hamilton-Jacobi method,” Nucl. Phys. B 654, 248 (2003)\n[hep-th/0205061]; K. Skenderis, “Lecture notes on holographic renormalization,” Class.\nQuant. Grav. 19, 5849 (2002) [hep-th/0209067].\n[6] K. Skenderis and M. Taylor, “Kaluza-Klein holography,” JHEP 0605, 057 (2006)\n[hep-th/0603016].\n[7] K. Skenderis and M. Taylor, “Holographic Coulomb branch vevs,” JHEP 0608, 001\n(2006) [hep-th/0604169].\n[8] K. Skenderis and M. Taylor, “Anatomy of bubbling solutions,” JHEP 0709, 019 (2007)\n[arXiv:0706.0216 [hep-th]].\n[9] D. Jang, Y. Kim, O. K. Kwon and D. D. Tolla, “Exact Holography of the Mass-deformed\nM2-brane Theory at Finite N ,” arXiv:1610.01490 [hep-th].\n[10] K. Hosomichi, K. M. Lee, S. Lee, S. Lee and J. Park, “N=5,6 Superconfor-\nmal Chern-Simons Theories and M2-branes on Orbifolds,” JHEP 0809, 002 (2008)\n[arXiv:0806.4977 [hep-th]].\n[11] J. Gomis, D. Rodriguez-Gomez, M. Van Raamsdonk and H. Verlinde, “A Massive Study\nof M2-brane Proposals,” JHEP 0809, 113 (2008) [arXiv:0807.1074 [hep-th]].\n41\n[12] O. Aharony, O. Bergman, D. L. Jafferis and J. Maldacena, “N=6 superconformal Chern-\nSimons-matter theories, M2-branes and their gravity duals,” JHEP 0810, 091 (2008)\n[arXiv:0806.1218 [hep-th]].\n[13] I. Bena and N. P. Warner, “A Harmonic family of dielectric flow solutions with maximal\nsupersymmetry,” JHEP 0412, 021 (2004) [hep-th/0406145].\n[14] H. Lin, O. Lunin and J. M. Maldacena, “Bubbling AdS space and 1/2 BPS geometries,”\nJHEP 0410, 025 (2004) [hep-th/0409174].\n[15] H. C. Kim and S. Kim, “Supersymmetric vacua of mass-deformed M2-brane theory,”\nNucl. Phys. B 839, 96 (2010) [arXiv:1001.3153 [hep-th]].\n[16] S. Cheon, H. C. Kim and S. Kim, “Holography of mass-deformed M2-branes,”\narXiv:1101.1101 [hep-th].\n[17] A. Hashimoto, “Comments on domain walls in holographic duals of mass deformed\nconformal field theories,” JHEP 1107, 031 (2011) [arXiv:1105.3687 [hep-th]].\n[18] O. K. Kwon and D. D. Tolla, “On the Vacua of Mass-deformed Gaiotto-Tomasiello\nTheories,” JHEP 1108, 043 (2011) [arXiv:1106.3700 [hep-th]]; Y. Kim, O. K. Kwon and\nD. D. Tolla, “Mass-Deformed Super Yang-Mills Theories from M2-Branes with Flux,”\nJHEP 1109, 077 (2011) [arXiv:1106.3866 [hep-th]]; “Partially Supersymmetric ABJM\nTheory with Flux,” JHEP 1211, 169 (2012) [arXiv:1209.5817 [hep-th]]; Y. H. Hyun,\nY. Kim, O. K. Kwon and D. D. Tolla, “Abelian Projections of the Mass-deformed\nABJM theory and Weakly Curved Dual Geometry,” Phys. Rev. D 87, no. 8, 085011\n(2013) [arXiv:1301.0518 [hep-th]].\n[19] S. Massai, G. Pasini and A. Puhm, “Metastability in Bubbling AdS Space,” JHEP\n1502, 138 (2015) [arXiv:1407.6007 [hep-th]].\n[20] B. Biran, A. Casher, F. Englert, M. Rooman and P. Spindel, “The Fluctuating Seven\nSphere in Eleven-dimensional Supergravity,” Phys. Lett. B 134, 179 (1984); A. Casher,\nF. Englert, H. Nicolai and M. Rooman, “The Mass Spectrum of Supergravity on the\nRound Seven Sphere,” Nucl. Phys. B 243, 173 (1984).\n[21] D. Jang, Y. Kim, O-K. Kwon, D. D. Tolla, work in progress.\n[22] S. Lee, S. Minwalla, M. Rangamani and N. Seiberg, “Three point functions of chiral\noperators in D = 4, N=4 SYM at large N,” Adv. Theor. Math. Phys. 2, 697 (1998)\n[hep-th/9806074].\n42\n[23] G. Arutyunov and S. Frolov, “Some cubic couplings in type IIB supergravity on AdS(5)\nx S**5 and three point functions in SYM(4) at large N,” Phys. Rev. D 61, 064009 (2000)\n[hep-th/9907085].\n[24] S. Lee, “AdS(5) / CFT(4) four point functions of chiral primary operators: Cubic\nvertices,” Nucl. Phys. B 563, 349 (1999) [hep-th/9907108].\n[25] R. Auzzi and S. P. Kumar, “Non-Abelian Vortices at Weak and Strong Coupling in\nMass Deformed ABJM Theory,” JHEP 0910, 071 (2009) [arXiv:0906.2366 [hep-th]].\n[26] K. K. Kim, O. K. Kwon, C. Park and H. Shin, “Renormalized Entanglement En-\ntropy Flow in Mass-deformed ABJM Theory,” Phys. Rev. D 90, no. 4, 046006 (2014)\n[arXiv:1404.1044 [hep-th]]; “Holographic entanglement entropy of mass-deformed\nAharony-Bergman-Jafferis-Maldacena theory,” Phys. Rev. D 90, no. 12, 126003 (2014)\n[arXiv:1407.6511 [hep-th]].\n[27] C. Kim, K. K. Kim and O. K. Kwon, “Holographic Entanglement Entropy of\nAnisotropic Minimal Surfaces in LLM Geometries,” Phys. Lett. B 759, 395 (2016)\n[arXiv:1605.00849 [hep-th]].\n[28] P. Kraus, F. Larsen and S. P. Trivedi, “The Coulomb branch of gauge theory from\nrotating branes,” JHEP 9903, 003 (1999) [hep-th/9811120].\n[29] E. Witten, “Multitrace operators, boundary conditions, and AdS / CFT correspon-\ndence,” hep-th/0112258.\n[30] M. Berkooz, A. Sever and A. Shomer, “’Double trace’ deformations, boundary con-\nditions and space-time singularities,” JHEP 0205, 034 (2002) doi:10.1088/1126-\n6708/2002/05/034 [hep-th/0112264].\n[31] S. S. Gubser and I. R. Klebanov, “A Universal result on central charges in the pres-\nence of double trace deformations,” Nucl. Phys. B 656, 23 (2003) doi:10.1016/S0550-\n3213(03)00056-7 [hep-th/0212138].\n[32] H. J. Kim, L. J. Romans and P. van Nieuwenhuizen, “The Mass Spectrum of Chiral\nN=2 D=10 Supergravity on S**5,” Phys. Rev. D 32, 389 (1985).\n[33] C. Fefferman and C. Robin Graham, Conformal Invariants, in Elie Cartan et les Math-\nematiques daujourdhui, Asterisque, 1985, page 95.\n[34] I. R. Klebanov and A. A. Tseytlin, “Entropy of near extremal black p-branes,” Nucl.\nPhys. B 475, 164 (1996) [hep-th/9604089].\n43\n[35] N. Drukker, M. Marino and P. Putrov, “From weak to strong coupling in ABJM theory,”\nCommun. Math. Phys. 306, 511 (2011) [arXiv:1007.3837 [hep-th]].\n[36] T. Nosaka, K. Shimizu and S. Terashima, “Mass Deformed ABJM Theory on Three\nSphere in Large N limit,” arXiv:1608.02654 [hep-th].\n[37] L. Anderson and K. Zarembo, “Quantum Phase Transitions in Mass-Deformed ABJM\nMatrix Model,” JHEP 1409, 021 (2014) [arXiv:1406.3366 [hep-th]].\n[38] L. Anderson and J. G. Russo, “ABJM Theory with mass and FI deformations and\nQuantum Phase Transitions,” JHEP 1505, 064 (2015) [arXiv:1502.06828 [hep-th]].\n[39] T. Nosaka, K. Shimizu and S. Terashima, “Large N behavior of mass deformed ABJM\ntheory,” JHEP 1603, 063 (2016) [arXiv:1512.00249 [hep-th]].\n44\n",
    "Link": "http://arxiv.org/abs/1612.05066"
}