{
    "Title": "Ajuvant effect of a Synthetic Aluminium - Magnesium Silicate on chloroquine phosphate, against Plasmodium berghei.",
    "Authors": "Augustine Ngene, madike ezeibe, nnenna elendu-eleke, obianuju obianuju Okoroafor",
    "Year": "No year available",
    "Abstract": "Abstract effect of a synthetic Aluminium - Magnesium Silicate (AMS) on antiplasmodial activity of chloroquine was tested. Plasmodium berghei-infected mice were treated with 7 mg/kg, 5 mg/kg and 3 mg/kg chloroquine, respectively. The two subgroups in each experiment were treated with chloroquine alone and with chloroquine in AMS respectively. Parasitaemia (%) of the group treated with 7 mg/kg was higher than that of the control. At 5 mg/kg, chloroquine treatment significantly reduced parasitaemia from 3.60 to 2.46 (P =0.01). Incorporating chloroquine in AMS significantly improved its ability to reduce P. berghei parasitaemia at 5 mgkg and at 3 mg/kg, from 2.46 0.21 to 1.57 0.25 (P = 0.01) and from 3.82 0.06 to 2.12 0.08 (P =0.01 ). It also increased mortality of mice treated at 7 mg/kg from 20 to 80 %",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Ajuvant effect of a  Synthetic  Aluminium – Magnesium Silicate on  \nchloroquine phosphate, against Plasmodium berghei. \n \n* Ezeibe Maduike, Elendu – Eleke  Nnenna, Okoroafor  Obianuju and Ngene Augustine \n                                      Department of Veterinary Medicine, \n                                               University of Nigeria, \n                                                          Nsukka. \n*Corresponding authur maduikeezeibe@yahoo.com \n \nAbstract \n Effect of a synthetic Aluminium – Magnesium Silicate (AMS) on antiplasmodial  activity of \nchloroquine was tested.Plasmodium berghei infected mice  were treated with  7 mg/ kg, 5 mg / \nkg and 3 mg / kg chloroquine, respectively.Subgroups in each experiment were treated with \nchloroquine alone and with chloroquine  in  AMS.Parasitaemia (%)  of the group treated with  7 \nmg / kg was higher than that of the control.At 5 mg / kg, chloroquine treatment reduced \nparasitaemia from 3.60  to 2.46  (P =   ).Incorporating chloroquine in  AMS \nimproved its ability to reduce P.berghei  parasitaemia at 5 mg /kg and at 3 mg / kg, from  2.46  \n0.21 to 1.57 0.25 (P = ) and from  3.82  0.06 to 2.12 0.08 (P = ). It also increased mortality \nof mice treated at 7 mg / kg from 20  to 80 % (P =   ). \n \nKey words: Antiplasmodial resistance, chloroquine toxicity, Aluminium – Magnesium Silicate, \nchloroquine phosphate. \n \nBackground. \n \nProtozoan parasites of the genus plasmodium are causative agents of malaria1, 2. Malaria is a \nzoonotic disease , affecting man, zoo primates, avian species and rodents3,4. It has also been \nreported that when species of plasmodium which infect animals were passaged in human \nvolunteers they produced malaria in man5. \n \nIn humans, malaria is cause of between one to three million deaths in sub saharan Africa every \nyear 6.Malaria is not only an effect of poverty it is also a cause of poverty7.To combat malaria, \nmost countries in Africa spend upto 40 % of their public health budget on the disease annually8. \nChloroquine is one of the drugs of choice for prevention and treatment of malaria in the \ndeveloping countries,because, it is cheap and effective9.However, in recent times cases of \nresistance to chloroquine by malaria parasites have been reported10. Need therefore exists to \nsearch for drugs to combine with chloroquine to improve its efficacy and still retain its low cost. \nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \nhd\nl:1\n01\n01\n/n\npr\ne.\n20\n12\n.6\n74\n9.\n1 \n: P\nos\nte\nd \n2 \nJa\nn \n20\n12\nAluminium – Magnesium Silicate (AMS) is cheap. It is also safe to combine with drugs for \ntreatment of man and animals11. When in solution its molecules form three dimentional \ncolloidal structures round molecules of any drug it is combined with. By that mechanism, AMS \nstabilizes other drugs . To stabilize means to protect the drugs from destruction . AMS may thus \nprotect chloroquine from being rapidly degraded by metabolic processes. This will retain high \nconcentration of chloroquine in blood of treated animals for a long time.  When high \nconcentrations of drugs are retained in blood for a long time, actions of such drugs are \nimproved12.  By incorporating piperazine and sulphadimidin in the synthetic AMS their activity \nagainst Helignosomoides barkeri and Eimeria spp respectively, were improved13,14. A formulation \nof 20 %  chloroquine phosphate in a synthetic Aluminium – Magnesium Silicate was therefore \nmade  to test if  the AMS would improve its antiplasmodial activity. \n \nSummary of Methods \nThirty five mice were infected by innoculating each mouse with 1 ml of blood which contained 2 \n105  parasitized Red Blood Cells. Ten days post infection (PI), they were divided into three \nexperimental groups of 10 mice each. A group of five of the P. berghei infected mice was left \nuntreated to serve as control. Each experimental group was subdivided into two, each of five \nmice . The experiments were done with chloroquine phosphate at 7 mg / kg, 5 mg /kg and 3 mg \n/ kg respectively. The two groups in each experiment were treated with  chloroquine phosphate \nalone and with  a drug formulation of 20 % chloroquine phosphate in the synthetic AMS \nrespectively.Chloroquine treatment was administered per os, daily for five days in each \nexperiment.   \n \nA day post treatment (PT), percentage parasitaemia,rectal temperature,total Red Blood Cell \n(RBC) count and Heamoglobin concentration (Hb) were determined for each mouse in the  six \ntreated  groups and control .This was repeated one week, two weeks and three weeks  PT. Mean \nvalues for each group were recorded as the group`s weekly values. \n \nFindings \n \n Four  mice (80 %)  and one mouse (20 % ) of the groups  treated with 7 mg / kg chloroquine in \nAMS and 7 mg / kg chloroquine alone respectively, died between 7 to 14 days PT.Incorporating \nchloroquine phosphate in the AMS significantly improved its ability to reduce  P. berghei mean \npercentage parasitaemia at 5 mg / kg and 3 mg / kg dose levels, from  2.46 0.21 to 1.57  0.25 \n(P =  ) and from 3.82  0.06 to 2.12 0.08 ( P = ) . Percentage mean  parasitaemia, 4.15  0.26 \nof the group treated with 7 mg / kg chloroquine phosphate alone, was higher than 3.60  0.22 \nof the control ( P = ).  \n \nMean Hb of 12.95 0.25 ,12.25  0.27  and 12.68  0.18 of the groups treated with 7 mg / kg \nchloroquine alone, 5 mg / kg chloroquine alone and 5 mg / kg chloroquine in AMS respectively, \nwere higher (P = ) than  10.18  3.00  got in the group treated with 3 mg / kg chloroquine alone. \nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \nhd\nl:1\n01\n01\n/n\npr\ne.\n20\n12\n.6\n74\n9.\n1 \n: P\nos\nte\nd \n2 \nJa\nn \n20\n12\nAlso, RBC counts of  95.19 2.81 , 92.91  4.01 and 95.23  5.32  of the groups treated with 7 \nmg / kg chloroquine phosphate alone,  5 mg / kg chloroquine phosphate in the AMS and 3 mg / \nkg chloroquine phosphate in AMS respectively, were higher (P = ) than 88.99 5.72 of the group \ntreated with  5 mg / kg chloroquine alone . They were also more significantly ( P = ) higher than \n63.39  8.02 of the group treated with 3 mg / kg chloroquine alone. \n \nMean rectal temperature,35.56  0.82   and 35.73   0.38 of the groups treated with 5 mg / \nkg chloroquine alone and 5 mg / kg chloroquine in AMS respectively, were significantly (P = ) \nlower than 36.84 0.32  , 36.84 0.23  and 36.16 0.35 got in the groups treated with 7 \nmg / kg chloroquine alone, 3 mg / kg chloroquine in AMS and in the control respectively.  Effect \nof the synthetic AMS on ability of chloroquine phosphate to reduce P. berghei parasitaemia is as \nin table 1. \n \nDiscussion \n                 Treatment with chloroquine in AMS reduced P.berghei parasitaemia,  significantly, more than \ntreatment with chloroquine alone. Vanderbilt11 reported that AMS is a stabilizing agent.The three \ndimentional colloidal structures it forms round molecules of active drugs protect them from degradation \nby metabolic processes. The synthetic AMS may have protected chloroquine from being rapidly \ndegraded  in blood of the treated mice. Retention of high concentrations of chloroquine in  blood of the \nmice for longer time may have led to  the significant reduction in parasitaemia. \n Dose of chloroquine usually employed in treatment of malaria in humans, is 7 mg / kg but in this \nexperiment,  mice treated with that dose had apparently higher parasitaemia than the untreated \ngroup.This may have been due to chloroquine toxicity. Chloroquine inhibits uptake of iron and destroys \nplasmodium infected Rbcs15,16 . Chloroquine toxicity also, results in immunosupression17 and it has no \neffect on parasites in tissues. Plasmodial parasites in tissues return to blood  once concentration of the \ndrug in blood falls16. In immunosupressed animals, parasites that return to blood could have  rapid \nmultiplication. So, the high parasitaemia in the  group treated with 7 mg /kg chloroquine alone, may be \ndue to  chloroquine toxicity. There was no mortality in the group of untreated mice . So, the deaths \nrecorded in the two groups treated at chloroquine dose of 7 mg / kg may  also be due to  chloroquine \ntoxicity. The 20 % mortality of the group treated with chloroquine alone is significantly lower than 80 % \nmortality of the chloroquine in AMS group. This, also,  suggests that the AMS potentiated action of  \nchloroquine. \n \n Wellem10 reported that it is necessary to include supportive treatments, such as iron and vitamines to \nmalarial therapy for effective treatment. None  inclusion of these surpotive treatments in the \nexperiments may be responsible for the high parasitaemia  and mortalities recorded when chloroquine \nwas used at dose of 7mg / kg. \n \nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \nhd\nl:1\n01\n01\n/n\npr\ne.\n20\n12\n.6\n74\n9.\n1 \n: P\nos\nte\nd \n2 \nJa\nn \n20\n12\nRBC counts and Hb values of the groups of mice treated  with 7 mg / kg chloroquine alone, 5 mg / kg \nchloroquine in AMS and  3 mg / kg chloroquine in AMS  were high, indicating that the mice had no \nanaemia but the group treated with  5 mg / kg chloroquine alone and the control had slight anaemia. \nAnaemia was more pronounced in the group treated with 3 mg / kg chloroquine alone.  Both \nchloroquine toxicity and malaria cause anaemia15,18 . So, anaemia  of the groups treated with 5 mg / kg \nchloroquine alone and  3 mg / kg chloroquine alone, may be a result of ineffective treatment of the \nplasmodial infections. High mean rectal temperature got in the  group treated with  3 mg / kg \nchloriquine alone  may also be due to same reason. In the experiment with 5 mg / kg, the low \nparasitaemia achieved and the lower dose of chloroquine used may be responsible for absence of \nanaemia and fever in the two groups. \nThe control group had only slight reduction in RBC count and in Hb. This finding agrees with report of  \nCarter and Diggs19 that plasmodiun infection in rats and mice does not produce serious clinical disease.  \nIt has therefore been concluded that use of  chloroquine at dose of  5 mg / kg in  drug formulation of \nchloroquine and AMS may achieve better antiplasmodial action and  reduce chloroqune toxicity that \noccured even at the 7 mg / kg which is  presently being recomended. Supportive treatment with iron \nand vitamines may improve  treatment of malaria with chloroquine further. \nReferences \n1.Singh, B.,Kim-Sung,L and Matusop, A (2004). A large focus of naturally acquired plasmodium knowlesi \ninfection in humanbeings. Lancet. 363(9414) :1017 – 24. \n2.Mueller,I, Zimmerman, P. A and Reeder,J. C. (2007).Plasmodium malria and Plasmodium ovale – \n“bashful  malaria parasite”.Trends parasitol 23(6) :278 -83. \n3. Vincke,I. H and  Lips, M. (1948). Plasmodium berghei . Annales de la societe Belge de medecine \ntropical 28 :97 – 104. \n4.Escalante,A. and  Ayala,F. (1994).”Phylogeny of the Malarial genus plasmodium,derived from Rna gene \nsequences” .Proc Natl Acad,Sci USA 91(24) : 11373 – 71. \n5. Collins, W. E. and Aikawa, M.(1977).Plasmodia of non-human primates. In: Kreier J.P;ed. Parasitic \nProtozoa. N. Y. Academic Press. \n6.Snow,R. W., Querra, C. A.,Noor,A. M.,Myint, H. Y. And Hay, S. I. (2005).The Global Distribution of \nClinical Episodes of Plasmodium falciparium  malaria. Nature 434 (7030) : 214 -7. \n7. Etling, M., Mcfarland, D. A., Schultz, L. J. And Chitsulo, L. (1994). Economic Impact of malaria in \nMalawian households. Trop. Med. Parasitol 45(1): 74 – 9. \n8.WHO (2009). Economic costs of malaria: Roll back malaria WHO partnership (PdF). \nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \nhd\nl:1\n01\n01\n/n\npr\ne.\n20\n12\n.6\n74\n9.\n1 \n: P\nos\nte\nd \n2 \nJa\nn \n20\n12\n9.Wards, B. P. and Fidock, D.(2004). Understanding how the malaria parasite resists chloroquine. Mol. \nCell sep.24. \n10.Wellems,T.E.(2002).Plasmodium chloroquine resistance and the search for a replacement \nantimalarial drug. Science 298 (5591): 124 -6. \n11, Vanderbilt, R. T.(1992). Inc.Technical Literature – Veegum the versatile ingredient for pharmaceutical \nformulations . www.rtvanderbilt.com pp 1 – 5. \n12. Brent, W. Gigi, H. R. ,H. R.,Khalid, H. I and John, C. R.(2001). What do we realy know about antibiotic \npharmacdynamics ? .Pharmacotherapy 21(2):3028 – 88. \n13.Ezeibe, M. C. O.(2011).The synthetic Aluminium – Magnesium Silicate. Great AP Express Pub. Nsukka \nNigeria. PP 28 – 33. \nEzeibe, M. C. O.,   Ofafor, U. C., Okoroafor, O. N., Eze, J. I., Ngene, A. A., Animoke,P. C. and Mbuko, I. J \n(2011). Effect of Aluminium – Magnesium Silicate on anticoccidial activity of sulphadimidin.Trop. Vet. 29 \n: 41 – 44. \n15.Emerson, L. R. ,Martin, E. M., Rodger, K. ,Martin, D., Kyle, E., Vahey, M. and Wirth, D. \nF.(2001).Relationship between chloroquine toxicity and acquisition in Saccharomyces cerevisae. \nJ.antimicrobial agents and chemotherapy: 2001.  \n16.Hempelmann, E.(2007). Hemozoin biocrystallization in Plasmodium falciparum and the antimalarial \nactivity of crystallization inhibitors. Parasitol Research. 100 (4): 671 – 676. \n17.Wildig,J., Michon, P.,Siba,P. and Melombo, M (2006). Parvovirus B 19 infection contrbutes to severe \nanaemia in young children in Papua New Guinea. J. Infect. Dis 194 : 146 – 153. \n18. Claire, I. M.,James, G. and Kevin, M.(2004).Clinical features and pathogenesis of severe malaria \n.Trends in parasitology. 20(12):  \n19. Carter,R.,Diggs, C. I.(1977). Plasmodia of rodents in : parasitic protozoa (ed,J.P. Kreier) Vol 111. \nAcademic press. N. Y. PP 359 – 465.  \n. \n \n \n \n \nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \nhd\nl:1\n01\n01\n/n\npr\ne.\n20\n12\n.6\n74\n9.\n1 \n: P\nos\nte\nd \n2 \nJa\nn \n20\n12\n    Table 1: Effect of the synthetic Aluminum-Magnesium Silicate on Plasmodium \nberghei parasitaemia of mice treated with chloroquine phosphate.  \n \nWeeks Post \nTreatment  \nPARASITAEMIA (%) \n \n 7mg/kg CQ 7mg/kg \nCQ-AMS \n5mg/kg CQ 5mg/kg \nCQ-AMS \n3mg/kg \nCQ \n3mg/kg \nCQ AMS \nControl \nWeek 0 4.50 5.00 2.62 1.12 3.88 2.24 3.64 \nWeek 1 4.40 4.60 2.20 1.16 3.96 2.04 2.96 \nWeek 2 4.30 Dead 2.97 2.12 3.68 1.92 3.85 \nWeek 3 3.38 Dead 2.06 1.86 3.76 2.28 3.93 \nMean   \n \n4.15 ±0.26c  2.46±0.21 \nabc \n1.57±0.25a 3.82±0.06bc 2.12 \n±0.08ab \n3.69±0.22 \nbc \n \nDifferent superscripts abc in a row indicates significant differences between the means at the level \nof probability: P ≤ 0.05 \n \n \n \n \n \n   \n \n \n \n \n \n \nx\nN\nat\nur\ne \nPr\nec\ned\nin\ngs\n : \nhd\nl:1\n01\n01\n/n\npr\ne.\n20\n12\n.6\n74\n9.\n1 \n: P\nos\nte\nd \n2 \nJa\nn \n20\n12\n",
    "Link": "https://core.ac.uk/download/pdf/290550.pdf"
}