{
    "Title": "Type 2 Innate Lymphoid Cells in Allergic Disease.",
    "Authors": "Doherty, Taylor A, Lund, Sean, Walford, Hannah H",
    "Year": "No year available",
    "Abstract": "Type II innate lymphoid cells (ILC2) are a novel population of lineage-negative cells that produce high levels of Th2 cytokines IL-5 and IL-13. ILC2 are found in human respiratory and gastrointestinal tissue as well as in skin. Studies from mouse models of asthma and atopic dermatitis suggest a role for ILC2 in promoting allergic inflammation. The epithelial cytokines IL-25, IL-33, and TSLP, as well as the lipid mediator leukotriene D4, have been shown to potently activate ILC2 under specific conditions and supporting the notion that many separate pathways in allergic disease may result in stimulation of ILC2. Ongoing investigations are required to better characterize the relative contribution of ILC2 in allergic inflammation as well as mechanisms by which other cell types including conventional T cells regulate ILC2 survival, proliferation, and cytokine production. Importantly, therapeutic strategies to target ILC2 may reduce allergic inflammation in afflicted individuals. This review summarizes the development, surface marker profile, cytokine production, and upstream regulation of ILC2, and focuses on the role of ILC2 in common allergic diseases",
    "Keywords": "No keywords available",
    "Publisher": "eScholarship, University of California",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "UC San Diego\nUC San Diego Previously Published Works\nTitle\nType 2 Innate Lymphoid Cells in Allergic Disease.\nPermalink\nhttps://escholarship.org/uc/item/7q66s65z\nJournal\nCurrent immunology reviews, 9(4)\nISSN\n1573-3955\nAuthors\nLund, Sean\nWalford, Hannah H\nDoherty, Taylor A\nPublication Date\n2013-11-01\nDOI\n10.2174/1573395510666140304235916\n \nPeer reviewed\neScholarship.org Powered by the California Digital Library\nUniversity of California\nSend Orders for Reprints to reprints@benthamscience.net \n214 Current Immunology Reviews, 2013, 9, 214-221  \n \nType 2 Innate Lymphoid Cells in Allergic Disease \nSean Lund1, Hannah H. Walford1,2 and Taylor A. Doherty*,1 \n1Department of Medicine, University of California, La Jolla, CA, USA \n2Rady’s Children’s Hospital of San Diego, Division of Rheumatology, Allergy and Immunology, San Diego, CA, USA \nAbstract: Type II innate lymphoid cells (ILC2) are a novel population of lineage-negative cells that produce high levels \nof Th2 cytokines IL-5 and IL-13. ILC2 are found in human respiratory and gastrointestinal tissue as well as in skin. \nStudies from mouse models of asthma and atopic dermatitis suggest a role for ILC2 in promoting allergic inflammation. \nThe epithelial cytokines IL-25, IL-33, and TSLP, as well as the lipid mediator leukotriene D4, have been shown to \npotently activate ILC2 under specific conditions and supporting the notion that many separate pathways in allergic disease \nmay result in stimulation of ILC2. Ongoing investigations are required to better characterize the relative contribution of \nILC2 in allergic inflammation as well as mechanisms by which other cell types including conventional T cells regulate \nILC2 survival, proliferation, and cytokine production. Importantly, therapeutic strategies to target ILC2 may reduce \nallergic inflammation in afflicted individuals. This review summarizes the development, surface marker profile, cytokine \nproduction, and upstream regulation of ILC2, and focuses on the role of ILC2 in common allergic diseases. \nKeywords: Allergy, asthma, atopic dermatitis, ILC2, nasal polyps, Type 2 innate lymphoid cells. \nINTRODUCTION \n Allergic inflammation is characterized by increased Th2 \ncytokines including IL-4, IL-5, and IL-13 resulting in tissue \neosinophilia, epithelial mucus metaplasia, and IgE \nproduction [1]. Classically, conventional CD4+ Th2 cells \nhave been considered as the primary regulators of the \nallergic response through production of Th2 cytokines. \nHowever, during the past decade, a novel Th2 cytokine-\nproducing population has been identified resulting in a \nparadigm shift in our understanding of allergic inflammation. \nType 2 innate lymphoid cells (ILC2) were first described in \n2001 by Fort et al. as non-B/non-T cells that produced IL-5 \nand IL-13 in response to IL-25 and expressed MHC class \nIIhigh and CD11cdull [2]. Further, IL-25 administered to RAG1 \nknockout mice that lack B or T cells led to eosinophilia and \nincreased tissue IL-5 and IL-13 expression suggesting that a \nnon-B/non-T cell population was active in vivo. A \nsubsequent report showed that an IL-25 responsive non-\nB/non-T population produced IL-5 in the lungs of mice and \nexpressed CD45R, B220, and Thy1 (-/+), but was negative \nfor NK1.1, Ly-6G(GR-1), CD4, CD3, and c-kit [3]. \nImportantly, mice deficient in NK cells, mast cells, and T/B \ncells mounted pulmonary eosinophilia after IL-25 \nadministration that was not present in RAG2/γc double \nknockout mice, thus demonstrating the importance of γc \ncytokines in the development and/or maintenance of this \nnovel population. In 2006, Fallon et al. described the \nexpansion of a similar c-kit+ non-B/non-T population in the \ncontext of a helminthic infection [4]. Further, the authors \ndemonstrated that IL-25 was required for expulsion of N. \nbrasiliensis and occurred independent of B and T cells. \n \n \n*Address correspondence to this author at the Department of Medicine, \nUniversity of California San Diego, Biomedical Sciences Building, Room \n5080, 9500 Gilman Drive, La Jolla, CA 92093-0635, USA; Tel: 858 822-\n7563; Fax: 858- 534-2110; E-mail: tdoherty@ucsd.edu \n In 2010, three landmark independent studies further \ncharacterized the phenotype and function of Th2 cytokine \nproducing non-B/non-T cell populations that are now termed \nILC2 by consensus [5-8]. Moro et al. described a lineage-\nnegative c-kit+ Sca-1+ lymphoid cell population present in \nthe mesenteric fat of mice that produced large amounts of \nIL-5 and IL-13 in response to IL-33 and induced intestinal \ngoblet cell hyperplasia after N. brasiliensis infection [7]. The \ncells were termed natural helper cells (NHC). In the same \nyear, another report showed that a similar non-T cell \npopulation termed “nuocytes” was detected in mesenteric \nlymph nodes (MLN) and small intestines of IL-13 reporter \nmice stimulated with IL-25 and IL-33 [5]. Nuocytes \nexpanded in vivo after helminth infection in an IL-25 and IL-\n33 dependent manner and nuocyte IL-13 was required for \nworm expulsion. The third report similarly described \nlineage-negative IL-13 producing cells termed innate helper \ntype 2 cells (Ih2) that were increased in MLN, spleen, liver, \nand lung after N. brasiliensis infection and were sufficient to \nexpel worms in the absence of adaptive immunity after \nstimulation with IL-25 [6]. Collectively, these studies \ndemonstrated that nuocytes, natural helper cells and innate \nhelper type 2 cells (now all termed ILC2) are novel Th2 \ncytokine producing cells and set the stage for a potential role \nfor ILC2 in allergic disease. In this review, we will highlight \nILC2 development, regulation, cytokine production, and \npotential roles in allergic diseases both in humans and in \nmice. \nILC2 DEVELOPMENT \n ILC2s originate from common lymphoid progenitors \n(CLPs) that were previously known to require inhibitor of \nDNA binding 2 (Id2), Notch, and the IL-7 receptor (IL-7R) \nthat signals through the common γ chain (γc) [7, 9-11]. One \nreport specifically showed that bone marrow natural helper \ncells develop from common lymphoid progenitors (CLPs) \n 1875-631X/13 $58.00+.00 © 2013 Bentham Science Publishers \nType 2 Innate Lymphoid Cells in Allergic Disease Current Immunology Reviews, 2013, Vol. 9, No. 4     215 \nand not from either myeloid or erythroid progenitors, \nconfirming that ILC2s are of lymphoid origin [9]. \nAdditionally, Moro et al. found a near complete absence of \nc-kit+ Sca-1+ natural helper cells in Id2 knockout mice \nconsistent with the requirement of Id2 for innate lymphoid \ncell development [7]. Several studies have since shown that \nmice deficient in either IL-7 or its receptor lack ILC2 [7, 12, \n13]. \n Notch signaling was previously shown to be required for \nin vitro differentiation from CLPs into nuocytes and a recent \nstudy demonstrated that high levels of Notch signaling \ntrigger ILC2 differentiation from human uncommitted \nthymic progenitor cells, and lower levels trigger a T cell \nprogram of differentiation [14, 15]. T cell factor 1 (TCF-1) is \ndownstream of Notch signaling and was recently shown to \nbe critical for the development of functional ILC2 [16]. In \naddition to Notch signaling, the transcription factor RORα \nwas also shown to be required for nuocyte differentiation in \nvitro and for IL-25-induced nuocyte expansion and goblet \ncell hyperplasia in vivo [14]. Another report substantiated the \nrequirement of RORα for natural helper cell development \nand notably showed that other ILC and Th2 cell responses \nwere normal, suggesting more specific ILC2 regulation by \nRORα [17]. \n Recently, the master Th2 cytokine transcription factor \nGATA3 has been shown to play a critical role in human and \nmouse ILC2 development and function [18-20]. In a recent \nreport, GATA3-deficient CLPs did not express RORα or Id2 \nmRNA and were not capable of producing IL-5 or IL-13 \n[19]. The transcription factor Gfi1 contributes to Th2 cell \ndevelopment by stabilizing GATA3 and a recent report \nevaluated the role of Gfi1 in ILC2 development and function \n[21, 22]. Interestingly, loss of Gfi1 led to reduced ILC2 \nresponsiveness to IL-33 and Gfi1 knockout ILC2 expressed \nlow levels of IL-5, but co-expressed IL-13 and IL-17, \nsuggesting that Gfi1 contributes to the type 2 effector \nprogram of ILC2 [22]. Taken together, the development of \nILC2 from CLPs depends on GATA3-induced Id2 and \nRORα, in addition to Notch and IL-7R signaling. \nILC2 SURFACE MARKERS \n Initial studies reported that the common surface markers \nexpressed (though to variable levels) by Ih2, nuocytes, and \nNHC included CD45, Thy1.2, CD44, CD69, and c-kit (Table \n1). Distinct phenotypic differences between these three \npopulations exist in expression of Sca-1, T1/ST2 and IL-7R〈. \nThese differences may reflect tissue and condition specific \nvariations in ILC2 phenotype and/or methods of ILC2 \nidentification. Regardless of some phenotypic distinctions, \nconsensus has been reached to identify Ih2, nuocytes, and \nnatural helper cells as ILC2 [8]. Human ILC2 were initially \ndetected in the gastrointestinal tract, lung, nasal polyp tissue \nand peripheral blood and are defined by expression of the \nprostaglandin D2 (PGD2) receptor CRTH2 [23]. \n Notably, a separate lineage-negative population of cells \ntermed multipotent progenitor type 2 cells (MPP2) was \ndiscovered in IL-4 reporter mice stimulated with Il-25 and \nwas initially included along with other innate Th2 cytokine \nproducing cells [24]. However, further work has now clearly \nshown that ILC2 are distinct from MPP2 that can \ndifferentiate into basophils, macrophages, and mast cells \n[25]. Interestingly, simultaneous activation of both ILC2 and \nMPP2 occurs after IL-25 exposure in vivo demonstrating \ncomplex parallel pathways that may contribute to type 2 \ninflammation. \nUPSTREAM REGULATION OF ILC2 \n ILC2s both respond to and are activated by a number of \ndifferent molecules, including cytokines and other \ninflammatory mediators (Fig. 1). Initial reports demonstrated \nthat ILC2 were activated by IL-25 and IL-33 leading to \nrobust Th2 cytokine production [2-7]. IL-25 (IL-17E) is a \nmember of the IL-17 family and binds specifically to the \nheterodimer of IL-17RB and IL-17RA leading to activation \nof MAP kinase and NF-kB pathways [26]. IL-25 is secreted \nby many cell types including Th2 cells, eosinophils as well \nas epithelial cells [26]. IL-33 is released by the airway \nepithelium and lung macrophages, and binds to T1/ST2, a \nheterodimer of ST2 and the IL-1 receptor accessory protein \n(T1) [27-29]. IL-33 exists in a biologically active pro-form \nas well as a processed cleaved protein. The binding of IL-33 \nto T1/ST2 leads to p38 MAPK as well as NF-κB signaling \n[27]. Both IL-25 and IL-33 are induced in allergic lung \ninflammation and thus are available for potent ILC2 \nstimulation [13, 29-32]. One report recently demonstrated \nthat IL-33 is more potent than IL-25 to activate IL-13 \nproducing ILC2 and induce airway hyperresponsiveness in \nallergen challenged mice [33]. Consistent with this, another \nreport showed that ST2 knockout mice, but not IL-17RB \nTable 1. Surface Marker Profiles and Tissue Distribution of Mouse and Human ILC2. Shared Surface Marker Expression As Well \nAs Distinctions Among ILC2 Subsets are Shown \n \n Subtype Tissue Localization Surface Markers References \nMouse \nIh2, NHC, Nuocyte shared markers CD45, Thy1.2 (CD90.2), CD44, CD69, c-kit [5-7, 25] \nIh2 bone marrow, liver, lung, mesenteric lymph node, peritoneum, spleen CD25, CD122  [6] \nNHC fat-associated lymphoid clusters, bone marrow, lung CD25, CD27, CD38, IL-7Rα, Sca-1, T1/ST2, GITR  [7, 9, 13, 37] \nNuocyte bone marrow, lung, mesenteric lymph node, spleen  \nCD43, CD49d, CD127, CD132, IL-7Rα, Sca-1, \nT1/ST2, MHC-II, Itgb7, ICOS, ICAM-1, CCR9 [5, 33, 55] \nHuman  ILC2  nasal polyps, sinus epithelium, peripheral blood, lung, gastrointestinal tract \nCD7, CD25, CD62L, CD127, CD161, CRTH2, ST2 \n(IL-33R), ALX, CMKLR1, NKG2D, c-kit, DR3 [13, 18, 23, 39, 45] \n216    Current Immunology Reviews, 2013, Vol. 9, No. 4 Lund et al. \nknockout mice, were impaired in allergic sensitization to \nhouse dust mite [34]. Though IL-33 appears to play a \ndominant role in some settings, both IL-33 and IL-25 induce \ndifferent routes of activation of ILC2s that may depend on \nthe availability of these cytokines from different cell types. \n Aside from IL-25 and IL-33, more recent work has \nidentified other mediators of ILC2 activation. TSLP is an \nepithelial cytokine induced in allergic inflammation and \npreviously shown to induce conventional Th2 cell priming \nthrough the costimulatory action of OX40 ligand expressed \non dendritic cells [35, 36]. Subsequently, a role for TSLP in \nactivation of ILC2 was demonstrated as purified human \nperipheral blood and nasal polyp ILC2 cultured with TSLP \nand IL-33 displayed enhanced IL-4, IL-5, and IL-13 \nproduction above IL-33 alone [18]. TSLP has also been \nshown to activate mouse lung and skin ILC2 [37, 38]. \n Interestingly, recent reports have shown that a number of \neicosanoids, arachidonic acid-derived lipid mediators, that \nare elevated in allergic inflammation can either directly \nstimulate or inhibit ILC2 [39-41]. Barnig et al. demonstrated \nthat PGD2 (binds to CRTH2 expressed on human ILC2) \npotentiated peripheral blood ILC2 IL-13 production above \nIL-2, IL-25, and IL-33 in vitro [39]. Furthermore, this effect \nwas lost upon the addition of lipoxin A4 (LXA4) suggesting \nthat LXA4 has an inhibitory effect on human ILC2. In \naddition to PGD2 stimulation of ILC2 cytokine production, \nwe have also detected increased human peripheral blood \nILC2 chemotaxis in response to PGD2 [42]. Further, we \nhave shown that mouse lung ILC2 express the cysteinyl \nleukotriene 1 receptor (CysLT1R) that is preferentially \nactivated by leukotriene D4 [40]. Leukotriene D4 potently \ninduced calcium influx and Th2 cytokine production from \npurified lung ILC2 in vitro, and potentiated ILC2 \nproliferation and lung eosinophilia in RAG2 knockout mice. \nThe eicosanoid molecules including prostaglandins, \nleukotrienes and lipoxins are largely produced by \nmacrophages, mast cells, eosinophils and dendritic cells and \nthus represent novel pathways through which ILC2 can be \nactivated [41]. \n The TNF superfamily member TL1A binds to Death \nreceptor 3 (DR3) and signals through TRADD and the \nintracytoplasmic death domain [43]. TL1A is produced by \ndendritic cells and macrophages in response to TLR and Fc \nreceptor cross-linking and is also produced by T cells in \nresponse to TCR stimulation [44]. TL1A/DR3 costimulation \nof T cells was previously shown to be required for \ngeneration of a Th2 response and development of allergic \nlung inflammation in OVA models of asthma [44]. Yu et al. \nhave recently reported that TL1A also directly activates \nILC2 and synergizes with IL-25 in vivo to promote cytokine \nproduction and increase numbers of ILC2s [45]. Further, \nDr3-/- mice showed an impaired ability to clear \nNippostrongylus brasiliensis infection and had reduced ILC2 \nlevels and lung inflammation compared with WT mice. The \nactivation of ILC2 by TL1A provides new insight into \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. (1). Interactions and functions of airway ILC2. ILC2 respond to epithelial cytokines TSLP, IL-33, and IL-25 and in turn produce Th2 \ncytokines. Additional ILC2 stimulation may occur from PGD2 and leukotriene D4 produced by mast cells and macrophages, and inhibitory \nsignals from lipoxin A4. TL1A is also produced by dendritic cells and macrophages and can activate ILC2. ILC2 IL-5 production stimulates \neosinophil activation and survival, whereas ILC2 IL-13 induces airway hyperresponsiveness, and along with IL-9, promotes mucus \nproduction. ILC2 IL-4 may contribute to Th2 cell differentiation and amphiregulin secreted by ILC2 binds to EGFR in the airway epithelium \nto induce repair responses. \n\u0002\u0003 \u0006\n\n )\u0015 + \u001b\n\u0002\u0003\u0004\u0005\u0006\u0007\n\u0002\u0003\u0004\b\b\u0007\n\t\n\u0003\u000b\u0007\n\u0007\n\u0007 \u0007\n\u0007\n\u0007\n\u0007\n\u0003\t\f\r\u000e\u0007\u000b\u000f\f\u0005\u000e\u0007\u0003\u0010\u0011\r\u0007\n\u0007\u0007\u0007\u0002\u0003\u0004\r\u0007\n\u0002\u0003\u0004\u0006\u0007\n\u0007\u0007\u0007\u0002\u0003\u0004\u0012\b\u0007\n\u0011\u0013\u0014\u0015\u0016\u0017\u0018\u0019\u001a\u001b\u0016\u001c\u0007\n\t\u0016\u001d\u001d\u001a\u0018\u0007\u0017\u0018\u0014\u001e\u0016\u0017\u0007\u001e\u001c\u001f\u0007\n\u0017\u0018\u0013 \u001f\u0018\u001b\u001b\u0016\u001c\u0019\u0007\n\u0002\u0003\u0004!\u0007\n\u0002\u001c\"\u0017\u0018\u001e\u001d\u0018\u001f\u0007\u0013\u001a\"\u001a\u001d\u0007\n\u001d\u0018\"\u0017\u0018# \u001c\u0007\n$ \u001d\u0016\u001c \u0014\u0015\u0016\u001b\u0007\n\u000b\u0017 \u001b\u0016%\u0018\u0017\u001e# \u001c\u0007\n\u0007\u001e\u001c\u001f\u0007\u001d\u001a\u0017&\u0016&\u001e\u001b\u0007\n\t'\u0005\u0007\u0003(\u0013\u0014\u0015 \"()\u0018\u001d\u0007\n\f\u0016*\u0018\u0017\u0018\u001c#\u001e# \u001c\u0007\u001e\u001c\u001f\u0007\n\u000b\u0017 \u001b\u0016%\u0018\u0017\u001e# \u001c\u0007\n+\u001e\u001d)\u0007,\u0018\u001b\u001b\u0007\n\n\u0013  )\u0015\u0007+\u001a\u001d\"\u001b\u0018\u0007\n\u0011\u0016\u0017-\u001e(\u0007'(\u0014\u0018\u0017\u0017\u0018\u001d\u0014 \u001c\u001d\u0016&\u0018\u001c\u0018\u001d\u001d\u0007\u0007\n+\u001e\"\u0017 \u0014\u0015\u001e\u0019\u0018\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0007\n\u0011\u0016\u0017-\u001e(\u0007$\u0014\u0016)\u0015\u0018\u001b\u0016\u001a\u0013\u0007\n\u0002\u0003,\u0005\u0007\n+\u001a\"\u001a\u001d\u0007\n\u0002\u0003\u0004\u0012\b\u0007\n\u0002\u0003\u0004!\u0007\n\u0007\u0007\u0011\u001a) \"\u0017\u0016\u001c\u0018\u0007\u001d\u001a\u0017&\u0016&\u001e\u001b\u0007%\u001e\") \u0017\u0007\n\f\u0018\u001c\u001f\u0017\u0016#\"\u0007,\u0018\u001b\u001b\u0007\n\t\u0003\u0012\u0011\u0007\nType 2 Innate Lymphoid Cells in Allergic Disease Current Immunology Reviews, 2013, Vol. 9, No. 4     217 \nmechanisms of ILC2 activation as TL1A is available at \nmucosal sites including the lung and could synergize with \nknown ILC2 activators. \n Recently, IL-9 was shown to play a critical role in ILC2 \nsurvival [46]. The authors found that IL-9 is an autocrine \nfactor necessary for amphiregulin, IL-5, and IL-13 \nproduction, as well as eosinophil recruitment [46]. IL-9R-/- \nmice had reduced tissue repair responses, and this work \nfurther highlights the potential importance of ILC2 in tissue \nprotective roles. The authors hypothesized that the \nantiapoptotic protein BCL3 could be conferring survival to \nILC2 by inhibiting cell apoptosis associated with activation \n[46]. \nILC2 CYTOKINE PRODUCTION \n ILC2s were initially described to produce high levels of IL-5 \nand IL-13 and very low levels of IL-4 in response to IL-33 in \nvitro [5, 7]. Interestingly, this cytokine pattern (high IL-5, IL-13 \nand low IL-4) may be more related to the effects of IL-33 as \nconventional T cells stimulated with IL-33 develop into IL-5 \nproducing cells that do not produce IL-4 [47]. Subsequently, \nstudies have shown that ILC2 stimulated with TSLP and \nleukotriene D4 produce IL-4 suggesting that ILC2, under \ncertain conditions, are a source of IL-4 [18, 40]. Interestingly, \nlung ILC2 have recently been shown to constitutively produce \nIL-5 critical to eosinophil homeostasis, though IL-13 production \nrequires IL-25 or IL-33 stimulation [48]. As stated above, ILC2 \nhighly express the master Th2 cytokine transcription factor \nGATA3 that is required for ILC2 Th2 cytokine production [13, \n18-20]. Though conventional Th2 cells and ILC2 share GATA3 \nexpression, ILC2 express GATA3 in the bone marrow \nsuggesting they are primed for Th2 cytokine production without \nperipheral differentiation [13, 20]. Importantly, a recent study \ndemonstrated that TSLP further enhances GATA3 expression in \nhuman ILC2, and thus may be one mechanism of ILC2 Th2 \ncytokine production induced by TSLP [18]. \n ILC2 have also been shown to produce IL-6, IL-9, and the \nEGFR ligand amphiregulin [7, 32, 49, 50]. IL-9 contributes to \nmany features of allergic asthma in animal models including \nairway eosinophilia and mucus production [51]. Lung ILC2 \nfrom mice challenged with the protease allergen papain were \nfound to be a dominant source of IL-9 dependent on IL-2, and \nILC2 cultured with IL-9 showed increased production of IL-5, \nIL-6, and IL-13 [50]. Amphiregulin is produced by ILC2 after \nairway administration to mice of influenza virus and the fungal \nallergen Alternaria [32, 49]. In mice receiving influenza virus, \nILC2 amphiregulin promoted lung tissue repair suggesting that \nILC2 may contribute to both pathogenic and healthy remodeling \nresponses in the lung [49]. Finally, the alternatively activated \nmacrophage enzyme Arginase I is constitutively produced by \nILC2s though deletion of the Arginase I gene does not appear to \ninhibit cytokine production, proliferation or survival of ILC2s \n[52]. Overall, these reports suggest that the variable cytokine \nproduction by ILC2 during lung responses may play distinct \nroles depending on the inflammatory context. \nILC2 LOCALIZATION IN TISSUES \n ILC2 have been found in several different anatomical \nlocations and have been studied in various mouse models of \ndisease (Table 1). Studies in mice have shown ILC2 to be \npresent in lung, skin, mesenteric lymph nodes, bone marrow, \nliver, spleen, gastrointestinal tract and in mesenteric fat-\nassociated lymphoid clusters [5-7, 9, 28, 38]. Interestingly, \nlung IL-5 positive ILC2 are localized to the collagen rich \nregions of the conducting airways, but not in alveolar spaces \n[48]. In humans, ILC2s have been found in nasal polyps, \nsinus epithelium, peripheral blood, lung, and in the \ngastrointestinal tract [18, 23, 49]. Thus, the extensive \ndistribution of ILC2 in tissues suggests that ILC2 may \ncontribute to many organ specific type 2 inflammatory \nresponses. \nROLES OF ILC2 IN ALLERGIC DISEASE \n The roles and regulation of ILC2 in the following allergic \ndiseases are summarized in Table 2. \nILC2 in Mouse Models of Asthma \n Mouse models of asthma induced by allergens or viruses \nare characterized by features found in human asthma \nincluding airway hyperresponsivness, peribronchial \ninflammation, epithelial mucus production and airway \nremodeling. Several studies have demonstrated the \nimportance of ILC2s in different mouse models and are also \nreviewed elsewhere [53, 54]. ILC2 have been shown to \ncontribute to type 2 lung inflammatory responses and airway \nhyperresponsiveness (AHR) in mice infected with influenza \nvirus and after challenge with multiple allergens including \nAlternaria, papain, house dust mite and OVA [12, 13, 28, 37, \n55, 56]. The initial report by Chang et al. showed that ILC2 \nIL-13 production was required for AHR induced by \ninfluenza virus as adoptive transfer of wild type ILC2, but \nnot IL-13 knockout ILC2, restored AHR in ILC2 depleted \nmice [28]. Another report demonstrated that the numbers of \nIL-5 and IL-13 producing lung ILC2 were shown to be \nequivalent to conventional cytokine producing Th2 cells in \nmice challenged with house dust mite [56]. Our group and \nothers have reported that intranasal administration of the \nfungal allergen Alternaria alternata rapidly induces IL-33, \nactivation of lung ILC2, and airway eosinophilia dependent \non IL-33 signaling [12, 32]. Further, we found that ILC2 \nexpress receptors for IL-4 and IL-13 and proliferation was \nimpaired in STAT6 deficient mice suggesting either a direct \nor indirect regulation of ILC2 by the IL-4/IL13/STAT6 axis. \nA single challenge with Alternaria given to mice also \ninduces rapid cysteinyl leukotriene production dependent on \nSTAT6 that may further regulate ILC2 activation and/or \nproliferation [40]. \n Though ILC2 appear to direct pathogenic lung responses \nin asthma models, there is evidence that ILC2 may promote \ntissue repair after viral and allergen challenges. In ILC2-\ndepleted RAG-deficient mice infected with influenza, there \nwas significant impairment in post infection epithelial barrier \nregeneration that was restored upon ILC2 transfer [49]. \nImportantly, the EGFR ligand amphiregulin was highly \nproduced by ILC2 and was sufficient to induce epithelial \nrepair after ILC2 depletion. In addition to influenza virus, \nAlternaria alternata intranasal challenges to induce ILC2 \nproduction of amphiregulin and upregulate the amphiregulin \nreceptor EGFR supporting a role for ILC2 in tissue repair \npost allergen challenge as well [13]. Thus, ILC2 may have \n218    Current Immunology Reviews, 2013, Vol. 9, No. 4 Lund et al. \nboth harmful as well as beneficial effects in lung \ninflammation. ILC2 are activated both by epithelial-derived \ncytokines such as IL-25, IL-33, and TSLP as well as \nleukotrienes found elevated in asthma, and yet ILC2 also \nproduce amphiregulin, an important tissue repair mediator. \nAirway ILC2 responses and upstream mediators are shown \nin Fig. (1). Further research is needed to elucidate the \nrelative contribution of ILC2 during development and \nresolution of inflammatory responses as well as tissue repair. \nILC2 in Human Asthma \n ILC2 have not been studied extensively in human \nasthma, though ILC2 as well as upstream cytokines and \nmediators including IL-33, leukotrienes, and PGD2 have \nbeen detected in human lungs [39, 49, 57, 58]. In 2001, a \nreport showed that human asthmatics had increased serum \nT1/ST2 receptor during acute exacerbation [59]. Subsequent \nstudies have shown increased levels of IL-25, IL-33, and \nTSLP in patients with asthma [58, 60, 61] that all have the \npotential to active ILC2. In 2009, a landmark study reported \nthe presence of a CD34+ non-B/non-T lymphocyte \npopulation found in asthmatic sputum that produced IL-5 \nand IL-13 in response to inhalational allergen challenge [62]. \nWhether or not these cells are the same as CRTH2-\nexpressing ILC2 found later in human lungs is not clear. \nTaken together, these studies suggest that ILC2 may play a \nsignificant role in human asthma especially given the \nheterogeneity of asthma triggers apart from allergens \nincluding tobacco smoke, viruses, and ozone that could \nactivate innate pathways. \nILC2 in Chronic Rhinosinusitis \n Chronic rhinosinusitis (CRS) is an inflammatory \ncondition involving the mucosal lining of the nose and \nparanasal sinuses, estimated to affect 2% to 5% of the adult \ngeneral population and is often associated with asthma, \naspirin sensitivity, cystic fibrosis and allergic disease [63]. \nChronic rhinosinusitis with nasal polyps (CRSwNP) \nrepresents a distinct disease entity from chronic \nrhinosinusitis without nasal polyps (CRSsNP). In 2011, \nILC2 were first reported to be enriched in nasal polyps \nsuggesting a potential role for these cells in CRSwNP [23]. \nA subsequent study identified an increased percentage of \nILC2 in inflamed sinonasal mucosa (not polyp tissue) from \npatients with CRSwNP as compared to CRSsNP [64]. \nFurther work has shown that ILC2 from nasal polyps \nproduce IL-13 in a GATA3-dependent manner after culture \nwith IL-2, IL-33 and TSLP [18]. Additionally, epithelial \ncells from patients with CRSwNP show high levels of \nmediators that regulate ILC2 including TSLP and IL-33[64, \n65]. Further, TSLP enhanced the level of ILC2 GATA3 \nexpression that may account for increased cytokine \nproduction [18]. Interestingly, ectopic expression of GATA3 \nby retrovirus of Lin-CD127+CD117+NKp44-CRTH2- cells \nresulted in the induction of surface CRTH2, T1/ST2, and \nTSLP-R as well as IL-13 production in response to TSLP \nand IL-33. This work critically demonstrates the role of \nGATA3 in directing human ILC2 programming. \n A recent consensus report suggests the importance of \nendotypes within CRSwNP patients defined by \nhistopathologic features, cytokine profiles and presence of \ndifferent cell types [66]. Though a large portion of nasal \npolyps contain high numbers of eosinophils and correlate \nwith elevated Th2 cytokine levels, there is increasing \nrecognition that polyps have varying cellular predominance \ndue to distinct pathogenic mechanisms [67]. We have \nrecently found that eosinophilic nasal polyps from allergic \nindividuals have a higher percentage of GATA3-expressing \nILC2 as compared to non-eosinophilic nasal polyps from \nindividuals with unknown allergic status (unpublished data), \nthus further implicating ILC2 in the development of \neosinophilic CRSwNP. \nILC2 in Atopic Dermatitis \n Atopic dermatitis is a chronic inflammatory skin condit-\nion associated with skin barrier disruption, eosinophilic \ninfiltration and high serum IgE levels. Recently, studies have \nTable 2. Regulation and Function of ILC2 in Mouse Models and Human Allergic Disease \n \n Allergic Disease ILC2 Upstream Regulation ILC2 Function Role of ILC2 in Disease References \nMouse \nAsthma \nIL-25 \nIL-33 \nLTD4 \nTSLP \nTL1A  \nIL-4, IL-5, IL-9, IL-13, \namphiregulin  \nAHR, eosinophilia, mucus \nproduction, tissue repair  [12, 13, 28, 33-37, 40, 49, 55, 56] \nAtopic Dermatitis IL-33 TSLP IL-4, IL-5, IL-13 \northokeratosis, acanthosis, \nskin lesions, eosinophilia [38, 68, 69] \nHuman \nAsthma \nIL-25 \nIL-33 \nLXA4 \nPGD2 \nTSLP \nIL-13 production from \nperipheral blood ILC2 ? [39, 49, 57-62] \nAtopic Dermatitis IL-33 TSLP ? ? [38, 69, 71] \nChronic \nRhinosinusitis \nIL-33 \nTSLP IL-13  ? [18, 23, 64, 65] \nType 2 Innate Lymphoid Cells in Allergic Disease Current Immunology Reviews, 2013, Vol. 9, No. 4     219 \nreported the presence of ILC2 in healthy mouse skin [38, \n68]. In one report, ILC2s have been classified as dermal \nILC2 (dILC2), and differ slightly from those found in other \norgans as dILC2 express CD103 and lack expression of c-Kit \n[68]. The same study used a dsRed/IL-13 transgenic reporter \nand determined that the majority of cells positive for IL-13 at \nsteady state were CD3- cells, ruling out Th2 cells as primary \ncontributors to homeostatic IL-13 production in the skin. \nAnother group utilized a mouse model of TSLP-driven \natopic dermatitis and demonstrated that ILC2 activation \noccurs independent of IL-33, but is dependent on TSLP \nreceptor signaling [38]. In contrast, a separate report \ndemonstrated that overexpression of IL-33 in the skin led to \natopic dermatitis-like pathology including increased dermal \neosinophils, increased Th2 cytokines and expansion of skin \nILC2 [69]. Thus, the availability of specific upstream \nmediators of ILC2 activation likely dictates the dominant \npathway resulting in ILC2 accumulation and cytokine \nproduction. Studies of ILC2 in human atopic dermatitis are \nlimited, though similar to asthma and chronic rhinosinusitis, \nelevation of TSLP and IL-33 is present in human atopic \ndermatitis [70, 71] and one recent report demonstrated that \nILC2 are increased in skin lesions of atopic dermatitis \npatients compared with controls [38]. Thus, ILC2 may play a \nrole in atopic dermatitis but investigations into skin ILC2 \nfunction from diseased and non-diseased humans are needed. \nILC2 INTERACTIONS WITH OTHER CELL TYPES \n Recently, several studies have suggested that interactions \nbetween ILC2 and other cell types including CD4+ T cells, \nB cells, and mast cells may have meaningful effects on ILC2 \nlevels or function. Data from the initial studies of mesenteric \nfat-associated ILC2 support a role for dependence on IL-2 \nfor ILC2 cytokine production [7]. Subsequently, lung ILC2 \nwere shown to require IL-2 for costimulation of cytokine \nproduction in vitro and ILC2 IL-9 production required IL-2 \nfrom adaptive immune cells in vivo [37, 50]. T cells are a \nknown source of IL-2 and this suggests that adaptive \nimmune cells are involved in the maintenance of ILC2 \nresponses. ILC2 have also shown the capacity to produce IL-\n4 after stimulation with TSLP and leukotriene D4, and thus \ncould provide an important signal leading to Th2 cell \npolarization [18, 40]. Interestingly, leukotriene production \nby dendritic cells has been shown to be required for Th2 \nresponses to house dust mite suggesting that a \nleukotriene/IL-4 axis could induce Th2 cell priming and \nperhaps ILC2 are involved in this pathway [72]. Direct \ncontact between ILC2 and CD4+ T cells may occur as some \nILC2 populations have been shown to express MHCII [5], \nthough the low numbers of ILC2 in tissues and lymph nodes \ndo not support a robust pathway where ILC2 present antigen \nto CD4+ T cells. \n ILC2 were initially described to produce IL-5 and IL-6 \nthat induced B1 B cells to produce IgA antibody [7]. \nRecently, a report of a Sca-1+ Thy1+ ILC2 population in the \nspleens of mice that does not express IL-7R or T1/ST2, but \nexpresses IL-18R, was shown to induce IgE production by B \ncells after co-culture with ILC2 and IL-18 [73]. Thus, ILC2 \nmay amplify B cell IgE responses that are characteristic of \nadaptive Th2 responses. Finally, the costimulatory molecule \nICOS has also been shown to be expressed by ILC2 and \ncould lead to interactions with ICOS-ligand expressing B \ncells [5]. \n A recent report also demonstrated that ILC2 are co-\nlocalized with mast cells in the dermis [68]. The authors \ntracked the movements of ILC2s using intravital multiphoton \nmicroscopy and found that interactions between mast cells \nand ILC2 lasted as long 30 minutes. Interestingly, the \nauthors also found that IL-9 enhanced mast cell release of \nIL-6 and TNFα, while IL-13 had the opposite effect and \nsuppressed mast cell release of IL-6 and TNFα. Another \nreport demonstrated the presence of ILC2 in close proximity \nto mast cells in human lung, supporting potential ILC2/mast \ncell interactions [39]. The interactions between ILC2 and \nmast cells could have important influences on shaping \nallergic responses as mast cell mediators including PGD2 \nand leukotrienes can activate ILC2 and mast cells could be \nreciprocally modulated by ILC2 cytokines. \nSUMMARY \n The classic paradigm underlying allergic disease has \nbeen characterized by allergen specific Th2 cell production \nof IL-4, IL-5 and IL-13 leading to tissue eosinophilia, mucus \nproduction, and specific IgE production. Though the Th2 \nadaptive response to allergen exposure is well substantiated, \nrecent evidence suggests that ILC2 may also contribute to \npathogenic allergic inflammation. The evolutionary \nadvantage of tissue ILC2 likely stems from an important \nearly role in anti-parasitic immunity. In 2010, the \nidentification of nuocytes, innate helper type 2 cells and \nnatural helper cells as major players in type 2 immunity \nduring helminth infections has led to investigations into \nILC2 in allergic disease. ILC2, like other innate cells, do not \nrequire antigen experience and peripheral differentiation and \nthus could drive innate type 2 responses to viruses, tobacco \nsmoke, and pollutants associated with asthma. Many \nimportant questions regarding the role of ILC2 in allergic \ndiseases remain including how ILC2 contribute to ongoing \nallergic inflammation in the presence of intact adaptive \nimmunity or how ILC2 can be specifically targeted \ntherapeutically. Future studies aimed at addressing these \nquestions will provide significant insight into mechanisms of \nILC2 biology and their contributions to human disease. \nABBREVIATIONS \nAHR = Airway hyperresponsiveness \nCRTH2 = Chemoattractant receptor homologous  \n   molecule expressed on TH2 lymphocytes \nDR3 = Death receptor 3 \nEGFR = Epidermal growth factor receptor \nGATA3 = Transacting T cell specific transcription factor 3 \nICOS = Inducible T-cell Costimulator \nIgA = Immunoglobulin A \nIgE = Immunoglobulin E \nILC2s = Type 2 innate lymphoid cells \nPGD2 = Prostaglandin D2 \nSTAT6 = Signal transducer and activator of transcription 6 \n220    Current Immunology Reviews, 2013, Vol. 9, No. 4 Lund et al. \nCONFLICT OF INTEREST \n The authors report no conflict of interest in the \npreparation of this manuscript. \nACKNOWLEDGEMENTS \n Grant support: T.A.D. is supported by NIH grant \n1K08AI080938 and ALA/AAAAI Allergic Respiratory \nDiseases Award. \nREFERENCES \n[1] Busse WW, Lemanske RF, Jr. Asthma. N Engl J Med 2001; \n344(5): 350-62. \n[2] Fort MM, Cheung J, Yen D, et al. IL-25 induces IL-4, IL-5, and \nIL-13 and Th2-associated pathologies in vivo. Immunity 2001; \n15(6): 985-95. \n[3] Hurst SD, Muchamuel T, Gorman DM, et al. New IL-17 family \nmembers promote Th1 or Th2 responses in the lung: in vivo \nfunction of the novel cytokine IL-25. J Immunol 2002; 169(1): \n443-53. \n[4] Fallon PG, Ballantyne SJ, Mangan NE, et al. Identification of an \ninterleukin (IL)-25-dependent cell population that provides IL-4, \nIL-5, and IL-13 at the onset of helminth expulsion. J Exp Med \n2006; 203(4): 1105-16. \n[5] Neill DR, Wong SH, Bellosi A, et al. Nuocytes represent a new \ninnate effector leukocyte that mediates type-2 immunity. Nature \n2010; 464(7293): 1367-70. \n[6] Price AE, Liang HE, Sullivan BM, et al. Systemically dispersed \ninnate IL-13-expressing cells in type 2 immunity. Proc Natl Acad \nSci USA 2010; 107(25): 11489-94. \n[7] Moro K, Yamada T, Tanabe M, et al. Innate production of T(H)2 \ncytokines by adipose tissue-associated c-Kit(+)Sca-1(+) lymphoid \ncells. Nature 2010; 463(7280): 540-4. \n[8] Spits H, Artis D, Colonna M, et al. Innate lymphoid cells--a \nproposal for uniform nomenclature. Nat Rev Immunol 2013; 13(2): \n145-9. \n[9] Yang Q, Saenz SA, Zlotoff DA, Artis D, Bhandoola A. Cutting \nedge: natural helper cells derive from lymphoid progenitors. J \nImmunol 2011; 187(11): 5505-9. \n[10] Yokota Y, Mansouri A, Mori S, et al. Development of peripheral \nlymphoid organs and natural killer cells depends on the helix-loop-\nhelix inhibitor Id2. Nature 1999; 397(6721): 702-6. \n[11] Satoh-Takayama N, Lesjean-Pottier S, Vieira P, Sawa S, Eberl G, \nVosshenrich CA, et al. IL-7 and IL-15 independently program the \ndifferentiation of intestinal CD3-NKp46+ cell subsets from Id2-\ndependent precursors. J Exp Med 2010; 207(2): 273-80. \n[12] Bartemes KR, Iijima K, Kobayashi T, Kephart GM, McKenzie AN, \nKita H. IL-33-responsive lineage- CD25+ CD44(hi) lymphoid cells \nmediate innate type 2 immunity and allergic inflammation in the \nlungs. J Immunol 2012; 188(3): 1503-13. \n[13] Doherty TA, Khorram N, Chang JE, et al. STAT6 regulates natural \nhelper cell proliferation during lung inflammation initiated by \nAlternaria. Am J Physiol Lung Cell Mol Physiol. 2012; 303(7): \nL577-88. \n[14] Wong SH, Walker JA, Jolin HE, et al. Transcription factor \nRORalpha is critical for nuocyte development. Nat Immunol 2012; \n13(3): 229-36. \n[15] Gentek R, Munneke JM, Helbig C, et al. Modulation of Signal \nStrength Switches Notch from an Inducer of T Cells to an Inducer \nof ILC2. Front Immunol 2013; 4: 334. \n[16] Mielke LA, Groom JR, Rankin LC, et al. TCF-1 Controls ILC2 and \nNKp46+RORgammat+ Innate Lymphocyte Differentiation and \nProtection in Intestinal Inflammation. J Immunol 2013; 191(8): \n4383-91. \n[17] Halim TY, MacLaren A, Romanish MT, Gold MJ, McNagny KM, \nTakei F. Retinoic-acid-receptor-related orphan nuclear receptor \nalpha is required for natural helper cell development and allergic \ninflammation. Immunity 2012; 37(3): 463-74. \n[18] Mjosberg J, Bernink J, Golebski K, et al. The Transcription Factor \nGATA3 Is Essential for the Function of Human Type 2 Innate \nLymphoid Cells. Immunity. 2012; 37(4): 649-59. \n[19] Klein Wolterink RG, Serafini N, van Nimwegen M, et al. Essential, \ndose-dependent role for the transcription factor Gata3 in the \ndevelopment of IL-5+ and IL-13+ type 2 innate lymphoid cells. \nProc Natl Acad Sci USA 2013; 110(25): 10240-5. \n[20] Hoyler T, Klose CS, Souabni A, et al. The transcription factor \nGATA-3 controls cell fate and maintenance of type 2 innate \nlymphoid cells. Immunity. 2012; 37(4): 634-48. \n[21] Shinnakasu R, Yamashita M, Kuwahara M, et al. Gfi1-mediated \nstabilization of GATA3 protein is required for Th2 cell \ndifferentiation. J Biol Chem 2008; 283(42): 28216-25. \n[22] Spooner CJ, Lesch J, Yan D, et al. Specification of type 2 innate \nlymphocytes by the transcriptional determinant Gfi1. Nat Immunol \n2013; 14(12): 1229-36. \n[23] Mjosberg JM, Trifari S, Crellin NK, et al. Human IL-25- and IL-\n33-responsive type 2 innate lymphoid cells are defined by \nexpression of CRTH2 and CD161. Nat Immunol 2011; 12(11): \n1055-62. \n[24] Saenz SA, Siracusa MC, Perrigoue JG, et al. IL25 elicits a \nmultipotent progenitor cell population that promotes T(H)2 \ncytokine responses. Nature 2010; 464(7293): 1362-6. \n[25] Saenz SA, Siracusa MC, Monticelli LA, et al. IL-25 \nsimultaneously elicits distinct populations of innate lymphoid cells \nand multipotent progenitor type 2 (MPPtype2) cells. J Exp Med \n2013; 210(9): 1823-37. \n[26] Gu C, Wu L, Li X. IL-17 family: Cytokines, receptors and \nsignaling. Cytokine. 2013; 64(2): 477-85. \n[27] Lloyd CM. IL-33 family members and asthma - bridging innate and \nadaptive immune responses. Curr Opin Immunol 2010; 22(6): 800-\n6. \n[28] Chang YJ, Kim HY, Albacker LA, et al. Innate lymphoid cells \nmediate influenza-induced airway hyper-reactivity independently \nof adaptive immunity. Nat Immunol 2011; 12(7): 631-8. \n[29] Kouzaki H, Iijima K, Kobayashi T, O'Grady SM, Kita H. The \nDanger Signal, Extracellular ATP, Is a Sensor for an Airborne \nAllergen and Triggers IL-33 Release and Innate Th2-Type \nResponses. J Immunol 2011; 186(7): 4375-87. \n[30] Tamachi T, Maezawa Y, Ikeda K, et al. IL-25 enhances allergic \nairway inflammation by amplifying a TH2 cell-dependent pathway \nin mice. J Allergy Clin Immunol 2006; 118(3): 606-14. \n[31] Angkasekwinai P, Park H, Wang YH, et al. Interleukin 25 \npromotes the initiation of proallergic type 2 responses. J Exp Med \n2007; 204(7): 1509-17. \n[32] Doherty TA, Khorram N, Sugimoto K, et al. Alternaria Induces \nSTAT6-Dependent Acute Airway Eosinophilia and Epithelial \nFIZZ1 Expression That Promotes Airway Fibrosis and Epithelial \nThickness. J Immunol 2012; 188(6): 2622-9. \n[33] Barlow JL, Peel S, Fox J, et al. IL-33 is more potent than IL-25 in \nprovoking IL-13-producing nuocytes (type 2 innate lymphoid cells) \nand airway contraction. J Allergy Clin Immunol 2013; 132(4): 933-\n41. \n[34] Chu DK, Llop-Guevara A, Walker TD, et al. IL-33, but not thymic \nstromal lymphopoietin or IL-25, is central to mite and peanut \nallergic sensitization. J Allergy Clin Immunol 2013; 131(1): 187-\n200 e1-8. \n[35] Ito T, Wang YH, Duramad O, et al. TSLP-activated dendritic cells \ninduce an inflammatory T helper type 2 cell response through \nOX40 ligand. J Exp Med 2005; 202(9): 1213-23. \n[36] Al-Shami A, Spolski R, Kelly J, Keane-Myers A, Leonard WJ. A \nrole for TSLP in the development of inflammation in an asthma \nmodel. J Exp Med 2005; 202(6): 829-39. \n[37] Halim TY, Krauss RH, Sun AC, Takei F. Lung natural helper cells \nare a critical source of Th2 cell-type cytokines in protease allergen-\ninduced airway inflammation. Immunity 2012; 36(3): 451-63. \n[38] Kim BS, Siracusa MC, Saenz SA, et al. TSLP elicits IL-33-\nindependent innate lymphoid cell responses to promote skin \ninflammation. Sci Transl Med 2013; 5(170): 170ra16. \n[39] Barnig C, Cernadas M, Dutile S, et al. Lipoxin A4 regulates natural \nkiller cell and type 2 innate lymphoid cell activation in asthma. Sci \nTransl Med 2013; 5(174): 174ra26. \n[40] Doherty TA, Khorram N, Lund S, Mehta AK, Croft M, Broide DH. \nLung type 2 innate lymphoid cells express cysteinyl leukotriene \nreceptor 1, which regulates TH2 cytokine production. J Allergy \nClin Immunol 2013; 132(1): 205-13. \n[41] Boyce JA. Mast cells and eicosanoid mediators: a system of \nreciprocal paracrine and autocrine regulation. Immunol Rev 2007; \n217: 168-85. \nType 2 Innate Lymphoid Cells in Allergic Disease Current Immunology Reviews, 2013, Vol. 9, No. 4     221 \n[42] Chang JE, Doherty TA, Baum R, Broide D. Prostaglandin D2 \nregulates human type 2 innate lymphoid cell chemotaxis. J Allergy \nClin Immunol 2014; 133(3): 899-901. \n[43] Meylan F, Richard AC, Siegel RM. TL1A and DR3, a TNF family \nligand-receptor pair that promotes lymphocyte costimulation, \nmucosal hyperplasia, and autoimmune inflammation. Immunol Rev \n2011; 244(1): 188-96. \n[44] Meylan F, Davidson TS, Kahle E, et al. The TNF-family receptor \nDR3 is essential for diverse T cell-mediated inflammatory diseases. \nImmunity 2008; 29(1): 79-89. \n[45] Yu X, Pappu R, Ramirez-Carrozzi V, et al. TNF superfamily \nmember TL1A elicits type 2 innate lymphoid cells at mucosal \nbarriers. Mucosal Immunol 2013 Nov 13. doi: 10.1038/mi.2013.92. \n[46] Turner JE, Morrison PJ, Wilhelm C, et al. IL-9-mediated survival \nof type 2 innate lymphoid cells promotes damage control in \nhelminth-induced lung inflammation. J Exp Med 2013 Nov 18. \n[Epub ahead of print] \n[47] Kurowska-Stolarska M, Kewin P, Murphy G, et al. IL-33 induces \nantigen-specific IL-5+ T cells and promotes allergic-induced \nairway inflammation independent of IL-4. J Immunol 2008; 181(7): \n4780-90. \n[48] Nussbaum JC, Van Dyken SJ, von Moltke J, et al. Type 2 innate \nlymphoid cells control eosinophil homeostasis. Nature 2013; \n502(7470): 245-8. \n[49] Monticelli LA, Sonnenberg GF, Abt MC, et al. Innate lymphoid \ncells promote lung-tissue homeostasis after infection with influenza \nvirus. Nat Immunol 2011; 12(11): 1045-54. \n[50] Wilhelm C, Hirota K, Stieglitz B, et al. An IL-9 fate reporter \ndemonstrates the induction of an innate IL-9 response in lung \ninflammation. Nat Immunol 2011; 12(11): 1071-7. \n[51] Soroosh P, Doherty TA. Th9 and allergic disease. Immunology \n2009; 127(4): 450-8. \n[52] Bando JK, Nussbaum JC, Liang HE, Locksley RM. Type 2 innate \nlymphoid cells constitutively express arginase-I in the naive and \ninflamed lung. J Leukoc Biol 2013; 94(5): 877-84. \n[53] Kim BS, Wojno ED, Artis D. Innate lymphoid cells and allergic \ninflammation. Curr Opin Immunol. 2013 Aug 31. doi: \n10.1016/j.coi.2013.07.013. \n[54] Klein Wolterink RG, Hendriks RW. Type 2 innate lymphocytes in \nallergic airway inflammation. Curr Allergy Asthma Rep 2013; \n13(3): 271-80. \n[55] Barlow JL, Bellosi A, Hardman CS, et al. Innate IL-13-producing \nnuocytes arise during allergic lung inflammation and contribute to \nairways hyperreactivity. J Allergy Clin Immunol 2012; 129(1): \n191-8 e1-4. \n[56] Klein Wolterink RG, Kleinjan A, van Nimwegen M, et al. \nPulmonary innate lymphoid cells are major producers of IL-5 and \nIL-13 in murine models of allergic asthma. Eur J Immunol 2012; \n42(5): 1106-16. \n[57] Fajt ML, Gelhaus SL, Freeman B, et al. Prostaglandin D(2) \npathway upregulation: relation to asthma severity, control, and TH2 \ninflammation. J Allergy Clin Immunol 2013; 131(6): 1504-12. \n[58] Prefontaine D, Lajoie-Kadoch S, Foley S, et al. Increased \nexpression of IL-33 in severe asthma: evidence of expression by \nairway smooth muscle cells. J Immunol 2009; 183(8): 5094-103. \n[59] Oshikawa K, Kuroiwa K, Tago K, et al. Elevated soluble ST2 \nprotein levels in sera of patients with asthma with an acute \nexacerbation. Am J Respir Crit Care Med 2001; 164(2): 277-81. \n[60] Corrigan CJ, Wang W, Meng Q, et al. Allergen-induced expression \nof IL-25 and IL-25 receptor in atopic asthmatic airways and late-\nphase cutaneous responses. J Allergy Clin Immunol 2011; 128(1): \n116-24. \n[61] Ying S, O'Connor B, Ratoff J, et al. Thymic stromal lymphopoietin \nexpression is increased in asthmatic airways and correlates with \nexpression of Th2-attracting chemokines and disease severity. J \nImmunol 2005; 174(12): 8183-90. \n[62] Allakhverdi Z, Comeau MR, Smith DE, et al. CD34+ hemopoietic \nprogenitor cells are potent effectors of allergic inflammation. J \nAllergy Clin Immunol 2009; 123(2): 472-8. \n[63] Fokkens WJ, Lund VJ, Mullol J, et al. EPOS 2012: European \nposition paper on rhinosinusitis and nasal polyps 2012. A summary \nfor otorhinolaryngologists. Rhinology 2012; 50(1): 1-12. \n[64] Shaw JL, Fakhri S, Citardi MJ, et al. IL-33-responsive innate \nlymphoid cells are an important source of IL-13 in chronic \nrhinosinusitis with nasal polyps. Am J Respir Crit Care Med 2013; \n188(4): 432-9. \n[65] Nagarkar D. Thymic stromal lymphopoietin activity is increased in \nnasal polyps of patients with chronic rhinosinusitis. J Allergy Clin \nImmunol 2013; 132(3): 593-600. \n[66] Akdis CA, Bachert C, Cingi C, et al. Endotypes and phenotypes of \nchronic rhinosinusitis: a PRACTALL document of the European \nAcademy of Allergy and Clinical Immunology and the American \nAcademy of Allergy, Asthma & Immunology. J Allergy Clin \nImmunol 2013; 131(6): 1479-90. \n[67] Van Zele T, Claeys S, Gevaert P, et al. Differentiation of chronic \nsinus diseases by measurement of inflammatory mediators. Allergy \n2006; 61(11): 1280-9. \n[68] Roediger B, Kyle R, Yip KH, et al. Cutaneous immunosurveillance \nand regulation of inflammation by group 2 innate lymphoid cells. \nNat Immunol 2013; 14(6): 564-73. \n[69] Imai Y, Yasuda K, Sakaguchi Y, et al. Skin-specific expression of \nIL-33 activates group 2 innate lymphoid cells and elicits atopic \ndermatitis-like inflammation in mice. Proc Natl Acad Sci USA \n2013; 110(34): 13921-6. \n[70] Soumelis V, Reche PA, Kanzler H, et al. Human epithelial cells \ntrigger dendritic cell mediated allergic inflammation by producing \nTSLP. Nat Immunol 2002; 3(7): 673-80. \n[71] Savinko T, Matikainen S, Saarialho-Kere U, et al. IL-33 and ST2 \nin atopic dermatitis: expression profiles and modulation by \ntriggering factors. J Invest Dermatol 2012; 132(5): 1392-400. \n[72] Barrett NA, Rahman OM, Fernandez JM, et al. Dectin-2 mediates \nTh2 immunity through the generation of cysteinyl leukotrienes. J \nExp Med 2011; 208(3): 593-604. \n[73] Fukuoka A, Futatsugi-Yumikura S, Takahashi S, et al. \nIdentification of a novel type 2 innate immunocyte with the ability \nto enhance IgE production. Int Immunol 2013; 25(6): 373-82. \n \n \nReceived: October 10, 2013 Revised: December 3, 2013 Accepted: December 4, 2013 \n",
    "Link": "https://core.ac.uk/download/323064316.pdf"
}