{
    "Title": "Genome-wide association and HLA fine-mapping studies identify risk loci and genetic pathways underlying allergic rhinitis",
    "Authors": "A Kamburov, A Puel, A Ramasamy, A Subramanian, Abdel Abdellaoui, Adnan Custovic, Albert M. Levin, Alexessander C. Alves, Amalia Barreto-Luis, AN Greiner, Andre F. S. Amaral, Andreas Arnold, Angela Simpson, AO Lucas, AP Bento, Ashish Kumar, AV Segrè, B Björkstén, B Bulik-Sullivan, B Jahn-Schmid, B León, BM Javierre, BP Fairfax, C Fagnani, C Rückert, C Tian, Carlos Flores, Carol A. Wang, Carole Ober, Catharina E. M. van Beijsterveldt, CC Chang, CE Hamblet, Chao Tian, Christian Gieger, Craig E. Pennell, CV Rothlin, D Karolchik, D Szklarczyk, DA Hinds, Dan L. Nicolae, David A. Hinds, David P. Strachan, David Torrents, Deborah A. Meyers, Deborah L. Jarvis, DK Sethi, DM Anderson, Dorret I. Boomsma, E Kreiner, Elisabeth Thiering, Ellen A. Nohr, Erik Melén, Esteban G. Burchard, Eugene R. Bleecker, F Lundmark, Fabian Lorenzo-Diaz, Frank Gilliland, Franz Rüschendorf, G Cavalli, G Willemsen, Gardar Sveinbjornsson, Gonneke Willemsen, Göran Pershagen, H Gao, Hans Bisgaard, Hansjörg Baurecht, Herman T. den Dekker, HJ Westra, HM Berman, Hongsheng Gui, Ingileif Jónsdóttir, Ivan Curjuric, J Bousquet, J Cairns, J Kettunen, J Nicodemus-Johnson, J Yang, J Zheng, Jaakko Kaprio, JB Andersen, Joachim Heinrich, Johannes Waage, John A. Curtin, John Henderson, Jonathan Thorsen, Jordi Sunyer, Josep M. Antó, Josep M. Mercader, Joyce Y. Tung, JR Conway, Julia Dmitrieva, K Bønnelykke, Kamilla K. Jensen, Kari Stefansson, Klaus Bønnelykke, L Paternoster, L. Keoki Williams, Lavinia Paternoster, Leon E. Jessen, Liesbeth Duijts, LM Scott, M Böhme, M Hayashi, MA Ferreira, Manuel A. Ferreira, MAR Ferreira, Maria Pino-Yanes, Marie Standl, Marjo-Riitta Jarvelin, Markus J. Ege, Maties Torrent, MD Kassmeier, Medea Imboden, MF Moffatt, Michael Kabesch, Michel Georges, N Pearce, Natalia Hernandez-Pacheco, Nathan Schoettler, Nicole M. Probst-Hensch, Patrick Holt, Philip J. Thompson, PY Chan, R Mägi, R Roychoudhuri, R Shinnakasu, R Vita, Rachel Myers, Raquel Granell, S Bunyavanich, Scott Weiss, Shyamali C. Dharmage, Stephan Weidinger, Supinda Bunyavanich, Susanne Brix, Sílvia Bonàs-Guarch, T Lawrence, T Mori, Tarunveer S. Ahluwalia, Teemu Palviainen, TH Pers, Torben Hansen, TW Winkler, TYF Halim, UK10K Consortium., Vincent W. V. Jaddoe, W McLaren, W. James Gauderman, Wellcome Trust Case Control Consortium., X Jia, X Zheng, Xingnan Li, Y Momozawa, Young-Ae Lee, Zhanghua Chen",
    "Year": "No year available",
    "Abstract": "Allergic rhinitis is the most common clinical presentation of allergy, affecting 400 million people worldwide, with increasing incidence in westernized countries1,2. To elucidate the genetic architecture and understand the underlying disease mechanisms, we carried out a meta-analysis of allergic rhinitis in 59,762 cases and 152,358 controls of European ancestry and identified a total of 41 risk loci for allergic rhinitis, including 20 loci not previously associated with allergic rhinitis, which were confirmed in a replication phase of 60,720 cases and 618,527 controls. Functional annotation implicated genes involved in various immune pathways, and fine mapping of the HLA region suggested amino acid variants important for antigen binding. We further performed genome-wide association study (GWAS) analyses of allergic sensitization against inhalant allergens and nonallergic rhinitis, which suggested shared genetic mechanisms across rhinitis-related traits. Future studies of the identified loci and genes might identify novel targets for treatment and prevention of allergic rhinitis",
    "Keywords": "No keywords available",
    "Publisher": "'Springer Science and Business Media LLC'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " 1 Genome-wide association and HLA fine mapping studies identify risk loci and genetic 1 pathways of allergic rhinitis 2  3  4 Johannes Waage1†, Marie Standl2†, John A Curtin3, Leon Jessen1, Jonathan Thorsen1, The 5 23andMe_Research_Team4, AAGC_collaborators4, Abdel Abdellaoui5, Tarunveer S Ahluwalia1, Alexander Alves6, 6 Andre F S Amaral7, Josep Maria Antó8, Andreas Arnold9, Carlos Flores10,30, Hansjörg Baurecht11, Toos CEM 7 Beijsterveldt5, Eugene R. Bleecker12, Sílvia Bonàs-Guarch13, Dorret Boomsma5,14, Susanne Brix15, Supinda 8 Bunyavanich16, Esteban Burchard17,18, Zhanghua Chen19, Ivan Curjuric20,21, Adnan Custovic22, Martijn den 9 Dekker23,24,25, Shyamali C. Dharmage26, Julia Dmitrieva27, Liesbeth Duijts23,24,25,28, Markus Ege29, Amalia Barreto-10 Luis10, W. James Gauderman19, Michel Georges27, Christian Gieger31,32, Frank Gilliland19, Raquel Granell33, 11 Hongsheng Gui34, Torben Hansen35, Joachim Heinrich2,36, John Henderson33, Natalia Hernandez-Pacheco10,37, David 12 A. Hinds38, David Hinds38, Patrick Holt39, Medea Imboden20,21, Vincent Jaddoe23,24,25, Marjo-Riita Jarvelin6, Deborah L 13 Jarvis7, Kamilla K Jensen40, Ingileif Jónsdóttir41,42, Michael Kabesch43, Jaakko Kaprio44,45,46, Ashish Kumar47,48,49, 14 Young-Ae Lee50,51, Albert M Levin52, Xingnan Li53, Fabian Lorenzo-Diaz37, Erik Melén47,54, Josep Maria 15 Mercader13,55,56, Deborah A. Meyers12, Rachel Myers57, Dan L. Nicolae57, Ellen Nohr58, Teemu Palviainen45, Lavinia 16 Paternoster59, Lavinia Paternoster59, Craig Pennell60, Göran Pershagen47,61, Maria Pino-Yanes10,30,37, Nicole M 17 Probst-Hensch20,21, Franz Rüschendorf50, Nathan Schoettler57, Angela Simpson3, Kari Stefansson41,42, Jordi Sunyer8, 18 Gardar Sveinbjornsson41, Elisabeth Thiering2,62, Philip J. Thompson63, Chao Tian38, Chao Tian38, Maties Torrent64, 19 David Torrents13,65, Joyce Y. Tung38, Carol Wang60, Stephan Weidinger11, Scott Weiss66, Gonneke Willemsen5, L 20 Keoki Williams34,67, Carole Ober57, Manuel A. Ferreira68, Hans Bisgaard1, David Strachan69, Klaus Bønnelykke1 21  22 Corresponding author: Hans Bisgaard1 23  24  25 1COPSAC, Copenhagen Prospective Studies on Asthma in Childhood, Herlev and Gentofte Hospital, University of 26 Copenhagen, Copenhagen, Denmark. 2Institute of Epidemiology I, Helmholtz Zentrum München - German Research 27 Center for Environmental Health, Neuherberg, Germany. 3Centre for Respiratory Medicine and Allergy, Institute of 28 Inflammation and Repair, University of Manchester and University Hospital of South Manchester, Manchester 29 Academic Health Sciences Centre, Manchester, UK. 4To be listed in Supplementary Information. 5Dept Biological 30 Psychology, Netherlands Twin Register, VU University, Amsterdam. 6Department of Epidemiology and Biostatistics, 31 School of Public Health, Imperial College, London, UK. 7Population Health and Occupational Disease, National Heart 32 and Lung Institute, Imperial College London, London, UK. 8ISGlobal-Center for Research in Environmental 33 Epidemiology (CREAL), Universitat Pompeu Fabra (UPF), CIBER Epidemiología y Salud Pública (CIBERESP), 34 Barcelona, Spain. 9Clinic and Polyclinic of Dermatology, University Medicine Greifswald, Greifswald, Germany. 35 10Research Unit, Hospital Universitario N.S. de Candelaria, Universidad de La Laguna, Tenerife, Spain. 11Department 36 of Dermatology, Venereology and Allergology, University-Hospital Schleswig-Hostein, Campus Kiel, Kiel, Germany. 37 12Divisions of Pharmacogenomics and Genetics, Genomics and Precision Medicine, Department of Medicine, 38 University of Arizona College of Medicine, Tucson, AZ, USA. 13Barcelona Supercomputing Center (BSC). Joint BSC-39 CRG-IRB Research Program in Computational Biology, Barcelona, Spain. 14EMGO Institute for Health and Care 40 Research. 15Department of Biotechnology and Biomedicine, Technical University of Denmark, Kgs. Lyngby, 41 Denmark. 16Department of Genetics and Genomic Sciences, Icahn School of Medicine at Mount Sinai, New York, NY, 42 USA. 17Department of Medicine, University of California San Francisco, San Francisco, California, USA. 43 18Department of Bioengineering & Therapeutic Sciences, University of California San Francisco, San Francisco, 44 California, USA. 19Dept of Preventive Medicine, University of Southern California, Keck School of Medicine. 45 20University of Basel, Switzerland. 21Swiss Tropical and Public Health Institute, Basel, Switzerland. 22Department of 46 Paediatrics, Imperial College London, UK. 23The Generation R Study Group. 24Department of Pediatrics, division of 47 Respiratory Medicine. 25Department of Epidemiology, Erasmus Medical Center, Rotterdam, the Netherlands. 48 26Melbourne School of Population and Global Health, University of Melbourne, Melbourne, Australia . 27Laboratory of 49 Animal Genomics, Unit of Medical Genomics, GIGA Institute, University of Liège, Belgium. 28Department of 50 Pediatrics, division of Neonatology. 29LMU Munich, Dr von Hauner Children's Hospital, Munich and German Center 51 for Lung Research (DZL), Munich, Germany. 30CIBER de Enfermedades Respiratorias (CIBERES), Instituto de Salud 52 Carlos III, Madrid, Spain. 31Research Unit of Molecular Epidemiology, Helmholtz Zentrum München–German 53 Research Center for Environmental Health, Neuherberg, Germany. 32Institute of Epidemiology II, Helmholtz Zentrum 54 München–German Research Center for Environmental Health, Neuherberg, Germany. 33School of Social and 55  2 Community Medicine, University of Bristol, UK. 34Center for Health Policy and Health Services Research, Henry Ford 56 Health System, Detroit, MI, USA. 35Novo Nordisk Foundation Center for Basic Metabolic Research, Section of 57 Metabolic Genetics, Department of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark. 58 36Institute and Outpatient Clinic for Occupational, Social and Environmental Medicine, University of Munich Medical 59 Center, Ludwig-Maximilians-Universität München, Munich, Germany. 37Genomics and Health Group, Department of 60 Biochemistry, Microbiology, Cell Biology and Genetics, Universidad de La Laguna, La Laguna, Tenerife, Spain. 61 3823andMe, Inc., Mountain View, California, USA. 39Telethon Kids Institute (TKI), Perth Australia. 40Department of 62 Bioinformatics, Technical University of Denmark, Kgs. Lyngby, Denmark. 41deCODE genetics / Amgen Inc, Reykjavik, 63 Iceland. 42Faculty of Medicine, University of Iceland, Reykjavik, Iceland. 43Department of Pediatric Pneumology and 64 Allergy, University Children`s Hospital Regensburg (KUNO), Regensburg, Germany. 44Department of Public Health, 65 University of Helsinki, Helsinki, Finland. 45Institute for Molecular Medicine Finland FIMM, University of Helsinki, 66 Helsinki, Finland. 46National Institute for Health and Welfare, Helsinki, Finland. 47Institute of Environmental Medicine, 67 Karolinska Institutet, Stockholm, Sweden. 48Department of Public Health Epidemiology, Unit of Chronic Disease 68 Epidemiology, Swiss Tropical and Public Health Institute, Basel, Switzerland. 49University of Basel, Basel, 69 Switzerland. 50Max-Delbrück-Center (MDC) for Molecular Medicine, Berlin, Germany. 51Clinic for Pediatric Allergy, 70 Experimental and Clinical Research Center, Charité Universitätsmedizin Berlin, Germany. 52Department of Public 71 Health Sciences, Henry Ford Health System, Detroit, MI, USA. 53Divisions of Genetics, Genomics and Precision 72 Medicine, Department of Medicine, University of Arizona College of Medicine, Tucson, AZ, USA. 54Sachs' Children's 73 Hospital, Stockholm, Sweden. 55Programs in Metabolism and Medical & Population Genetics, Broad Institute of 74 Harvard and MIT, Cambridge, Massachusetts, USA. 56Diabetes Unit and Center for Genomic Medicine, 75 Massachusetts General Hospital, Boston, Massachusetts, USA. 57Department of Human Genetics, University of 76 Chicago, Chicago IL, USA. 58Institute of Clinical Research, University of Southern Denmark, Department of Obstetrics 77 & Gynecology, Odense University Hospital, Odense, Denmark. 59MRC Integrative Epidemiology Unit at the University 78 of Bristol, School of Social and Community Medicine, University of Bristol, UK. 60Division of Obstetrics and 79 Gynaecology, The University of Western Australia (UWA), Perth, Australia. 61Centre for Occupational and 80 Environmental Medicine, Stockholm County Council, Stockholm. 62Ludwig-Maximilians-University of Munich, Dr. von 81 Hauner Children's Hospital, Division of Metabolic Diseases and Nutritional Medicine, Munich, Germany. 63Institute for 82 Respiratory Health, Harry Perkins Institute of Medical Research, University of Western Australia, Nedlands, Australia. 83 64ib-salut, Area de Salut de Menorca, Menorca, Spain. 65Institució Catalana de Recerca i Estudis Avançats (ICREA), 84 Barcelona, Spain. 66Channing Division of Network Medicine, Brigham & Women's Hospital and Harvard Medical 85 School, Boston, MA, USA. 67Department of Internal Medicine, Henry Ford Health System, Detroit, MI, USA. 68QIMR 86 Berghofer Medical Research Institute, Brisbane, Queensland, Australia. 69Population Health Research Institute, St 87 George's, University of London, London, UK. 88  89 †These authors contributed equally to this work 90   91  3 Introduction 92 Allergic rhinitis is the most common clinical presentation of allergy, affecting 400 million people 93 worldwide, and with increasing incidence in westernized countries.1,2 To elucidate the genetic 94 architecture and understand disease mechanisms of allergic rhinitis, we carried out a meta-95 analysis of allergic rhinitis in 59,762 cases and 152,358 controls of European ancestry and 96 identified a total of 41 risk loci for allergic rhinitis, including 20 loci not previously associated with 97 allergic rhinitis, which were confirmed in a replication phase of 60,720 cases and 618,527 98 controls. Functional annotation implied genes involved in various immune pathways, and fine 99 mapping of the HLA region suggested amino acid variants of importance for antigen binding. 100 We further performed GWASs of allergic sensitization against inhalant allergens and non-101 allergic rhinitis suggesting shared genetic mechanisms across rhinitis-related traits. Future 102 studies of the identified loci and genes might identify novel targets for treatment and prevention 103 of allergic rhinitis.   104  105 Main text 106 Allergic rhinitis (AR) is an inflammatory disorder of the nasal mucosa mediated by 107 allergic hypersensitivity responses to environmental allergens1 with large adverse effects on 108 quality of life and health care expenditures. The underlying causes for AR are still not 109 understood and prevention of the disease is not possible. The heritability of AR is estimated to 110 be more than 65%3,4. Seven loci have been associated and with allergic rhinitis in genome-wide 111 association studies (GWAS) of AR per se, while other have been suggested from GWAS 112 studies on related traits, such as self-reported allergy, asthma plus hay fever, or allergic 113 sensitization5–9, but only few of these have been replicated. 114 We carried out a large-scale meta-GWAS of AR including a discovery meta-analysis of 115 16,531,985 genetic markers from 18 studies comprising 59,762 cases and 152,358 controls of 116 primarily European ancestry (Supplementary Table 1, cohort recruitment details in 117 Supplementary Note). We report the genetic heritability on the liability scale of AR as at least 118 7.8% (assuming 10% disease prevalence), with a genomic inflation of 1.048 (Supplementary 119 Figure 1). We identified 42 genetic loci, with index markers below genomewide significance 120 (p<5e-8), of which 21 have previously been reported in relation to AR or other inhalant allergy6–9 121 (Fig. 1, Table 1, Supplementary Fig. 2, Supplementary Fig. 3).  122 One study (23andMe) had a proportionally large weight (~80%) in the discovery phase. 123 Overall  there was good agreement between 23andMe and the other studies with respect to 124 effect size and direction, and regional association patterns (Supplementary Table 2 and 125 Supplementary Fig. 4+5), and the genetic correlation was 0.80 (p<2e-17). Heterogeneity 126 between 23andMe and the remaining studies was statistically significant (p<0.05) for 7 of 42 127 loci, in most cases due to a smaller effect size in 23andMe. This was likely due to many non-128 23andMe studies using a more robust phenotype definition of doctor diagnosed AR 129 (Supplementary Table 3), which tended to result in larger effect sizes (Supplementary Table 130 4).  131  4   The index markers from a total of 25 loci that had not previously been associated 132 with AR or other inhalant allergy were carried forward to the replication phase. These included 133 16 loci that showed genome-wide significant association in the discovery phase and evidence of 134 association (p<0.05) in both 23andMe and non-23andMe studies (Supplementary Table 2), 135 and an additional 9 loci that were selected from the p-value stratum between 5e-8 and 1e-6 136 based on enrichment of gene sets involved in immune-signalling (Supplementary Table 5). 137 Replication was sought in another 10 studies with 60,720 cases and 618,527 controls. Of the 25 138 loci, 20 loci reached a Bonferroni-corrected significance threshold of 0.05 (p<0.0019) in a meta-139 analysis of replication studies (Fig. 1 (blue), Table 1), and all of these reached genome-wide 140 significance in the combined fixed-effect meta-analysis of discovery and replication studies 141 (Table 1). Evidence of heterogeneity was seen for one of these loci (rs1504215), which did not 142 reach statistical significance in the random effects model (0.95 [0.92; 0.97], p=2.83e-07, 143 Supplementary Fig. 3).  144  A conditional analysis of top loci identified 13 additional independent variants at 145 p<1e-5, with 4 of these being genome-wide significant (near WDR36, HLA-DQB1, IL1RL1 and 146 LPP) (Supplementary Table 6 and Supplementary Fig. 5, bottom panel). 147 To gain insight into functional consequences of known and novel loci, we utilised a number of 148 data sources, including 1) 11 eQTL sets and 1 meQTL set from blood and blood subsets; 2) 2 149 eQTL sets and 1 meQTL set from lung tissue; and 3) data on enhancer-promoter interactions in 150 15 different blood subsets. Support of regulatory effects on coding genes was found for 33 out 151 of the 41 loci. Many loci showed evidence of regulatory effects across a wide range of immune 152 cell types (including B- and T-cells), while other seemed cell type-specific, like e.g. innate 153 lymphoid cells (Table 2 and Supplementary Table 7). Calculation of the “credible set” of 154 markers for each locus using a Bayesian approach that selects markers likely to contain the 155 causal disease-associated markers (Supplementary Table 8) and looking up these in the 156 Variant Effect Predictor database generated a list of 17 markers producing amino acid changes, 157 including deleterious changes in NUSAP1, SULT1A1 and PLCL, as predicted by SIFT 158 (Supplementary Table 9). 159 The major histocompatibility complex on chr6p harbored some of the strongest association 160 signals in the GWAS with 2 independent signals located around HLA-DQB and HLA-B, 161 respectively. The top variant at HLA-DQB was an eQTL for several HLA-genes, including HLA-162 DQB1, HLA-DQA1, HLA-DQA2, and HLA-DRB1 in immune and/or lung tissue, and the top 163 variant at HLA-B was an eQTL for MICA (Supplementary Table 7). In addition we found highly 164 significant associations with several well imputed amino acid variants (Supplementary Tables 165 10 and 11). Importantly, the strongest associated amino acid variants in HLA-DQB1 and HLA-B, 166 respectively (Supplementary Table 10) were both located in the peptide binding pockets with a 167 high likelihood of affecting MHC-peptide interaction (Figure 2). MHC class II molecules, 168 including HLA-DQ, are known for their role in allergen-binding and Th2 driven immune 169 responses. 10 The strong association with HLA-DQB1 His30 (p=2.06e-28, OR=0.91) in the 170 peptide binding pocket, and the moderate LD (r2=0.71) with the GWAS top SNP rs3400401, 171 therefore suggest that the association signal at this locus involves changes in allergen binding 172 properties by HLA-DQ and thereby altered risk of allergen-specific immunity. We also found 173 association with several classical HLA alleles, including HLA-DQB1*02:02, HLA-DQB1*03:01, 174  5 HLA-DRB1*04:01, and HLA-C*04:01, which were in weak LD (r2<0.1) with the GWAS top SNPs 175 (Supplementary Tables 12 and 13). These findings suggest that genetic associations in HLA-176 MHC region both involve variants affecting gene regulation and structure, similar to what has 177 been found for autoimmune disease.11,12 178 The majority of the 20 loci not previously associated with AR per se imply genes with a 179 known role in the immune system, including IL7R13, 14, SH2B315, CEBPA/CEBPG16, 17, CXCR518, 180 FCER1G, NFKB119, BACH220, 21, TYRO322, LTK 23, VPRBP24, SPPL325, OASL26, RORA27, and 181 TNFSF1128. Other loci imply genes with no clear function in AR pathogenesis. These include 182 one of the strongest associated loci in this meta-analysis at 12q24.31 with the top-signal located 183 between CDK2AP1 and C12orf65, harboring cis-eQTLs in blood and lung tissue for several 184 genes and evidence for enhancer-promoter interaction with DDX55 in various immune cells. 185 (Table 2 and further locus description in the Supplementary Note). Concomitantly with the 186 current study, a GWAS combining asthma, eczema and AR was conducted.29 The majority 187 (15/20) of identified AR loci in our study were also suggested in the previous, more unspecific, 188 GWAS29 (as indicated in Tables 1 and 2), while many suggested loci from the previous GWAS 189 were not identified in our study. Asthma, eczema and allergic rhinitis are related but distinct 190 disease entities, often with separate disease mechanisms, e.g. allergic sensitization is present 191 in only 50% of children with asthma30 and 35% of children with eczema.31 Our results therefore 192 complement those from the less specific “atopic phenotype” GWAS29 by pinpointing loci 193 specifically associated, and replicated, in relation to allergic rhinitis.   194 AR loci were significantly enriched (p<1e-5) for variants reported to be associated with 195 autoimmune disorders. Reported autoimmune variants were located within a 1mb distance of 31 196 (76%) of the 41 AR loci. For 24 of these, an autoimmune top SNP was also associated with AR, 197 and for 12 of these the autoimmune top SNP was in LD (r2>0.5) with the AR top SNP 198 (Supplementary Table 14). For approximately half of these, the direction of effect was the 199 same for the autoimmune and AR top SNP in line with a previous study,32 underlining the 200 complex genetic relationship between AR and autoimmunity, which might involve shared as well 201 as diverging molecular mechanisms.  202 Assessment of enrichment of AR-associated variant burden in open chromatin as defined by 203 DNAse hypersensitive sites showed a clear enrichment in several blood and immune cell 204 subsets, with the largest enrichment in T-cells (CD3 expressing), B-cells (CD19 expressing), 205 and T and NK-cells (CD56-expressing) (Fig. 3, Supplementary Table 15, Supplementary Fig. 206 6). We also probed tissue enrichment by means of gene expression data from a wide number of 207 sources, showing enrichment of AR genes in blood and immune cell subsets, as well as in 208 tissues of the respiratory system, including oropharynx, respiratory and nasal mucosa 209 (Supplementary Table 16).  210 To explore biological connections and identify new pathways associated with AR, we combined 211 all genes suggested from eQTL/meQTL analyses, enhancer-promoter interactions and 212 localization within the top loci. The resultant prioritized gene set consisted of 255 genes, of 213 which 89 (~36%) were present in more than one set (Supplementary Fig. 7). Overall, the full 214 set was enriched for pathways involved in Th1 and Th2 Activation (Fig. 4), antigen presentation, 215 cytokine signaling, and inflammatory responses (Supplementary Table 17).    216  6 Using the 255 prioritized genes in combination with STRING to identify proteins that interact 217 with the proteins encoded by the high priority genes, we demonstrated a high degree of 218 interaction at the protein level, and several of these proteins are target of approved drugs or 219 drugs in development, including TNFSF11, NDUFAF1, PD-L1, IL-5, and IL-13  (Fig. 4).  220 AR is strongly correlated to allergic sensitization (presence of allergen-specific IgE), but 221 sensitization is often present without AR suggesting specific mechanisms determining 222 progression from sensitization to disease. We therefore conducted a GWAS on sensitization to 223 inhalant allergens (AS) comprising 8,040 cases and 16,441 controls from 13 studies 224 (Supplementary Table 1), making it the largest GWAS on allergic sensitization to date7. A total 225 of 10 loci reached genome-wide significance, including one novel hit near the FASLG gene 226 (Supplementary Table 18). The genetic heritability on the liability scale was 17.75% (10% 227 prevalence), considerably higher than the heritability of AR in consistency with a more 228 homogeneous phenotype. Look-up of AR top-loci in the AS GWAS demonstrated large 229 agreement with 39 of the 41 AR markers showing same direction of effect and 28 also showing 230 nominal significance for AS (Supplementary Table 19). This suggests that AR and AS share 231 biological mechanisms and that AS loci generally affect systemic allergic sensitization. We 232 compared genetic pathways of AR and AS using the DEPICT tool showing overlap in enriched 233 pathways but also differences among the top gene sets, with AR gene sets characterized by B-234 cell, Th2, and parasite responses and AS gene sets characterized by a broader activation of 235 cells (Supplementary Fig 8 and Supplementary Tables 20 and 21).  236 Non-allergic rhinitis, defined as rhinitis symptoms without evidence of allergic sensitization, is a 237 common but poorly understood disease entity.33 We performed the first GWAS on this 238 phenotype hypothesizing that this might reveal specific rhinitis mechanisms. The analysis 239 included 2,028 cases and 9,606 controls from 9 studies but did not identify any risk loci at the 240 genome-wide significance level. Comparison with AR results suggested some overlap in 241 susceptibility loci (Supplementary Note and Supplementary Table 22).  242 We estimated the proportion of AR in the general population that can be attributed to the 41 243 identified AR loci and obtained a conservative population-attributable risk fraction estimate of 244 39% (95% CI 26%-50%), considering the 10% of the population with the lowest genetic risk 245 scores to represent an ‘unexposed’ group. Allergic rhinitis prevalence plotted by genetic risk 246 score (Supplementary Fig. 9) showed approximately 2 times higher prevalence in the 7% of 247 the population with the highest risk score compared to the 7% with the lowest risk score.   248 Finally, we investigated the genetic correlation of AR with AS, asthma34, and eczema35 by LD 249 score regression. There was a strong correlation between AR and AS (r2=0.73, p<2e-34), 250 moderate with asthma (r2=0.60, p<3e-14) and weaker with eczema (r2=0.40, p<2e-07). 251 In conclusion, we expanded the number of established susceptibility loci for AR and highlighted 252 involvement of AR susceptibility loci in diverse immune cell types and both innate and adaptive 253 IgE-related mechanisms. Future studies of novel AR loci might identify targets for treatment and 254 prevention of disease. 255  256   257  7 Methods: 258 Phenotype definition  259 Allergic rhinitis (AR) 260 Cases were defined as individuals ever having a diagnosis or symptoms of AR dependant on 261 available phenotype definitions in the included studies (Supplementary Table 3 and cohort 262 recruitment details in Supplementary Note). To maximize numbers and optimize statistical 263 power, we did not require doctor-diagnosed AR or verification by allergic sensitization. This 264 approach was confirmed by a sensitivity analysis in 23andMe based on association with known 265 risk loci for allergic rhinitis (data not shown). Controls were defined as individuals who never had 266 a diagnosis or symptoms of AR.  267  268 Allergic sensitization (AS) 269 We considered specific IgE production against inhalant allergens without restriction by 270 assessment method or type of inhalant allergen. Cases were defined as individuals with 271 objectively measured sensitization against at least one of the inhalant allergens tested for in the 272 respective studies, and controls were defined as individuals who were not sensitized against 273 any of the allergens tested for. We included sensitization assessed by skin reaction after 274 puncture of the skin with a droplet of allergen extract (SPT) and/or by detection of the levels of 275 circulating allergen-specific IgE in the blood. The SPT wheal diameter cutoffs were 3 mm larger 276 than the negative control for cases and smaller than 1 mm for controls. To optimize case 277 specificity and the correlation between methods, we chose a high cutoff of specific IgE levels for 278 cases (0.7 IU/ml) and a low cutoff for controls (0.35 IU/ml).  279  280 Non-allergic rhinitis (NAR) 281 Case were defined as individuals with current allergic rhinitis symptoms (within the last 12 282 months) and no allergic sensitization (negative specific IgE (< 0.35 IU/mL) and/or negative skin 283 prick test (< 1 mm) for all allergens and time points tested) 284 Controls were defined as individuals never having symptoms of allergic rhinitis and no allergic 285 sensitization (negative specific IgE (< 0.35 IU/mL) and/or negative skin prick test (< 1 mm) for all 286 allergens and time points tested) 287  288 For all 3 phenotypes, we combined data from children and adults but chose a lower age limit of 289 6 years, as allergic rhinitis and sensitization status at younger ages show poorer correlation with 290 status later in life, both owing to transient symptoms/sensitization status and frequent 291 development of symptoms/sensitization during late childhood. 292 GWAS QC and cohort summary data harmonization 293 For AR, AS, and NAR, each cohort imputed their data separately using the 1000 Genomes 294 Project (1KGP) phase 1, version 3 release, and conducted the genome-wide association 295 analysis adjusted for sex and if necessary for age and principal components (Supplementary 296  8 Table COHORTS). All studies included individuals of European descent, except Generation R 297 and RAINE, comprising a mixed, multi-ethnic population. We utilized EasyQC v. 9.236 for quality 298 control and marker harmonization for cohort-level meta-GWAS summary files. Cohort data was 299 harmonized to genome build GRCh37 and checked against 1KGP phase 3 reference allele 300 frequencies for processing problems. GWAS summary “karyograms” were visually inspected to 301 catch cohorts with incomplete data. Distributions of estimate coefficients and errors, as well as 302 “Standard error vs. sample size”- and “p value vs. z-score” plots were inspected for each cohort 303 for systematic errors in statistical models. Ambiguous markers that were non-unique in terms of 304 both genomic position and allele coding were removed. A minimum imputation score of 0.3 (R2) 305 or 0.4 (proper_info) was required for markers. A minimum minor allele count of 7 was required 306 for each marker in each cohort, as suggested by the GIANT consortium and EasyQC. 307  308 Meta-Analysis 309 For AR, AS, and NAR, meta-analysis for the discovery phase was conducted using GWAMA37 310 with an inverse variance weighted fixed-effect model with genomic control correction of the 311 individual studies. Each locus is represented by the variant showing the strongest evidence 312 within a 1Mb buffer. Loci were inspected visually by plotting genomic neighbourhood and 313 coloring for 1KGP r2 values. From the pool of genomewide significant markers in the discovery, 314 one locus with index marker rs193243426 without a credible LD structure was removed from 315 further analysis (Supplementary Fig. 10). Heterogeneity was assessed with Cochran’s Q test. 316 Meta-analysis of replication candidates from the AR discovery phase was carried out using R 317 version 3.4.0, and the meta package version 4.8-2 with an inverse variance weighted fixed-318 effect model. For a subset of markers, cohorts reported suitable proxies (r2>0.85), where 319 followed-up markers were not present or had insufficient imputation or genotyping quality 320 (Supplementary Table 23).  321 Gene set overrepresentation analysis, discovery phase 322 To facilitate selection of biologically relevant discovery candidates in the sub-genomewide 323 significant stratum (5e-8 < p < 1e-6), we employed a custom gene set overrepresentation 324 analysis algorithm implemented in R, with a scoring and permutation regime modelled after 325 MAGENTA.38 Genes with lengths less than 200bp, with copies on multiple chromosomes, and 326 with multiple copies on the same chromosome more than 1Mb apart were removed from 327 analysis. Gene models (GENCODE v 19) were downloaded from the UCSC Table Browser,39 328 and expanded 110 kb upstream, and 40 kb downstream, similar to MAGENTA. The HLA region 329 was excluded from analysis (chromosome 6: 29,691,116-33,054,976). Similar to MAGENTA, 330 gene scores were adjusted for number of markers per gene, gene width, recombination 331 hotspots, genetic distance, and number of independent markers per gene, all with updated data 332 from UCSC Table Browser. For the gene set overrepresentation permutation calculation, gene 333 sets from the MSigDB collections c2, c3, c5, c7, and hallmark, were included.40 A MAGENTA-334 style enrichment cutoff at 95% was used. Gene sets with FDR<0.05 were considered. 335  9 Conditional analyses 336 To identify additional independent markers at each discovery genomic region, we used 337 Genome-wide Complex Trait Analysis (GCTA) v. 1.26.0.41 Within a window of +/- 1Mb of each 338 discovery phase index marker, all markers were conditioned on the index using the --cojo-cond 339 feature of GCTA with default parameters. Plink v. v1.90b3.4242 was used to calculate r2 for 340 GCTA with the UK10K full genotype panel43 as reference. A total of 42 of 52 markers from the 341 full discovery phase were present in UK10K. As a MAF-dependent inflation of conditional p-342 values was observed (data not shown), only conditional markers with MAF >= 10% were 343 selected. 344 Locus definition and credible sets for VEP annotation 345 Discovery loci were defined as index markers extended with markers in LD (r2 >= 0.5), based on 346 the 1KGP phase 3. Protein coding gene transcript models (GENCODE V24) were downloaded 347 from the UCSC Table Browser, and nearest upstream, downstream, as well as all genes within 348 the extended loci were annotated. 349 Credible sets for each locus were calculated using the method of Morris, A.P44. 350 LD was calculated for each discovery index variant within +/- 500 kb, and markers with r2<0.1 351 were excluded. For the remaining markers, the Bayesian Factor (ABF) values and the posterior 352 probabilities (PostProb) were calculated, and cumulative posterior probability values were 353 generated based ranking markers on ABF. Finally, variants were included in the 99% credible 354 set until the cumulative posterior probability was greater or equal than 0.99. 355 Credible sets for each loci was annotated with information on mutation impact in coding regions 356 using the Variant effect Prediction (VeP) REST API45, exporting only the nonsynonymous 357 substitutions. 358 GWAS catalogue lookup 359 For annotation of markers with identification in previous GWA studies, the GWAS catalog was 360 downloaded from NHGRI-EBI (v.1.0.1, 2016-11-28). For this analysis, AR loci were lifted from 361 genomic build GRCh37 to GRCh38, and extended with +/- 1Mb in each direction before being 362 overlapped with GWAS catalog annotations. Relevant GWAS catalog overlap traits were binned 363 into trait groups “Allergic Rhinitis”, “Asthma”, “Autoimmune”, “Eczema”, “Infectious Diseases”, 364 “Lung-related Traits”, and “Other allergy”. A million random genomic intervals of the same length 365 (2Mb) were obtained to generate a background overlap distribution, and p-values were 366 calculated from this background. 367 HLA classical allele analysis 368 Analyses of imputed classical HLA-alleles were performed in the 23andMe study (AR discovery 369 population) comprising 49,180 individuals with allergic rhinitis and 124,102 controls.  370 HLA imputation was performed with HIBAG.46 We imputed allelic dosage for HLA-A, B, C, 371 DPB1, DQA1, QB1, and DRB1 loci at four-digit resolution using the default settings of HIBAG 372 for a total of 292 classical HLA alleles.  373  10 Using an approach suggested by P. de Bakker,47 we downloaded the files that map HLA alleles 374 to amino acid sequences from https://www.broadinstitute.org/mpg/snp2hla/ and mapped our 375 imputed HLA alleles at four-digit resolution to the corresponding amino acid sequences; in this 376 way we translated the imputed HLA allelic dosages directly to amino acid dosages. We encoded 377 all amino acid variants in the 23andMe European samples as 2395 bi-allelic amino acid 378 polymorphisms as previously described.48  379 Similar to the SNP imputation, we measured imputation quality using r2, which is the ratio of the 380 empirically observed variance of the allele dosage to the expected variance assuming Hardy-381 Weinberg equilibrium.  382 To test associations between imputed HLA alleles, amino acid variants, and phenotypes, we 383 performed logistic regression using the same set of covariates used in the SNPbased GWAS. 384 We applied a forward stepwise strategy, within each type of variant, to establish statistically 385 independent signals in the HLA region. Within each variant type, we first identified the most 386 strongly associated signals (lowest p-value) and performed forward iterative conditional 387 regression to identify other independent signals. All analyses were controlled for sex and five 388 principal components of genetic ancestry. The p-values were calculated using a likelihood ratio 389 test.  390  391 Structural visualization of amino acid variants 392 Structural visualization of amino acid variants was performed for the strongest associated 393 variants in HLA-DQB1 (position 30) and HLA-B (position 116), respectively (Supplementary 394 Table 10) and were made using X-ray structures from Protein Data Bank (PDB).49 To find the 395 best structure we used the specialized search function in the Immune Epitope Database,50 396 selecting only X-ray crystalized structures for the specific MHC type HLA-DQB1 and HLA-B. 397 Using this criterion, we found 17 crystallized structures for HLA-DQB1 and 164 structures for 398 HLA-B. From these lists, we selected the structure with the lowest resolution and the amino 399 acids encoded by the reported top SNPs. The PDB accession code for the selected structures 400 was 4MAY51 for HLA-DQB1 and 2A8352 for HLA-B and both structures were visualized using 401 PyMOL (http://www.pymol.org). Furthermore, we used PyMOL to measure intra-molecular 402 distances from the side chain of the amino acids associated with allergic rhinitis to the C atoms 403 in the peptide. This distance measure was chosen to accommodate the possibility for different 404 amino acids in the peptide. In order for two amino acids to interact the distance should be 405 approximately 4Å or less. We measured distances of 6Å (HLA-DQB1) and 7Å (HLA-B), however 406 these distances do not include the peptide side chains which range from 1.5 Å – 8.8 Å. 407 Therefore, we estimate that physical interaction between the amino acids encoded by the top 408 SNPs and the peptide is likely. 409 Genetic heritability and genetic correlation 410 For calculating genetic heritability and genetic correlation between AR and AS, as well as 411 between clinical cohorts and 23andMe within AR, we utilized the LD score regression based 412 method as implemented by LDSC v.1.0.45,53 Population prevalence was set to 10% for AR and 413  11 AS. Genetic correlation analysis between AR, AS and published GWAS studies was carried out 414 using the LDHUB platform v1.3.154 against all traits, but excluding Metabolites55.    415 eQTL sources and analysis 416 From GTEx V6p56, all significant variant-gene cis eQTL pairs for whole blood, lung, and EBV-417 transformed lymphocytes were downloaded from https://gtexportal.org, and carried forward in 418 analysis. From Westra et al.57, both cis and trans eQTLs in whole blood were downloaded, and 419 variant-gene pairs with FDR < 0.1 were carried forward in analysis. From Fairfax et al.58, cis 420 eQTLs from monocytes and B cells were downloaded, and variant-gene pairs with FDR < 0.1 421 were carried forward in analyses. From Bonder et al.58, meQTLs from whole blood were 422 downloaded, and variant-probe pairs with FDR < 0.05 were carried forward in analyses. From 423 Nicodemus-Johnson et al.59, cis eQTLs and meQTLs from lung were downloaded, and variant-424 gene pairs with FDR < 0.1 were carried forward in analyses. From Momozawa et al. [in press, 425 personal correspondence], cis eQTLs from blood cell types CD14, CD15, CD19, CD4, and CD8 426 were downloaded, and variant-gene pairs with a weighted correlation of >= 0.6 were carried 427 forward to analysis. For table 2 priority genes, protein coding information was downloaded from 428 the UCSC Table Browser, using the “transcriptClass” field from the 429 “wgEncodeGencodeAttrsV24lift37” table. 430 Promoter Capture Hi-C Gene Prioritisation 431 To assess spatial promoter interactions in the discovery set, we performed a Capture Hi-C 432 Gene Prioritisation (CHIGP) as described in Javierre et al.60 and 433 https://github.com/ollyburren/CHIGP using recommended settings and data sources: 0.1cM 434 recombination blocks, 1KGP EUR reference population, coding markers from the GRCh37 435 Ensembl assembly and the CHICAGO-generated61 Promoter Capture Hi-C peak matrix data 436 from 17 human primary blood cell types supplied in the original paper. The resulting protein-437 coding prioritized genes (gene score > 0.5) were used in the downstream network analysis, 438 from cell types \"Fetal thymus\", \"Total CD4 T cells\", \"Activated total CD4 T cells\", \"Non-activated 439 total CD4 T cells\", \"Naive CD4 T cells\", \"Total CD8 T cells\", \"Naive CD8 T cells\", \"Total B cells\", 440 \"Naive B cells\", \"Endothelial precursors\", \"Macrophages M0\", \"Macrophages M1\", 441 \"Macrophages M2\", \"Monocytes\", and \"Neutrophils\". 442 Gene set overrepresentation analysis of known and replicating novel loci 443 All high-confidence gene symbols from eQTL and meQTL sources, PCHiC, as well as genes 444 (models extended 110kb upstream, and 40kb downstream) within each r2-based loci definition  445 from known and replicating novel loci were input into the pathway-based set over-representation 446 analysis module of ConsensusPathDB (CPDB) database and tools62 with 229 of 277 gene 447 identifiers translated. In addition, these same symbols were used for Ingenuity pathway analysis 448 (IPA; www.ingenuity.com; a curated database of the relationships between genes obtained from 449 published articles, and genetic and expression data repositories) to identify biological pathways 450 common to genes. IPA determines whether the associated genes are significantly enriched in a 451  12 specific biological function or network by assessing direct interactions. We assigned significance 452 if right-tailed Fisher’s exact test p-value < 0.05. 453 eQTL/meQTL, PCHiC and locus gene intersections were visualized using the UpSetR 454 package63. 455 Tissue overrepresentation 456 To assay the enrichment of variants associated with AR in tissue specific gene expression sets, 457 we utilized the DEPICT enrichment method64, using a p-value threshold of 1e-5, and standard 458 settings.    459 Enrichment of regulatory regions 460 To assay the enrichment of variants associated with AR in regions of open chromatin and 461 specific histone marks, we utilized the GWAS Analysis of Regulatory or Functional Information 462 Enrichment with LD correction (GARFIELD) method65. In essence, GARFIELD performs greedy 463 pruning of GWAS markers (LD r2 > 0.1) and then annotates them based on functional 464 information overlap. Next, it quantifies Fold Enrichment (FE) at various GWAS significance 465 cutoffs and assesses them by permutation testing, while adjusting for minor allele frequency, 466 distance to nearest transcription start site and number of LD proxies (r2 > 0.8). GARFIELD was 467 run with 10,000,000 permutations, and otherwise default settings. 468 PARF 469 Population-attributable risk fractions (PARFs) were estimated from B58C, a general-population 470 sample with participant ages 44-45 years also contributing to the discovery stage. The genetic 471 risk score was calculated by applying the pooled per-allele coefficients (ln(OR) values) from the 472 AR discovery set to the number of higher-risk alleles of each of the 41 established (known 473 genome-wide significant and novel replicated loci), one SNP per locus. Because there were no 474 individuals observed with zero higher-risk alleles, the prevalence of sensitization for individuals 475 in the lowest decile of the genetic risk score distribution was used to derive PARF estimates on 476 the assumption that this 10% of the population was unexposed. This method has the advantage 477 that it does not predict beyond the bounds of the data, but its results are conservative. The 478 PARF was then derived (with 95% confidence interval) by expressing the difference between 479 the observed prevalence and the predicted (unexposed) prevalence as a percentage of the 480 observed prevalence. PARFs were estimated using the 41 AR loci in relation to AR, AS and 481 NAR, respectively. 482 Protein network and drug interactions 483 In order to analyse protein-protein-drug interaction networks, STRING (V10)66 was used. Protein 484 network data (9606.protein.links.v10.txt.gz) and protein alias data (9606.protein.aliases.v10.txt) 485 files were downloaded from the string db website [http://string-db.org/]. GWAS hits stratified on 486 ‘all’, ‘blood’ and ‘lung’ were converted to Ensembl protein ids using the protein alias data. The 487 interactors were subsequently identified using the link data at a ‘high confidence cutoff of >0.7’ 488  13 as described in the STRING FAQ. The interactor Ensembl protein ids were then converted to 489 UniProt gene names and both hits and interactors were then analyzed for interactions with FDA 490 approved drugs using the ChEMBL Database67 API via Python (v2.7.12). Lastly, stratified 491 networks consisting of GWAS hits connected to interactors and drugs connected to both GWAS 492 hits and interactors were visualised using GGraph (v1.0.0), iGraph (v1.0.1), TidyVerse (v1.1.1) 493 under R (v3.3.2). 494 Data availability 495 Genome-wide results are available on request through the corresponding author, on condition of 496 signing any Data Transfer Agreements required according to the institutional review board 497 (IRB)-approved protocols of contributing studies. 498   499  14 References 500 1. Greiner, A. N., Hellings, P. W., Rotiroti, G. & Scadding, G. K. Allergic rhinitis. Lancet 378, 501 2112–2122 (2011). 502 2. Björkstén, B. et al. Worldwide time trends for symptoms of rhinitis and conjunctivitis: Phase 503 III of the International Study of Asthma and Allergies in Childhood. Pediatr. Allergy 504 Immunol. 19, 110–124 (2008). 505 3. Willemsen, G., van Beijsterveldt, T. C. E. M., van Baal, C. G. C. M., Postma, D. & 506 Boomsma, D. I. Heritability of self-reported asthma and allergy: a study in adult Dutch 507 twins, siblings and parents. Twin Res. Hum. Genet. 11, 132–142 (2008). 508 4. Fagnani, C. et al. Heritability and shared genetic effects of asthma and hay fever: an Italian 509 study of young twins. Twin Res. Hum. Genet. 11, 121–131 (2008). 510 5. Ramasamy, A. et al. A genome-wide meta-analysis of genetic variants associated with 511 allergic rhinitis and grass sensitization and their interaction with birth order. J. Allergy Clin. 512 Immunol. 128, 996–1005 (2011). 513 6. Hinds, D. A. et al. A genome-wide association meta-analysis of self-reported allergy 514 identifies shared and allergy-specific susceptibility loci. Nat. Genet. 45, 907–911 (2013). 515 7. Bønnelykke, K. et al. Meta-analysis of genome-wide association studies identifies ten loci 516 influencing allergic sensitization. Nat. Genet. 45, 902–906 (2013). 517 8. Ferreira, M. A. R. et al. Genome-wide association analysis identifies 11 risk variants 518 associated with the asthma with hay fever phenotype. J. Allergy Clin. Immunol. 133, 1564–519 1571 (2014). 520 9. Bunyavanich, S. et al. Integrated genome-wide association, coexpression network, and 521 expression single nucleotide polymorphism analysis identifies novel pathway in allergic 522 rhinitis. BMC Med. Genomics 7, 48 (2014). 523 10. Jahn-Schmid, B., Pickl, W. F. & Bohle, B. Interaction of Allergens, Major Histocompatibility 524  15 Complex Molecules, and T Cell Receptors: A ‘Ménage à Trois’ That Opens New Avenues 525 for Therapeutic Intervention in Type I Allergy. Int. Arch. Allergy Immunol. 156, 27–42 526 (2011). 527 11. Cavalli, G. et al. MHC class II super-enhancer increases surface expression of HLA-DR 528 and HLA-DQ and affects cytokine production in autoimmune vitiligo. Proc. Natl. Acad. Sci. 529 U. S. A. 113, 1363–1368 (2016). 530 12. Hayashi, M. et al. Autoimmune vitiligo is associated with gain-of-function by a 531 transcriptional regulator that elevates expression of HLA-A*02:01 in vivo. Proc. Natl. Acad. 532 Sci. U. S. A. 113, 1357–1362 (2016). 533 13. Puel, A., Ziegler, S. F., Buckley, R. H. & Leonard, W. J. Defective IL7R expression in T(-534 )B(+)NK(+) severe combined immunodeficiency. Nat. Genet. 20, 394–397 (1998). 535 14. Lundmark, F. et al. Variation in interleukin 7 receptor alpha chain (IL7R) influences risk of 536 multiple sclerosis. Nat. Genet. 39, 1108–1113 (2007). 537 15. Mori, T. et al. Lnk/Sh2b3 controls the production and function of dendritic cells and 538 regulates the induction of IFN-γ-producing T cells. J. Immunol. 193, 1728–1736 (2014). 539 16. Scott, L. M., Civin, C. I., Rorth, P. & Friedman, A. D. A novel temporal expression pattern of 540 three C/EBP family members in differentiating myelomonocytic cells. Blood 80, 1725–1735 541 (1992). 542 17. Gao, H., Parkin, S., Johnson, P. F. & Schwartz, R. C. C/EBP gamma has a stimulatory role 543 on the IL-6 and IL-8 promoters. J. Biol. Chem. 277, 38827–38837 (2002). 544 18. León, B. et al. Regulation of T(H)2 development by CXCR5+ dendritic cells and 545 lymphotoxin-expressing B cells. Nat. Immunol. 13, 681–690 (2012). 546 19. Lawrence, T. The nuclear factor NF-kappaB pathway in inflammation. Cold Spring Harb. 547 Perspect. Biol. 1, a001651 (2009). 548 20. Shinnakasu, R. et al. Regulated selection of germinal-center cells into the memory B cell 549  16 compartment. Nat. Immunol. 17, 861–869 (2016). 550 21. Roychoudhuri, R. et al. BACH2 regulates CD8(+) T cell differentiation by controlling access 551 of AP-1 factors to enhancers. Nat. Immunol. 17, 851–860 (2016). 552 22. Rothlin, C. V., Ghosh, S., Zuniga, E. I., Oldstone, M. B. A. & Lemke, G. TAM receptors are 553 pleiotropic inhibitors of the innate immune response. Cell 131, 1124–1136 (2007). 554 23. Chan, P. Y. et al. The TAM family receptor tyrosine kinase TYRO3 is a negative regulator 555 of type 2 immunity. Science 352, 99–103 (2016). 556 24. Kassmeier, M. D. et al. VprBP binds full-length RAG1 and is required for B-cell 557 development and V(D)J recombination fidelity. EMBO J. 31, 945–958 (2012). 558 25. Hamblet, C. E., Makowski, S. L., Tritapoe, J. M. & Pomerantz, J. L. NK Cell Maturation and 559 Cytotoxicity Are Controlled by the Intramembrane Aspartyl Protease SPPL3. J. Immunol. 560 196, 2614–2626 (2016). 561 26. Andersen, J. B., Strandbygård, D. J., Hartmann, R. & Justesen, J. Interaction between the 562 2’-5' oligoadenylate synthetase-like protein p59 OASL and the transcriptional repressor 563 methyl CpG-binding protein 1. Eur. J. Biochem. 271, 628–636 (2004). 564 27. Halim, T. Y. F. et al. Retinoic-acid-receptor-related orphan nuclear receptor alpha is 565 required for natural helper cell development and allergic inflammation. Immunity 37, 463–566 474 (2012). 567 28. Anderson, D. M. et al. A homologue of the TNF receptor and its ligand enhance T-cell 568 growth and dendritic-cell function. Nature 390, 175–179 (1997). 569 29. Ferreira, M. A. et al. Shared genetic origin of asthma, hay fever and eczema elucidates 570 allergic disease biology. Nat. Genet. 49, 1752–1757 (2017). 571 30. Pearce, N., Pekkanen, J. & Beasley, R. How much asthma is really attributable to atopy? 572 Thorax 54, 268–272 (1999). 573 31. Bohme, M., Wickman, M., Lennart Nordvall, S., Svartengren, M. & Wahlgren, C. F. Family 574  17 history and risk of atopic dermatitis in children up to 4 years. Clin. Exp. Allergy 33, 1226–575 1231 (2003). 576 32. Kreiner, E. et al. Shared genetic variants suggest common pathways in allergy and 577 autoimmune diseases. J. Allergy Clin. Immunol. (2017). doi:10.1016/j.jaci.2016.10.055 578 33. Bousquet, J. et al. Important research questions in allergy and related diseases: nonallergic 579 rhinitis: a GA2LEN paper. Allergy 63, 842–853 (2008). 580 34. Moffatt, M. F. et al. Genetic variants regulating ORMDL3 expression contribute to the risk of 581 childhood asthma. Nature 448, 470–473 (2007). 582 35. Paternoster, L. et al. Multi-ancestry genome-wide association study of 21,000 cases and 583 95,000 controls identifies new risk loci for atopic dermatitis. Nat. Genet. 47, 1449–1456 584 (2015). 585 36. Winkler, T. W. et al. Quality control and conduct of genome-wide association meta-586 analyses. Nat. Protoc. 9, 1192–1212 (2014). 587 37. Mägi, R. & Morris, A. P. GWAMA: software for genome-wide association meta-analysis. 588 BMC Bioinformatics 11, 288 (2010). 589 38. Segrè, A. V. et al. Common inherited variation in mitochondrial genes is not enriched for 590 associations with type 2 diabetes or related glycemic traits. PLoS Genet. 6, (2010). 591 39. Karolchik, D. et al. The UCSC Table Browser data retrieval tool. Nucleic Acids Res. 32, 592 D493–6 (2004). 593 40. Subramanian, A. et al. Gene set enrichment analysis: a knowledge-based approach for 594 interpreting genome-wide expression profiles. Proc. Natl. Acad. Sci. U. S. A. 102, 15545–595 15550 (2005). 596 41. Yang, J., Lee, S. H., Goddard, M. E. & Visscher, P. M. GCTA: a tool for genome-wide 597 complex trait analysis. Am. J. Hum. Genet. 88, 76–82 (2011). 598 42. Chang, C. C. et al. Second-generation PLINK: rising to the challenge of larger and richer 599  18 datasets. Gigascience 4, 7 (2015). 600 43. UK10K Consortium et al. The UK10K project identifies rare variants in health and disease. 601 Nature 526, 82–90 (2015). 602 44. Wellcome Trust Case Control Consortium et al. Bayesian refinement of association signals 603 for 14 loci in 3 common diseases. Nat. Genet. 44, 1294–1301 (2012). 604 45. McLaren, W. et al. The Ensembl Variant Effect Predictor. Genome Biol. 17, 122 (2016). 605 46. Zheng, X. et al. HIBAG--HLA genotype imputation with attribute bagging. 606 Pharmacogenomics J. 14, 192–200 (2014). 607 47. Jia, X. et al. Imputing amino acid polymorphisms in human leukocyte antigens. PLoS One 608 8, e64683 (2013). 609 48. Tian, C. et al. Genome-wide association and HLA region fine-mapping studies identify 610 susceptibility loci for multiple common infections. Nat. Commun. 8, (2017). 611 49. Berman, H. M. The Protein Data Bank. Nucleic Acids Res. 28, 235–242 (2000). 612 50. Vita, R. et al. The immune epitope database (IEDB) 3.0. Nucleic Acids Res. 43, D405–12 613 (2015). 614 51. Sethi, D. K., Gordo, S., Schubert, D. A. & Wucherpfennig, K. W. Crossreactivity of a human 615 autoimmune TCR is dominated by a single TCR loop. Nat. Commun. 4, 2623 (2013). 616 52. Rückert, C. et al. Conformational dimorphism of self-peptides and molecular mimicry in a 617 disease-associated HLA-B27 subtype. J. Biol. Chem. 281, 2306–2316 (2006). 618 53. Bulik-Sullivan, B. et al. An atlas of genetic correlations across human diseases and traits. 619 Nat. Genet. 47, 1236–1241 (2015). 620 54. Zheng, J. et al. LD Hub: a centralized database and web interface to perform LD score 621 regression that maximizes the potential of summary level GWAS data for SNP heritability 622 and genetic correlation analysis. Bioinformatics 33, 272–279 (2017). 623 55. Kettunen, J. et al. Genome-wide association study identifies multiple loci influencing human 624  19 serum metabolite levels. Nat. Genet. 44, 269–276 (2012). 625 56. Lucas, A. O. Surveillance of communicable diseases in tropical Africa. Int. J. Epidemiol. 5, 626 39–43 (1976). 627 57. Westra, H.-J. et al. Systematic identification of trans eQTLs as putative drivers of known 628 disease associations. Nat. Genet. 45, 1238–1243 (2013). 629 58. Fairfax, B. P. et al. Genetics of gene expression in primary immune cells identifies cell type-630 specific master regulators and roles of HLA alleles. Nat. Genet. 44, 502–510 (2012). 631 59. Nicodemus-Johnson, J. et al. DNA methylation in lung cells is associated with asthma 632 endotypes and genetic risk. JCI Insight 1, e90151 (2016). 633 60. Javierre, B. M. et al. Lineage-Specific Genome Architecture Links Enhancers and Non-634 coding Disease Variants to Target Gene Promoters. Cell 167, 1369–1384.e19 (2016). 635 61. Cairns, J. et al. CHiCAGO: robust detection of DNA looping interactions in Capture Hi-C 636 data. Genome Biol. 17, 127 (2016). 637 62. Kamburov, A. et al. ConsensusPathDB: toward a more complete picture of cell biology. 638 Nucleic Acids Res. 39, D712–7 (2011). 639 63. Conway, J. R., Lex, A. & Gehlenborg, N. UpSetR: An R Package For The Visualization Of 640 Intersecting Sets And Their Properties. (2017). doi:10.1101/120600 641 64. Pers, T. H. et al. Biological interpretation of genome-wide association studies using 642 predicted gene functions. Nat. Commun. 6, 5890 (2015). 643 65. Iotchkova, V. et al. GARFIELD - GWAS Analysis of Regulatory or Functional Information 644 Enrichment with LD correction. bioRxiv 085738 (2016). doi:10.1101/085738 645 66. Szklarczyk, D. et al. STRING v10: protein-protein interaction networks, integrated over the 646 tree of life. Nucleic Acids Res. 43, D447–52 (2015). 647 67. Bento, A. P. et al. The ChEMBL bioactivity database: an update. Nucleic Acids Res. 42, 648 D1083–90 (2014).  649  20 Table legends 650 Table 1 651 Association results of index markers (variant with lowest p-value for each locus) from the 652 discovery phase. Column “Nearest gene” denotes nearest up- and downstream gene (for 653 intergenic variants with two genes listed), or surrounding gene (for intronic variants with one 654 gene listed), with the exception of rs5743618, an exonic missense variant within TLR1; and 655 rs1504215, an exonic synonymous variant within BACH2. Replication and combined p values 656 are for a one-sided test.  657  658 Table 2 659 Functional description of known and novel replicating loci. ‘Locus genes’ column denotes genes 660 overlapping with R2-extended loci (See Methods). ‘Missense variant’ column denotes variants 661 with a predicted missense coding consequences. ‘e/meQTL priority genes’ denotes genes 662 prioritized from the combined e/meQTL analysis. ‘PCHiC priority genes’ denotes genes 663 prioritized from the PCHiC chromatin capture analysis.       664 a) Overlap for rs35350651 with group “other allergy” is “eosinophil count”, b) rs11671925 = 665 eosinophilic esophagitis.  666   667   668  21 Figure legends 669 Figure 1: Manhattan plot of the meta-GWAS discovery phase 670 Circular plot of p-values of genetic marker association to allergic rhinitis from the discovery 671 phase. Only markers with p < 1e-3 are shown. Labels indicate nearest gene name for index 672 marker in locus (marker with lowest p-value). Green labels indicate loci previously associated 673 with allergy; blue labels indicate novel AR loci; grey labels indicate novel loci that were not 674 carried forward to the replication phase. Green line indicates level of genome wide significance 675 (p = 5e-8).     676  677 Figure 2: Structural visualization of amino acid variants associated with allergic rhinitis  678 The surface of the MHC molecules is shown in white, while the backbone of the bound peptides 679 is shown in dark gray. The amino acid variant is highlighted in red and the peptide binding 680 pockets of the MHC molecule is indicated with dashed circles. P1-P9 refers to positions in the 681 peptides counting from the N-termini. (A) Localization of the strongest associated amino acid 682 variant in HLA-DQB (MHC class II), HLA-DQB1 His30, located in the peptide binding pocket 683 close to P6 of the peptide with a distance of 6Å (excluding peptide side chain). The protective 684 amino acid variant at this location in relation to AR is His, whereas the risk variant is Ser. 685 Histidine is positively charged and has a large aromatic ring, whereas Ser is not charged and 686 not aromatic. Therefore, this mutation results in a significant change of the binding pocket 687 environment. (B) Localization of the strongest associated amino acid variation in HLA-B (MHC 688 class I), HLA-B AspHisLeu116, located close to P9 with a distance of 7Å (excluding peptide side 689 chain). The close proximity to the bound peptide for both variants indicates that they are likely to 690 affect the MHC-peptide interaction and thereby which peptides are presented. 691  692 Figure 3: Enrichment of allergic rhinitis-associated variants in tissue-specific open 693 chromatin 694 Enrichment of variants associated with allergic rhinitis (at p < 1e-08 as threshold for marker 695 association) in 189 cell types from ENCODE and Roadmap epigenomics data. Enrichment and 696 p-value was calculated empirically against a permuted genomic background using the 697 GARFIELD tool. Red labels indicate blood and blood-related cell-types, grey labels indicate 698 other cell types. Due to number of permutations = 1e7, empirical p-values reached a minimum 699 ceiling of 1/1e7. FDR threshold = 0.00026. For epstein-Barr virus transformed B-lymphocyte cell 700 types (cell type “GM****”), only most enriched instance is shown (“B-Lymphocyte”). NHEK = 701 normal human epidermal keratinocytes, HMEC/vHMEC = mammary epithelial cells, HCM = 702 human cardiac myocytes , WI-38 = lung fibroblast-derived, HRGEC = human renal glomerular 703 endothelial cell, HCFaa = Human Cardiac Fibroblasts-Adult Atrial cell, HMVEC−dBl−Neo = 704 human microvascular endothelial cells, Th1 = T helper cell, type 1, Th2 = T helper cell, type 2. 705  706 Figure 4: Interaction network between drugs and proteins from genes associated with 707 allergic rhinitis 708 Grey nodes represent locus genes as well as genes prioritized from e/meQTL and PCHiC 709 sources. Blue nodes represent drugs from the ChEMBL drug database. Edges represent very-710  22 high confidence interactions from the STRING database (for locus-locus interactions) and drug 711 target evidence (for drug-locus interactions). Red borders indicate genes with protein products 712 that were significantly enriched in the “Th1 and Th2 Activation” pathway (-log[p-value] >19.1) 713 from the IPA pathway analysis. 714  715   716  1 Table 1. Association results of index markers (variant with lowest p-value for each locus). Column “Nearest gene” denotes nearest up- and downstream gene (for intergenic variants with two genes listed), or surrounding gene (for intronic variants with one gene listed), with the exception of rs5743618, an exonic missense variant within TLR1; and rs1504215, an exonic synonymous variant within BACH2. Replication and combined p values are for a one-sided test. EA/OA=effect allele/other allele. P-value is calculated from the logistic regression model. Het.P=p-value for heterogeneity obtained from Cochrane’s Q test. * Variants also reported associated with a combined asthma/eczema/hay fever phenotype by Ferreira et al.29 (within +/- 1Mb).  Discovery Variant Locus Nearest genes EA/OA EAF n (studies) OR [95% conf.int] P Het. P Known rs34004019 6p21.32 HLA-DQB1;HLA-DQA1 G/A 0.27 196,951 (11) 0.89 [0.87-0.90] 1.00E-30 0.41 rs950881 2q12.1 IL1RL1;IL1RL1 T/G 0.15 212,120 (18) 0.88 [0.87-0.90] 1.74E-30 0.91 rs5743618 4p14 TLR1;TLR10 A/C 0.27 210,652 (17) 0.90 [0.89-0.92] 4.38E-27 0.70 rs1438673 5q22.1 CAMK4;WDR36 C/T 0.50 212,120 (18) 1.08 [1.07-1.10] 3.15E-26 0.26 rs7936323 11q13.5 LRRC32;C11orf30 A/G 0.48 212,120 (18) 1.08 [1.06-1.09] 6.53E-24 0.0001 rs2428494 6p21.33 HLA-B;HLA-C A/T 0.42 195,753 (12) 1.08 [1.06-1.09] 7.01E-19 0.25 rs11644510 16p13.13 RMI2;CLEC16A T/C 0.37 212,120 (18) 0.93 [0.92-0.95] 1.58E-17 0.65 rs12939457 17q12 GSDMB;ZPBP2 C/T 0.44 212,120 (18) 0.94 [0.92-0.95] 2.35E-17 0.02 rs148505069 4q27 IL21;IL2 G/A 0.33 212,120 (18) 1.07 [1.05-1.08] 2.54E-15 0.02 rs13395467 2p25.1 ID2;RNF144A G/A 0.28 212,120 (18) 0.94 [0.92-0.95] 9.93E-15 0.61 rs9775039 9p24.1 IL33;RANBP6 A/G 0.16 212,120 (18) 1.08 [1.06-1.10] 2.22E-14 0.40 rs2164068 2q33.1 PLCL1 A/T 0.49 212,120 (18) 0.94 [0.93-0.96] 4.21E-14 0.82 rs2030519 3q28 TPRG1;LPP G/A 0.49 212,120 (18) 1.06 [1.04-1.07] 1.83E-13 0.12 rs11256017 10p14 CELF2;GATA3 T/C 0.18 212,120 (18) 1.07 [1.05-1.09] 2.72E-12 0.60 rs17294280 15q22.33 AAGAB;SMAD3 G/A 0.25 212,120 (18) 1.07 [1.05-1.09] 5.97E-12 0.07 rs7824993 8q21.13 ZBTB10;TPD52 A/G 0.37 212,120 (18) 1.05 [1.04-1.07] 1.86E-10 0.56 rs9282864 16p11.2 SULT1A1;SULT1A2 C/A 0.33 208,761 (16) 0.94 [0.93-0.96] 4.69E-10 0.03 rs9687749 5q31.1 IL13;RAD50 T/G 0.44 207,604 (16) 1.06 [1.04-1.09] 1.84E-09 0.19 rs61977073 14q21.1 TTC6 G/A 0.22 212,120 (18) 1.06 [1.04-1.08] 5.78E-09 0.05 rs6470578 8q24.21 TMEM75;MYC T/A 0.28 212,120 (18) 1.05 [1.03-1.07] 4.36E-08 0.02 rs3787184 20q13.2 NFATC2;KCNG1 G/A 0.19 207,604 (16) 0.94 [0.93-0.96] 4.76E-08 0.69            Replication Combined Novel         n (studies) OR [95% conf.int] P FWER n (studies) OR [95% conf.int] P Het. P rs7717955* 5p13.2 CAPSL;IL7R T/C 0.27 212,120 (18) 0.95 [0.93-0.96] 1.50E-09 0.24 679,247 (10) 0.93 [0.91-0.94] 4.09E-25 1.06E-23 891,367 (28) 0.94 [0.93-0.95] 3.78E-32 0.09 rs63406760* 12q24.31 CDK2AP1;C12orf65 G/- 0.26 210,652 (17) 0.93 [0.91-0.95] 5.12E-14 0.91 675,338 (7) 0.95 [0.93-0.96] 3.27E-12 8.51E-11 885,990 (24) 0.94 [0.93-0.95] 2.54E-24 0.89 rs1504215* 6q15 BACH2;GJA10 A/G 0.34 207,604 (16) 0.95 [0.94-0.97] 1.49E-08 0.02 679,247 (10) 0.95 [0.94-0.97] 1.99E-11 5.17E-10 886,851 (26) 0.95 [0.94-0.96] 1.54E-18 0.05 rs28361986* 11q23.3 CXCR5;DDX6 A/T 0.20 212,120 (18) 0.93 [0.91-0.95] 1.81E-14 0.87 675,919 (8) 0.94 [0.93-0.96] 7.92E-11 2.06E-09 888,039 (26) 0.94 [0.92-0.95] 2.32E-23 0.91 rs2070902* 1q23.3 AL590714.1;FCER1G T/C 0.25 212,120 (18) 1.06 [1.04-1.08] 1.03E-10 0.18 679,247 (10) 1.05 [1.03-1.06] 7.27E-10 1.89E-08 891,367 (28) 1.05 [1.04-1.06] 6.19E-19 0.23 rs111371454* 15q15.1 ITPKA;RTF1 G/A 0.21 212,120 (18) 1.06 [1.03-1.08] 1.65E-07 0.17 675,338 (7) 1.04 [1.03-1.06] 8.47E-09 2.20E-07 887,458 (25) 1.05 [1.03-1.06] 1.28E-14 0.22 rs12509403* 4q24 MANBA;NFKB1 T/C 0.32 212,120 (18) 0.95 [0.94-0.97] 9.97E-09 0.27 679,247 (10) 0.96 [0.95-0.97] 1.86E-08 4.84E-07 891,367 (28) 0.96 [0.95-0.97] 1.17E-15 0.39 rs9648346* 7p15.1 JAZF1;TAX1BP1 G/C 0.22 207,604 (16) 1.05 [1.03-1.07] 3.62E-08 0.74 679,247 (10) 1.04 [1.03-1.06] 1.39E-07 3.63E-06 886,851 (26) 1.05 [1.03-1.06] 3.30E-14 0.48 rs35350651* 12q24.12 ATXN2;SH2B3 C/- 0.49 206,136 (15) 1.04 [1.03-1.06] 6.63E-08 0.60 672,701 (6) 1.04 [1.02-1.05] 1.41E-07 3.66E-06 878,837 (21) 1.04 [1.03-1.05] 5.82E-14 0.43 rs2519093* 9q34.2 ABO;OBP2B T/C 0.20 212,120 (18) 1.06 [1.04-1.09] 4.96E-11 0.38 675,919 (8) 1.04 [1.03-1.06] 2.96E-07 7.68E-06 888,039 (26) 1.05 [1.04-1.07] 2.79E-16 0.61 rs62257549 3p21.2 VPRBP A/G 0.20 212,120 (18) 0.95 [0.93-0.97] 7.13E-08 0.45 677,615 (9) 0.96 [0.94-0.97] 3.37E-07 8.76E-06 889,735 (27) 0.95 [0.94-0.97] 1.84E-13 0.53 rs11677002 2p23.2 FOSL2;RBKS C/T 0.45 212,120 (18) 0.96 [0.95-0.98] 3.80E-07 0.21 679,247 (10) 0.97 [0.96-0.98] 3.54E-07 9.20E-06 891,367 (28) 0.97 [0.96-0.97] 7.08E-13 0.36 rs35597970* 10q24.32 ACTR1A;TMEM180 -/A 0.45 210,652 (17) 1.06 [1.04-1.07] 1.34E-13 0.96 676,970 (8) 1.03 [1.02-1.05] 4.37E-07 1.14E-05 887,622 (25) 1.04 [1.03-1.05] 5.42E-18 0.53 rs2815765 1p31.1 LRRIQ3;NEGR1 T/C 0.37 212,120 (18) 0.95 [0.94-0.97] 1.18E-09 0.59 679,247 (10) 0.97 [0.95-0.98] 6.16E-07 1.60E-05 891,367 (28) 0.96 [0.95-0.97] 9.45E-15 0.52 rs11671925* 19q13.11 CEBPA;SLC7A10 A/G 0.17 206,136 (15) 0.94 [0.92-0.96] 1.80E-08 0.97 677,551 (9) 0.96 [0.94-0.98] 2.80E-06 7.29E-05 883,687 (24) 0.95 [0.94-0.96] 5.91E-13 0.60 rs2461475* 12q24.31 SPPL3;ACADS C/T 0.47 212,120 (18) 1.04 [1.02-1.05] 9.19E-07 0.97 677,551 (9) 1.03 [1.02-1.04] 6.52E-06 0.0002 889,671 (27) 1.03 [1.02-1.04] 3.81E-11 0.83 rs6738964* 2q36.3 SPHKAP;DAW1 G/T 0.24 212,120 (18) 0.96 [0.94-0.97] 4.51E-07 0.72 679,247 (10) 0.97 [0.96-0.98] 4.96E-05 0.0013 891,367 (28) 0.96 [0.95-0.97] 1.86E-10 0.87 rs10519067* 15q22.2 RORA A/- 0.13 212,120 (18) 0.93 [0.91-0.96] 1.78E-09 0.37 442,354 (7) 0.93 [0.90-0.96] 7.53E-05 0.0020 654,474 (25) 0.93 [0.92-0.95] 5.53E-13 0.36 rs138050288* 1p36.23 RERE;SLC45A1 -/CA 0.29 210,652 (17) 1.05 [1.04-1.07] 5.96E-10 0.71 675,338 (7) 1.03 [1.01-1.04] 0.0002 0.0046 885,990 (24) 1.04 [1.03-1.05] 6.62E-12 0.63 rs7328203 13q14.11 TNFSF11;AKAP11 G/T 0.46 212,120 (18) 1.05 [1.03-1.06] 5.94E-09 0.90 677,551 (9) 1.02 [1.01-1.04] 0.0005 0.0134 889,671 (27) 1.03 [1.02-1.04] 1.28E-10 0.78  2 Table 2. Functional description of known and novel replicating loci. ‘Locus genes’ column denotes genes overlapping with R2-extended loci (See Methods). ‘Missense variant’ column denotes variants with a predicted missense coding consequences. ‘e/meQTL priority genes’ denotes genes prioritized from the combined e/meQTL analysis. ‘PCHiC priority genes’ denotes genes prioritized from the PCHiC chromatin capture analysis. * Variants also reported associated with a combined asthma/eczema/hay fever phenotype by Ferreira et al.29 (within +/- 1Mb).  Variant Locus Locus genes Missensevariant e/meQTL priority genes PCHiC priority genes Possible function Known   rs13395467 2p25.1  ID2 Transcription factor required for specific innate cell, T cell and B cell subsets  rs950881 2q12.1 IL1RL1, IL18R1, IL18RAP IL18R1, IL18RAP, IL1RL1, MFSD9 IL1RL1 Interleukin receptor, IL33-signalling, Th2-responsers2164068 2q33.1 PLCL1 PLCL1 COQ10B, MARS2, PLCL1, RFTN2, SF3B1 PLCL1 Phospholipase, intracellular signallingrs2030519 3q28 LPP Transcription factor, Th2-differentiationrs5743618 4p14 TLR10, TLR1, TLR6, FAM114A1 TLR1 FAM114A1, TLR1, TLR10, TLR6 Pattern recognition receptors, innate immunityrs148505069 4q27 IL2 IL21 Interleukin, immune regulatory effectsrs1438673 5q22.1 WDR36, CAMK4 TSLP Th2 immune responsesrs9687749 5q31.1 IL13, IL4, IL5, RAD50 IL13 Interleukin, IgE secretion, allergic inflammationrs34004019 6p21.32 HLA-DRB1, HLA-DQB1, HLA-DQA2, HLA-DQA1 C4A, CYP21A2, HLA-DOB, HLA-DQA1, HLA-DQA2, HLA-DQB1, HLA-DQB2, HLA-DRA, HLA-DRB1, HLA-DRB5, LY6G5B, TAP2 Antigen presentation, self tolerancers2428494 6p21.33 MICA, HLA-B, HLA-C C4A, HCG27, MICA Stress induced ligand recognized by NK and T cellsrs7824993 8q21.13  MRPS28 Unknownrs6470578 8q24.21  MYC Transcription factor, B-cell proliferation and differentiation rs9775039 9p24.1 IL33 CD274 IL33: Interleukin, Th2-signalling. CD274: Immune regulation rs11256017 10p14  rs7936323 11q13.5 C11orf30, LRRC32 Treg expressed, TGF-beta signallingrs61977073 14q21.1 TTC6, FOXA1 FOXA1 Transcription factor, Treg differentiationrs17294280 15q22.33 SMAD3, IQCH, AAGAB SMAD3 SMAD3 Transcriptional factor, TGF-beta signallingrs9282864 16p11.2 EIF3C, IL27, NPIPB8, NUPR1, SGF29, SULT1A1, SULT1A2 APOBR, ATXN2L, CLN3, EIF3C, EIF3CL, IL27, NPIPB6, NPIPB7, SBK1, SH2B1, SPNS1, SULT1A1, SULT1A2, TUFM Indcues naïve T cell proliferation and Th1 differentiation while suppressing Th17, Th2 and Treg responses. Induces isotype swithcing of B cells and has additional effects on innate immune cells. rs11644510 16p13.13 RMI2, CLEC16A DEXI C16orf72, CLEC16A, DEXI, GSPT1, LITAF, NUBP1, PRM2, PRM3, RMI2, RSL1D1, SNN, SOCS1, TNP2, TXNDC11, ZC3H7A Unknown function. Highly expressed in lung, B- and T-cells rs12939457 17q12 GSDMA, GSDMB, IKZF3, LRRC3C, PSMD3, ZPBP2 GSDMB, ZPBP2 GSDMA, GSDMB, IKZF3, MED24, ORMDL3, PGAP3, ZPBP2 GSDMB, ORMDL3 Regulator of sphingolipid synthesis. Endoplasmic reticulum-mediated Ca(+2) signaling rs3787184 20q13.2 NFATC2 Transcription factor, activated T-cell gene transcription    3  Variant Locus Locus genes Missensevariant e/meQTL priority genes PCHiC priority genes Possible function Novel, replicating  rs2815765 1p31.1 NEGR1 NEGR1 Cell adhesion.rs138050288* 1p36.23 RERE RERE Transcription factor associated with apoptosis.rs2070902* 1q23.3 ADAMTS4, AL590714.1, APOA2, B4GALT3, DEDD, FCER1G, NDUFS2, NR1I3, PCP4L1, PFDN2, SDHC, TOMM40L FCER1G, TOMM40L, USF1 Codes for the high affinity IgE receptor involved in allergic responses. Present on many cell types, including immune cells and epithelial cells.   rs11677002 2p23.2 FOSL2, PLB1 FOSL2 Cell cycle and proliferation.rs6738964* 2q36.3 DAW1 Dynein assembly factor.rs62257549 3p21.2 VPRBP, RAD54L2 HYAL3, MAPKAPK3, NAT6, RBM15B Required for optimal T cell proliferation after antigen encounter and involved in V(D)J recombination during B cell development.  rs12509403* 4q24 NFKB1, MANBA BDH2, MANBA, NFKB1 NFKB1: Activation of multiple inflammatory pathways, mediating signals from toll-like receptors and cytokines.  rs7717955* 5p13.2 IL7R IL7R IL7R, LMBRD2, SPEF2, UGT3A2 Necessary for V(D)J recombination of T and B cell receptors. T cell sub-populations have different levels of IL-7R on the cell surface.  rs1504215* 6q15 BACH2 BACH2 BACH2 Role in several immune cells, including antigen-induced formation of memory B cells and memory T cells.  rs9648346* 7p15.1 JAZF1 CREB5, JAZF1 Transcriptional repressor, associated with systemic sclerosis, type 2 diabetes and endometrial stromal tumors. rs2519093* 9q34.2 ABO, GBGT1, OBP2B, RPL7A, STKLD1, SURF2 ABO, GBGT1, MED22, SURF1, SURF4, SURF6 Allelic variants of ABO determine blood group type. rs35597970* 10q24.32 CUEDC2, PSD, TMEM180, ACTR1A, SUFU ACTR1A, ARL3, AS3MT, SUFU, TMEM180, TRIM8 NFKB2 Subunit of NFKB complex which is expressed in many cell types and involved in regulating immune responses, including TLR-4 and cytokine signaling.   rs28361986* 11q23.3 DDX6, CXCR5 CXCR5, TRAPPC4 CXCR5, DDX6 Chemokine receptor present on B cells and involved in B cell migration to the B cell follicular zone in lymph nodes and spleen; CXCR5 is also expressed on a subset of follicular T cells. rs35350651* 12q24.12 SH2B3, FAM109A, ATXN2 SH2B3 ALDH2, SH2B3, TMEM116 Involved in hematopoiesis as well as downstream of T cell receptor activation. rs63406760* 12q24.31 C12orf65, CDK2AP1, MPHOSPH9, SBNO1 SBNO1 ABCB9, ARL6IP4, C12orf65, CDK2AP1, MPHOSPH9, OGFOD2, PITPNM2, RILPL2, SBNO1, SETD8, SNRNP35 DDX55 DDX55: Involved in multiple nuclear processes. rs2461475* 12q24.31 SPPL3 C12orf43, OASL, RNF10, SPPL3 SPPL3: Deletion results in decreased numbers of NK cells. OASL: Involved in IFN-gamma signaling.  rs7328203 13q14.11 TNFSF11, AKAP11 AKAP11 Enhances T cell activation by dendritic cells. rs111371454* 15q15.1 ITPKA, NDUFAF1, RTF1, TYRO3, LTK NDUFAF1, NUSAP1 ITPKA, LTK, NDUFAF1, OIP5, RPAP1 TYRO3: Inhibits TLR-mediated immune signaling and activates SOCS1 (identified as potential gene in previous screen). LTK: Leukocyte tyrosine kinase that is involved in downstream T cell receptor signalling.  rs10519067* 15q22.2 RORA Involved natural helper cell development and allergic disease.  rs11671925 19q13.11 SLC7A10, LRP3   CEBPA, CEBPG CEBPA: Important for lung development. Associated with inflammatory bowel disease. CEBPG: Transcriptional enhancers for the immunoglobulin heavy chain.    1234567891011121314151617181920 2122XID2IL1RL1PLCL1LPPTLR1IL2WDR36IL13HLA−BHLA−DQB1ZBTB10MYCIL33GATA3LRRC32TTC6SMAD3RMI2SULT1A1ZPBP2NFATC2RERENEGR1FCER1GFOSL2DAW1VPRBPNFKB1IL7RBACH2JAZF1ABOTMEM180DDX6SH2B3SPPL3C12orf65AKAP11ITPKARORASLC7A10MIER1GAL3ST2SBP1PHF19APOA1AQP2ITGA11NFICZNF217RTEL11E−55E−81E−101E−201E−30P value\t\t\t\t\t\t\t\tA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tB\tFDR ThresholdPermutation p ceiling● ●●●●● ●●●●●●●●●●●●● ●●● ●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●● ●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●● ●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●Adult CD4+Breast vHMECCD14 Primary CellsCD14+CD19 Primary CellsCD20+CD3 Primary CellsCD4 Primary CellsCD56 Primary CellsCD8 Primary CellsFetal Intestine LargeFetal Intestine SmallFetal SpleenFetal ThymusB-LymphocyteHCFaaHCMHMECHMVEC−dBl−NeoHRGECMobilized CD34 Primary CellsMobilized CD4 Primary CellsMobilized CD56 Primary Cells Mobilized CD8 Primary CellsNHEKTh1Th2WI−38110e−110e−210e−310e−410e−510e−610e−74 6 8Fold enrichment−log10[Empirical p−value]MEPOLIZUMABLEBRIKIZUMABSOCS1TSLPRESLIZUMABIL13IL5TRALOKINUMABIL21IL7RIL2MYCIL18RAPIL4IL18R1NFKB1CD274DTYMKGAL3ST2HLA-DQA1NEU4HLA-DRAACTR1AATEZOLIZUMABHLA-DQB1HLA-COASLHLA-BHLA-DRB1HLA-DRB5NFKB2TPD52ITPR3ID2CEBPGCEBPAMED24SURF6SURF2 SURF4ITPKASURF1MED22CELF2APOA5NDE1RPL7AAPOA1APOA4SMAD3AQP2GATA3FCER1GFOXA1NFATC2DENOSUMABOGFOD2 NUBP1NDUFAF1TRAF1TNFSF11ME-344NV-128CREB5TUFMLYM-1C12orf65ATXN2LATXN2DISULFIRAMDDX6 CAMK4IKZF3TLR1RTEL1TLR6GSDMBORMDL3ZPBP2IL27ABCB9PRM3ALDH2IL1RL1TNP2METFORMIN HYDROCHLORIDE IL33PRM2SH2B3WDR36DDX55RSL1D1SH2B1TRIM8",
    "Link": "https://core.ac.uk/download/160105528.pdf"
}