{
    "Title": "10 Key Policies and Practices for Schoolwide and Classroom-Based Behavioral Supports With Strong Evidence of Effectiveness From High-Quality Research",
    "Authors": "The Meadows Center for Preventing Educational Risk",
    "Year": "No year available",
    "Abstract": "The seventh installment of MCPER's \"10 Key\" series, this document distills the latest research findings into 10 easy-to-follow recommendations that states, school districts, and schools can use to improve schoolwide and classroom behavioral supports. Also included are examples of each recommendation.\r\n\r\nNote: This file has been formatted for online viewing and is not a print file.Educatio",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "10 Key Policies and Practices for Schoolwide and Classroom-Based Behavioral Supportswith strong evidence of effectiveness from high-quality research© 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.010 Key Policies and Practices for Schoolwide  and Classroom-Based Behavioral Supportswith strong evidence of effectiveness from high-quality research1. Schools establish structures and processes for their schoolwide behavioral support system, includ-ing administrative support, a leadership team, at least 80% staff commitment, a schoolwide self-assess-ment, an action plan, and a data-management system.Examples• School administrators agree to actively support the schoolwide behavioral support system.• The established leadership team includes an administrator, grade-level representatives, an individual with behavioral expertise, support staff members, and parents.• A schoolwide self-assessment finds that at least 80% of the staff is committed to the plan.• A 3- to 5-year action plan is created with a focus on the routine collection, evaluation, and use of data (e.g., office referrals, attendance, teacher and student surveys) for decision-making.2. Schools have a multitiered system in place that supports the behavioral practices—from the schoolwide to the individualized levels. The multitiered (sometimes referred to as three-tier) system allows for the implementation of behavior practices, data-driven decision-making, and the training of stakeholders within a schoolwide framework.Examples• Tier 1 is established for all students. This tier is the foundation for data collection, data-based deci-sion-making, and the behavioral practices (e.g., hallway, cafeteria, and recess expectations; school-wide reinforcement systems for good behavior; teacher modeling of schoolwide expectations).• Tier 2 is established for students needing support beyond Tier 1, typically due to excessive off-task and disruptive behavior. This level of support requires data-based decision-making by a behavioral support team (e.g., Is the intervention working? Are more or fewer supports needed?).• Tier 3 is established for students who have not adequately responded to Tier 2 interventions or whose behaviors are deemed unsafe (e.g., repeated violent behavior, running from adults). This level uses school- or district-level behavioral expertise to deliver individualized assessments and create and provide a more individualized and intensive intervention.3. Schools provide a continuum of strategies to improve behavior that are based on high-quality research. This continuum ranges from schoolwide supports available to all students to supports that are highly individualized and available to just a few students.Examples• Tier 1 supports: Explicitly and routinely teaching the schoolwide expectations, monitoring teacher implemen-tation and student use of the expectations, providing opportunities to practice social skills in real-life settings, and providing specific encouragement to students• Tier 2 supports: Weekly social skills groups, positive rein-forcement throughout the day, and routine check-ins• Tier 3 supports: Strategies developed and supported by behavior specialists and stakeholders, such as additional school staff members, the family, and the community © 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.04. School decisions are guided by schoolwide discipline data. Schools collect data that can be rou-tinely and formally reviewed to make decisions.Examples• A plan is in place to routinely collect and evaluate data on the schoolwide behavior support system’s impact on student behavior and the quality of the action plan’s implementation.• The leadership team reviews and disseminates Tier 1 data, such as attendance, school and fam-ily satisfaction surveys, and behavior infractions, to inform schoolwide decision-making (e.g., more adult supervision at dismissal, reinforcement of appropriate hallway behavior).• Team members routinely collect and review Tier 2 data, such as student on-task behavior, and disseminate the data to the appropriate stakeholders (e.g., individual students, teachers, par-ents) to evaluate the effectiveness of the plan and make appropriate adjustments.• The behavior support team routinely collects, reviews, and disseminates to the appropriate stakeholders and team members Tier 3 data, such as observations, interviews, and satisfaction surveys. This process allows the team to evaluate the individualized intervention, think through any changes that need to be made, and determine whether the students need additional evalua-tions and resources.5. School staff supports are in place. The leadership team and schoolwide policies support staff training through scheduled, ongoing coaching.Examples• The leadership team uses data to build in professional development (e.g., how to use the Tier 2 interventions) and identify areas where assistance is needed.• Regularly scheduled professional devel-opment, coaching, and feedback oppor-tunities are provided for staff members, coaches, and school teams.• Schools have a plan and timeline to shift from outside support to having their own capacity to develop and provide profes-sional development, ongoing coaching, and feedback. 6. Schools develop culturally relevant practices and supports. The multitiered systems and evi-dence-based practices reflect the needs, preferences, and cultural learning history of the students, families, staff members, and community.Examples• At school-sponsored outreach sessions, schools facilitate discussions about collected data, school expectations and rules, and available school supports (e.g., after-school programs, in-school behavior supports).• The school leadership teams actively recruit parents, students, and community members to participate in decision-making.• Schools include families and community members in developing and delivering professional development presentations reflecting the community’s cultures, values, and perspectives.© 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.07. Schools create and train teachers to use a classroom management “if-then” chart. The chart out-lines processes for how to prevent and respond to classroom behaviors in a predetermined manner.Examples• If students talk out, then reteach expectations and consider revising the reinforcement plan.• If a student refuses to complete work, then record the number of times the behavior occurs. • If a student is frequently disruptive in class, then implement a behavior contract that states the reinforcement for displaying the appropriate behaviors.• If additional support is needed, then gather relevant data and submit a request to the behavior support team.8. Classrooms allow for easy movement and have visibly posted expectations. Classrooms are ar-ranged strategically so students can move about easily. Three to five expectations are clearly displayed.Examples• The classroom layout allows the teacher and students to easily move around for common routines.• The design of the classroom allows the teacher and students to actively engage in instructional activities (e.g., circle areas for discussion, forward-facing area for group discussion).• The posted classroom expectations are clearly defined with examples and explicitly taught in an engaging lesson.9. Classroom behavioral practices are in place. The practices focus on prevention through supervi-sion, reminders, clear routines, opportunities for engagement, and acknowledgment of appropriate behavior, but also include clear responses to misbehavior.Examples• The classroom routines for arrival, dismissal, asking for assistance, what to do when work is completed, warm-up activities, and instruction for new and review mate-rials are predictable, taught, practiced, and reinforced.• The teacher constantly moves throughout the room, respectfully interacting with students and using behav-ior-specific praise (e.g., “You all did a great job coming into the room quietly,” “You masterfully led the group discussion with patience and respect for everyone”).• Students are engaged in lessons through individual or small-group questioning (e.g., pull a name out of a jar), choral responding (e.g., students respond to a question in unison), and nonverbal responses (e.g., thumbs up if you agree).• Students are provided prompts (e.g., signals for attention) and reminders prior to an expected be-havior, and misbehavior corrections are provided in a brief, concise, respectful, and private manner.10. Classroom data systems are in place. The classroom data-collection methods vary, depending on the type of behavior.Examples• The number of times that some behaviors occur (e.g., talking out in class) can be counted, such as with a clicker. • Noting what happens directly before a behavior begins (antecedent), the behavior itself, and what happens after the behavior (consequence) can lead to a better understanding of the behavior. —www.meadowscenter.org—© 2017 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0",
    "Link": "https://core.ac.uk/download/211330087.pdf"
}