{
    "Title": "Exciting LLM Geometries",
    "Authors": "Huang, Jia-Hui, Koch, Robert de Mello, Tribelhorn, Laila",
    "Year": "No year available",
    "Abstract": "We study excitations of LLM geometries. These geometries arise from the\nbackreaction of a condensate of giant gravitons. Excitations of the condensed\nbranes are open strings, which give rise to an emergent Yang-Mills theory at\nlow energy. We study the dynamics of the planar limit of these emergent gauge\ntheories, accumulating evidence that they are planar ${\\cal N}=4$ super\nYang-Mills. There are three observations supporting this conclusion: (i) we\nargue for an isomorphism between the planar Hilbert space of the original\n${\\cal N}=4$ super Yang-Mills and the planar Hilbert space of the emergent\ngauge theory, (ii) we argue that the OPE coefficients of the planar limit of\nthe emergent gauge theory vanish and (iii) we argue that the planar spectrum of\nanomalous dimensions of the emergent gauge theory is that of planar ${\\cal\nN}=4$ super Yang-Mills. Despite the fact that the planar limit of the emergent\ngauge theory is planar ${\\cal N}=4$ super Yang-Mills, we explain why the\nemergent gauge theory is not ${\\cal N}=4$ super Yang-Mills theory.Comment: 30 pages plus Appendice",
    "Keywords": "No keywords available",
    "Publisher": "'Springer Science and Business Media LLC'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Exciting LLM Geometries\nRobert de Mello Kocha,b,1, Jia-Hui Huanga,2\nand Laila Tribelhornb,3\na School of Physics and Telecommunication Engineering,\nSouth China Normal University, Guangzhou 510006, China\nb National Institute for Theoretical Physics,\nSchool of Physics and Mandelstam Institute for Theoretical Physics,\nUniversity of the Witwatersrand, Wits, 2050,\nSouth Africa\nABSTRACT\nWe study excitations of LLM geometries. These geometries arise from the backreaction\nof a condensate of giant gravitons. Excitations of the condensed branes are open strings,\nwhich give rise to an emergent Yang-Mills theory at low energy. We study the dynamics\nof the planar limit of these emergent gauge theories, accumulating evidence that they are\nplanar N = 4 super Yang-Mills. There are three observations supporting this conclusion: (i)\nwe argue for an isomorphism between the planar Hilbert space of the original N = 4 super\nYang-Mills and the planar Hilbert space of the emergent gauge theory, (ii) we argue that the\nOPE coefficients of the planar limit of the emergent gauge theory vanish and (iii) we argue\nthat the planar spectrum of anomalous dimensions of the emergent gauge theory is that of\nplanar N = 4 super Yang-Mills. Despite the fact that the planar limit of the emergent gauge\ntheory is planar N = 4 super Yang-Mills, we explain why the emergent gauge theory is not\nN = 4 super Yang-Mills theory.\n1robert@neo.phys.wits.ac.za\n2huangjh@m.scnu.edu.cn\n3 laila.tribelhorn@gmail.com\nar\nX\niv\n:1\n80\n6.\n06\n58\n6v\n1 \n [h\nep\n-th\n]  \n18\n Ju\nn 2\n01\n8\nContents\n1 Introduction 1\n2 Free CFT 6\n2.1 Background Dependence . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 7\n2.2 Excitations of AdS5×S5 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n2.3 Exitations of an LLM Geometry . . . . . . . . . . . . . . . . . . . . . . . . . 13\n3 Weak Coupling CFT 19\n3.1 One Loop Mixing of Local Operators . . . . . . . . . . . . . . . . . . . . . . 21\n3.2 Mixing with Delocalized Operators . . . . . . . . . . . . . . . . . . . . . . . 24\n4 Strong Coupling CFT 26\n5 Summary and Outlook 29\nA Ratios of hooks 31\nB Ratios of factors 33\nC Delocalized Trace Structures are Preserved 33\nD Localized and Delocalized Mixing at One Loop 36\nE Correcting the planar limit 37\n1 Introduction\nThe map between the planar limit of N = 4 super Yang-Mills theory and an integrable spin\nchain[1] has been a surprisingly rich idea. Single trace operators in the conformal field theory\n(CFT) are identified with states of the spin chain, and the dilatation operator of the CFT\nwith the Hamiltonian of the spin chain. This allows the exact computation of anomalous\ndimensions and hence precision tests[2, 3] of the duality with string theory on AdS5×S5[4,\n5, 6]. Excitations of the closed string are identified as magnons. The magnons are visible\nin the dual string theory description[7, 8]. After projecting the closed string solution to a\nplane (the so called bubbling plane [9]) and using coordinates suited to 1/2 BPS supergravity\ngeometries, the string worldsheet traces out a polygon[8]. The sides of the polygon are the\nmagnons. Geometrical properties of these sides (their length and orientation) determine the\nconserved charges (momentum and energy) labeling the magnon. The S-matrix for magnon\nscattering is determined up to a single overall phase simply by kinematics[10]. Integrability\n1\nthen fixes this phase. The S-matrix computed in string theory is in exact agreement with\nthe S-matrix computed in the CFT.\nHow much, if anything, of this story survives for string excitations of new geometries?\nThe geometries that we have in mind are the LLM geometries[9]. An LLM geometry is\ndual to an operator with a dimension that grows as N2 in the large N limit. Consequently,\ncorrelators of operators with dimensions of order N2 encode the physics of excitations of\nthese geometries. For operators with such a large dimension the planar approximation is not\njustified[11]. Consequently, mixing between different trace structures is not suppressed. The\nidentification between single trace operators in the CFT and spin chain states is spoiled and\nit seems that the link to an integrable spin chain is lost. In this introduction we will give\nsome physical arguments which suggest that, at least for a subset of excitations, this is not\nthe case. The rest of the paper then carries out detailed CFT computations that confirm\nthe details of this physical picture.\nThe LLM geometries are dual to a 1/2 BPS sector of the CFT. This 1/2 BPS sector\ncontains all gauge invariant operators built from a single complex matrix Z. Since we study\nsingle matrix dynamics, there is a simple free fermion description, obtained by working in\nterms of the eigenvalues of Z[12, 13]. There is also a closely related description which employs\nSchur polynomials in Z[13, 14]. We mainly use this second description as we know how\nto generalize it when including more matrices[15, 16]. This is needed when studying small\nfluctuations of the LLM geometries. A Schur polynomial dual to an LLM geometry is labeled\nby a Young diagram with order N2 boxes[9]. An operator dual to a smooth supergravity\ngeometry has a Young diagram with O(1) corners and the distance between any two adjacent\ncorners (that is, the number of rows or columns ending on the side between the two corners)\nis order N . The string theory understanding of this geometry is that it is the state obtained\nfrom back reaction of condensed giant gravitons[17, 18, 19]. The translation between the\nCFT and string theory descriptions is direct: we read the rows of the Young diagram as dual\ngiant gravitons or the columns as giant gravitons[13].\nTo excite the geometry in the CFT description, add boxes at a particular corner of the\nYoung diagram describing the LLM geometry[20, 21, 22]. In string theory we understand\nthis as exciting the giants that condensed to produce the geometry. The description of world-\nvolume excitations of these D3 brane giant gravitons is in terms of some open string field\ntheory whose low energy limit gives rise to a new emergent Yang-Mills theory[23, 24]. Rela-\ntive to the original Yang-Mills theory we started with, the space of the giant’s worldvolume\nis an emergent space. The new emergent Yang-Mills theory may itself have a holographic\ndescription so we might have new holographic dualities in this large charge limit[23].\nThe intuitive picture sketched above suggests that excitations arising from any particular\ncorner give rise to a distinct super Yang-Mills theory. We will study the planar limit of these\nemergent gauge theories, to provide detailed support for this intuition. To restrict to the\nplanar limit consider excitations with a bare dimension of at most O(\n√\nN), i.e. add at most\nO(\n√\nN) boxes to any given corner. Concretely we will demonstrate three things\n2\n1. An isomorphism between the planar Hilbert space of the original N = 4 super Yang-\nMills theory and the planar Hilbert space of the emergent gauge theory arising at a\ncorner. When restricted to the 1/2 BPS sector, these Hilbert spaces are in fact a\ngeneralization of the code subspaces constructed by [25] (see also [26, 27, 28]).\n2. Three point functions of operators in the planar emergent gauge theory vanish. We\ndemonstrate this in the free field theory. In the planar limit of matrix models the\nvanishing follows because to mix three single traces we have to break some index loops\nwhich costs (at least) a factor of N . This is a general conclusion true for both free\nand interacting matrix models. Consequently we conjecture that our free field theory\nresult holds after interactions are turned on. Since operator product expansion (OPE)\ncoefficients can be read from the three point functions, this implies the OPE coefficients\nof the planar emergent gauge theory vanish.\n3. The correct spectrum of planar anomalous dimensions of the emergent gauge theory.\nWe know the planar spectrum of anomalous dimensions of N = 4 super Yang-Mills\ntheory. We find the same spectrum for the emergent gauge theory. This demonstrates\nintegrability for the emergent gauge theories.\nNotice that since any CFT is determined by its spectrum of anomalous dimensions and\nOPE coefficients, and that in the strict planar limit all OPE coefficients vanish, this demon-\nstrates that the planar limit of the emergent gauge theories are planar N = 4 super Yang-\nMills theory. We will see that although these different emergent gauge theories all share the\nsame coupling constant (which is expected since this coupling is equal to the string coupling\nconstant of the original string theory on AdS5×S5), they generically have distinct gauge\ngroups U(Neff). The rank of the gauge group Neff receives contributions both from the flux\nof the original N D3 branes that gives rise to the N = 4 super Yang-Mills theory we start\nwith and from the giants which have condensed. By considering a large charge state, its\npossible to have an emergent gauge theory with gauge group that has rank larger than N .\nWhat we are finding is that a subset of the excitations of large charge states of the N = 4\nsuper Yang-Mills theory are equivalent to excitations of the vacuum. There are of course\nexcitations that go beyond the planar limit of the emergent gauge theory. The excitation\nis constructed by adding boxes to the Young diagram describing the LLM geometry. We\nmight add so many boxes that we reach beyond two corners of the Young diagram defining\nthe LLM geometry. The excitation is “too big” to sit on the Young diagram and in this way\nwe can detect features of the background Young diagram. These excitations are obtained by\nadding ∼ N boxes and hence do not belong to the planar limit of the emergent gauge theory\n- they are giant graviton like operators of the emergent theory. There are also excitations\nconstructed by adding order\n√\nN boxes, with the boxes added at different corners[45, 21, 22].\nThese (delocalized) states can be described as strings with magnon excitations that stretch\nbetween two corners. We will show that at large N these states are decoupled from (localized)\n3\nstates in the planar Hilbert space of the emergent gauge theory, so that if we start from a\nstate in the planar Hilbert space, the large N dynamics will not take us out of this space.\nThis is an important point to demonstrate since the coupling of the planar Hilbert space of\nthe emergent gauge theory to other degrees of freedom will almost certainly ruin integrability.\nThe free fermion description of the system is a powerful description because of its sim-\nplicity. The large charge state corresponds to exciting the fermions as illustrated in Fig 1.\nThe idea that a subset of the excitations of large charge states of the CFT are equivalent to\nexcitations of the vacuum has a natural interpretation in this free fermion language. We are\nsaying that exciting any edge of the blocks appearing in the excited state is equivalent to\nexciting the edge of the original Fermi sea. The only difference between the different blocks\nis their extent. By restricting to the planar limit we consider excitations that are not able\nto detect that the Fermi sea is not infinite, so the extent of each block is irrelevant.\nFigure 1: The free fermion description of a state labeled by a Young diagram. On the\nleft we have the Fermi sea corresponding to the AdS5×S5 geometry. The states are simply\nfilled from the lowest to highest energy with no unoccupied states. On the right, the Young\ndiagram corresponding to a particular LLM geometry is shown. Each vertical edge of the\nYoung diagram maps into occupied states while the horizontal edges map into unoccupied\nstates. The number of fermions that were not excited at all is equal to the number of rows\nwith no boxes. Thus, the excited state has broken the Fermi sea up into a series of occupied\nblocks.\nWe will be using group representation theory methods to approach the problem of com-\nputing correlators of operators with a bare dimension of order N2. This approach has been\n4\ndeveloped in a series of articles[13],[29]-[38],[15],[16], which has developed a number of bases\nfor the local operators of the theory. These bases diagonalize the two point function of the\nfree theory to all orders in 1/N , and they mix weakly at weak coupling[30, 39, 40]. They\ntherefore provide a very convenient tool with which to tackle the large N but non-planar\nlimit of the CFT.\nThe representation theory methods sum the complete set of ribbon graphs. In this\napproach, operators are constructed using projection operators1 of the symmetric group so\nthat the gauge invariant operators are labeled with irreducible representations of the group.\nSumming the ribbon diagrams of the free theory becomes multiplying these projectors and\nthen taking a trace. At loop level, we evaluate the dilatation operator D. Evaluating matrix\nelements of D amounts to computing the trace of the product of commutators of elements\nof the symmetric group with projection operators. The central technical achievement is\nthat in the end computing correlators, i.e. summing the ribbon graphs, is reduced to well\ndefined (but technically involved) problems in group representation theory. A helpful point\nof view in making sense of the details, which we introduce and develop in this article,\nentails classifying the various ingredients of the computation as background independent or\nbackground dependent. By something that is background independent, we mean something\nthat would take the same value on any inward pointing corner of any Young diagram dual\nto an LLM geometry, or even in the absence of a background, i.e. in the planar limit of the\noriginal CFT. These are quantities that take the same value regardless of which collection of\nbranes we excite, and this is what we signify in the terminology “background independent”.\nA quantity that is background dependent does depend on the collection of branes we excite.\nAs we discuss in section 2, after making this distinction it is clear that the Hilbert spaces\nof the planar limit of the emergent gauge theory at any corner are isomorphic to each other\nand to the planar Hilbert space of the theory in the absence of a background.\nOne of the original motivations for this study are the results [21, 22, 41] which suggest\nthe existence of new integrable subsectors of the CFT. We want to explore (and further\nestablish) the existence of these integrable subsectors. As discussed above, a key issue is\nto understand if the integrable sectors are decoupled from the nonintegrable sectors. It is\nuseful to bear in mind that integrability in the planar limit also depends on a decoupling\nbetween different subspaces: it makes use of the fact that different trace structures don’t\nmix. Thanks to this decoupling, it is consistent to focus on the space of single trace operators\nand it is in this subspace that its possible to construct a bijection between operators and\nthe states of an integrable spin chain. The statement of this decoupling is coded into the\nplanar correlation functions: correlators of operators with different trace structures vanish\nas N → ∞. Motivated with this insight we focus on correlation functions of the large\nN but non-planar limits to establish the decoupling between integrable and non-integrable\nsubsectors. This is discussed in section 2, where we obtain a simple formula for the correlators\n1These operators are actually intertwiners since they map between different copies of the representations\ninvolved. For simplicity though the reader may think of them as projectors which are more familiar.\n5\nin the planar limit of the free emergent gauge theory in terms of correlators of the free planar\nCFT without background. Consequently the decoupling we establish is closely related to the\nabsence of mixing between different trace structures in the planar limit.\nWe extend these results to the weakly interacting CFT in section 3, giving arguments\nthat the spectrum of planar anomalous dimensions of the emergent gauge theory match the\nspectrum of planar anomalous dimensions of the original N = 4 super Yang-Mills theory.\nWe revisit the issue of coupling between integrable and non-integrable subsectors, arriving\nat the conclusion that the two are decoupled even after interactions are turned on.\nIn section 4 we consider the strongly coupled CFT, using the dual string description.\nWe explain why the excitations considered should be understood as open string excitations\nlocalized on the world volume of giant graviton branes. We also suggest how to describe\nclosed string excitations of the large charge state we consider. In section 5 we summarize\nand discuss a number of promising directions in which to extend this work.\n2 Free CFT\nOur basic goal is to organize and study excitations of an LLM background, using the dual\nN = 4 super Yang-Mills theory. Any LLM geometry is specified by a boundary condition,\ngiven by coloring the bubbling plane into black and white regions[9]. The LLM backgrounds\nwe consider have boundary conditions given by concentric annuli, possibly with a central\nblack disk. The LLM geometry is described by a CFT operator with a bare dimension of\norder N2. Concretely, it is a Schur polynomial[13] labeled by a Young diagram with O(N2)\nboxes and O(1) corners. Large N correlators of these operators are not captured by summing\nonly planar diagrams, so we talk about the large N but non-planar limit of the theory. The\nexcitation is described by adding J boxes to the background, with J2 \u001c N . Consequently,\nwe can ignore back reaction of the excitation on the LLM geometry.\nThe CFT operators corresponding to the background and excitation are given by re-\nstricted Schur polynomials[15, 16]. Construction of these operators and their correlators\nbecomes an exercise in group representation theory. In section 2.1 we discuss elements of\nthis description, placing an emphasis on if the quantity being considered depends on or is\nindependent of the collection of branes being excited. This distinction will clarify general\npatterns in the CFT computations that follow.\nWe begin our study in the free field theory. The Hilbert space of possible excitations can\nbe written as a direct sum of subspaces. There are subspaces that collect the excitations\nlocalized at the outer or inner edge of a given annulus, or at the outer edge of the central\ndisk. The excitations are obtained by adding boxes to the Young diagram describing the\nbackground, at a specific location. They are also localized in the dual gravitational de-\nscription, at a specific radius on the bubbling plane[21, 22]. Each localized Hilbert space is\nlabeled by the edge at which it is localized. There are also delocalized excitations, where the\n6\ndescription of the excitation involves adding boxes at different locations on the background\nYoung diagram[21, 22]. We will not have much to say about delocalized excitations.\nThe excitations belonging to the localized Hilbert spaces play a central role in our study.\nThese are the Hilbert spaces of the emergent gauge theories. We give a bijection between the\nstates belonging to the planar Hilbert space of an emergent gauge theory, and the states of\nthe planar limit of the original CFT without background. To show that the bijection takes on\na physical meaning, we argue that correlation functions of operators that are in bijection are\nrelated in a particularly simple way, in the large N limit. This result is significant because\nthe basic observables of any quantum field theory are its correlation functions and many\nproperties of the theory can be phrased as statements about correlation functions. Thanks\nto the map between correlation functions, any statement about the planar limit that can be\nphrased in terms of correlators, immediately becomes a statement about the planar emergent\ngauge theories that arise in the large N but non-planar limits we consider.\n2.1 Background Dependence\nIrreducible representations of the symmetric group Sn are labeled by Young diagrams with\nn boxes. States in the carrier space of the representation are labeled by standard tableau, in\nwhich we populate the boxes with numbers {1, 2, ..., n} such that the numbers are decreasing\nalong the rows (from left to right) and along the columns (from top to bottom). A repre-\nsentation for Sn is given by specifying the action of any element σ ∈ Sn on the standard\ntableau. We will use Young’s orthogonal representation. For example, here is the action of\nthe two cycle σ = (12) ∈ S4 on a specific tableau\n(12) 4 3 1\n2\n=\n1\n3\n4 3 1\n2\n+\n√\n1−\n(\n1\n3\n)2\n4 3 2\n1\n(2.1)\nThe number 1\n3\nthat appears in the above equation is counting the number of boxes in the\nshortest path from the box labeled 1 to the box labeled 2. The only thing that matters is the\nrelative position of boxes 1 and 2. Consequently, σ has the same action on all three states\nshown below.\n4 3 1\n2\n4 3 1\n2\n4 3 1\n2\n(2.2)\n7\nFor example\n(12)\n4 3 1\n2\n=\n1\n3\n4 3 1\n2\n+\n√\n1−\n(\n1\n3\n)2\n4 3 2\n1\n(2.3)\nThis demonstrates that the action of the symmetric group on the boxes belonging to the\nexcitation is background independent. In what follows we will use R (or r) to denote the\nYoung diagram describing the excitation and +R (or +r) to denote the Young diagram after\nit has been placed at an inward pointing corner of the Young diagram for the LLM geometry.\nWhen our excitation has more than one type of field, the gauge invariant operator is\nconstructed by restricting to the subgroup that permutes fields of a specific type. For exam-\nple, if we have n Z fields and m Y fields, we would start with an irreducible representation\nR ` n + m of Sn+m and restrict to some representation (r, s), r ` n, s ` m, of the Sn × Sm\nsubgroup. Upon restricting (r, s) may appear more than once, so we need a multiplicity label\nα to distinguish the different copies. Since we use only the action of the symmetric group\nto perform the restrictions, the multiplicity labels are also background independent. To di-\nagonalize the one loop dilatation operator [42, 43] traded the multiplicity labels for directed\ngraphs recording how open strings are connected between giant gravitons. These graphs\nsummarize basic physics coming from the Gauss Law on the brane worldvolume that is true\nfor any collection of compact branes. This is why the multiplicity labels are background\nindependent.\nThere is a potential fly in the ointment that deserves discussion. In the absence of the\nbackground, R is used to put the Zs and Y s together while r is used to organize the Zs and s\nthe Y s. In the presence of the background, constructed using Zs, we must replace R→ +R\nand r → +r, while s is unchanged. The first m boxes labeled in the standard tableau made\nby filling R are Y fields, and are among the impurity boxes added to the background Young\ndiagram. The remaining boxes are then labeled in all possible ways to give the states of the\nsubspace. Imagine that n = m = 2. Two possible labeling are as follows\n4 3 1\n2\n4\n3 1\n2\n(2.4)\nOn the left we have the usual action of the symmetric group on the added boxes. For the\nstate on the right, we find a different answer. At large N , when the number of boxes in\n8\nthe shortest path linking distant box 4 to any local labeled box (where the excitation was\nadded) is of order N , any permutation swapping box 4 with another box, will just swap the\ntwo labels. This is orthogonal to the state before the swap. We will always land up taking\na trace over group elements of the subgroup that permutes excitation boxes. For the traces\nwe need only states on the left contribute. As a consequence, although the action of the\nsymmetric group on impurities is not background independent traces over these elements\nare2. Notice that the problem of resolving multiplicities is phrased entirely in terms of the\nsubgroup acting on Y fields i.e. we can set the problem up so that the multiplicities are\nassociated to representation s. For this reason the above potential spanner in the works\ndoesn’t threaten our conclusion that multiplicity labels are background independent.\nThe operators which generalize the Schur polynomials when more than one type of field is\npresent are called restricted Schur polynomials[29, 15]. The Schur polynomial is constructed\nusing characters of the symmetric group. The restricted Schur polynomial is constructed\nusing a restricted character χR,(r,s),αβ(σ) [29]. Recall that the character χR(σ) is given as a\ntrace over the matrix ΓR(σ) representing σ in irreducible representation R. For the restricted\ncharacter we restrict the trace to the subspace carrying the representation of the subgroup\n(r, s). Because there are different copies of (r, s) in the game, there are many ways to do\nthis. The restricted character χR,(r,s)αβ(σ) is given by summing the row index of ΓR(σ) over\nthe α copy of (r, s) and the column label over the β copy of (r, s). This can be accomplished\nby making use of an intertwining map PR,(r,s)αβ which maps from the α copy of (r, s) to the\nβ copy of (r, s). This map can be constructed using only elements of the symmetric group\nthat act on the impurities. In terms of PR,(r,s)αβ we have\nχR,(r,s)αβ(σ) = Tr\n(\nPR,(r,s)αβ ΓR(σ)\n)\n(2.5)\nIn the presence of the background this becomes\nχ+R,(+r,s)αβ(σ) = Tr\n(\nP+R,(+r,s)αβ Γ+R(σ)\n)\n(2.6)\nwhere σ is the same permutation as in (2.5). It is clear that the restricted character is\nbackground independent, up to the remark of footnote 2.\nThe operators of the planar limit are dual to strings and gravitons in the AdS5×S5\ngeometry. Since the restricted Schur polynomials provide a basis, any such operator can\nbe expressed as a linear combination of restricted Schurs. For simplicity we will discuss\noperators constructed from two complex matrices Z and Y , but it will be clear that our\nconclusions generalize for an arbitrary local operator. The definition of the restricted Schur\npolynomial is[15]\nχR,(r,s)αβ(Z, Y ) =\n1\nn!m!\n∑\nσ∈Sn+m\nχR,(r,s),αβ(σ)Y\ni1\niσ(1)\n· · ·Y imiσ(m)Z\nim+1\niσ(m+1)\n· · ·Zin+miσ(n+m) . (2.7)\n2This is of course up to a factor which is determined by the dimension of the irreducible representation\nof the background. This factor is from summing over all the possible standard tableau obtained by filling\nboxes associated to the background.\n9\nAn arbitrary operator OA can be expanded in the basis of restricted Schur polynomials as\nfollows[16]\nOA =\n∑\nR,r,s,α,β\na\n(A)\nR,(r,s),α,βχR,(r,s)αβ(Z, Y,X, · · · ) (2.8)\nWe will argue that the expansion coefficients a\n(A)\nR,(r,s),α,β are background independent. Imagine\nthat OA is the operator in the planar Hilbert space corresponding to some specific state,\nlabeled by its dimension,R-charge and whatever other labels we need to specify it completely.\nThe operator in the planar Hilbert space of the emergent gauge theory, dual to the state\nthat shares the same labels, is given by\nO+A =\n∑\nR,r,s,α,β\na\n(A)\nR,(r,s),α,βχ+R,(+r,s)αβ(Z, Y,X, · · · ) (2.9)\nIt is in this sense that the expansion coefficients are background independent. We will argue\nfor (2.9) below by demonstrating that with this rule the correlation functions of the set of\noperators {O+A} are given in terms of those of {OA}, essentially by replacing N → Neff . The\ntwo operators should then represent the same physical state since the physical interpretation\nof any operator is coded into its correlation functions.\nWe now consider quantities that are background dependent. The two point function of\nrestricted Schur polynomials includes a product of the factors of the Young diagram. A box\nin row i and column j of a Young diagram has factor N−i+j. This quantity clearly depends\nsensitively on where you are located within the Young diagram and is not simply a function\nof the relative position of two boxes. The factors of the boxes added at different corners will\ndepend on the corner and on the details of the shape of the Young diagram. We will see\nin what follows that all of the N dependence of the correlators comes from factors, so that\nmoving between different corners shifts N → Neff , which changes the rank of the emergent\ngauge group. The only difference between the planar limit of the emergent gauge theories\nat each corner is this shift in N .\nA second ingredient in the two point function of restricted Schur polynomials, is a ratio\nof the product of the hook lengths of the Young diagram. Assume that we have a total of\nC outward pointing corners and further that our localized excitation is stacked in the ith\ncorner. In the Appendix A we prove the following result\nhooks+R\nhooks+r\n=\nhooksR\nhooksr\n(ηB)\n|R|−|r|\n(\n1 +O\n(\n1\nN\n))\n(2.10)\nwhere |R| stands for the number of boxes in the Young diagram R and\nηB =\ni∏\nj=1\nL(j, i)\nL(j, i)−Nj\nC∏\nl=i+1\nL(i+ 1, l)\nL(c+ 1, l)−Ml (2.11)\n10\nL(a, b) =\nb∑\nk=a\n(Nk +Mk) (2.12)\nThe notation in the above formulas is defined in Figure 2. Formula (2.10) is telling us that\nalthough hooks+R/hooks+r depends on the background this dependence is a simple multi-\nplicative factor that is sensitive to the shape of the Young diagram for the LLM geometry\nand the number of fields in the excitation that are not Z fields. Its dependence on R and r\nnicely matches hooksR/hooksr. Note that (2.10) is not exact - it receives\n1\nN\ncorrections.\nOur discussion in this section has focused on operators constructed using only 2 fields, Z\nand Y . The generalization is straight forward. For k different species of fields (which may\ninclude additional scalars, fermions or covariant derivatives), with nk fields of each species,\nwe consider a subgroup Sn1 × Sn2 × · · · × Snk of Sn1+n2+···+nk . By including enough different\nspecies we can describe any operator in the planar limit of the CFT. It is again clear that\nalthough the action of the symmetric group on impurities is not background independent,\ntraces over these elements are and that multiplicity labels and expansion coefficients are\nagain background independent.\n2.2 Excitations of AdS5×S5\nStart in the simplest setting in which no giant graviton branes have condensed and consider\nexcitations that are dual to operators with a bare dimension of order J with J2 \u001c N . This\ncorresponds to the planar limit of the N = 4 super Yang-Mills. In this limit there are\nimportant simplifications. First, different trace structures don’t mix3. This is phrased as a\nstatement about correlation functions. To see this, consider loops constructed from a single\ncomplex adjoint matrix Z. In terms of the normalized traces OJ ≡ Tr(ZJ)/\n√\nJNJ we have\n〈O†J(x1)OJ(x2)〉 =\n1\n|x1 − x2|2J +O\n(\nJ2\nN\n)\n〈O†J1+J2(x1)OJ1(x2)OJ2(x2)〉 =\n√\nJ1J2(J1 + J2)\nN |x1 − x2|2J1+2J2 + ...\n→ 0 as N →∞ (2.13)\nThe two point function of single traces is of order 1, while the two point function of a double\ntrace with a single trace operator goes to zero. We have considered mixing between single\nand double traces, but the conclusion is general: to mix different trace structures, we break\ncolor index loops to match traces structures and every time we break an index loop it costs\na factor of N . The fact that different trace structures do not mix in the planar limit is an\nimportant result, ultimately responsible for the existence of the spin chain language. Indeed,\n3For a careful study of this point see [44].\n11\nthe absence of mixing implies it is consistent to restrict to single trace operators and each\nsingle trace operator can be identified with a specific spin chain state. We will derive a\nformula for the correlation functions of certain excitations of a (heavy) operator with an\nenormous ∼ N2 dimension in terms of the correlation functions of the planar limit. As\na consequence of this formula, we will see that simplifications of the planar limit encoded\nin correlation functions are then automatically present in correlation functions of certain\nexcitations of the background.\nWe will make extensive use of the two point function of the restricted Schur polynomial,\ngiven by[15]\n〈χR,(r,s)αβ(Z, Y )χT,(t,u)δγ(Z, Y )†〉 = δRSδrtδsuδαδδβγ fRhooksR\nhooksrhookss\n(2.14)\nIn the above formula fR stands for the product of factors of Young diagram R, while hooksR\nstands for the product of hook lengths of Young diagram R. This result is exact for the\nfree field theory, i.e. all ribbon diagrams have been summed. Thus, the above formula is\nreliable for correlators of operators regardless of their dimension. This is why its useful to\nexpress our computations in the restricted Schur polynomial language: we can tackle both\nthe planar correlators (with dimension ≤ O(√N)) and correlators in the background of a\nheavy operator (with dimension of O(N2)) using a single formalism.\nThe computation of correlation functions most useful for our goals, starts by expressing\nthe operators of interest as linear combinations of restricted Schur polynomials. This is\nalways possible because the restricted Schur polynomials furnish a basis for the local gauge\ninvariant operators of the theory. An arbitrary operator OA\nOA = Tr(σY\n⊗m ⊗ Z⊗n) = Y i1iσ(1) · · ·Y imiσ(m)Z\nim+1\niσ(m+1)\n· · ·Zin+miσ(n+m) (2.15)\ncan be written as a linear combination of restricted Schur polynomials as follows\nOA =\n∑\nR,r,s,α,β\na\n(A)\nR,(r,s),α,βχR,(r,s)αβ(Z, Y,X, · · · ) (2.16)\nBy changing the permutation σ appearing in (2.15) we can obtain any desired multi trace\nstructure. Taking linear combinations of these terms, we can easily construct, for example,\nthe operators that would map into the states of the spin chain. Explicit formulas for the\ncoefficients are known\nTr(σZ⊗nY ⊗m) =\n∑\nT,(t,u)αβ\ndTn!m!\ndtdu(n+m)!\nχT,(t,u)αβ(σ\n−1)χT,(t,u)βα(Z, Y ) (2.17)\nWe will not however need the precise values of the a\n(A)\nR,{r},α. Formula (2.17) does however\nmake it clear that these coefficients are symmetric group data and consequently, they are\nindependent of N . Using the known two point function for the restricted Schur polynomial,\n12\nwe find in the free field theory, that\n〈OA(x1)OB(x2)†〉 =\n∑\nR,r,s,α\na\n(A)\nR,(r,s),α,βa\n(B)∗\nR,(r,s),α,βhooksRfR\nhooksrhookss\n1\n|x1 − x2|2J (2.18)\nThe above result is exact and its an ingredient in the proof of the identity relating planar\ncorrelation functions of N = 4 super Yang-Mills theory to the correlations functions of the\nemergent gauge theories that arise in large N but non-planar limits. The planar approxima-\ntion to the correlation function in free field theory is obtained by truncating the above exact\nresult to its leading term in a large N expansion.\nUp to now we have focused on operators constructed using only the Z and Y fields.\nThe most general operator will be constructed from adjoint scalars, adjoint fermions or\ncovariant derivatives of these fields. The construction of restricted Schur polynomials with\nan arbitrary number of species of adjoint scalars and an arbitrary number of species of\nadjoint fermions was given in [46]. The construction of restricted Schur polynomials using\ncovariant derivatives has been described in [47]. Each power of the covariant derivative DpµZ\nmust be treated as a new species of field. If the operator we consider is constructed using\na total of k species of fields, then the restricted Schur polynomial becomes χR,{r},αβ, with\n{r} a collection of k Young diagrams, one for each species. If we use ni fields of species i\nthe corresponding Young diagram ri has ni boxes. Young diagram r1 corresponds to the Z\nfield. Young diagram R has n1 + n2 + ... + nk boxes. The additional labels contained in α\nand β are again discrete labels distinguishing operators that carry the same R, {r} labels.\nThe formulas we have given above now generalize as follows\n〈χR,{r}αβ(Z, Y )χT,{t}δγ(Z, Y )†〉 = δRSδ{r},{t}δαδδβγ fRhooksR∏\nr hooksr\n(2.19)\nOA =\n∑\nR,r,s,α,β\na\n(A)\nR,{r1,r2,··· },α,βχR,{r1,r2,··· }αβ(Z, Y,X, · · · ) (2.20)\nand\n〈OA(x1)OB(x2)†〉 =\n∑\nR,r,s,α\na\n(A)\nR,{r},α,βa\n(B)∗\nR,{r},α,βhooksRfR∏\nr hooksr\n1\n|x1 − x2|2J (2.21)\nIn the above formulas, δ{r},{t} is 1 if the complete ordered sets of Young diagrams {r} and\n{t} are equal, and it is zero otherwise. The planar approximation is again obtained by\ntruncating to the leading term in a large N expansion. This completes our discussion of the\nplanar correlation functions.\n2.3 Exitations of an LLM Geometry\nThe LLM geometries that we consider are described by Schur polynomials χB(Z) of the\ncomplex matrix Z labeled by a Young diagram B with O(N2) boxes and O(1) outward\n13\npointing corners. An example of a possible Young diagram B, with 5 outward pointing\ncorners is shown in Figure 2.\nFigure 2: A possible label B for a Schur polynomial describing an LLM background. Note\nthat\n∑6\ni=1 Ni = N .\nAll of the horizontal edges Mi, and vertical edges Ni have a length of O(N). Excitations\nare obtained by adding J = O(\n√\nN) boxes to B. These new boxes could be stacked at\nany of the inward pointing corners, below or to the right4 of B. The possible locations\nfor the new boxes are labeled 0 to 5 in Figure 2. We will distinguish between excitations\nconstructed by adding all extra boxes at a single inward pointing corner (localized excitations)\nand excitations constructed by adding extra boxes at more than one corner (delocalized\nexcitations). In the free field theory, thanks to the fact that the two point function of the\nrestricted Schur polynomial is diagonal in all of its labels, the local and delocalized excitations\nare orthogonal5. Denote the Hilbert space of small fluctuations about the LLM geometry by\n4We could also create excitations by eroding the outward pointing corners. We will not study these\nexcitations here.\n5When we make this comment we have the operator/state correspondence of the CFT in mind. According\nto the correspondence, the inner product of two states is related to the correlators of the corresponding\noperators.\n14\nHCFT;LLM. This Hilbert space can be decomposed as a direct sum as follows\nHCFT;LLM = HCFT;Local\n⊕\nHCFT;Delocalized (2.22)\nOur study will focus on the local excitations. The Hilbert space of local excitations can\nfurther be refined as a direct sum of subspaces, one for each corner of the background Young\ndiagram\nHCFT;Local =\n⊕\ni\nH(i)CFT (2.23)\nwhere i runs over inward pointing corners with the understanding that below or to the\nright6 of B count as corners. Each factor H(i)CFT in the above sum is the Hilbert space of an\nemergent gauge theory and is isomorphic to the space of local operators in the planar limit of\nthe original CFT, as we now explain. We do this by giving the bijection between operators\nof dimension J with J2 \u001c N and operators in H(i)CFT. The bijection maps the operator given\nin (2.20) above into\nO\n(B)\nA =\n∑\nR,r,s,α,β\na\n(A)\nR,{r1,r2,··· },α,βχ+R,{+r1,r2,··· }αβ(Z, Y,X, · · · ) (2.24)\nThe coefficients of the expansion appearing in (2.20) are identical to the coefficients appearing\nin (2.24). It is only the R and r1 labels in the restricted Schur polynomials in (2.20) and\n(2.24) that have changed. The Young diagram +R is obtained by stacking R at the ith\ncorner of B and similarly, the Young diagram +r is obtained by stacking r at the ith corner\nof B. For an example of how this works, see Figure 3.\nFigure 3: To obtain +R from R we stack R at one of the inward pointing corners of B.\nThis mapping is a bijection. Operators with distinct labels are orthogonal. Operators\nwith distinct labels before the map have distinct labels after the map. Thus, the mapping\n6The locations labeled 0 and 5 in Figure 2.\n15\nis injective. Any operator with a bare dimension J and J2 \u001c N can be mapped to an\nexcitation of the background B. What is important here is that, since each edge of the\nYoung diagram has a length of order N , there is no danger that when we stack R it will not\nfit onto the corner. Of course, the converse is also true: any excitation of the background\ncan be mapped to an operator of dimension J by deleting the boxes in +R and +r1 which\nbelong to B. Thus, the map is surjective. This demonstrates that our mapping is a bijection.\nIn the remainder of this section we will argue that the correlation functions of operators\nthat are in bijection are related in a particularly simple way, in the large N limit. We would\nlike to normalize our correlators so that\n〈1〉B = 1 (2.25)\nWe know that 1 maps into χB(Z) and that\n〈χB(Z)χB(Z)†〉 = fB 1|x1 − x2|2|B| (2.26)\nwhere |B| is the free field dimension of χB(Z). Consequently we will include an extra factor\nof |x1 − x2|2|B|f−1B to ensure that our correlators are correctly normalized\n〈· · · 〉B = 〈· · · 〉\nfB\n|x1 − x2|2|B| (2.27)\nUsing the two point function of the restricted Schur polynomial, we obtain the following\nresult\n〈O(B)A (x1)O(B)B (x2)†〉B =\n∑\nR,r,s,α\na\n(A)\nR,(r,s),α,β a\n(B)∗\nR,(r,s),α,β hooks+R f+R\nfB hooks+r1\n∏\ni>2 hooksri\n1\n|x1 − x2|2J (2.28)\nAssume that we have a total of C outward pointing corners and further that our localized\nexcitation is stacked in the ith corner. Applying the identity (2.10) we find\n〈O(B)A (x1)O(B)B (x2)†〉B = (ηB)nI\n∑\nR,r,s,α\na\n(A)\nR,(r,s),α,β a\n(B)∗\nR,(r,s),α,β hooksR∏\ni hooksri\nf+R\nfB\n1\n|x1 − x2|2J\n(\n1 +O\n(\n1\nN\n))\n(2.29)\n(2.10) is not exact - it includes 1\nN\ncorrections and this is the only source of 1\nN\ncorrections in\nour final result. We have assumed7 that every term in the sum has the same total number\nof fields and the same number of Z fields, i.e. that each term has the same value for\n|R| − |r1| ≡ nI . The subscript I on nI stands for “impurity” since its common to refer to\n7This assumption is not necessary. By rescaling each impurity field by\n√\nηB we could remove the ηB\ndependence in these formulas.\n16\nfields in our excitation that are not Z fields as impurities. We would now like to compare\nthis to the result that we obtained for the planar correlators, which is\n〈OA(x1)OB(x2)†〉 =\n∑\nR,r,s,α\na\n(A)\nR,(r,s),α,βa\n(B)∗\nR,(r,s),α,βhooksRfR\nhooksrhookss\n1\n|x1 − x2|2J\n≡ FAB(N) 1|x1 − x2|2J (2.30)\nThe two results are nearly identical. The only difference, apart from the overall factor (ηB)\nnI ,\nis that fR in the planar result is replaced by\nf+R\nfB\nin the emergent gauge theory result. Now,\nrecall that fR is the product of factors in Young diagram R and that a box in row j and\ncolumn k has factor N − j + k. Consequently\nfR(N) =\n∏\n(j,k)∈R\n(N − j + k) (2.31)\nIn the ratio f+R\nfB\nfactors of boxes that are common to +R and B cancel. After performing\nthese cancellations we find\nf+R\nfB\n= fR(Neff) =\n∏\n(j,k)∈R\n(Neff − j + k) (2.32)\nwhere\nNeff = N −\ni∑\na=1\nNa +\nC∑\nb=i+1\nMb (2.33)\nThis last formula is explained in Figure 2 and Appendix B. Neff is the factor of the first\nexcitation box added to the background Young diagram. Finally, recalling that the only\nsource of N dependence is in fR (for the planar correlators) or\nf+R\nfB\n(for the emergent gauge\ntheory correlators) we finally obtain\n〈OA(x1)OB(x2)†〉 = FAB(N) 1|x1 − x2|2J\n〈OA(x1)OB(x2)†〉B = FAB(Neff) (ηB)\nnI\n|x1 − x2|2J\n(\n1 +O\n(\n1\nN\n))\n(2.34)\nThis demonstrates a remarkable relationship between correlators in the planar and non-\nplanar limits.\nThis result has a number of immediate applications. As we have stressed above, the fact\nthat operators with different trace structures don’t mix in the planar limit is a statement\nabout correlators. This no-mixing result allows focus on the single trace operators which is\nneeded to develop the spin chain connection for the planar CFT. Our result (2.34) immedi-\nately implies that operators that are the image of operators with different trace structures,\n17\nwill not mix. Thus, we too can focus on the image of single trace operators and then develop\na spin chain description of the planar limit of the emergent gauge theory. States of the spin\nchain that were identified with a given operator in the planar limit will now be identified\nwith the image of the same operator.\nThree point functions of single trace operators are suppressed in the planar limit of the\noriginal CFT. Is there a similar statement for three point functions of single trace operators\nin the emergent gauge theory? In any Poincare invariant CFT the spacetime dependence\nof the three point function is fixed by conformal invariance. We can thus simply factor this\ndependence out and consider the problem of the combinatorics of the Wick contractions.\nThis is also a complicated problem, but for some well chosen examples it can be solved.\nConsider the following correlator\n〈Tr (Zn1Y n2 · · · )Tr (Zm1Y m2 · · · )Tr (Z†p1Y †p2 · · · )〉 (2.35)\nThe Wick contractions are all between the first trace and the third trace, and between\nthe second trace and the third trace. In particular, there are no contractions between the\nfirst and second traces. For the combinatorics of the Wick contractions, we can treat the\ndouble trace Tr (Zn1Y n2 · · · )Tr (Zm1Y m2 · · · ) as a single operator and apply the bijection\nand treat Tr (Z†p1Y †p2 · · · ) as a single operator and apply the bijection. Thus, we have\nreduced the computation to a two point function. This two point correlator correctly sums\nthe contractions between the three traces with each other and with the background. The\nresult (2.34) then implies that this correlator, which is giving the three point function, is\nsuppressed in the planar limit of the emergent gauge theory. Since OPE coefficients are read\nfrom three point functions, the OPE coefficients vanish in the planar limit of both N = 4\nsuper Yang-Mills and the emergent gauge theory. We have proved this in the free field theory,\nfor a specific class of correlators. We conjecture that it holds quite generally and continues\nto hold when interactions are turned on. The usual suppression holds because we need to\nbreak index loops (which costs N−1 for each loop we break) to find a non-zero correlator\nbetween three single traces. This does not rely on any detailed structure of the interaction\nand is quite generally true for a matrix model. Of course, this is one point in our analysis\nthat could be improved.\nOur argument in this section considers only the local operators. One might wonder if\nmixing between different trace structures of delocalized operators is also suppressed or not.\nIn this case the argument is more involved. It is unlikely that there is a simple relationship\nbetween correlators of delocalized operator and correlators computed in the planar limit.\nExplicit computations using concrete examples support the conclusion that again, different\ntrace structures don’t mix. See Appendix C for a discussion of this point.\nTo summarize, we have arrived at a rather detailed picture of the structure of the Hilbert\nspace. We have decomposed the Hilbert space of excitations of the LLM geometry into a\n18\ndirect sum\nHCFT;LLM =\n(⊕\ni\nH(i)CFT\n)⊕\nHCFT;Delocalized (2.36)\nRestricted Schur polynomials are orthogonal if their labels don’t match. This immediately\nimplies that in the free field theory operators belonging to different Hilbert spaces in the\nabove sum have vanishing two point functions and hence that the corresponding subspaces\nare orthogonal. We have further argued that each subspace can be decomposed into a direct\nsum of orthogonal components, with each component collecting operators of a definite “trace\nstructure”. Here the trace structure is read from the preimage of the operator under the\nbijection (2.24). At large N these different trace structures do not mix.\nOur study has focused on the free field theory. Of course, the bijection we have defined\nholds for any coupling. The free field limit has been used to obtain the relationship between\ncorrelators of operators and correlators of their images. It is this discussion that we will\nextend to weak coupling in the next section.\n3 Weak Coupling CFT\nWe expect that the gravitational physics dual to the CFT is coded into the large N corre-\nlators. Consequently, it is attractive if we can find relationships between correlators of the\nplanar limit and correlators in the background of a heavy operator. In the previous section\nwe have exhibited relationships of this type, all in the free limit of the CFT. We expect the\ndual gravitational description is simplest when the CFT is strongly coupled. It is natural to\nask if the simple relations between correlation functions exhibited in the free theory survive\nwhen interactions are added. Answering this question is the goal of the current section. We\nstart with a careful discussion of the one loop dilatation operator, which develops the relation\nbetween correlators at one loop. This argument also gives insight into why the relationship\nwe have uncovered between correlators holds even when higher loop corrections are included.\nThe article [21] argued that matrix elements of the planar dilation operator are identical\nto matrix elements of the dilatation operator computed using local excitations, localized\nat corner8 i of the Young diagram for the LLM geometry, after replacing λ = g2YMN by\nλeff = g\n2\nYMNeff where Neff is the factor of the first box added to corner i. This again\namounts to replacing N → Neff so it is the rule we derived in Section 2.3! We will revisit\nthis argument below adding two new improvements\n1. By carefully tracking what is background independent and what is not we will develop\na much simpler technical analysis.\n8These operators belong to H(i)CFT\n19\n2. We will phrase the result using the bijection we developed in Section 2.3. The advantage\nof the rephrasing is that it supports the conclusion that the planar limit of the emergent\ngauge theory is planar N = 4 super Yang-Mills.\nThe final result is remarkable: in the large N but non-planar limit we need to sum a huge\nset of Feynman diagrams. The net effect of summing the huge set of non-planar diagrams,\nis a simple rescaling of the ’t Hooft coupling. This is in complete harmony with the physical\nargument we developed in the introduction.\nThe fact that we simply need to rescale the ’t Hooft coupling has far reaching conse-\nquences: since the dilatation operator in the planar CFT matches the Hamiltonian of an\nintegrable spin chain, we know that the dilatation operator describing the anomalous dimen-\nsions of the emergent gauge theory will also match the integrable spin chain. As long as\nthe dilatation operator does not mix operators that belong to the Hilbert space H(i)CFT with\noperators that don’t belong to this space, we conclude that there are integrable subsectors\nin the large N but non-planar limit we consider. Demonstrating the absence of this mixing\nis one of the main goals of this section.\nBefore turning to a detailed technical analysis we will briefly review the evidence sup-\nporting the above result. It implies that the anomalous dimensions of the operators of the\nplanar emergent gauge theory are determined in terms of the corresponding dimensions com-\nputed in the planar CFT. Explicit computations of anomalous dimensions of the emergent\nCFT, when developed in a perturbative expansion, confirm this prediction both in the weak\ncoupling CFT and at strong coupling using the dual string theory[45, 21]. Using the su(2|2)\nsymmetry enjoyed by the su(3|2) subspace of local excitations, the two magnon S-matrix has\nbeen determined and it agrees up to two loops with a weak coupling computation performed\nin the CFT[22]. The first finite size corrections to both the magnon and the dyonic magnon\nhave been computed by constructing solutions to the Nambu-Goto action that carry finite\nangular momentum. These computations[22] again show that the net affect of the back-\nground is a scaling of the ’t Hooft coupling. This constitutes strong coupling evidence for\nour result. Since these corrections are sensitive to the overall phase of the S-matrix, which is\nnot determined by kinematics (i.e. the su(2|2)2 symmetry of the theory), this is a non-trivial\ntest. Finally, strings spinning on the three sphere that belongs to AdS5 have been consid-\nered in [41]. These strings are dual to operators belonging to the SL(2) sector of the gauge\ntheory. Once again, the net affect of the background is a scaling of the ’t Hooft coupling as\npredicted[41].\nIn the subsection that follows we revisit the analysis of [21], phrasing things in terms of\nthe bijection of section 2.3 and paying attention the background dependence of the various\ningredients in the analysis. This significantly simplifies the original analysis. We pay careful\nattention to operator mixing, to give evidence supporting the conclusion that the integrable\nsubsectors are decoupled at large N . This closes an important hole in the analysis of [21].\nFinally, we consider how the one loop discussion generalizes when we include higher loops.\n20\n3.1 One Loop Mixing of Local Operators\nFrom now on we normalize the two point function of our operators to 1. To simplify the\ndiscussion again focus on operators constructed using only Z and Y fields. It is a simple\ngeneralization to include more fields. Consider the mixing between two restricted Schur poly-\nnomials, O+R,(+r,s)µ1µ2(Z, Y ) and O+T,(+t,u)ν1ν2(Z, Y ). The capital letter O for the restricted\nSchur polynomial instead of the χ stresses the fact we are considering normalized operators\n〈O+R,(+r,s)µ1µ2(Z, Y )†O+T,(+t,u)ν1ν2(Z, Y )〉 = δ+R,+T δ+r,+tδsuδµ1ν1δµ2ν2 (3.1)\nThese operators are the image under the bijection of OR,(r,s)µ1µ2(Z, Y ) and OT,(t,u)ν1ν2(Z, Y ).\nThe operators O+R,(+r,s)µ1µ2(Z, Y ) provide a basis for H(i)CFT. The starting point of our\nanalysis is the one loop dilatation operator in this basis[39]\nDO+R,(+r,s)µ1µ2(Z, Y ) =\n∑\nT,(t,u)ν1ν2\nN+R,(+r,s)µ1µ2;+T,(+t,u)ν1ν2O+T,(+t,u)ν1ν2(Z, Y ) (3.2)\nwhere\nN+R,(+r,s)µ1µ2;+T,(+t,u)ν1ν2 = −\ng2YM\n8pi2\n∑\n+R′\nc+R,+R′d+Tnm\nd+R′d+tdu(n+m)\n√\nf+Thooks+Thooks+rhookss\nf+Rhooks+Rhooks+thooksu\nTr\n([\n(1,m+ 1), P+R,(+r,s)µ1µ2\n]\nI+R′+T ′\n[\n(1,m+ 1), P+T,(+t,u)ν2ν1\n]\nI+T ′+R′\n)\n(3.3)\nIn the above expression Young diagram +R′ is obtained by dropping one box from +R and\nc+R,+R′ is the factor of the box that is dropped. Also, dr is the dimension of symmetric group\nirreducible representation r. Use n to denote the total number of Z fields in O+R,(+r,s)µ1µ2\nand nB to denote the number of Z fields in the background. Also, nZ denotes the number\nof Z fields in OR,(r,s)µ1µ2 and m denotes the number of Y fields. We have n = nB + nZ . The\nabove result (3.2),(3.3) was derived using the convention that the Y fields occupy slots 1 to\nm exactly as shown in (2.7). In the standard tableau labeling of the states in +R, the Y ’s\nwould be associated to the boxes labeled 1 to m. This result is the exact one loop result - we\nhave not made use of any of the simplifications that come from taking N →∞. Notice that\nthe N dependence of the matrix elements appears in c+R,+R′ , f+R or f+T . This immediately\nimplies that we will again have a dependence on Neff and not on N .\nTo proceed further, begin by discussing the intertwining map P+R,(+r,s)µ1µ2 . Our goal is to\ngive a careful argument concluding that P+R,(+r,s)µ1µ2 is background independent. This map\nacts within a direct sum of the carrier space of +T and the carrier space of +R. It gives zero\non +T and projects the row and column labels of the +R subspace to an (r, s) irreducible\nrepresentation of Sn×Sm. Our convention is that the first boxes removed are associated to Y .\nThis projection operator simply has to assemble these boxes into an irreducible representation\ns of Sm. The remaining boxes are already in +r. Thus, the projection operator is\nP+R,(+r,s) =\n1\nm!\n∑\nσ∈Sm\nχs(σ)Γ+R(σ) (3.4)\n21\nIn writing the above projection operator it is understood that we are acting in the subspace\nof +R in which states are labeled by standard tableau such that labels 1,...,m only fill boxes\nthat belong to +R and not to +r. This is the subspace in which the remaining boxes are\nalready in +r. To get the intertwining map, restrict the above row and column labels.\nThe key point is that the projection operator acts only on boxes associated to the Y fields.\nRestricting indices to get the intertwining map will not change this so that the intertwining\nmap P+R,(+r,s)αβ only has a nontrivial action on the Y boxes, that is, on the boxes that\nare removed from +R to get +r. With the discussion of Section 2.1 in mind, its clear that\nP+R,(+r,s)αβ is background independent.\nTo evaluate the matrix elements of the dilatation operator, we need to perform the\nfollowing trace\nTr\n([\n(1,m+ 1), P+R,(+r,s)µ1µ2\n]\nI+R′+T ′\n[\n(1,m+ 1), P+T,(+t,u)ν2ν1\n]\nI+T ′+R′\n)\n(3.5)\nThe intertwining maps I+R′+T ′ and I+T ′+R′ map from the subspace +R\n′ obtained by dropping\na single box from +R, to the subspace +T ′ obtained by dropping a single box from +T .\nAs a result, these maps act only on the box in the standard tableau labeled 1 which is\nassociated to a Y and hence these maps are background independent. The results of Section\n2.1 imply that the above trace is background independent. Lets pursue this further in our\ncurrent example. The intertwining maps P+R,(+r,s)µ1µ2 and P+T,(+t,u)ν2ν1 act only on the\nboxes labeled 1 to m - all Y boxes, and the permutation (1,m + 1) acts only on boxes\nlabeled 1 or m + 1. One is a Y box, one is a Z box and both belong to the excitation.\nConsequently, in the above trace the very vast majority of boxes - those with labels > m+ 1\nand there are O(N2) of them - are simply spectators and can be traced over. Recall that\nwe are focusing on operators that belong to a given emergent gauge theory. The non-trivial\nstructure of the matrix elements is determined by the Young diagrams R, r and s and it will\nagree with the non-trivial structure of the planar matrix elements - this is the background\nindependence. The only difference between the planar result for the trace and what we\nconsider above, is that the sum over the inert boxes produces a factor d+r′i where +r\n′\ni is\nobtained by dropping a box from row i of r in +r while in the planar case we get a factor\nof dr′i . If we now consider mixing with operators outside of the emergent gauge theory, in\nprinciple we could drop a box from +r at any location - even a corner that is distinct from\nwhere our excitation is located. These matrix elements arise when there is mixing with states\nthat don’t belong to the integrable subsector. We will consider these corrections in detail\nin the next section. Our conclusion is that these matrix elements vanish at large N . Using\nthis result, we can restrict to mixing between operators that belong to the planar limit of\nthe emergent gauge theory. Consequently, the bijection of section 2.3 relates these operators\nto two operators, OR,(r,s)µ1µ2(Z, Y ) and OT,(t,u)ν1ν2(Z, Y ) defined in the planar CFT. We\nwill now derive a relationship between the matrix elements for mixing O+R,(+r,s)µ1µ2(Z, Y )\nand O+T,(+t,u)ν1ν2(Z, Y ) and those for mixing OR,(r,s)µ1µ2(Z, Y ) and OT,(t,u)ν1ν2(Z, Y ). This\nextends the free field theory relationship between correlators obtained in Section 2.3, to one\n22\nloop. The argument is9\n−g\n2\nYM\n8pi2\n∑\n+R′\nc+R,+R′d+Tnm\nd+R′d+tdu(n+m)\n√\nf+Thooks+Thooks+rhookss\nf+Rhooks+Rhooks+thooksu\nTr\n([\n(1,m+ 1), P+R,(+r,s)µ1µ2\n]\nI+R′+T ′\n[\n(1,m+ 1), P+T,(+t,u)ν2ν1\n]\nI+T ′+R′\n)\n= −g\n2\nYM\n8pi2\n∑\n+R′\n∑\ni\nc+R,+R′m\ndu\n√\nhooks+rhooks+t\nhooks+r′i\nhooks+R′√\nhooks+Thooks+R\n√\nf+Thookss\nf+Rhooksu\nTr+i\n([\n(1,m+ 1), P+R,(+r,s)µ1µ2\n]\nI+R′+T ′\n[\n(1,m+ 1), P+T,(+t,u)ν2ν1\n]\nI+T ′+R′\n)\n= −g\n2\nYM\n8pi2\n∑\n+R′\n∑\ni\nc+R,+R′m\ndu\n√\nhooksrhookst\nhooksr′i\nhooksR′√\nhooksThooksR\n√\nf+Thookss\nf+Rhooksu\nTri\n([\n(1,m+ 1), P+R,(+r,s)µ1µ2\n]\nI+R′+T ′\n[\n(1,m+ 1), P+T,(+t,u)ν2ν1\n]\nI+T ′+R′\n)\n= −g\n2\nYM\n8pi2\n∑\n+R′\n∑\ni\nc+R,+R′m\ndu\n√\nhooksrhookst\nhooksr′i\nhooksR′√\nhooksThooksR\n√\nf+Thookss\nf+Rhooksu\nTri\n([\n(1,m+ 1), PR,(r,s)µ1µ2\n]\nIR′T ′\n[\n(1,m+ 1), PT,(t,u)ν2ν1\n]\nIT ′R′\n)\n= −g\n2\nYM\n8pi2\n∑\nR′\nc+R,+R′dTnZm\ndR′dtdu(nZ +m)\n√\nf+ThooksThooksrhookss\nf+RhooksRhooksthooksu\nTr\n([\n(1,m+ 1), PR,(r,s)µ1µ2\n]\nIR′T ′\n[\n(1,m+ 1), PT,(t,u)ν2ν1\n]\nIT ′R′\n)\n(3.6)\nIn moving to the third line above we have used the formula (2.10) proved in Appendix A.\nThis is the only step in the above computation that is not exact, but relies on the large N\nlimit. Notice that the only difference between the last line above and the matrix elements\nof the dilatation operator in the planar limit is that N is replaced with Neff . This is then\na simple proof that at large N , the matrix elements of the one loop dilatation operator\nwith respect to states of the emergent gauge theory are given by replacing N → Neff in the\nmatrix elements of the planar dilatation operator, taken with respect to the preimages of\nthese states.\nHow does this generalize to higher loops? The two loop dilatation operator has been\nconsidered in [48] and from that analysis it is clear what the general results are. The\nstructure of the matrix elements are very similar to the form shown in (3.3). One again\nlands up computing a trace. The same intertwining maps P+R,(+r,s)µ1µ2 and P+T,(+t,u)ν1ν2\nappear in the trace. The maps IR′T ′ , IT ′R′ are replaced at L loops by maps which map\nfrom a representation R(L) obtained by dropping L boxes from R to a representation T (L)\nobtained by dropping L boxes from T . There are also again permutations that act on the\nboxes associated to the excitation. Finally, the trace is multiplied by the square root of the\n9Recall that dr = n!/hooksr for any irrep r of Sn. In what follows Tri indicates that we have traced over\nri and Tr+i indicates that we have traced over +ri.\n23\nfactors of the boxes dropped from R and T . Arguing as we did above, its clear that the trace\nis background independent and the product of factors implies that the simple rule N → Neff\nagain applies. These observations imply that our one loop conclusion goes through when\nhigher loop corrections are included.\nTo summarize, we have found integrable subsectors in the large N but non-planar limit\nthat we are considering. Each integrable subsector is an emergent gauge theory, with its\nown gauge group U(Neff). To complete this discussion, in the next section we will consider\nthe mixing between the integrable and non-integrable subsectors.\n3.2 Mixing with Delocalized Operators\nThe operators that belong to the planar limit of a given emergent gauge theory are localized\nat a given corner and define an integrable subsector of the theory. There are operators that\nare not localized at one corner - they straddle two or more corners. If these delocalized\noperators mix with the localized operators they will almost certainly ruin integrability of\nthe emergent gauge theory. In this section we consider the mixing between localized and\ndelocalized operators. Our main result is that\n〈φ|D|ψ〉 = 0 |φ〉 ∈ HCFT;Local |ψ〉 ∈ HCFT;Delocalized (3.7)\nat large N .\nWe make extensive of two basic observations. First, in computing the matrix element\n(3.3), it is clear that the reason why two different states can have a non-zero matrix element,\nis because the permutation group element (1,m+ 1) acts to change the identity of the state.\nIt is thus important to have a good understanding of the action of this permutation on a\nstandard tableau. Since we are computing a trace which has the same value in any equivalent\nrepresentation, we can carry this computation out in any convenient representation. In what\nfollows, we will use Young’s orthogonal representation. This representation is specified by\ngiving the action of adjacent swaps which are two cycles of the form (i, i + 1). Given the\nmatrices representing the complete set of adjacent swaps, it is easy to generate the rest of the\ngroup. Let |ψ〉 denote a valid standard tableau and let |ψ〉i↔i+1 denote the state obtained\nfrom |ψ〉 by swapping i and i+ 1. The content of the box labeled i, denoted c(i) is given by\nb− a if the box is in row a and column b. Our convention for the standard tableau labeling\nis spelled out in the following example\n5 4 3 2 1 (3.8)\nThe rule specifying the matrix representing the adjacent swap is\n(i, i+ 1)|ψ〉 = 1\nc(i)− c(i+ 1) |ψ〉+\n√\n1− 1\n(c(i)− c(i+ 1))2 |ψ〉i↔i+1 (3.9)\n24\nIf boxes i and i+ 1 are located at different corners, the first term above is of order N−1 and\ncan be neglected in the large N limit while the coefficient of the second term is 1, to the\nsame accuracy.\nThe second observation is a relationship between the loop order and the number of boxes\nthat can differ in the Young diagram labels of the operators that are mixing. To add loop\neffects, we consider Feynman diagrams with a certain number of vertices included in the\ndiagram. Contracting two fields in a restricted Schur polynomial with a vertex has the effect\nof setting the indices of two different fields equal. This Kronecker delta function restricts\nthe sum over permutations in (2.7) from Sn+m to Sn+m−1. Two operators which begin as\ndistinct representations of Sn+m may well produce the same representation of Sn+m−1. For\nthis to happen, their Young diagram labels must differ in the placement of at most one box.\nThis is manifest in the matrix element (3.3), because the maps IT ′R′ which appear are only\nnon-zero if T ′ (obtained by dropping one box from T ) has the same shape as R′ (obtained by\ndropping one box from R). At L loops we have added L vertices which lands up restricting\nthe sum in (2.7) from Sn+m to Sn+m−L. In this case operators that differ by at most L boxes\nwill mix.\nAs a warm up example, consider the mixing of localized operators that belong to different\ncorners\n〈φ|D|ψ〉 = 0 |φ〉 ∈ H(i)CFT |ψ〉 ∈ H(j)CFT (3.10)\nwith j 6= i. This represents a mixing between states of two different planar emergent gauge\ntheories, i.e. two distinct integrable subsectors. For concreteness imagine that these two\noperators are the images of R(r, s)αβ and T (t, u)γδ under the bijection described in section\n2.3. These two operators disagree in the placement of J ∼ O(√N) boxes, since the excitation\nwhich has J boxes is located at corner i for state |φ〉 and at corner j for state |ψ〉. Thus,\nthese two operators will start to mix at the J loop order. Further, for a non-zero intertwining\nmap IR(J),T (J) we need to drop the boxes that disagree between the two operators\n10. This\nimplies that, after expressing permutations that appear in the dilatation operator in terms\nof adjacent swaps, only the first term on the right hand side of (3.9) contributes. We need\nto swap all of the distant and local boxes which leads to a suppression of O(N−1), for every\nbox in the excitation. Consequently this mixing is completely suppressed at large N and\n(3.10) holds.\nWe are now ready to tackle (3.7). Consider a localized excitation, located at corner i. We\nstudy the mixing of this localized excitation with a delocalized excitation, that has k boxes\nat corner j 6= i and is otherwise located at corner i. These two operators disagree in the\nplacement of at least k boxes and so the first time they can possibly mix is at k loops. To\nget a non-zero answer, for the interwining map, we need to drop the boxes that don’t agree\nand this means that we must keep terms in which distant boxes remain distant. This again\n10We use R(J) to denote a Young diagram obtained by dropping J boxes from R and similarly for T (J).\n25\namounts to retaining the first term on the right hand side of (3.9) and hence a suppression\nof O(N−1), for every distant box. Consequently this mixing is suppressed as ∼ N−k at large\nN . This demonstrates that (3.7) holds at large N .\nWe will end this section with a simple example illustrating the above argument. The\noperators which mix are labeled by the Young diagrams shown in (3.11). They have a total\nof 2 Y fields and many Z fields.\nA =\n∗\n∗ Y\n∗\nY\nB =\n∗ Y\n∗ Y\n∗\n(3.11)\nA and B are the Young diagrams for the excitations in the background. They both have\nO(N2) boxes. The boxes labeled with a Y correspond to Y fields and they may be labeled\n1. The boxes with a ∗ are Z fields and may be labeled with m + 1 = 3. For a non-zero\nanswer, the states in A which contribute have the bottom Y labeled with a 1. Only in this\ncase can we match the shape of B, after one box - the upper Y box - is dropped. Using\nDirac notation, the structure of the terms contributing to (3.5) are∑\ni,j\n〈A′, i|P+R,(+r,s)µ1µ2(1,m+ 1)|A′, j〉〈B′, j|P+T,(+t,u)ν1ν2(1,m+ 1)|B′, i〉 (3.12)\nIt is clear that the only way that 〈A′, i|P+R,(+r,s)µ1µ2(1,m+ 1)|A′, j〉 can be non-zero is if we\nkeep the first term in (3.9) when the permutation acts. Since the only boxes labeled with\nm+ 1 (the starred boxes) are distant from the bottom Y box in A, this is suppressed as 1\nN\n.\n4 Strong Coupling CFT\nIn this section we want to explore the string theory interpretation of our results, adding to\nthe discussion of the introduction. The excitations we have considered in the CFT are all\ndual to excitations of the D3-brane giant gravitons that condensed to produce the geometry.\nThese are all open string excitations and we have demonstrated that they lead to emergent\ngauge theories. In this section we will motivate why adding boxes to the Young diagrams\ngive excitations that are localized to the brane, that is, why they are open strings. There are\nalso closed string excitations in the dual string theory. We will give an example of a closed\nstring excitation. For relevant earlier literature see [49, 50, 51, 52].\nWhy does adding extra boxes to a Young diagram as we have done above, lead to open\nstrings excitations? We can also phrase this question as: Why does adding extra boxes to a\n26\nYoung diagram lead to excitations localized on the branes? Recall that there is an intimate\nconnection between the entanglement of the underlying degrees of freedom and the geometry\nof spacetime. This is manifested in the Ryu-Takayanagi formula for entanglement entropy\nin terms of the area of a minimal surface[53]. Further, Van Raamsdonk has conjectured that\nthe amount of entanglement between two regions is related to the distance between them:\nthe more the entanglement the less the distance between the two regions[54]. For a recent\nrelevant discussion see [28]. To apply this to our set up, recall that the Young diagram is\nan instruction for how an operator composed of many fields is to be constructed. Each box\ncorresponds to a distinct field and the indices of fields in the same row are to be symmetrized,\nwhile the indices of fields in the same column are to be antisymmetrized. This will in the end\nproduce a highly entangled state, with fields corresponding to boxes that are nearby on the\nYoung diagram being more entangled than boxes that are more distant. The Young diagram\nbecomes a convenient way to visualize the entanglement so that boxes that are nearby on the\nYoung diagram, are nearby in spacetime. To make these comments more precise we would\nneed a better understanding of entanglement for multi part quantum systems.\nIf this interpretation is correct, then to produce a closed string excitation (which is not\nlocalized on the brane), we should construct an operator whose indices are not symmetrized\nor antisymmetrized with indices of the fields making up the background. An example of such\nan operator is given by O{k} = Tr (Y k1Xk2Y k3 · · · ). Since this is a closed string state, we\nexpect that the mixing of this operator with the background will correspond to closed string\nabsorption by a brane. Intuition from a single brane suggests that this is highly suppressed\nbecause gs ∼ O(N−1) at large N . However, we are dealing with O(N) branes so that we\ncan’t neglect mixing of O{k} with the background. If this mixing were suppressed, we would\nbe dealing with an SU(2) sector of the planar Yang-Mills theory which is integrable. We\nwill explore this issue at strong coupling using string theory.\nThe state dual to O{k} should be a closed string moving in an LLM geometry. The general\nLLM geometry is described by the metric[9] (i, j = 1, 2)\nds2 = −y(eG + e−G)(dt+ Vidxi)2 + 1\ny(eG + e−G)\n(dy2 + dxidxi) + yeGdΩ3 + ye\n−GdΩ˜3 (4.1)\nwhere\nz = z˜ +\n1\n2\n=\n1\n2\ntanh(G) y∂yVi = \u000fij∂j z˜ y(∂iVj − ∂jVi) = \u000fij∂yz˜ (4.2)\nThe metric is determined by the function z which depends on the three coordinates y, x1\nand x2 and is obtained by solving Laplace’s equation\n∂i∂iz + y∂y\n∂yz\ny\n= 0. (4.3)\nIn what follows we often trade x1, x2 for a radius and an angle, r and ϕ. Our focus is on\ngeometries given by concentric black annuli on the bubbling plane. For a set of rings with a\n27\ntotal of E edges with radii Rl l = 1, 2, ..., E the geometry is determined by the functions[9]\nz˜ =\nE∑\nl=1\n(−1)E−l\n2\n(\nr2 + y2 −R2l√\n(r2 + y2 +R2l )\n2 − 4r2R2l\n− 1\n)\n, (4.4)\nVϕ(x\n1, x2, y) =\nE∑\nl=1\n(−1)E−l+1\n2\n(\nr2 + y2 +R2l√\n(r2 + y2 +R2l )\n2 − 4r2R2l\n− 1\n)\n. (4.5)\nWe need the y = 0 limit of the metric, which is given by\nds2 = −1\nb\n(dt+ Vϕdϕ)\n2 + b(dy2 + y2dΩ˜23) + b(dr\n2 + r2dϕ2) +\n1\nb\n(\nsin2 ψdβ2 + dψ2 + cos2 ψdα2\n)\n(4.6)\nwith\nb(r) =\n√√√√ E∑\nl=1\n(−1)E−l R\n2\nl\n(R2l − r2)2\n(4.7)\nWe look for classical string solutions to the equations of motion following from the Nambu-\nGoto action\nSNG =\n√\nλ\n2pi\n∫\ndτLNG =\n√\nλ\n2pi\n∫\ndσ\n∫\ndτ\n√\n(X˙ ·X ′)2 − X˙2X ′2 (4.8)\nThe ansatz\nt = τ ψ = ψ(τ, σ) α = α(τ, σ) y = 0 r = 0 (4.9)\nwith θ˜, ϕ˜, ψ˜, ϕ, β constant leads to a solution. After inserting this into the equations of\nmotion, the resulting equations describe a string moving on\nds2 =\n1\nb(0)\n(−dt2 + dψ2 + cos2 ψdα2) (4.10)\nThis is string theory on R× S2 which is integrable. The single magnon solution is given by\nt = τ , α = τ + σ and\ncosψ =\ncosψ0\ncosσ\n− ψ0 ≤ σ ≤ ψ0 (4.11)\nThe energy of this solution is given by\nE =\n√\nλ\n2pi\n∫ ψ0\n−ψ0\ndσ\n∂LNG\n∂t˙\n=\n√\nλ\npi\n1\nb(0)\ncosψ0 (4.12)\n28\nThis is the energy of a single magnon with N → Neff where\nNeff =\nN1(M +N1)(M +N1 +N2)\nM2 +N21 +M(2N1 +N2)\n(4.13)\nand N1 + N2 = N . In writing this formula we specialized to a geometry with a central\nblack disk of area N1, a white ring of area M and a black ring of area N2. If we take\nN2 = O(1) = M at large N we find Neff = N1 = N(1 + O(N\n−1)). This is exactly as\nexpected since this boundary condition corresponds to exciting so few giant gravitons that\nbackreaction can be neglected and we must recover the AdS5×S5 result as we have done. The\nabove result shows that the closed string is exploring the geometry at r = 0 in the bubbling\nplane. This region simply can’t be explored by adding boxes to any corner of the background\nYoung diagram. The result depends in a nontrivial way on the details of the background,\nas we might expect for an excitation that is not localized on a specific set of branes. This\nsupports our argument that this is a closed string excitation. For this closed string excitation\nonce again the only change as compared to the planar limit is the replacement N → Neff .\nThis is probably only a property of the strong coupling limit. Indeed, in the free theory the\ncorrelator of the closed string excitation and the background factorizes\n〈χ)B(Z)χB(Z)†O{k}O†{k}〉 = 〈χ)B(Z)χB(Z)†〉〈O{k}O†{k}〉 (4.14)\nwhich is not consistent with a simple N → Neff replacement.\n5 Summary and Outlook\nIn this article we have considered excitations of LLM geometries. The excitations are con-\nstructed by adding boxes (representing the excitation) to a Young diagram with O(N2) boxes\n(representing the LLM geometry). Adding a box to a row of a Young diagram implies that\nthe indices of the added operator will be symmetrized or antisymmetrized with the indices of\nadjacent boxes, so that the fields associated to the boxes added are highly entangled with the\nfields associated to adjacent boxes. Two objects that are entangled are nearby in spacetime,\nso that we produce excitations that are localized to the brane worldvolume. These excita-\ntions are open strings and hence give rise to an emergent gauge theory. We have constructed\na bijection between operators in the Hilbert space of planar N = 4 super Yang-Mills and\noperators in the planar Hilbert space of the emergent gauge theory. Free field correlators of\noperators that are in bijection are related in a very simple way. This immediately implies\nthat since three point functions of single trace operators are suppressed in the planar limit of\nthe original free CFT, they are also suppressed in the planar limit of the free emergent gauge\ntheory. Since OPE coefficients are read from three point functions, the OPE coefficients\nvanish in the planar limit of both free N = 4 super Yang-Mills and the free emergent gauge\ntheory. We have conjectured that this continues to be the case when interactions are turned\non. By considering the weak coupling CFT we have also given arguments concluding that\n29\nthe anomalous dimensions match the dimensions of an N = 4 super Yang-Mills with gauge\ngroup U(Neff), where Neff is read from the factor of the boxes associated to the excitations.\nSince any CFT is determined by its OPE coefficients and spectrum of anomalous dimensions,\nthis strongly suggests that the planar limit of the emergent gauge theories are planar N = 4\nsuper Yang-Mills theories.\nWe have been careful to stress that the planar limit of the emergent gauge theory agrees\nwith planar N = 4 super Yang-Mills. The stronger statement, that the emergent gauge\ntheory is N = 4 super Yang-Mills is not true: there are important differences between the\ntwo theories that are only apparent when going beyond the planar limit. The emergent\ngauge theory has gauge group U(Neff). If this gauge theory really is N=4 super Yang-\nMills theory we expect a stringy exclusion principle cutting off the angular momentum of\nthe giant graviton at momentum Neff . In actual fact, the maximum angular momentum\nfor a giant graviton is in general below this and it is set by the shape of the background\nYoung diagram. Similarly, dual giant gravitons can usually have an arbitrarily large angular\nmomentum. In the emergent gauge theory, the dual giant must fit inside the corner at which\nthe emergent gauge theory is located, so there are no dual giant excitations with arbitrarily\nlarge momentum. These discrepancies arise because the giant graviton excitations detect the\nstructure of the bubbling plane. They can probe the difference between a black disk in a sea\nof white or just one ring among many or something else. So even in the large N limit, the\nemergent gauge theory and N = 4 super Yang-Mills theory are different. They do however\nshare the same planar limit.\nAn interesting technical result that has been achieved is the description of states when\nsome of the rows of the Young diagram describing the giant graviton branes are equal in\nlength. Previous studies [56, 42, 43] have considered the displaced corners approximation in\nwhich the length between any two rows (for a system of dual giant gravitons) scales as N in\nthe large N limit. In this situation, the action of the symmetric group simplifies and explicit\nformulas for the restricted characters can be developed[56, 42]. Here we have the case that\nmany row lengths are of comparable size. Progress is achieved by uncovering the relationship\nbetween the relevant restricted Schur computations and those of the planar limit. We also\nallowed some Z fields in the excitation which includes the case that the row lengths are\nsimilar but not identical.\nThere are a number of interesting directions that could be pursued. First, perhaps\nthere are new holographic dualities: each emergent gauge theory might itself be dual to an\nAdS5×S5 geometry, in a suitable limit. There maybe a limit of the geometry that zooms in\non the edge of the black regions in the bubbling plane to give an AdS5×S5 geometry with\nNeff units of five form flux. Restricting to excitations that belong to H(i)CFT is how we restrict\nto the integrable subsector in the CFT. The limit that isolates an AdS5×S5 geometry would\nrestrics us to the integrable subsector in the string theory. This is currently under active\ninvestigation [55].\nThere are a number of questions we could pursue to further explore the dynamics of the\n30\nemergent gauge theory. As we have mentioned, the worldvolume of the giant gravitons is a\ndistinct space from the space on which the original CFT is defined. How is locality in this\nemergent space of the emergent gauge theory realized? This may provide a simple testing\nground for ideas addressing the emergence of spacetime. We have argued that there are\nintegrable subsectors in large N but non-planar limits of N = 4 super Yang-Mills. Can we\nfind further evidence for the integrability of these subsectors? Even more important, how can\nthis integrability be exploited to explore the physics of emergent gauge theories in interesting\nand non-trivial ways? For other promising indications of integrability beyond the planar limit\nsee [57, 58, 58]. Besides the local observables we have considered, the emergent gauge theory\nwill have Wilson loops. It maybe interesting to explore these non-local observables.\nThe emergent gauge theory that we have explored in this article is only a decoupled sector\nat large N . What are the first corrections which couple the emergent gauge theory to the rest\nof the theory? Presumably these corrections correspond to closed string absorption/emission\nby branes. This is something concrete that can be evaluated.\nFinally, decoupling limits for gauge theory living on the intersections of giant gravitons\nhave been considered in [60, 61, 62, 63, 64]. It would be interesting to see if the methods\ndeveloped in this article can be used to clarify the emergent gauge theories arising in these\ncases, which may shed light on the microstates of near-extremal black holes in AdS5×S5.\nAcknowledgements\nThis work is supported by the South African Research Chairs Initiative of the Department\nof Science and Technology and National Research Foundation as well as funds received from\nthe National Institute for Theoretical Physics (NITheP). J.-H.Huang is supported by the\nNatural Science Foundation of Guangdong Province (No.2016A030313444). We are grateful\nfor useful discussions to Shinji Hirano, Minkyoo Kim, Sanjaye Ramgoolam and Jaco Van\nZyl.\nA Ratios of hooks\nThe hook HR(i, j) of the box in row i and column j of R is the set of boxes (a, b) with a = i\nand b ≥ j or a ≥ i and b = j. The hook-length hR(i, j) is the number of boxes in the hook\nHR(i, j). To visualize the hook associated to a given box, imagine an elbow with its joint in\nthe box and one arm exiting R by moving to the right through the row of the box and one\narm exiting by moving down through the column. The hook length is the number of boxes\nthe elbow passes through. We use hooksR to denote the product of hook lengths for each\nbox in R. In this Appendix we want to derive a formula for the ratio\nhooks+R\nhooks+r\n(A.1)\n31\n+r is obtained from +R by removing a total of |R|−|r| boxes. All of these boxes are located\nclose to corner i of Young diagram B.\nStart by removing a single box from +R to obtain the Young diagram +R′. Consider\nthe ratio\nhooks+R\nhooks+R′\n(A.2)\nImagine that the box that was removed comes from row a and column b of R. Denote the\nlength of row a by la and the length of column b by lb. The numbers a, b, la, lb are all much\nsmaller than\n√\nN . Most hook lengths in the numerator will equal the hook lengths in the\ndenominator. The only hook lengths that don’t match are lengths for hooks that enter or\nexit through the box that is removed. After many cancellations we find\nhooks+R\nhooks+R′\n=\ni∏\nj=1\nL(j, i)− b+ lB\nL(j, i)−Nj − b+ lb\nC∏\nl=i+1\nL(i+ 1, l)− a+ la\nL(c+ 1, l)−Ml − a+ la\nhooksR\nhooksR′\n(A.3)\nwhere\nL(c, d) =\nd∑\nk=c\n(Nk +Mk) (A.4)\nand Nk and Mk are defined in Figure 2. These numbers specify the background Young\ndiagram. In the large N limit this result can be simplified to\nhooks+R\nhooks+R′\n= ηB\nhooksR\nhooksR′\n(\n1 +O\n(\n1\nN\n))\n(A.5)\nwhere\nηB =\ni∏\nj=1\nL(j, i)\nL(j, i)−Nj\nC∏\nl=i+1\nL(i+ 1, l)\nL(c+ 1, l)−Ml (A.6)\nNotice that ηB is independent of a and b, at large N . If we have removed two boxes from\n+R to obtain +R′′, we can use the above result to compute\nhooks+R\nhooks+R′′\n=\nhooks+R\nhooks+R′\nhooks+R′\nhooks+R′′\n=\n(\nηB\nhooksR\nhooksR′\n)(\nηB\nhooksR′\nhooksR′′\n)(\n1 +O\n(\n1\nN\n))\n= (ηB)\n2 hooksR\nhooksR′′\n(\n1 +O\n(\n1\nN\n))\n(A.7)\nAt large N , every time we remove a box from +R it results in a factor of ηB in the ratio of\nhooks lengths. We have to remove |R| − |r| boxes from R to obtain r, so that we find\nhooks+R\nhooks+r\n=\nhooksR\nhooksr\n(ηB)\n|R|−|r|\n(\n1 +O\n(\n1\nN\n))\n(A.8)\nwhich is the identity (2.10) used in section 2.3.\n32\nB Ratios of factors\nRecall that fR denotes the product of the factors of each box in R and that a box in row i\nand column j has factor N− i+j. In this Appendix we will compute the ratio of the product\nof factors for a Young diagram +R and Young diagram B. +R is obtained by attaching a\nsmaller Young diagram R to the Young diagram B. The argument is rather simple and most\neasily illustrated with an explicit example.\nFigure 4: An example showing Young diagrams R, B and +R. The Young diagram +R is\nobtained by stacking R next to B.\nConsider the Young diagrams shown in Figure 4 above. It is simple to see that\nfR = N(N − 1)(N + 1) (B.1)\nand\nf+R\nfB\n= (N + δ)(N + δ − 1)(N + δ + 1) (B.2)\nwhere δ = 1 = 5 − 4. In general, if the top most and left most box of R is added to row a\nand column b of B, we will have δ = b− a.\nC Delocalized Trace Structures are Preserved\nIn this Appendix we compute correlation functions of delocalized operators. Our results\nsuggest that, in general, there is no simple relationship between correlation functions of\ndelocalized operators and correlation functions of operators in the planar limit, even in the\nfree CFT. The results of our computation do however provide evidence that mixing between\ndifferent trace structures is suppressed, even for the delocalized operators.\nTo keep the discussion simple consider operators constructed from a single field Z.\nThis will already probe aspects of the operator mixing issue. As a simple warm up ex-\nample, consider delocalized excitations constructed by starting with operators of the form\n33\nTr(σ1Z\n⊗n1)Tr(σ2Z⊗n2). To construct a delocalized excitation, begin by writing\nTr(σ1Z\n⊗n1) =\n∑\nR1`n1\nχR1(σ1)χR1(Z)\nTr(σ2Z\n⊗n2) =\n∑\nR2`n2\nχR2(σ2)χR2(Z) (C.1)\nThe delocalized excitation is given by\nO(B)(σ1, σ2) =\n∑\nR1,R2\nχR1(σ1)χR2(σ2)χ+(R1,R2)(Z) (C.2)\nThe Young diagram +(R1, R2) is obtained by adding R1 at the ith inward pointing corner\nand adding R2 at the jth inward pointing corner. This corresponds to localizing Tr(σ1Z\n⊗n1)\nat the ith corner and localizing Tr(σ2Z\n⊗n2) at the jth corner. It is now rather simple to\nevaluate the correlator\n〈O(B)(σ1, σ2)(x1)O(B)(τ1, τ2)†(x2)〉B\n=\n∑\nR1`n1,R2`n2\nχR1(σ1)χR2(σ2)χR1(τ1)χR2(τ2)\nf+(R1,R2)\nfB|x1 − x2|2n1+2n2\n=\n∑\nR1`n1\nχR1(σ1)χR1(τ1)\nfR1(Neff,1)\n|x1 − x2|2n1\n∑\nR2`n2\nχR2(σ2)χR2(τ2)\nfR2(Neff,2)\n|x1 − x2|2n2\n= 〈Tr(σ1Z⊗n1)(x1)Tr(τ1Z⊗n1)(x2)〉N→Neff,1〈Tr(σ2Z⊗n2)(x1)Tr(τ2Z⊗n2)(x2)〉N→Neff,2\n(C.3)\nIn the above expression, fR(M) means the product of the factors of Young diagram R with\nN replaced by M . Further Neff,1 is the factor of the first box added to corner i and Neff,2 is\nthe factor of the first box added to corner j. The above result implies that the delocalized\ncorrelator has factorized into two factors, one for each corner on which the operator is located.\nEach factor is a correlation function. The value of N is replaced by an effective value of N for\neach corner. It is worth emphasizing that the expressions on the last line of (C.3) are exact.\nThis result implies that trace mixing is even more constrained for the delocalized excitation\nthan it is in the planar limit. Indeed, in the planar limit we will have mixing if the trace\nstructure of Tr(σ1Z\n⊗n1)Tr(σ2Z⊗n2) matches the trace structure of Tr(τ1Z⊗n1)Tr(τ2Z⊗n2).\nFor the delocalized excitation we will only have mixing if the trace structure of Tr(σ1Z\n⊗n1)\nmatches Tr(τ1Z\n⊗n1) and the trace structure of Tr(σ2Z⊗n2) matches Tr(τ2Z⊗n2).\nThere is a second type of delocalized excitation we could consider: a single trace operator\nthat is itself delocalized. As an example, consider a single trace operator that is distributed\nbetween corners i and j. To write such a loop we introduce the space time independent\nauxiliary field X ab , which has two point function\n〈X ab X cd 〉 = δadδcb (C.4)\n34\nUsing this auxiliary field we can split any single trace operator into two traces, that re-\nassemble to give a single trace when the average over X is performed. For example, we can\nreplace\nTr(Y 5) −→ Tr(Y 2X )Tr(Y 3X ) (C.5)\nPerforming the average over X , we recover our original loop\n〈Tr(Y 2X )Tr(Y 3X )〉 = (Y 2)ba (Y 3)dc〈X ab X cd 〉 = Tr(Y 5) (C.6)\nThe advantage of splitting things in this way, is that we can now follow exactly the same\nlogic that we used for the first example above. We will take this to be the definition of the\ndelocalized single trace operator. For the general operator constructed from Y s, the resulting\nexpression is of the form11\nOA(Y ) =\n∑\nR1,R2,r1,r2\na\n(A)\nR1,R2,r1,r2χR1,(r1, )(Y,X )χR2,(r2, )(Y,X ) (C.7)\nThe single extra box in the labels for the restricted Schur polynomial represents the auxiliary\nX field. We can now, following the example we studied above, attach R1 and R2 to different\ncorners and in this way obtain the delocalized single trace operator. For operators that\ninvolve more than two corners, we would need to introduce more than one auxiliary field.\nConcretely, for the case we consider, we have\nO\n(B)\nA =\n∑\nR1,R2,r1,r2\na\n(A)\nR1,R2,r1,r2 χ+(R1,R2),(+(r11 ,r12), × )(Z, Y,X ) (C.8)\nThe notation × is just to reflect the fact that we have not organized the auxiliary fields\ninto representations of S2. We can now average over X in (C.8) to obtain an operator that\ndoes not depend on the auxiliary fields. This averaging is easily performed using the methods\ndeveloped in [65]. It is straight forward, but tedious and messy, to check that mixing between\ndifferent trace structures of these delocalized excitations is also suppressed.\nLets illustrate the above construction with the simplest possible example: we consider\ntwo delocalized operators. The first, OA, is given by placing Tr(Y ) at corner i and Tr(Y )\nat corner j. The second, OB, is obtained by distributing Tr(Y\n2) between the two corners.\nWhen the background is not present, the relevant correlators are\n〈Tr(Y 2)(x1)Tr(Y †2)(x2)〉 = 2N\n2\n|x1 − x2|4\n〈Tr(Y )2(x1)Tr(Y †)2(x2)〉 = 2N\n2\n|x1 − x2|4\n11Imagine that our operator is constructed using n Zs. The restricted Schur polynomials needed for this\ncomputation involve restricting Sn+1 to Sn. There is no need for multiplicity labels when studying this\nrestriction.\n35\n〈Tr(Y )2(x1)Tr(Y †2)(x2)〉 = 2N|x1 − x2|4 (C.9)\nIt is clear that the last correlator, which mixes different trace structures, is down by a factor\nof N . If we had normalized the two point functions to one, the last correlator above vanishes\nat large N which shows that different trace structures don’t mix. The delocalized operator\nwith Tr(Y ) at corner i and Tr(Y ) at corner j is obtained by adding a single box at corner i\nof B and a single box at corner j. Denote the factor of the box added at corner i by Neff,1\nand the factor of the box added at corner j by Neff,2. It is a simple matter to find\n〈O(B)A (x1)O(B)A (x2)†〉 = ηB η˜B\nNeff,1Neff,2\n|x1 − x2|4 (C.10)\nin complete agreement with (C.3). The coefficient ηB η˜B is an order 1 number that arises\nfrom computing the ratios of hooks. After averaging over the X fields we find that O(B)B (x2)\nis a sum of two terms. One is clearly leading and has coefficient\n√\n1− 1\n(Neff,1−Neff,2)2 . The\nsubleading term have coefficient 1\nNeff,1−Neff,2 . The leading term involves a twisted character\nin the notation of [29], while the subleading term is a normal restricted character. We find\nthat both terms contribute to the correlator\n〈O(B)B (x1)O(B)B (x2)†〉 = ηB η˜B\nNeff,1Neff,2\n|x1 − x2|4 (C.11)\nwhile only the subleading term contributes to the mixed correlator\n〈O(B)A (x1)O(B)B (x2)†〉 = ηB η˜B\nNeff,1Neff,2\n(Neff,1 −Neff,2)|x1 − x2|4 (C.12)\nSince Neff,1−Neff,2 is of order N , this clearly demonstrates the suppression. Although there\nis little doubt that mixing between different trace structures is suppressed for the general\ndelocalized excitations, at this point in time we do not have a simple general argument for\nthis conclusion.\nD Localized and Delocalized Mixing at One Loop\nIn this Appendix we study a simple example of mixing between a localized and a delocalzied\noperator at one loop. Since we don’t want a selection rule to prevent the operators from\nmixing, we need to consider operators that differ in the placement of at most one box. To\nmake the computation as transparent as possible choose particularly simple operators. Our\ngoal is to show that this mixing is of order N−1. This is a simple illustration that the mixing\nbetween a delocalized operator and a local operator, is suppressed at large N .\nThe local operator that we consider is O\n+ ,(+ , )\n(Z, Y ). The representation\nproduces (+ , ) once upon restricting from S4 to S2 × S2 so that there is no need\n36\nfor multiplicity labels. Lets assume that this excitation is localized at corner i. For the\ndelocalized operator, we assume that we have ( , ( , )) at corner i and , (·, ) at corner\nj. For this example we can evaluate the matrix element (3.3) exactly. The result is\nN\n+ ,(+ , );+\n(\ni\n, j\n)\n,(+ i,( i, j))\n=\nλeff,i\n4pi\n√\nNeff,i\nNeff,j\n1\nNeff,j −Neff,i\n(\n1 +O\n(\n1\nN\n))\n(D.1)\nwhere Neff,i is the factor of the first box added at corner i, Neff,j is the factor of the first\nbox added at corner j and λeff,i ≡ g2YMNeff,i. The fact that this mixing is of order N−1 is in\nperfect accord with the arguments of section 3.2.\nE Correcting the planar limit\nThe emergent gauge theory has ’t Hooft coupling g2YMNeff with g\n2\nYM the coupling of the\noriginal CFT. It is natural to ask if (non-planar) higher genus corrections are suppressed by\npowers of N or powers of Neff . This Appendix gives a discussion of the issue.\nThe article [66] studied excitation of the annulus LLM background, with boundary con-\ndition given by a single black annulus (of area N) with a central white disk (of area M).\nThe Young diagram describing this geometry has a total of N rows and M columns. A\nsimple and clean argument shows that the 1/2 BPS correlators, with excitations constructed\nusing only Z fields, admit an expansion with N−2eff playing the role of the genus counting\nparameter[66]. In the 1/2 BPS sector, this result generalizes to multi ring geometries and\nagain the genus counting parameter is N−2eff .\nTo go beyond the half BPS sector the result (2.34) can be used. After rescaling the fields\nwhich are not Z fields, by a factor of 1/\n√\nηB, we find a product of two terms\n〈OA(x1)OB(x2)†〉B = FAB(Neff) 1|x1 − x2|2J\n(\n1 +O\n(\n1\nN\n))\n(E.1)\nThe first factor on the RHS above admits an expansion in N−1eff . The second factor does not.\nThus, in general our amplitude can’t be developed as a series in the two small parameters\nλeff and N\n−2\neff .\nReferences\n[1] J. A. Minahan and K. Zarembo, “The Bethe ansatz for N=4 superYang-Mills,” JHEP\n0303, 013 (2003) doi:10.1088/1126-6708/2003/03/013 [hep-th/0212208].\n[2] N. Gromov, V. Kazakov, S. Leurent and D. Volin, “Quantum Spectral Curve for Pla-\nnar N = 4 Super-Yang-Mills Theory,” Phys. Rev. Lett. 112, no. 1, 011602 (2014)\ndoi:10.1103/PhysRevLett.112.011602 [arXiv:1305.1939 [hep-th]].\n37\n[3] N. Beisert et al., “Review of AdS/CFT Integrability: An Overview,” Lett. Math. Phys.\n99, 3 (2012) doi:10.1007/s11005-011-0529-2 [arXiv:1012.3982 [hep-th]].\n[4] J. M. Maldacena, “The Large N limit of superconformal field theories and supergrav-\nity,” Int. J. Theor. Phys. 38, 1113 (1999) [Adv. Theor. Math. Phys. 2, 231 (1998)]\ndoi:10.1023/A:1026654312961, 10.4310/ATMP.1998.v2.n2.a1 [hep-th/9711200].\n[5] S. S. Gubser, I. R. Klebanov and A. M. Polyakov, “Gauge theory correlators from non-\ncritical string theory,” Phys. Lett. B 428, 105 (1998) doi:10.1016/S0370-2693(98)00377-3\n[hep-th/9802109].\n[6] E. Witten, “Anti-de Sitter space and holography,” Adv. Theor. Math. Phys. 2, 253 (1998)\ndoi:10.4310/ATMP.1998.v2.n2.a2 [hep-th/9802150].\n[7] D. Berenstein, D. H. Correa and S. E. Vazquez, “All loop BMN state energies from\nmatrices,” JHEP 0602, 048 (2006) doi:10.1088/1126-6708/2006/02/048 [hep-th/0509015].\n[8] D. M. Hofman and J. M. Maldacena, “Giant Magnons,” J. Phys. A 39, 13095 (2006)\ndoi:10.1088/0305-4470/39/41/S17 [hep-th/0604135].\n[9] H. Lin, O. Lunin and J. M. Maldacena, “Bubbling AdS space and 1/2 BPS geometries,”\nJHEP 0410, 025 (2004) doi:10.1088/1126-6708/2004/10/025 [hep-th/0409174].\n[10] N. Beisert, “The SU(2—2) dynamic S-matrix,” Adv. Theor. Math. Phys. 12, 945 (2008)\ndoi:10.4310/ATMP.2008.v12.n5.a1 [hep-th/0511082].\n[11] V. Balasubramanian, M. Berkooz, A. Naqvi and M. J. Strassler, “Giant gravitons in\nconformal field theory,” JHEP 0204, 034 (2002) doi:10.1088/1126-6708/2002/04/034 [hep-\nth/0107119].\n[12] E. Brezin, C. Itzykson, G. Parisi and J. B. Zuber, “Planar Diagrams,” Commun. Math.\nPhys. 59, 35 (1978). doi:10.1007/BF01614153\n[13] S. Corley, A. Jevicki and S. Ramgoolam, “Exact correlators of giant gravi-\ntons from dual N=4 SYM theory,” Adv. Theor. Math. Phys. 5, 809 (2002)\ndoi:10.4310/ATMP.2001.v5.n4.a6 [hep-th/0111222].\n[14] D. Berenstein, “A Toy model for the AdS / CFT correspondence,” JHEP 0407, 018\n(2004) doi:10.1088/1126-6708/2004/07/018 [hep-th/0403110].\n[15] R. Bhattacharyya, S. Collins and R. de Mello Koch, “Exact Multi-Matrix Correlators,”\nJHEP 0803, 044 (2008) doi:10.1088/1126-6708/2008/03/044 [arXiv:0801.2061 [hep-th]].\n[16] R. Bhattacharyya, R. de Mello Koch and M. Stephanou, “Exact Multi-Restricted Schur\nPolynomial Correlators,” JHEP 0806, 101 (2008) doi:10.1088/1126-6708/2008/06/101\n[arXiv:0805.3025 [hep-th]].\n38\n[17] J. McGreevy, L. Susskind and N. Toumbas, “Invasion of the giant gravitons from\nAnti-de Sitter space,” JHEP 0006, 008 (2000) doi:10.1088/1126-6708/2000/06/008 [hep-\nth/0003075].\n[18] A. Hashimoto, S. Hirano and N. Itzhaki, “Large branes in AdS and their field theory\ndual,” JHEP 0008, 051 (2000) doi:10.1088/1126-6708/2000/08/051 [hep-th/0008016].\n[19] M. T. Grisaru, R. C. Myers and O. Tafjord, “SUSY and goliath,” JHEP 0008, 040\n(2000) doi:10.1088/1126-6708/2000/08/040 [hep-th/0008015].\n[20] R. de Mello Koch, “Geometries from Young Diagrams,” JHEP 0811, 061 (2008)\ndoi:10.1088/1126-6708/2008/11/061 [arXiv:0806.0685 [hep-th]].\n[21] R. de Mello Koch, C. Mathwin and H. J. R. van Zyl, “LLM Magnons,” JHEP 1603,\n110 (2016) doi:10.1007/JHEP03(2016)110 [arXiv:1601.06914 [hep-th]].\n[22] R. de Mello Koch, M. Kim and H. J. R. Zyl, “Integrable Subsectors from Holography,”\nJHEP 1805, 198 (2018) doi:10.1007/JHEP05(2018)198 [arXiv:1802.01367 [hep-th]].\n[23] V. Balasubramanian, M. x. Huang, T. S. Levi and A. Naqvi, “Open strings from\nN=4 superYang-Mills,” JHEP 0208, 037 (2002) doi:10.1088/1126-6708/2002/08/037 [hep-\nth/0204196].\n[24] V. Balasubramanian, D. Berenstein, B. Feng and M. x. Huang, “D-branes in Yang-\nMills theory and emergent gauge symmetry,” JHEP 0503, 006 (2005) doi:10.1088/1126-\n6708/2005/03/006 [hep-th/0411205].\n[25] D. Berenstein and A. Miller, “Code subspaces for LLM geometries,” Class. Quant. Grav.\n35, no. 6, 065003 (2018) doi:10.1088/1361-6382/aaa623 [arXiv:1708.00035 [hep-th]].\n[26] D. Berenstein and A. Miller, “Superposition induced topology changes in quantum\ngravity,” JHEP 1711, 121 (2017) doi:10.1007/JHEP11(2017)121 [arXiv:1702.03011 [hep-\nth]].\n[27] H. Lin and K. Zeng, “Detecting topology change via correlations and entangle-\nment from gauge/gravity correspondence,” J. Math. Phys. 59, no. 3, 032301 (2018)\ndoi:10.1063/1.4986985 [arXiv:1705.10776 [hep-th]].\n[28] J. Simon, “Correlations vs connectivity in R-charge,” arXiv:1805.11279 [hep-th].\n[29] R. de Mello Koch, J. Smolic and M. Smolic, “Giant Gravitons - with Strings Attached\n(I),” JHEP 0706, 074 (2007) doi:10.1088/1126-6708/2007/06/074 [hep-th/0701066].\n[30] R. de Mello Koch, J. Smolic and M. Smolic, “Giant Gravitons - with Strings Attached\n(II),” JHEP 0709, 049 (2007) doi:10.1088/1126-6708/2007/09/049 [hep-th/0701067].\n39\n[31] Y. Kimura and S. Ramgoolam, “Branes, anti-branes and brauer algebras in\ngauge-gravity duality,” JHEP 0711, 078 (2007) doi:10.1088/1126-6708/2007/11/078\n[arXiv:0709.2158 [hep-th]].\n[32] D. Bekker, R. de Mello Koch and M. Stephanou, “Giant Gravitons - with\nStrings Attached. III.,” JHEP 0802, 029 (2008) doi:10.1088/1126-6708/2008/02/029\n[arXiv:0710.5372 [hep-th]].\n[33] T. W. Brown, P. J. Heslop and S. Ramgoolam, “Diagonal multi-matrix correlators and\nBPS operators in N=4 SYM,” JHEP 0802 (2008) 030 doi:10.1088/1126-6708/2008/02/030\n[arXiv:0711.0176 [hep-th]].\n[34] S. Ramgoolam, “Schur-Weyl duality as an instrument of Gauge-String duality,” AIP\nConf. Proc. 1031, 255 (2008) doi:10.1063/1.2972012 [arXiv:0804.2764 [hep-th]].\n[35] T. W. Brown, P. J. Heslop and S. Ramgoolam, “Diagonal free field matrix correla-\ntors, global symmetries and giant gravitons,” JHEP 0904, 089 (2009) doi:10.1088/1126-\n6708/2009/04/089 [arXiv:0806.1911 [hep-th]].\n[36] Y. Kimura and S. Ramgoolam, “Enhanced symmetries of gauge theory and\nresolving the spectrum of local operators,” Phys. Rev. D 78, 126003 (2008)\ndoi:10.1103/PhysRevD.78.126003 [arXiv:0807.3696 [hep-th]].\n[37] J. Pasukonis and S. Ramgoolam, “From counting to construction of BPS states in N=4\nSYM,” JHEP 1102, 078 (2011) doi:10.1007/JHEP02(2011)078 [arXiv:1010.1683 [hep-th]].\n[38] Y. Kimura, “Correlation functions and representation bases in free N=4 Su-\nper Yang-Mills,” Nucl. Phys. B 865, 568 (2012) doi:10.1016/j.nuclphysb.2012.08.010\n[arXiv:1206.4844 [hep-th]].\n[39] V. De Comarmond, R. de Mello Koch and K. Jefferies, “Surprisingly Simple Spectra,”\nJHEP 1102, 006 (2011) doi:10.1007/JHEP02(2011)006 [arXiv:1012.3884 [hep-th]].\n[40] T. W. Brown, “Permutations and the Loop,” JHEP 0806, 008 (2008) doi:10.1088/1126-\n6708/2008/06/008 [arXiv:0801.2094 [hep-th]].\n[41] M. Kim and H. J. R. van Zyl, “Semiclassical SL(2) Strings on LLM backgrounds,”\narXiv:1805.12460 [hep-th].\n[42] R. de Mello Koch, M. Dessein, D. Giataganas and C. Mathwin, “Giant Graviton Oscilla-\ntors,” JHEP 1110, 009 (2011) doi:10.1007/JHEP10(2011)009 [arXiv:1108.2761 [hep-th]].\n[43] R. de Mello Koch and S. Ramgoolam, “A double coset ansatz for integrability in\nAdS/CFT,” JHEP 1206, 083 (2012) doi:10.1007/JHEP06(2012)083 [arXiv:1204.2153\n[hep-th]].\n40\n[44] D. Garner, S. Ramgoolam and C. Wen, “Thresholds of large N factorization in CFT4:\nexploring bulk spacetime in AdS5,” JHEP 1411, 076 (2014) doi:10.1007/JHEP11(2014)076\n[arXiv:1403.5281 [hep-th]].\n[45] R. de Mello Koch, N. H. Tahiridimbisoa and C. Mathwin, “Anomalous Di-\nmensions of Heavy Operators from Magnon Energies,” JHEP 1603, 156 (2016)\ndoi:10.1007/JHEP03(2016)156 [arXiv:1506.05224 [hep-th]].\n[46] R. de Mello Koch, P. Diaz and N. Nokwara, “Restricted Schur Polynomials\nfor Fermions and integrability in the su(2—3) sector,” JHEP 1303, 173 (2013)\ndoi:10.1007/JHEP03(2013)173 [arXiv:1212.5935 [hep-th]].\n[47] R. de Mello Koch, P. Diaz and H. Soltanpanahi, “Non-planar Anomalous Dimensions\nin the sl(2) Sector,” Phys. Lett. B 713, 509 (2012) doi:10.1016/j.physletb.2012.06.057\n[arXiv:1111.6385 [hep-th]].\n[48] R. de Mello Koch, G. Kemp, B. A. E. Mohammed and S. Smith, “Nonplanar integrabil-\nity at two loops,” JHEP 1210, 144 (2012) doi:10.1007/JHEP10(2012)144 [arXiv:1206.0813\n[hep-th]].\n[49] H. Y. Chen, D. H. Correa and G. A. Silva, “Geometry and topology of bubble solutions\nfrom gauge theory,” Phys. Rev. D 76, 026003 (2007) doi:10.1103/PhysRevD.76.026003\n[hep-th/0703068 [HEP-TH]].\n[50] R. de Mello Koch, T. K. Dey, N. Ives and M. Stephanou, “Hints of Integra-\nbility Beyond the Planar Limit: Nontrivial Backgrounds,” JHEP 1001, 014 (2010)\ndoi:10.1007/JHEP01(2010)014 [arXiv:0911.0967 [hep-th]].\n[51] H. Lin, A. Morisse and J. P. Shock, “Strings on Bubbling Geometries,” JHEP 1006,\n055 (2010) doi:10.1007/JHEP06(2010)055 [arXiv:1003.4190 [hep-th]].\n[52] P. Diaz, H. Lin and A. Veliz-Osorio, “Graph duality as an instrument of Gauge-\nString correspondence,” J. Math. Phys. 57, no. 5, 052302 (2016) doi:10.1063/1.4949550\n[arXiv:1505.04837 [hep-th]].\n[53] S. Ryu and T. Takayanagi, “Holographic derivation of entanglement entropy from\nAdS/CFT,” Phys. Rev. Lett. 96, 181602 (2006) doi:10.1103/PhysRevLett.96.181602 [hep-\nth/0603001].\n[54] M. Van Raamsdonk, “Building up spacetime with quantum entanglement,” Gen. Rel.\nGrav. 42, 2323 (2010) [Int. J. Mod. Phys. D 19, 2429 (2010)] doi:10.1007/s10714-010-\n1034-0, 10.1142/S0218271810018529 [arXiv:1005.3035 [hep-th]].\n[55] R. de Mello Koch and M. Kim, in progress.\n41\n[56] W. Carlson, R. de Mello Koch and H. Lin, “Nonplanar Integrability,” JHEP 1103, 105\n(2011) doi:10.1007/JHEP03(2011)105 [arXiv:1101.5404 [hep-th]].\n[57] B. Eden, Y. Jiang, D. le Plat and A. Sfondrini, “Colour-dressed hexagon tessella-\ntions for correlation functions and non-planar corrections,” JHEP 1802, 170 (2018)\ndoi:10.1007/JHEP02(2018)170 [arXiv:1710.10212 [hep-th]].\n[58] T. Bargheer, J. Caetano, T. Fleury, S. Komatsu and P. Vieira, “Handling Handles I:\nNonplanar Integrability,” arXiv:1711.05326 [hep-th].\n[59] B. Eden, Y. Jiang, M. de Leeuw, T. Meier, D. l. Plat and A. Sfondrini, “Positivity of\nhexagon perturbation theory,” arXiv:1806.06051 [hep-th].\n[60] V. Balasubramanian, J. de Boer, V. Jejjala and J. Simon, “Entropy of near-extremal\nblack holes in AdS(5),” JHEP 0805, 067 (2008) doi:10.1088/1126-6708/2008/05/067\n[arXiv:0707.3601 [hep-th]].\n[61] R. Fareghbal, C. N. Gowdigere, A. E. Mosaffa and M. M. Sheikh-Jabbari, “Nearing\nExtremal Intersecting Giants and New Decoupled Sectors in N = 4 SYM,” JHEP 0808,\n070 (2008) doi:10.1088/1126-6708/2008/08/070 [arXiv:0801.4457 [hep-th]].\n[62] T. Harmark, K. R. Kristjansson and M. Orselli, “Matching gauge theory and string\ntheory in a decoupling limit of AdS/CFT,” JHEP 0902, 027 (2009) doi:10.1088/1126-\n6708/2009/02/027 [arXiv:0806.3370 [hep-th]].\n[63] J. de Boer, M. Johnstone, M. M. Sheikh-Jabbari and J. Simon, “Emergent IR\nDual 2d CFTs in Charged AdS5 Black Holes,” Phys. Rev. D 85, 084039 (2012)\ndoi:10.1103/PhysRevD.85.084039 [arXiv:1112.4664 [hep-th]].\n[64] M. Johnstone, M. M. Sheikh-Jabbari, J. Simon and H. Yavartanoo, “Near-Extremal\nVanishing Horizon AdS5 Black Holes and Their CFT Duals,” JHEP 1304, 045 (2013)\ndoi:10.1007/JHEP04(2013)045 [arXiv:1301.3387 [hep-th]].\n[65] R. de Mello Koch, N. Ives and M. Stephanou, “Correlators in Nontrivial Backgrounds,”\nPhys. Rev. D 79, 026004 (2009) doi:10.1103/PhysRevD.79.026004 [arXiv:0810.4041 [hep-\nth]].\n[66] R. de Mello Koch, T. K. Dey, N. Ives and M. Stephanou, “Correlators Of Opera-\ntors with a Large R-charge,” JHEP 0908, 083 (2009) doi:10.1088/1126-6708/2009/08/083\n[arXiv:0905.2273 [hep-th]].\n42\n",
    "Link": "http://arxiv.org/abs/1806.06586"
}