{
    "Title": "Binding of carbon nanotube to BMP receptor 2 enhances cell differentiation and inhibits apoptosis via regulating bHLH transcription factors",
    "Authors": "A Hartmann, A Suzuki, A Suzuki, A Verma, AA Mangi, AL Gartel, BYS Kim, C Li, C Toma, D Liu, D Orlic, D Pantarotto, E Schnapp, G Amabile, G Cossu, GJ Anderson, H Noushmehr, H Zhou, J Goedhart, J Holy, J Wang, K Guo, K Herrick-Davis, K Miyazono, L Lacerda, L Zhang, MH Parker, N Noiseux, NG Sahoo, NL Kennea, O Halevy, P Zhu, PB Yu, Q Mu, Q Mu, S Hirano, S Robinson, T-I Chao, V Andrés, VE Kagan, W Li, Y Jen, Y Wang",
    "Year": "No year available",
    "Abstract": "Biomaterials that can drive stem cells to an appropriate differentiation level and decrease apoptosis of transplanted cells are needed in regenerative medicine. Nanomaterials are promising novel materials for such applications. Here we reported that carboxylated multiwalled carbon nanotube (MWCNT 1) promotes myogenic differentiation of mouse myoblast cells and inhibits cell apoptosis under the differentiation conditions by regulating basic helix-loop-helix transcription factors. MWCNT 1 attenuates bone morphogenetic protein receptor (BMPR) signaling activity by binding to BMPR2 and attenuating the phosphorylation of BMPR1. This molecular understanding allowed us to tune stem cell differentiation to various levels by chemical modifications, demonstrating human control of biological activities of nanoparticles and opening an avenue for potential applications of nanomaterials in regenerative medicine",
    "Keywords": "No keywords available",
    "Publisher": "Nature Publishing Group",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Binding of carbon nanotube to BMP receptor 2\nenhances cell differentiation and inhibits apoptosis\nvia regulating bHLH transcription factors\nY Zhang\n1,2,QM u\n2, H Zhou\n2, K Vrijens\n3, MF Roussel\n3, G Jiang\n4 and B Yan*\n,2,5\nBiomaterials that can drive stem cells to an appropriate differentiation level and decrease apoptosis of transplanted cells are\nneeded in regenerative medicine. Nanomaterials are promising novel materials for such applications. Here we reported that\ncarboxylated multiwalled carbon nanotube (MWCNT 1) promotes myogenic differentiation of mouse myoblast cells and inhibits\ncellapoptosisunderthedifferentiationconditionsbyregulatingbasichelix-loop-helixtranscriptionfactors.MWCNT1attenuates\nbone morphogenetic protein receptor (BMPR) signaling activity by binding to BMPR2 and attenuating the phosphorylation of\nBMPR1. This molecular understanding allowed us to tune stem cell differentiation to various levels by chemical modiﬁcations,\ndemonstrating human control of biological activities of nanoparticles and opening an avenue for potential applications of\nnanomaterials in regenerative medicine.\nCell Death and Disease (2012) 3, e308; doi:10.1038/cddis.2012.48; published online 10 May 2012\nSubject Category: Experimental Medicine\nNanotechnology has evolved rapidly and has an impact on\nnearly every aspect in modern society including medicine. For\nexample, carbon nanotube (CNT) materials have shown\npromising potentials in drug\n1 and gene delivery,\n2 cancer cell\nimaging\n3 and regenerative medicine. CNT has been able to\ndirect the differentiation of mouse embryonal carcinoma stem\ncells\n4andpromoteneuralstemcelldifferentiationfromhuman\nembryonic stem cells.\n5\nAdult stem cells, the undifferentiated cells residing in\nmature organs or tissues, can renew themselves and\ndifferentiate to cells of the specialized tissues or organs.\nBecause of the less controversial aspect of their use than\nembryonic stem cells, the easy accessibility, and their\ncapability to divide in cell cultures, adult stem cells provide\nvaluable cell sources to treat and cure many regenerative\ndiseases. Induction of myogenic differentiation from different\nadult stem cells is promising to cure diseases like muscular\ndystrophies,\n6 cardiac myocyte death\n7 and muscle damage.\nFor example, mesenchymal stem cells identiﬁed from bone\nmarrow have been successfully used for repairing heart\nmuscle in cardiac ischemia.\n7,8 However, this application is\nlimited by the poor viability of the transplanted cells caused by\nthe pathological milieu and loss of survival signals from matrix\nattachments and cell–cell interactions.\n9 In order to increase\nthe survivalofstemcell grafts,sometransgenic strategies(for\ninstance, by engineering stem cells to express AKT, a serine\nthreonine kinase and a powerful survival signal) have been\npursued.\n10 In spite of these endeavors, there is still a need to\ndevelop strategies to enhance differentiation in a controllable\nmanner and improve the viability of transplanted cells. C2C12\nis a mouse myoblast cell line, which is capable of myogenic or\nosteogenic differentiations.\n11 In this work, we investigated the\nmyogenic differentiation of C2C12 under the effects of\ncarboxylated multiwalled CNT (MWCNT 1) and studied the\ninvolved molecular mechanisms. The results demonstrated\nthat MWCNT 1 promoted myogenic differentiation of C2C12\nwithout using any protein or chemical factor. MWCNT 1 also\nimproved cell survival under the differentiation conditions.\nThese effects were originated from the binding of MWCNT 1\nto bone morphogenetic protein receptor 2 (BMPR2), suppres-\nsing the BMP signaling pathway and regulating basic helix-\nloop-helix (bHLH) transcription factors involved in differentia-\ntion and apoptosis. Based on this mechanistic understanding,\nwe successfully modulated myogenicdifferentiation of C2C12\nto various levels by surface-chemistry modiﬁcations on\nMWCNTs.\n1School of Pharmaceutical Sciences, Shandong University, Jinan 250100, China;\n2Department of Chemical Biology and Therapeutics, St. Jude Children’s Research\nHospital, Memphis, TN 38105, USA;\n3Department of Tumor Cell Biology, St. Jude Children’s Research Hospital, Memphis, TN 38105, USA;\n4Research Center for\nEco-Environmental Sciences, Chinese Academy of Sciences, Beijing 100085, China and\n5School of Chemistry and Chemical Engineering, Shandong University,\nJinan 250100, China\n*Correspondingauthor:BYan,SchoolofChemistryandChemicalEngineering,ShandongUniversity,27ShandaNanlu,Jinan250100,China.Tel: þ8653188366232;\nFax: þ86 531 88380029; E-mail: dr.bingyan@gmail.com\nReceived 07.2.12; revised 19.3.12; accepted 02.4.12; Edited by H-U Simon\nKeywords: carbon nanotube; membrane receptor; BMP signaling; cell differentiation; regenerative medicine\nAbbreviations: bHLH, basic helix-loop-helix; BMP, bone morphogenetic protein; BMPR, bone morphogenetic protein receptor; BRE, BMP-responsive element; BSA,\nbovine serum albumin; ChIP, chromatin immunoprecipitation; CNT, carbon nanotube; DAPI, 40,6-diamidino-2-phenylindole; DM, differentiation medium; DMEM,\nDulbecco’s minimum essential medium; FITC, ﬂuorescein isothiocyanate; FRET, ﬂuorescence resonance energy transfer; GAPDH, glyceraldehyde-3-phosphate\ndehydrogenase; GM, growth medium; Id, inhibitor of DNA-binding/differentiation; PLA, proximity ligation assay; MWCNT, multiwalled carbon nanotube; MYH, myosin\nheavy chain; p-BMPR1A, phosphorylated BMPR1A; RT-PCR, reverse transcription PCR; qRT-PCR, quantitative reverse transcription PCR; TEM, transmission electron\nmicroscope; TRITC, tetramethyl rhodamine isothiocyanate; TUNEL, terminal deoxynucleotidyl transferase dUTP nick end labeling\nCitation: Cell Death and Disease (2012) 3, e308; doi:10.1038/cddis.2012.48\n& 2012 Macmillan Publishers Limited All rights reserved 2041-4889/12\nwww.nature.com/cddisResults\nMWCNT 1 promotes myogenic differentiation and inhi-\nbits apoptosis. The physicochemical characterization of\nMWCNT 1 was summarized in Table 1. MWCNT 1 has an\ninner diameter of 5–12nm and an outer diameter and\n30–50nm. On the basis of the functional group loading\n(0.4mmol/g) as determined by the elemental analysis and\nmeasured surface area (500m\n2/g), we estimated that the\naverage density of modiﬁcation is approximately ﬁve func-\ntional groups per 10nm\n2. At pH 7.0, MWCNT 1 carries\nnegative charges. Its solubility in water and plasma is much\nbetter compared with the pristine MWCNT. Inductively\ncoupled plasma mass spectrometry analysis indicated a\nnegligible amount of metal impurities excluding the possibility\nthat they may affect cellular function.\n12\nC2C12 can differentiate into adipocytes, muscle cells or\nosteoblasts under different conditions. It has been reported\nthat C2C12 cells underwent myogenic differentiation after\ntransventricular injection into the arterial circulation of the\nmurine heart.\n13 MWCNT 1 showed little cytotoxicity at\nconcentrations up to 100mg/ml (Supplementary Figure S1).\nTo mimic the differentiation microenviroment of transplanted\ncells, C2C12 cells were incubated in the differentiation\nmedium (DM) to evaluate their myogenic differentiation under\nthe inﬂuence of MWCNT 1. C2C12 cells when treated with\nMWCNT 1 expressed myosin heavy chain (MYH) protein,\nformed myotubes and showed a dose-dependent increase in\nfusion index compared with DM controls (Figures 1a–c).\nThese data demonstrated that MWCNT 1 accelerated\nthe myogenic differentiation under the differentiation\nenvironment.\nDifferentiation conditions (low serum) deprived mitogens of\ncells and caused an increase in apoptotic cells (20–30%).\n14\nMicroscopic observation indicated that the cell death was\nsigniﬁcantly decreased by MWCNT 1 treatment (Figures 1d\nand e). Terminal deoxynucleotidyl transferase dUTP nick end\nlabeling (TUNEL) assay showed that MWCNT 1 treatment\ndecreased the percentage of TUNEL-positive cells from 23 to\nabout 8% in 48h (Supplementary Figure S2 and Figure 1f).\nThe activity of apoptotic effector protein caspase 3\n15\ndropped to nearly control level (1.2-fold compared with that\nin growth medium) (Figure 1g). These data showed that\nMWCNT 1 promotes myogenic differentiation as well as\ninhibits apoptosis of C2C12 under the differentiation conditions.\nThe myogenic differentiation of C2C12 was coordinated by\na family of proteins containing bHLH structures including\nMyoD, myogenin, myf5, mrf4 and E2A proteins such as\nHEB, E12 and E47.\n16 The inhibitor of DNA-binding/\ndifferentiation (Id) proteins are negative regulators of\nmyogenic differentiation.\n17 The Id proteins form a complex\nwith myogenic regulatory factors and prohibit their binding to\nDNA to activate the expression of muscle-speciﬁc genes.\n17\nWe ﬁrst evaluated whether MWCNT 1 promoted myogenic\ndifferentiation by altering functions of these two families of\nproteins or their interactions.\nMWCNT 1 positively regulates functions of bHLH\nproteins. We ﬁrst analyzed the effects of MWCNT 1 on\nmyogenic regulatory factors and Id proteins. Because\nof the functional redundancy of MyoD with mrf4\n18 and\nmyogenin with myf5,\n19 we analyzed the protein levels\nof two myogenic regulatory factors MyoD and myogenin\nand one E2A protein HEB. The expression level of MyoD and\nHEB did not change, whereas the expression of myogenin\nincreased (Figure 2a). In the normal medium, MWCNT 1\ntreatment decreased the expression of all the three Id genes\non both mRNA and protein levels (Supplementary Figure\nS3a and Figure 2b). Under the differentiation conditions,\nMWCNT 1 treatment also downregulated Id1 and Id3 at the\nmRNA level (Supplementary Figure S3b). MyoD is known as\na marker for myogenic commitment and its major function is\nto induce the expression of myogenin and cell-cycle\ninhibitors such as p21.\n16,20 MyoD forms a complex with\nE2A protein and activates the expression of target genes by\nbinding to E-box motifs in the promoter region of these\ngenes.\n16 However, because of their higher afﬁnity to E2A\nproteins, Id proteins compromise the MyoD–E2A complex\nformation and block the gene expression by binding to E2A\nproteins.\n17 The nanotube-induced increase in myogenin\nexpression and decrease in Id proteins expression sug-\ngested that MWCNT 1 might abrogate the formation of HEB–\nId complex, thus favoring the formation of HEB–MyoD\ncomplex. Co-immunoprecipitation with HEB followed by\nprobing the co-precipitated proteins with anti-Id1 and anti-\nMyoD antibodies conﬁrmed that Id1 downregulation actually\npromoted the HEB–MyoD complex formation (Figure 2c). In\norder to further validate that the enhanced myogenin-\nexpression level after MWCNT 1 treatment is indeed caused\nby the elevated HEB–MyoD complex formation, chromatin\nimmunoprecipitation (ChIP) assay with anti-HEB and anti-\nMyoD antibodies was carried out. The results indicated that\nMWCNT 1 treatment recruited more HEB–MyoD complex to\nthe E-box region of the myogenin promoter (Figure 2d). As a\nconsequence of the increased DNA binding by HEB–MyoD\ncomplex, the activity of the myogenin promoter was\nincreased by six-folds (Figure 2e).\nMyogenin triggers the expression of muscle-speciﬁc\ngenes by replacing MyoD and forming a dimer with HEB\nafter the initiation of differentiation (24–48h under the\nTable 1 Characterization of MWCNT-COOH\nChemical structure\nSuspension in plasma\n(after 120h)\nDiameter (nm) 30–50 (outer); 5–12 (inner)\nLength (mm) 0.5–2.0\nZeta potential (mV in H2O)  42.5\nZeta potential (mV in plasma)  9.3\nFunctional group loading (mmol/g) 0.4\nFe, Al, Cr and Mn (%) by ICP-MS 0.3, 0.02, 0.002 and 0.00001\nOther 19 metals (%) by ICP-MS o0.00008\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n2\nCell Death and Diseasedifferentiation conditions).\n20 A signiﬁcant increase in HEB–\nmyogenin complex formation after MWCNT 1 treatment was\nobserved (Figure 2c). A subsequent event is the nuclear\ntranslocation of myogenin to activate the expression of\nmuscle-speciﬁc genes. Immunocytochemistry showed that\nMWCNT 1 accelerated both the expression and nuclear\ntranslocation of myogenin (Figures 2f and g). Together,\nthese data showed that by negative regulation of Id\nproteins, MWCNT 1-enhanced positive regulation of cell-\ndifferentiation machinery.\np21\nCip1/waf-mediated apoptosis inhibition. We were also\ninterested in investigating how MWCNT 1 suppressed cell\napoptosis. Cdk inhibitors, such as p21\nCip1/waf (hereinafter\np21), can protect cells from apoptosis,\n14,21 and p21 expres-\nsion was controlled by the bHLH proteins.\n22,23 We found that\nMWCNT 1 treatment upregulated the p21 promoter activity\n(Supplementary Figure S4a) and recruited more HEB–MyoD\ncomplex to bind to p21 promoter (Supplementary Figure\nS4b). Western blot analysis showed an increased expression\nof p21 from 24 to 72h after MWCNT 1 treatment (Figure 3a).\nOn the basis of these results and the previous reports,\n14,21\nwe hypothesized that the MWCNT 1-induced elevation of\np21 expression accounted for the apoptosis suppression.\np21 inhibits apoptosis only when it is translocated from\nnucleus to mitochondrial membrane.\n24 To verify the mito-\nchondrial localization of p21, we labeled mitochondria with a\nmouse-originated anti-Core II antibody and a Cy3-labeled\nsecondary antibody, and p21 was labeled with rabbit-\noriginated anti-p21 antibody and a ﬂuorescein isothiocyanate\n(FITC)-conjugated secondary antibody. Our results showed\nthat p21 proteins were mainly localized in mitochondria in\nMWCNT 1-treated cells. In the untreated group, p21 proteins\nresided in the nucleus (Figure 3b). At the mitochondrial\nmembranes, p21 forms a complex with procaspase 3 and\ninhibits its activation.\n25,26 The enhanced p21–procaspase 3\nFigure1 MWCNT1promotesC2C12differentiationandinhibitsapoptosis.(a)Time-dependentMYHproteinexpressionassayedbywesternblotwithanti-MYHantibody.\n(b)MyotubeformationinC2C12cellscultured inDMor MWCNT 1(25mg/ml)forvarioustimepoints. Immunocytochemistrywas performedwith anti-MYHantibodyandFITC-\nconjugated secondary antibody (scale bar: 200mm). (c) Quantitative analysis of time-dependent cell differentiation under MWCNT 1 concentrations of 25 and 100mg/ml\nassayed by nuclear fusion index (*Po0.05). (d and e) Phase-contrast photomicroscopy revealed cell apoptosis after 48h in DM and MWCNT 1 concentration of 25mg/ml.\n(f) Quantitative analysis of BrdU-positive nuclei. The percentage of BrdU-positive nuclei in 0h was also shown. (g) Quantitative analysis of caspase 3 activity. Caspase 3\nactivity in GM group was normalized to 1.0 (*Po0.05). GM, growth medium\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n3\nCell Death and Diseasecomplex formation was observed in a co-immunoprecipita-\ntion assay (Figure 3c). MWCNT 1 also inhibited caspase 3\nactivity (Figure 2f). Therefore, our ﬁndings suggested that\nupregulation of the expression of p21 proteins was at least\none mechanism to protect cells from apoptosis under the\ndifferentiation conditions.\nThe above data demonstrated that MWCNT 1’s down-\nregulation of Id protein levels has a critical role in\npromoting myogenic differentiation and inhibiting apoptosis\nof C2C12. The Id proteins are the targets of the BMP\nsignaling pathway.\n27 We have reported that CNTs inhibit\nthe BMP signaling pathway\n28 and this was conﬁrmed by\nFigure 2 MWCNT 1 positively regulates functions of MyoD and myogenin by inhibiting expression of Id proteins. (a) Effects of MWCNT 1 on the expression of MyoD,\nmyogeninandHEBanalyzedbywesternblots.(b)MWCNT1decreasedtheexpressionofIdproteins.(c)MWCNT1causedadecreaseinHEB–Idcomplexformationandan\nincrease in HEB–MyoD and HEB–myogenin. Protein complex formations were analyzed by co-immunoprecipitation with anti-HEB antibody followed by probing the co-\nprecipitated proteins with different antibodies after MWCNT 1 treatment. (d) MWCNT 1 recruiting HEB–MyoD complexes to E-box motifs in the promoter of myogenin gene\nassayed by chromatin immuoprecipitation (ChIP) with anti-HEB and anti-MyoD antibodies. Total DNA before immunoprecipitation was used as input controls and b-actin was\nused as a control for speciﬁcity (Supplementary Information for details). (e) Myogenin promoter activity enhanced by MWCNT 1. C2C12 was transfected with constructs\ncontaining ﬁreﬂy luciferase gene driven by myogenin promoter and the luminescence intensity was measured after treatment for 48h. The luminescence intensity in DM was\nnormalized to 1.0. (f) Myogenin expression and distribution in C2C12 cultured in DM or MWCNT 1 for various times. Myogenin-negative cells were indicated by arrows with\ndotted line and cells with nuclear translocation of myogenin were shown with arrow heads. Fusion of myogenin-positive nuclei was indicated by arrows with solid line.\nImmumnocytochemistry was performed with anti-myogenin antibody and Cy3-conjugated secondary antibody. (scale bar: 50mm). (g) Quantitative analysis of nuclei\nexpressing myogenin at different time points (*Po0.05)\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n4\nCell Death and Diseasean independent group.\n29 Here we found that MWCNT 1\nalso inhibited Id protein expression by suppressing the\nBMP signaling pathway. In order to gain further under-\nstanding of interplays between MWCNT 1 and the BMP\nsignaling pathway, we investigated the further details in\nthis context.\nMWCNT 1 perturbs the phosphorylation of BMPR1. BMP\nsignaling is suppressed when the initial membrane-receptor\nactivation or any of the following signal transduction steps is\npartially blocked.\n30 In order to reveal how MWCNT 1 blocked\nBMP signaling, we examined the effects of MWCNT 1 on\nindividual signaling steps.\n31 We ﬁrst analyzed the phosphor-\nylation of Smad1/5/8. Western blot indicated that while the\nlevel of Smad1/5/8 was unchanged, MWCNT 1 treatment\ndecreased their phosphorylation level (Figure 4a), suggest-\ning that Smad1/5/8 phosphorylation or an upstream step\nwas affected. In cells, Smad1/5/8 was phosphorylated by\nactivated BMPR1. In order to clarify whether MWCNT 1\naffected any step downstream of BMPR1 phosphorylation, a\ntransgenic cell line C33A-2D2 containing ﬁreﬂy luciferase\nreporter driven by Id1 promoter was transiently transfected\nwith constitutively active forms of the type 1 BMP receptor\nALK2 and ALK3 (BMPR1A) to generate C33A-2D2-ALK 2\nand C33A-2D2-ALK 3 cells. These constructs mimic the\nphosphorylated BMPR1 and are able to constitutively\nphosphorylate Smad1/5/8 and transduce intracellular\nsignals.\n30 Incubation of both the transfected cell lines with\nMWCNT 1 at various concentrations for different times\nshowed no dose-dependent inhibition on Id1 promoter\nactivity, whereas the speciﬁc Smad1/5/8 inhibitor dorsomor-\nphin did (Figures 4c–f). These results suggested that MWCNT\n1 did not interfere with any step downstream of BMPR1.\nPhosphorylation of BMPR1 by BMPR2 after ligand binding\nis the ﬁrst step to trigger the intracellular BMP signaling\ncascade.\n31 In order to investigate whether MWCNT 1\ninterferes with the phosphorylation process of BMPR1,\nthe phosphorylated BMPR1A in whole-cell extract was\ndetermined after co-immunoprecipitation with its antibody.\nThe data showed that MWCNT 1 strongly suppressed\nBMP4-induced phosphorylation of BMPR1A (Figure 4b),\nsuggesting that MWCNT 1 inhibited BMPR1 phosphorylation\nby BMPR2.\nMWCNT 1 binds to BMPR2 and suppresses BMP\nsignaling process. The suppression of BMPR1 phosphor-\nylation by MWCNT 1 suggested that its target might be\nmembrane-bound BMP receptors. Under the transmission\nelectron microscope (TEM), MWCNT 1 bound to cell surface\nor was endocytosed into cells with continued membrane\ninteractions (Figures 5a and b). We ﬁrst investigated the\nspatial proximity of MWCNT 1 with BMPRs. To do this, we\nconjugated mouse IgG to MWCNT 1. By an in situ proximity\nligation assay (PLA)\n32 using rabbit antibodies to BMPR1A\nFigure 3 Induced p21 protects cells from apoptosis. (a) Time-dependent p21 expression analyzed by western blot. The protein expression level was quantiﬁed by the\nbanddensityusingImageJmethodandtheratio betweenp21 andGAPDHbandswas plottedafter normalizing thatin 0-h groupas 1.0.(b)MWCNT 1-inducedmitochondrial\ntranslocationofp21aftertreatmentfor48h.p21proteinsonlylocatedinthenucleiinDMgroup,whereastranslocatedtomitochondriaafterMWCNT1treatment.Mitochondria\nandp21weredetectedsimultaneouslybymouse-originatedanti-CoreIIandrabbit-originatedanti-p21antibodies.Cy3-andFITC-conjugatedsecondaryantibodieswereused.\nScale bar, 5mm. (c) Complex formation between p21 and procaspase 3. Cell extracts after MWCNT 1 treatment for 24h were co-immunoprecipitated with anti-p21 antibody\nfollowed by probing with anti-p21 and anti-procaspase 3 antibodies\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n5\nCell Death and Diseaseand BMPR2, we detected a close proximity between\nMWCNT 1 and BMPR2 (10.6 PLA signals per nuclear,\ncompared with 20.5 PLA signals per nuclear in positive\ncontrol of BMPR1A/BMPR2 and 1.8 PLA signals per nuclear\nin negative control of bovine serum albumin (BSA)-conju-\ngated MWCNT 1 (Supplementary Figures S5a and b)) other\nthan with BMPR1A (4.0 PLA signals per nuclear) (Figures 5c\nand d). This was likely due to a direct binding between\nMWCNT 1 and BMPR2. In order to substantiate MWCNT 1/\nBMPR2 binding, we also determined ﬂuorescence resonance\nenergy transfer (FRET) between ﬂuorescent-labeled\nMWCNT 1 and BMPR2. MWCNT 1 was labeled with FITC-\nconjugated BSA (FITC-BSA) and BMPR2 was labeled with\ntetramethyl rhodamine isothiocyanate (TRITC)-conjugated\nsecondary antibody. FRET acceptor bleaching method\n33\nmeasures the donor ‘de-quenching’ in the presence of\nacceptor by comparing donor ﬂuorescence intensity before\nand after destroying the acceptor by photobleaching. If FRET\nis initially present, a resultant increase in donor ﬂuorescence\nwill occur on photobleaching of the acceptor. We found that\nphotobleaching TRITC resulted in an increase in the FITC\nintensity with an efﬁciency of 15B20% (Figures 5i–n). This\nincreased efﬁciency is comparable to that reported in\ninteraction between two ﬂuorescent proteins;\n34 hence this\nresult conﬁrmed the binding between MWCNT 1 and\nBMPR2. This binding event abrogated the BMPR1A–\nBMPR2 heterodimer formation as shown also by PLA\nusing antibodies to BMPR1A and BMPR2 after BMP4\nFigure 4 MWCNT 1 inhibits BMP signaling by blocking phosphorylation of BMPR1A. (a) Inhibition on BMP signaling by MWCNT 1 shown by decreasing phosphorylation\nof Smad1/5/8. (b) MWCNT 1 decreased phosphorylation level of BMPR1A. Whole-cell extract (200mg) from C2C12 cells treated with MWCNT 1 and/or BMP4 (25ng/ml) for\n6h was co-immunoprecipitated with anti-BMPR1A antibody followed by probing with anti-phosphorylated-Serine (p-Ser) and anti-BMPR1A antibodies. The level of BMPR1A\nin whole-cell lysate was also probed. (c–f) MWCNT 1 did not affect Id1 promoter activity induced by constitutively active BMP receptors. Amino-acid mutations in wild-type\nBMP1receptorsALK2andALK3/BMPR1Aproducedligand-independentactivationofBMPsignalinginC33A-2D2-ALK2andC33A-2D2-ALK3cells,whichalsocontainﬁreﬂy\nluciferase genes driven by Id1 promoter. The Id1 activity in empty vector-transfected cells was normalized as 1.0. Dorsomorphin (25mM), a speciﬁc inhibitor of the Smad-\ndependent BMP signaling pathway was used as positive control\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n6\nCell Death and Diseasetreatment (Figures 5f–h). The interruption of the formation\nof BMPR1A–BMPR2 heterodimer markedly suppressed the\nBMP4-induced phosphorylation of BMPR1A as analyzed\nby immunoprecipitation (Figure 4b). We also found that\nMWCNT 1 in culture system neither adsorbed BMP4\nligand (Figure 5e) nor affected their binding to BMPRs\n(Supplementary Figures S5c–f). These data demon-\nstrated that MWCNT 1 affected the BMP signaling\npathway by binding to BMPR2 and compromising its\nsignaling function.\nOur ﬁnding can be summarized into a working model\n(Figure 6). By binding to BMPR2 and inhibiting the phosphor-\nylation of BMPR1, MWCNT 1 downregulates the phosphor-\nylation of Smad1/5/8 and reduces the expression of Id\nproteins. The decrease in Id proteins expression enhances\nthe formation of HEB–MyoD complex, which in turn promotes\nthe expression of myogenin and p21. Myogenin forms\ncomplex with HEB to activate the differentiation-speciﬁc\ngenes (e.g., MYH) and leads to myogenesis. p21 proteins\ntranslocate to mitochondria to bind and inhibit the activation of\nprocaspase 3, thereby suppressing apoptosis.\nFine tuning of cell differentiation by surface modiﬁca-\ntions on MWCNT 1. Biological perturbations by nanoparti-\ncles can be attributed to their size, shape, structure and\nsurface properties.\n35 When the size, shape and structure of\nnanoparticles are kept the same, their surface chemistry will\ndictate the surface properties such as hydrophobicity,\nstereochemistry and charges. The altered surface properties\nof CNTs determine their interactions with proteins and other\nbiological molecules.\n36 We hypothesized that the interactions\nof CNTs with BMPRs might be modulated by their surface\nchemistry. We therefore examined a diverse array of surface-\nmodiﬁed MWCNTs, which contains 84 members (MWCNT\n1–84)\n37 for their effects on the activation of BMPRs as\nindicated by Id1 promoter activity in C33A-2D2 cells.\nMWCNTs with diverse surface-chemistry modiﬁcations gen-\nerated various Id1 promoter activations (Supplementary\nFigure S6 and Figure 7b). To explore whether we could tune\ncell differentiation by modulating BMP signaling activation,\nwe further investigated MWCNTs 6, 7, 11, 12, 20 and 43\n(Figure 7a) for their effects on cell signaling and differentia-\ntion. First, we found that they enter cells in a similar manner\nFigure 5 MWCNT 1 blocks phosphorylation of BMPR1A by binding to BMPR2. (a and b) TEM images show MWCNT 1s (arrows) bound to cell membranes or in\nendosomes. C2C12 cells were incubated with MWCNT 1 (25mg/ml) for 2h before ﬁxation. Scale bar, 100nm. (c–h) MWCNT 1 has a close proximity with BMPR2 and\ninterferes with BMPR1A–BMPR2 complex formation assayed by in situ PLA. In (c-e) MWCNT 1 was conjugated with mouse IgG, and protein pairs between IgG with rabbit\nBMPR2(c),BMPR1A(d) andBMP4(e)antibodiesweredetermined.PLAsignalswereshown inred, andnucleiwerestainedblueby DAPI.(f–h) BMPR1A–BMPR2complex\nformation was assayed by in situ PLA after addition of BMP4 (f), BMP4 with MWCNT 1 (g) and BMP4 with noggin (h). C2C12 cells were treated with MWCNT 1 (25mg/ml) or\nnoggin(200ng/ml) for 2h followedbyBMP4(25ng/ml)treatment for 1h before ﬁxation.Scalebars,50mm. (i–n) MWCNT1 (labeled byFITC)closely associateswith BMPR2\n(labeled by TRITC) as detected by FRET. A region in the red rectangle was photobleached at 543nm (TRITC channel) for 50 exposures and images were taken in FITC\n(488nm) and TRITC (543nm) channels before and after bleaching. Scale bars, 50mm\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n7\nCell Death and Diseaseas MWCNT 1 as shown by TEM (Supplementary Figure\nS7a). Similar to MWCNT 1, they did not inhibit caALK-\ninduced Id1 activation in C33A-2D2-ALK2 or C33A-2D2-\nALK3 cells (Supplementary Figure S7b). These MWCNTs\nalso showed various inhibitions on BMPR1A phosphorylation\n(Figure 7e). Furthermore, they downregulated phosphoryla-\ntion of Smad1/5/8 and the expression of Id proteins in the\nsame order (Figure 7e). These data strongly showed that\nsurface-chemistry modiﬁcations conferred different modula-\ntions on BMPR and caused different levels of suppression on\nthe BMP signaling pathway. Therefore, this approach is\npromising for ﬁne tuning of cell differentiation through\nmodulating BMP signaling to a desired level. To test this\npossibility, we analyzed the differentiation proﬁle of C2C12\ncells into myotubes. Our data showed that the differen-\ntiation of C2C12 was regulated to various levels as\nshown by the inversely correlated myogenin promoter\nactivity (Figure 7c) and different expression levels of both\nmyogenin and the differentiation-marker MYH proteins\n(Figure 7e). Expression of the apoptosis-inhibitor p21 was\nalso regulated (Figure 7e). As a quantitative measure for\nterminal differentiation, myotube formation and the nuclear\nfusion index were also modulated to various controllable\nlevels (Figures 7f and d).\nDiscussion\nRapid and controllable induction of differentiation and\ndecreasing cell apoptosis are both desired attributes\nof medicinal agents in regenerative medicine. These\ntwo aims have been sought out by various strategies\n10,38\nwithout much success.\n39 Nanomaterials hold enormous\npromises in this aspect because they exhibit suitable\nphysical characteristics and they are able to mimic surface\nproperties of natural tissues.\n40 Therefore, the molecular\nunderstanding of the effects of nanoparticle on stem cell\ndifferentiation is critical to fully develop their application\npotential.\nIn a previous study,\n41 incubation of CNT with cell lysate\nenhanced protein binding and MS analysis revealed that CNT\nbound to murine scavenger receptor macrophage receptor\nwith collagenous structure in addition to other proteins.\nFigure6 AschematicdiagramshowingthemolecularinteractionsinvolvedinMWCNT1-enhancedcelldifferentiationandinhibitionofapoptosis.MWCNT1bindstoBMP\nreceptor 2 (BMPR2) and inhibits the heterodimer formation between BMPR1 and BMPR2, blocking the phosphorylation of BMPR1. This consequently attenuates the\nexpression of Id proteins, which are members of the negative HLH family of proteins. Lower Id protein levels reduced their ability to inhibit complex formation between\nubiquitous E-protein (HEB) and tissue-speciﬁc E-proteins (MyoD and myogenin). These positive HLH protein complexes activate the expression of differentiation-speciﬁc\ngenes (myogenin and MYH) and p21 by binding to E-box motif in their promoter region. p21 translocated from nuclear to mitochondria, where it binds to procaspase 3 and\ninhibits cell apoptosis\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n8\nCell Death and DiseaseOur study provides the evidence that nanoparticles bound to\ncell-membrane receptors in live cells. Discoveries from this\nwork in combination with previous reports demonstrate how\nCNTs alter cell functions such as differentiation and apoptosis\n(Figure 6). The binding of CNTs to BMPR2 weaken the\ninteractions between BMPR2 and BMPR1 and inhibited\nBMPR1 activation. Such weakening is propagated through\nthe BMP signaling pathway as shown by a downregulation of\nSmad phosphorylation, Smad nucleus translocation and Id\nprotein expression. Reduced Id expression in cell nucleus\nchanges the regulation of HLH transcription factors and\nupregulated cell-differentiation genes and p21, which sup-\npresses cell apoptosis. The combined effect is the enhanced\ncell myogenic differentiation.\nThe driving forces for CNTs/protein binding are likely\nelectrostatic, hydrophobic and p–p stacking interactions.\n42\nSuch interactions are probably not speciﬁc. In fact, CNTs\nperturbed cell genome by up- and downregulation of more\nthan 400 genes and the BMP pathway is only one of the top\nten most-affected signaling pathways.\n28 However, one\nsigniﬁcant ﬁnding from this work is the identiﬁcation that\nperturbations onthe BMPsignaling pathway are resulted from\ninteractions of CNT with BMPR2. On the basis of this ﬁnding,\nchemical modiﬁcations on CNTs to alternate its interactions\nwith BMPR2 become possible. By carrying out chemical\nmodiﬁcations on CNT surface, we successfully modulated\nmyogenic differentiation of C2C12 to various levels by\ncontrolling CNT–BMPR2 interactions. Chemical basis for\nFigure 7 Surface-modiﬁed MWCNTs’ ﬁne-tune cell differentiation. (a) Chemical structures of CNTs with differently modiﬁed surfaces. (b and c) Variable activation of\nMWCNTs(25mg/ml)onId1promoter(b)andmyogeninpromoter(c)aftertreatmentfor24and48h,respectively.(d)EffectsofMWCNTson terminalmyogenicdifferentiation\nof C2C12 evaluated by nuclear fusion index. MWCNTs with more intense inhibition of Id1 promoter showed higher capability to promote nuclear fusion. (e) Western blot of\nproteins involved in BMP signaling, cell differentiation and anti-apoptosis. For phosphorylated BMPR1A, whole-cell extracts (200mg) from C2C12 cells treated with MWCNTs\n(25mg/ml) and BMP4 (25ng/ml) were immunoprecipitated with BMPR1A antibody followed by immunoblotting with an antibody to p-Ser. The level of BMPR1A in C2C12\nwhole-cell extracts was also probed. For phosphorylated Smad1/5/8, Smad1 and Id1 protein assays, BMP4 (25ng/ml) was added to DM simultaneously with MWCNTs\nto stimulate BMP signaling. The treatment time is also indicated. (f) Representative images showing differential myotube formation after treatment with MWCNTs (25mg/ml)\nfor 72h. Immunocytochemistry was performed using MYH antibody and FITC-conjugated secondary antibody (scale bar: 100mm)\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n9\nCell Death and Diseasesuch regulation was explored by analyzing the relationships\nbetween various structural parameters of CNTs’ surface\nmolecules and the Id1 promoter activities. Preliminary studies\nshowed that molecular surface areas and polar surface areas\nexhibited some correlations with the effects of CNTs on BMP\nsignaling. However, the correlation was not very tight,\nsuggestingthatmorecomplexfactorssuchasothermolecular\nand CNT interactions were also involved in the regulation of\ncell differentiation.\nAlthoughthebiologicalimpactsofnanomaterials aremostly\nunknown, and some effects are found to be harmful, this\nwork points out that beneﬁcial effects can be initiated by\nCNTs. This investigation characterized in molecular terms\nhow CNTs promote cell myogenic differentiation by binding to\nBMPR2 and suppress BMP signaling. Furthermore, we\nsuccessfully modulated effects of CNTs on differentiation,\nmodifying surface chemistry on CNTs. By this result, we\ndemonstrate the human control of the biological impacts of\nnanomaterials and open an avenue for the applications of\nnanomaterials in regenerative medicine.\nMaterials and Methods\nMaterials, cell lines, reagents and antibodies. MWCNT 1 and the\ncombinatorial array of surface-modiﬁed MWCNTs were prepared as reported.\n37\nStock solutions of MWCNTs (1mg/ml) in ddH2O was prepared and sterilized at\n1211C for 30min and sonicated before use.\nC2C12 cells o20 generations were grown in growth medium (Dulbecco’s\nminimum essential medium (DMEM) medium supplemented with 20% fetal bovine\nserum) and were placed in DM (DMEM medium supplemented with 2% horse\nserum) when culture reached 80% of conﬂuence (t¼0h). C33A-2D2 was\nconstructed using human cervical carcinoma cell line C33A. Single-cell clones from\nC33A that responded to human recombinant BMP4 were selected after they were\ntransfectedwithamultimerizedBMP-responsiveelement(BRE)fromthemouseId1\npromoter linked to the ﬁreﬂy luciferase gene (pGL4-BRE-Luc). The EC50 value for\nBMP4-induced speciﬁc BRE-mediated activity was 1ng/ml. The control C33A line\nexpressing the pGL4-luciferase vector only (C33A-empty vector) was also\nconstructed as a control for all the assays.\nConstitutiveactiveALK2andALK3constructsweregiftsfromPaulBYu,Harvard\nMedical School. Myogenin-luciferase and p21-luciferase constructs were gifts from\nMichael A Rudnicki, Ottawa Health Research Institute, and Carme Gallego,\nUniversitat de Lleida.\nLipofectamine 2000 Transfection Reagent, Opti-MEM I Reduced-Serum\nMedium, and RIPA Buffer (10 , no. 9806) were purchased, respectively, from\nInvitrogen (Grand Island, NY, USA) and Cell Signaling (Danvers, MA, USA). The\nluciferase assay system (E1500) and the ChIP assay kit (no. 17–295) were\npurchased, respectively, from Promega (Madison, WI, USA) and Millipore (Billerica,\nMA, USA). Caspase3/CPP32 Colorimetric Assay Kit (k106–100) was purchased\nfrom BioVision (Milpitas, CA, USA).\nGoat anti-mouse and goat anti-rabbit secondary antibodies (no. 926–32220 and\n926–32221) used for western blot analysis are products of LI-COR Biosciences\n(Lincoln, NE, USA). All the ﬂuorescent-labeled secondary antibodies used for\nimmunocytochemistry were commercial, obtained from Jackson ImmunoResearch\n(West Grove, PA, USA). Primary antibodies used in in situ PLA including rabbit\nantibodies to BMP4 (N-term AP1715a), BMPR1A (C-term, AP2004b) and BMPR2\n(N-term, AP2006a) were purchased from Abgent (San Diego, CA, USA). Mouse\nantibody to BMPR2 (CP 10368) and BMP4 (PA003869-CB12470) were purchased,\nrespectively, from Cell Application Inc. (San Diego, CA, USA), BD Pharmingen\n(San Jose, CA, USA), and Syd Labs (Boston, MA, USA). MyoD (554130)\nand myogenin (556358) were commercial, obtained from BD Pharmingen.\nHEB (A-20), MYH (H-300), p21 (H-164), BMPR-IA (H-60), caspase 3 (3CSP03)\nand phosphorylated-serine (16B4) antibodies, Protein A/G PLUS-Agarose\nImmunoprecipitation Reagent (sc-2003), normal mouse IgG (sc-2025) and normal\nrabbit IgG (sc-2027) are products of Santa Cruz Biotechnology, Inc. (Santa Cruz,\nCA, USA). Antibodies to phospho-Smad1 (Ser463/465)/Smad5 (Ser463/465)/\nSmad8 (Ser426/428) (no. 9511) was from Cell Signaling. Smad1/5/8/9 antibody\n(ab72504) was from Abcam (Cambridge, MA, USA). Glyceraldehyde-3-phosphate\ndehydrogenase (GAPDH; G9545) antibody was purchased from Sigma-Aldrich\n(St. Louis, MO, USA). The Id1 (BCH-1/37-2-50), Id2 (BCH-3/9-2-8-50) and Id3\n(BCH-4/6-1-50) antibodieswerefrom BioCheck(Foster City, CA, USA). ComplexIII\nsubunit Core 2 monoclonal antibody (MS304-SP) was commercial, obtained from\nMitoSciences (Eugene, OR, USA).\nImmunocytochemistry. For immunocytochemistry assays, cells were\nseeded on 22 22-mm\n2 cover slips (Corning Life Sciences, Tewksbury, MA,\nUSA) and treated with poly-D-lysine. After ﬁxing with cold 4% paraformaldehyde\nin PBS for 15min and membrane permeabilization with 0.25% Triton X-100 for\n10min, cells were blocked with 1% BSA in PBS containing 0.5% Tween-20 for\n30min followed by 1h incubation with primary antibodies and 1h incubation\nwith FITC- or cy3-conjugated secondary antibodies at room temperature. Cells\nwere rinsed and mounted on cover slips with mounting medium containing\n40,6-diamidino-2-phenylindole (DAPI; Vector Lab, Burlingame, CA, USA).\nFluorescence images were taken using a Zeiss (Peabody, MA, USA) LSM 510\nconfocal microscope with a  40 objective lens.\nCalculation of nuclear fusion index. The nuclear fusion index was\ncalculated by the number of nuclei in cells containing two or more nuclei/total\nnuclei  100%. For each experiment, 300–500 nuclei were counted.\nPrimers for PCR. Id1, forward: 50-CGCTGCAGGCCCTAGCTGTT-30, reverse:\n50-TGGAACACATGCCGCCTCGG-30 (391bp); Id2, forward: 50- GCAGATCGCC\nCTGGACTCGC-30, reverse: 50-GGCCGGAGAACGACACCTGG-30 (376bp); Id3,\nforward: 50-CTACGAGGCGGTGTGCTGCC-30,r e v e r s e :5 0-CTGCGTTCGGGAGG\nTGCCAG-30 (329bp); and b-actin, forward: 50-AAATCGTGCGTGACATCAAA-30,\nreverse: 50-AGAAGGAAGGCTGGAAAAGA-30 (180bp). Primers for ChIP assay,\np21, forward: 50-ACAGTTGGTCAGGGACAGACCCA-30,r e v e r s e :5 0-TCTCGGCT\nGCTGCAGTTGG-30 (305bp); myogenin, forward: 50-GAATCACATGTAATCCAC\nTGGA-30,r e v e r s e :5 0-ACACCAACTGCTGGGTGCCA-30 (180bp) (E-box motif\nsequences highlighted by red); and b-actin, forward: 50-AAATCGTGCGTGACATC\nAAA-30,r e v e r s e :5 0-AGAAGGAAGGCTGGAAAAGA-30 (180bp).\nSemi-quantitative reverse transcription PCR (RT-PCR) and\nquantitative RT-PCR (qRT-PCR). RNA was extracted with an RNeasy\nMini Kit and cDNA was synthesized with SuperScript III ﬁrst-strand synthesis\nsystem for RT-PCR (both kits are commercial, obtained from Invitrogen). For semi\nqRT-PCR, 1.5ml of cDNA and 5ml of primers (10mM) were used for one reaction.\nA total of 20 cycles were run with a C1000 thermal cycler (Bio-Rad, Hercules,\nCA, USA) and each cycle consisting of denaturation at 941C for 30s, annealing at\n621C for 30s and extension at 721C for 1min. qRT-PCR was run in a 7900HT\nfast real-time PCR system with the following cycling conditions: enzyme activation\nat 951C for 20s; 40 cycles for denaturing at 951C for 1s; and anneal/extend at\n601C for 20s. Finally, 0.25ml of cDNA and 0.2ml of primers (10mM) in one 10-ml\nreaction were used with Fast SYBR Green Master Mix (Applied Biosystems,\nCarlsbad, CA, USA). Every reaction was run in triplicate in a 384-well clear optical\nreaction plate. All the instruments and reagents used for real-time PCR were from\nApplied Biosystems.\nTUNEL assay. TUNEL assays were conducted with an ApopTag Plus\nFluorescein In Situ Apoptosis Detection Kit (S7111; EMD Millipore, Billerica,\nMA, USA) following the indicated protocol. Brieﬂy, cells were treated as\nindicated, ﬁxed in 1% paraformaldehyde, washed in PBS three times, incubated\nin equilibration buffer for 10min and incubated with terminal deoxynucleotidyl\ntransferase for 60min at 371C. Cells were washed with stop buffer for 10min and\nthen incubated with anti-digoxigenin conjugate for 30min at 251C. After washing in\nPBS, cells were mounted with DAPI and viewed and photographed on a microscope\nwith a ﬂuorescent attachment.\nCaspase 3 activity assay. After being exposed to DM with or without CNTs\nfor 24h, cell lysates were prepared and 200mg of proteins were used for caspase\n3 activity assays. Samples were read at 400nm in a microtiter plate reader and\nfold increase in caspase 3 activity was determined by comparing with the level in\ncells cultured in growth medium.\nCo-immunoprecipitation. Cell lysates were extracted with 1  RIPA Buffer,\nand 200mg of lysate was used for each immunoprecipitation. Before precipitation\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n10\nCell Death and Diseasewith primary antibodies, lysate was precleared by adding 1.0mg of the appropriate\nnormal mouse or rabbit IgG (corresponding to the host species of the primary\nantibody) together with 20ml of resuspended Protein A/G Plus-Agarose. Each\nprecipitation used 1mg of primary antibodies and 20ml of Protein A/G plus-agarose.\nAfter centrifugation, samples were boiled in 1% SDS solution and analyzed by\nwestern blot. All western blots were imaged with an Odyssey Infrared Imaging\nSystem (LI-COR Biosciences).\nChIP assay. ChIP is a method to determine the identity and quantity of DNAs\nthat bind particular proteins of interest. Following the breakage of DNA molecules\ninto pieces by sonication, the protein–DNA complex can be immunoprecipitated\nout from the cellular lysate by using an antibody that is speciﬁc to a putative DNA-\nbinding protein. Then the identity and quantity of DNA bound by the protein can\nbe analyzed using PCR. After optimization of DNA-shearing conditions, the\nmanufacturer’s standard protocol for ChIP was followed. About 1 10\n6 C2C12\ncells in a 10-cm dish were treated with 1% formaldehyde for 10min at 371C. Cells\nwere washed twice with cold PBS containing protease inhibitors and suspended in\n200ml SDS lysis buffer in a 1.5ml eppendorf tube, which was then held in ice\nwater. Sonication was applied to the cell pellets for a total of 18min using a 130-W\nultrasonic processor (model: VCX 130) accessorized with a 6-mm probe (model:\nCV18) (VWR International Ltd, Hunter Boulevard, England) with the following\nsetting: amplitude setting 15% using 15s pulses with 30s cool-down intervals\nbetween pulses. About 20ml of sonicated cell supernatant was kept as input samples\nand the rest was diluted by 10-fold. After immunoprecipitation with anti-HEB and anti-\nMyoD antibodies, 60ml of protein A agarose/salmon sperm DNA was added for 1h of\nculture, followed by centrifuge. The complex was eluted and histone–DNA crosslinks\nwere reversed by heating at 651C for 4h. DNA was recovered by phenol/chloroform\nextraction. Finally, 5ml of DNA suspension was used for PCR cycling.\nIn situ PLA. Cells were seeded on 35-mm glass-bottom dishes (MatTek\nCorp., Ashland, MA, USA). After treatment, cells were ﬁxed with cold 4%\nparaformaldehyde for 15min at room temperature followed by cell-membrane\npermeabilization with 0.25% Triton-X-100 in PBS for 10min. The cells were\nwashed three times with PBS, blocked for 1h at room temperature with 1% BSA in\nPBS containing 0.1% Tween-20 and incubated with the indicated antibody pairs in\na cell incubator at 371C. Duolink in situ PLA (Olink Bioscience, Uppsala, Sweden)\nwas performed according to the manufacturer’s instructions. Images were taken\nusing an Olympus Research Inverted System Microscope (Olympus, Center\nValley, PA, USA) with IX81 LUCplan FLN objectives and cellSen Dimension\nsoftware (1.4.1; Olympus). The paired primary antibodies used included rabbit and\nmouse BMP4 antibody, rabbit BMPR1A antibody and rabbit and mouse BMPR2\nantibody. For preparation of IgG-conjugated MWCNT 1, mouse IgG (100mg,\nSanta Cruz Biotechnology, Inc.) or BSA (100mg) was mixed with MWCNT 1 (50ml\nof the supernatant of 0.5mg/ml aqueous solution after being centrifuged at\n10000 g for 1min) in water (ﬁnal volume, 400ml) and shaken overnight at 41C.\nThe mixture was centrifuged at 16000 g for 30min and the pellet was\nresuspended in 100ml of water. Finally, 50mg/ml-conjugated MWCNT 1 was used\nfor cell treatment (2h).\nFRET. FRET was performed using a Zeiss LSM 510 Meta microscope with a\n 63 oil objective lens, all controlled by Zen 2009 software (Peabody, MA, USA). For\nlabeling MWCNT 1, 200ml of the supernatant of aqueous MWCNT 1 suspension\n(0.5mg/ml, centrifuged at 10000 g for 1min) was mixed with 4.2mg of FITC-\nBSA (Sigma, St. Louis, MO, USA) in 0.6ml of ddH2O and shaken overnight at\n41C. The mixture was centrifuged at 16000 g for 30min to pellet MWCNT 1,\nand the pellet was washed once with PBS. Finally, the pellet was suspended in\n0.2ml of ddH2O. C2C12 cells were seeded on 35-mm glass-bottom dishes\n(MatTek Corp.). After incubation with FITC-conjugated MWCNT 1 (50mg/ml) for\n2h, cells were washed with PBS twice to remove free MWCNT 1. Samples were\nprepared as for immunocytochemistry. FRET was detected by an acceptor\nphotobleaching method. This method involves measuring the donor de-quenching\nin the presence of an acceptor. This can be done by comparing donor\nﬂuorescence intensity in the same sample before and after destroying the acceptor\nby photobleaching. If FRET was initially present, a resultant increase in donor\nﬂuorescence will occur after photobleaching of the acceptor. A selected region of\ninterest was irradiated with the 543-nm laser line (70% bleach power, 50 iterations)\nfor 12s to photobleach TRITC. FITC and TRITC images were collected immediately\nafter photobleaching, and FRET was measured as an increase in FITC ﬂuores-\ncence intensity. The FRET efﬁciency was calculated as FRETeff¼1–Dpre/Dpos\nusing the Zen 2009 software, taking into account background noise in each\nchannel, where Dpre and Dpos are, respectively, the even FITC ﬂuorescence\nintensity in the selected region before and after photobleaching.\n43\nCell transfection and luciferase activity assay. C2C12 or C33A-2D2\ncells were seeded in 24-well plates. After overnight culture, the cell conﬂuence\nreached about 80–90%. Next, 0.6mg of plasmids mixed with Lipofectamine 2000\nat a ratio 1:3 (w/v) in 100ml of Opti-MEM I Reduced-Serum Medium was used for\ntransfecting cells in one well. A pcDNA3.1 empty vector was used as control for\ncaALK2 and caALK3 constructs and a pGL3 empty vector was used as control\nfor myogenin-luciferase and p21-luciferase constructs. A pGL3 control vector\ncontaining SV40 promoter and enhancer sequences was used to monitor the\ntransfection efﬁciency simultaneously. Six hours after transfection, cells were\nchanged to fresh medium, and 24h after transfection, cells were exposed\nto CNTs. After the indicated time, cell lysates were prepared by adding\n80mlo f1   RIPA buffer to each well. Protein concentration was detected\nwith a BCA Protein Assay Kit (Thermo Scientiﬁc, Barrington, IL, USA). A luciferase\nactivity assay was conducted in a white 384-well plate and detected with an\nEnvision 2012 Multilabel Reader (PerkinElmer, Waltham, MA, USA). Finally, 4ml\nof the lysates and 25ml of Steadylite Plus substrate were used for a one-well\nassay. The luciferase activity was normalized as luminescence intensity divided\nby the protein concentration of the same lysate sample.\nId1 promoter activity assay. Approximately 20000 C33A-2D2 cells per well\nwere seeded in white 96-well plates and cultured overnight. Each CNT (100mg/ml)\nfrom the combinatorial array was incubated with cells for 24h before BMP4 (25ng/ml)\nwas added. After incubation for another 24h, 100ml of Steadylite Plus substrate was\nadded and luminescence intensity was determined. To normalize luciferase activity,\na cell viability assay with the same CNT exposure was performed with the XTT\nmethod. The luminescence intensity divided by the number of viable cells in each\nwell was used and the value in medium was set as 1.\nStatistical analysis. The two-sided student’s t-test was used to analyze\ndifferences between experiments. Data are reported as mean values±S.D. from\nmultiple determinations. P-values o0.05 were considered statistically signiﬁcant\nand all the statistical calculations were carried out using SigmaPlot 10.0 (Systat\nSoftware, Chicago, IL, USA).\nConﬂict of Interest\nThe authors declare no conﬂict of interest.\nAcknowledgements. We thank Fu-yue Zeng, Victoria Frohlich, Yannan Ouyang,\nSharon Frase, Linda Mann and Jianmin Ye for their technical assistance and Paul B Yu\n(Harvard Medical School), Michael A Rudnicki (Ottawa Health Research Institute) and\nCarme Gallego (Universitat de Lleida) for providing constitutive active ALK2 and ALK3\nconstructs, myogenin-luciferase and p21-luciferase constructs. This work was\nsupported by the National Basic Research Program of China (2010CB933504),\nNational Natural Science Foundation of China (21077068 and 21137002), National\nCancer Institute (P30CA027165), NIH (CA096832 and CA21765 for MFR) and\nthe American Lebanese Syrian Associated Charities.\n1. Sahoo NG, Bao H, Pan Y, Pal M, Kakran M, Cheng HKF et al. Functionalized carbon\nnanomaterialsasnanocarriersforloading and deliveryofa poorlywater-soluble anticancer\ndrug: a comparative study. Chem Commun 2011; 47: 5235–5237.\n2. Pantarotto D, Singh R, McCarthy D, Erhardt M, Briand J-P, Prato M et al. Functionalized\nCarbon nanotubes for plasmid DNA gene delivery. Angew Chem Int Edit 2004; 43:\n5242–5246.\n3. Lacerda L, Soundararajan A, Singh R, Pastorin G, Al-Jamal KT, Turton J et al. Dynamic\nimaging of functionalized multi-walled carbon nanotube systemic circulation and urinary\nexcretion. Adv Mater 2008; 20: 225–230.\n4. Holy J, Perkins E, Yu X. Adhesion, proliferation and differentiation of pluripotent stem cells\non multi-walled carbon nanotubes. IET Nanobiotechnology 2011; 5: 41–46.\n5. Chao T-I, Xiang S, Chen C-S, Chin W-C, Nelson AJ, Wang C et al. Carbon nanotubes\npromote neuron differentiation from human embryonic stem cells. Biochem Biophys Res\nCommun 2009; 384: 426–430.\n6. Cossu G, Mavilio F. Myogenic stem cells for the therapy of primary myopathies: wishful\nthinking or therapeutic perspective? J Clin Invest 2000; 105: 1669–1674.\n7. Orlic D, Kajstura J, Chimenti S, Jakoniuk I, Anderson SM, Li B et al. Bone marrow cells\nregenerate infarcted myocardium. Nature 2001; 410: 701–705.\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n11\nCell Death and Disease8. Toma C, Pittenger MF, Cahill KS, Byrne BJ, Kessler PD. Human mesenchymal stem cells\ndifferentiatetoacardiomyocyte phenotypeintheadultmurineheart. Circulation2002;105:\n93–98.\n9. Kennea NL, Stratou C, Naparus A, Fisk NM, Mehmet H. Functional intrinsic and extrinsic\napoptotic pathways in human fetal mesenchymal stem cells. Cell Death Differ 2005; 12:\n1439–1441.\n10. Mangi AA, Noiseux N, Kong D, He H, Rezvani M,IngwallJS et al. Mesenchymalstem cells\nmodiﬁedwithAktpreventremodelingandrestoreperformanceofinfarctedhearts. NatMed\n2003; 9: 1195–1201.\n11. Amabile G, D’Alise AM, Iovino M, Jones P, Santaguida S, Musacchio A et al. The Aurora B\nkinase activity is required for the maintenance of the differentiated state of murine\nmyoblasts. Cell Death Differ 2008; 16: 321–330.\n12. KaganVE,TyurinaYY,Tyurin VA,KonduruNV,PotapovichAI, OsipovANetal.Direct and\nindirect effects of single walled carbon nanotubes on RAW 264.7 macrophages: Role of\niron. Toxicol Lett 2006; 165: 88–100.\n13. Robinson S, Cho P, Levitsky H, Olson J, Hruban R, Acker M et al. Arterial delivery of\ngenetically labelled skeletal myoblasts to the murine heart: long-term survival and\nphenotypic modiﬁcation of implanted myoblasts. Cell Transplant 1996; 5: 77–91.\n14. Wang J, Walsh K. Resistance to apoptosis conferred by Cdk inhibitors during myocyte\ndifferentiation. Science 1996; 273: 359–361.\n15. Hartmann A, Hunot S, Michel PP, Muriel M-P, Vyas S, Faucheux BA et al. Caspase-3:\na vulnerability factor and ﬁnal effector in apoptotic death of dopaminergic neurons in\nParkinson’s disease. Proc Natl Acad Sci USA 2000; 97: 2875–2880.\n16. Parker MH, Perry RLS, Fauteux MC, Berkes CA, Rudnicki MA. MyoD synergizes with the\nE-protein HEBb to induce myogenic differentiation. Mol Cell Biol 2006; 26: 5771–5783.\n17. Jen Y, Weintraub H, Benezra R. Overexpression of Id protein inhibits the muscle\ndifferentiation program: in vivo association of Id with E2A proteins. Genes Dev 1992; 6:\n1466–1479.\n18. SchnappE,PistocchiAS,KarampetsouE,FogliaE,LamiaCL,CotelliFetal.Inducedearly\nexpression of mrf4 but not myog rescues myogenesis in the myod/myf5 double-morphant\nzebraﬁsh embryo. J Cell Sci 2009; 122: 481–488.\n19. Wang Y, Schnegelsberg PNJ, Dausman J, Jaenisch R. Functional redundancy of the\nmuscle-speciﬁc transcription factors Myf5 and myogenin. Nature 1996; 379: 823–825.\n20. Andre ´s V, Walsh K. Myogenin expression, cell cycle withdrawal, and phenotypic\ndifferentiation are temporally separable events that precede cell fusion upon myogenesis.\nJ Cell Biol 1996; 132: 657–666.\n21. Gartel AL, Tyner AL. The role of the cyclin-dependent kinase inhibitor p21 in apoptosis.\nMol Cancer Ther 2002; 1: 639–649.\n22. Guo K, Wang J, Andres V, Smith R, Walsh K. MyoD-induced expression of p21 inhibits\ncyclin-dependent kinase activity upon myocyte terminal differentiation. Mol Cell Biol 1995;\n15: 3823–3829.\n23. Halevy O, Novitch BG, Spicer DB, Skapek SX, Rhee J, Hannon GJ et al. Correlation of\nterminal cell cycle arrest of skeletal muscle with induction of p21 by MyoD. Science 1995;\n267: 1018–1021.\n24. Li C, Tzeng S, Cheng Y, Kang J. Chloramphenicol-induced mitochondrial stress increases\np21 Expression and prevents cell apoptosis through a p21-dependent pathway. J Biol\nChem 2005; 280: 26193–26199.\n25. Suzuki A, Tsutomi Y, Yamamoto N, Shibutani T, Akahane K. Mitochondrial regulation of\ncelldeath:mitochondriaareessentialforprocaspase3-p21complexformationtoresistfas-\nmediated cell death. Mol Cell Biol 1999; 19: 3842–3847.\n26. Suzuki A, Ito T, Kawano H, Hayashida M, Hayasaki Y, Tsutomi Y et al. Survivin initiates\nprocaspase 3/p21 complex formation as a result of interaction with Cdk4 to resist Fas-\nmediated cell death. Oncogene 2000; 19: 1346–1353.\n27. Miyazono K, Miyazawa K. Id: a target of BMP signaling. Sci STKE 2002; 2002: pe40.\n28. Mu Q, Du G, Chen T, Zhang B, Yan B. Suppression of human bone morphogenetic\nprotein signaling by carboxylated single-walled carbon nanotubes. ACS Nano 2009; 3:\n1139–1144.\n29. Liu D, Yi C, Zhang D, Zhang J, Yang M. Inhibition of proliferation and differentiation\nof mesenchymal stem cells by carboxylated carbon nanotubes. ACS Nano 2010; 4:\n2185–2195.\n30. Yu PB, Hong CC, Sachidanandan C, Babitt JL, Deng DY, Hoyng SA et al. Dorsomorphin\ninhibits BMP signals required for embryogenesis and iron metabolism. Nat Chem Biol\n2008; 4: 33–41.\n31. Anderson GJ, Darshan D. Small-molecule dissection of BMP signaling. Nat Chem Biol\n2008; 4: 15–16.\n32. Zhu P, Tan Ming J, Huang R-L, Tan Chek K, Chong Han C, Pal M et al. Angiopoietin-like 4\nprotein elevates theprosurvivalintracellularo2:h2o2 ratio andconfers anoikisresistance to\ntumors. Cancer Cell 2011; 19: 401–415.\n33. Noushmehr H, D’Amico E, Farilla L, Hui H, Wawrowsky KA, Mlynarski W et al. Fatty\nacid translocase (FAT/CD36) is localized on insulin-containing granules in human\npancreatic b-Cells and mediates fatty acid effects on insulin secretion. Diabetes 2005;\n54: 472–481.\n34. Goedhart J, van Weeren L, Adjobo-Hermans MJW, Elzenaar I, Hink MA, Gadella TWJ Jr.\nQuantitative co-expression of proteins at the single cell level – application to a multimeric\nFRET sensor. PLoS One 2011; 6: e27321.\n35. Kim BYS, Rutka JT, Chan WCW. Nanomedicine. New Engl J Med 2010; 363:\n2434–2443.\n36. Verma A, Stellacci F. Effect of surface properties on nanoparticle–cell interactions. Small\n2010; 6: 12–21.\n37. Zhou H, Mu Q, Gao N, Liu A, Xing Y, Gao S et al. A Nano-combinatorial library strategy for\nthe discovery of nanotubes with reduced protein-binding, cytotoxicity, and immune\nresponse. Nano Lett 2008; 8: 859–865.\n38. Li W, Sun W, Zhang Y, Wei W, Ambasudhan R, Xia P et al. Rapid induction and long-term\nself-renewal of primitive neural precursors from human embryonic stem cells by small\nmolecule inhibitors. Proc Natl Acad Sci USA 2011; 108: 8299–8304.\n39. Noiseux N, Gnecchi M, Lopez-Ilasaca M, Zhang L, Solomon SD, Deb A et al. Mesenchymal\nstem cells overexpressing akt dramatically repair infarcted myocardium and improve cardiac\nfunction despite infrequent cellular fusion or differentiation. Mol Ther 2006; 14: 840–850.\n40. Zhang L, Webster TJ. Nanotechnology and nanomaterials: promises for improved tissue\nregeneration. Nano Today 2009; 4: 66–80.\n41. Hirano S, Kanno S, Furuyama A. Multi-walled carbon nanotubes injure the plasma\nmembrane of macrophages. Toxicol Appl Pharmacol 2008; 232: 244–251.\n42. Mu Q, Liu W, Xing Y, Zhou H, Li Z, Zhang Y et al. Protein binding by functionalized\nmultiwalled carbon nanotubes is governed by the surface chemistry of both parties and the\nnanotube diameter. J Phys Chem C 2008; 112: 3300–3307.\n43. Herrick-Davis K, Weaver BA, Grinde E, Mazurkiewicz JE. Serotonin 5-HT2C receptor\nhomodimer biogenesis in the endoplasmic reticulum. J Biol Chem 2006; 281:\n27109–27116.\nCell Death and Disease is an open-access journal\npublished by Nature Publishing Group. This work is\nlicensed under the CreativeCommons Attribution-NonCommercial-No\nDerivativeWorks3.0Unported License. To viewacopyofthis license,\nvisit http://creativecommons.org/licenses/by-nc-nd/3.0/\nSupplementary Information accompanies the paper on Cell Death and Disease website (http://www.nature.com/cddis)\nBinding of carbon nanotube to BMP receptor 2\nY Zhang et al\n12\nCell Death and Disease",
    "Link": "https://core.ac.uk/download/pdf/8735600.pdf"
}