{
    "Title": "Acute coronary syndrome in diclofenac sodium-induced type I hypersensitivity reaction : Kounis syndrome",
    "Authors": "Gluvic, Zoran M., Jankovic-Gavrilovic, Jelena, Panic, Milos, Putnikovic, Biljana, Rasic-Milutinovic, Zorica, Stojkovic, Aleksandra",
    "Year": "No year available",
    "Abstract": "Drug-induced type I hypersensitivity reactions are frequent. Sometimes, acute coronary syndrome (ACS) can be registered in such patients, which may have a serious impact on the course and management of the allergic reaction. Because of potentially atypical ACS clinical presentations, the ECG is an obligatory diagnostic tool in any allergic reaction. Coronary artery spasm is the pathophysiological basis of ACS, triggered by the action of potent vasoactive mediators (histamine, neutral proteases, arachidonic acid products) released from the cells involved in type I hypersensitivity. Allergic angina and allergic myocardial infarction are referred to as Kounis Syndrome. We describe herein a case of ACS in a patient with registered systemic immediate hypersensitivity reaction which developed following the muscular administration of diclofenac sodium.peer-reviewe",
    "Keywords": "No keywords available",
    "Publisher": "Malta Medical Journal",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "36 Malta Medical Journal    Volume 19   Issue 03   September 2007\nZoran M Gluvic, Biljana Putnikovic, Milos Panic, Aleksandra Stojkovic, \nZorica Rasic-Milutinovic, Jelena Jankovic-Gavrilovic\nCase Report\nAcute coronary syndrome in diclofenac \nsodium-induced type I hypersensitivity reaction:\nKounis syndrome\nZoran M. Gluvic* MD, MS\nDepartment of Medicine, Division of Endocrinology, Diabetes and \nMetabolism Disorders, \nZemun Clinical Hospital, Zemun-Belgrade, Serbia\nEmail: gluvic@beotel.yu; zorangluvic@hotmail.com\nBiljana Putnikovic MD, PhD\nDivision of Cardiology, Department of Medicine, \nZemun Clinical Hospital, Zemun-Belgrade, Serbia\nMilos Panic MD\nDepartment of Medicine, Division of Cardiology, \nZemun Clinical Hospital, Zemun-Belgrade, Serbia\nAleksandra Stojkovic MD \nDepartment of Medicine, Division of Cardiology, \nZemun Clinical Hospital, Zemun-Belgrade, Serbia\nZorica Rasic-Milutinovic MD, PhD\nClinical Endocrinology Section, Department of Medicine, \nDivision of Endocrinology, Diabetes and Metabolism Disorders, \nZemun Clinical Hospital, Zemun-Belgrade, Serbia\nJelena Jankovic-Gavrilovic MD\nBarts & London School of Medicine, Queen Mary, \nDepartment of Psychiatry, University of London, London, UK\nKey words\nHypersensitivity, anti-inflammatory agents, non-steroidal \nmast cells, inflammatory mediators, coronary vasospasm\nAbstract\nDrug-induced type I hypersensitivity reactions are frequent. \nSometimes, acute coronary syndrome (ACS) can be registered \nin such patients, which may have a serious impact on the course \nand management of the allergic reaction. Because of potentially \natypical ACS clinical presentations, the ECG is an obligatory \ndiagnostic tool in any allergic reaction. Coronary artery spasm \nis the pathophysiological basis of ACS, triggered by the action \nof potent vasoactive mediators (histamine, neutral proteases, \narachidonic acid products) released from the cells involved in \ntype I hypersensitivity. Allergic angina and allergic myocardial \ninfarction are referred to as Kounis Syndrome. \nWe describe herein a case of ACS in a patient with registered \nsystemic immediate hypersensitivity reaction which developed \nfollowing the muscular administration of diclofenac sodium.\nIntroduction\nDiclofenac sodium (DS) is a frequently used non-\nsteroidal anti-inflammatory drug (NSAID). Gastrointestinal, \nhaematological, hepatic and renal side effects, as well as allergic \nreactions are registered frequently. The hypersensitivity reactions \nwith the symptoms and signs of coronary arteries involvement \n(Kounis Syndrome) are not rare, despite the fact that they are not \nfrequently documented in the medical literature1,6 Therefore, the \nreport of Mori et al.1 on the first two cases of vasospastic angina \npresented after NSAID administration is debatable. Kounis \nSyndrome is the concurrence of ACS with mast cell activation \ninduced by allergic or hypersensitivity and anaphylactic or \nanaphylactoid reactions.2,6 In our discussion we review a case \nof ACS in a patient who suffered an anaphylactic reaction after \nthe administration of DS. \nCase report\nA 66-year-old man was admitted to the CCU of Zemun \nClinical Hospital after CPR had been performed on him in the \nCasualty Medicine Cubicle. His medical history evidenced the \nparenteral administration of DS in the Casualty Surgical Cubicle \nas he complained of pain in his left toe caused by foot injury \nhe had sustained a few days before. He had no medical record \nof drug allergies, nor did he provide any drug allergy data to \nmedical stuff prior to DS administration. Several minutes after \nthe parenteral administration of DS, he suddenly experienced \ncardio-respiratory arrest, and was immediately transferred \nto the Casualty Medicine Cubicle for resuscitation. The ECG \nrecording showed up to 5mm ST segment elevation in inferior \nand entire precordial leads (Figure 1). He was transferred \nto CCU after CPR had been successfully performed (airway \nintubation, oxygen therapy, establishing IV access, precordial \nthump, crystalloid administration). Later on, we received \nhis health insurance card only to discover that it contained a \nwritten warning of DS hypersensitivity. The patient’s family said \nthat similar episodes had occurred after the application of DS \ntwo or three years before, except that he then experienced no \ncardio-respiratory arrest and had no ECG pathological findings. \nThe patient had always refused to undergo the recommended \nallergy testing.\nAt admission to the CCU, the patient was unconscious, \nintubated, with irregular spontaneous respirations, centrally \nand peripherally cyanosed, afebrile. Clinical: raised JVP (1-\n2+), apparent pathological venous pulsations. Chest: weak \n* corresponding author\n38 Malta Medical Journal    Volume 19   Issue 03   September 2007\npulmonary sound on auscultation with prolonged expiration, \ndiffuse polyphonic wheezing and inspiratory crackles at the lung \nbases. Heart: quiet heart sounds, regular action, PR 110bpm, \nand BP 10.5/6.5kPa (80/50mmHg). With the exception of the \nswelling and bruising of the left toe, other physical examination \nof extremities was regular. \nLaboratory findings. Complete blood count (CBC) \nshowed eosinophilia (8%) and neutrophilia (82%), but no \nabnormalities in the count of other blood cells. Biochemical \nanalyses showed mild hyperglycemia (7.4mmol/L), whereas \nhepatic, electrolyte, creatin-kinase, BUN and creatine findings \nwere normal. Blood gases showed partial respiratory acidosis \n(pH 7.2, pCO\n2\n 60mmHg, pO\n2\n 90mmHg, and haemoglobin-\noxygen saturation 94%). The urinalysis showed haematuria (a \nurinary catheter inserted). Findings on the chest X-ray showed \nair trapping (pulmonary emphysema), presumably due to the \nexcessive smoking habit.\nThe patient was managed by oxygen, methylprednisolone, \ntheophyline, IV nitrates (Nirmin®) and carefully monitored for \nST elevations. A few hours later, spontaneous respirations were \nrestored and the patient gradually regained consciousness. He \nhad an almost regressed chest auscultation finding showing \ninspiratory crackles at the lung bases. Four hours after \nadmission to the CCU, he was extubated and showed stabilized \nhaemodynamic parameters - PR 96bpm, BP 17/11kPa (125/80 \nmmHg). On the second day, control laboratory tests revealed \nhyperglycemia (10.1mmol/L), elevated creatine kinase (468 \nU/l) and overall serum IgE levels (356 U/l). The measurements \nof serum specific IgE directed to NSAID, serum histamine and \ntryptase levels were not performed (due to the lack of funds \nand equipment for such measurement). Other haematological \n(eosinophils) and biochemical parameters, including Troponin \nI (<0.2ng/ml) were within the reference range. Repeated ECG \nrecordings (Figure 2) showed a regular heart rhythm and a rate \nof 84 bpm, with no specific ST-T changes. Echocardiography \nrevealed no motility disorders of the heart muscle (EF 53%, trace \nmitral and tricuspid regurgitation). The patient was discharged \nat his own request and refused to undergo the recommended \nexercise stress testing and coronary arteries angiography. Four \nweeks later, the repeated overall serum IgE level showed a \nsignificant decrease (69 U/l). \nDiscussion\nThe occurrence of ACS is a serious clinical problem, \ndespite its being seldom reported in patients with anaphylactic \nresponses to drug administration. The mechanism of its \nonset is characterized by coronary arteries spasm due to mast \ncells degranulation and the subsequent release of vasoactive \nmediators.2 Mast cells are recruited to heart tissue and adventitia \nof coronary arteries.3 Released mediators can be preformed \n(histamine, neutral proteases - chymase and tryptase, platelet \nactivating factor) or newly synthesized (cytokines, chemokines, \narachidonic acid products - leukotrienes, prostaglandins). They \ncan act either locally and/or systemically, and have important \nroles in the activation and interaction between other cells \ninvolved in allergic reactions (macrophages, T-lymphocytes, \nendothelial cells).6-8 The most important among the various \nmediators are histamine, serotonin, and leukotrienes, the \nexogenous application of which provoked coronary spasm in \npatients who suffered from vasospastic angina.4,5 Likewise, one \ncannot disregard the inhibition of vasodilative prostaglandin \nproduction, such as PgI\n2\n, caused by the NSAIDs influence \non the enzyme involved in prostaglandin synthesis (cyclo-\noxygenase).1 \nNikolaidis et al.6 described two variants of Kounis syndrome. \nThe type I variant, includes patients with normal coronary arteries \nand represents a manifestation of endothelial dysfunction. Type \nII variant of Kounis syndrome includes patients with preexisting \natheromatous coronary arteries disease. Causes of Kounis \nsyndrome include drugs (antibiotics, analgesics, antineoplastics, \ncontrast media, corticosteroids, intravenous anesthetics, \nNSAIDs, skin disinfectants, thrombolytics, anticoagulants), \nvarious conditions (angio-edema, bronchial asthma, urticaria, \nfood allergy, exercise induced allergy, mastocytosis, serum \nsickness), and environmental exposures (stings of ants, bees, \nwasps, jellyfish, grass cutting, millet allergy, poison ivy, latex \ncontact, shellfish eating, viper venom poisoning).6, 7\nTo conduct provocative NSAIDs testing in the course of a \ncoronary angiography study is not recommended as it may lead \nto potentially fatal anaphylaxis, as well as for ethical reasons. \nAssured of “normal coronary arteries” on angiography, Mori et \nal.1 administered acetylcholine and ergonovine to two patients, \nwhich provoked coronary arteries spasm, chest pain, and \nspecific ECG changes. Our patient was unwilling to undergo \nFigure 1: ECG report at admission Figure 2: ECG report at discharge\nMalta Medical Journal    Volume 19   Issue 03   September 2007 39\ncoronary angiography.  Furthermore, he resolutely rejected both \nangiography and exercise stress testing. For this reason, the \nclinical, ECG and serological findings of a significant IgE level \ndecrease were taken into account to confirm ACS. \nConclusion\nThe manifestations of ACS in drug-induced hypersensitivity \nreactions could be completely atypical and therefore cause \ndiagnostic confusions. It is of great importance to ask the patient \nif he is aware of any allergies, and not only drug-related. Before \nany drug administration, it would be prudent to check whether \nthere are any medical records of drug hypersensitivities or \nintolerances. Likewise, health authorities must provide allergy \nalert cards. Because of potentially fatal anaphylaxis, drug allergy \ntesting is of limited and cautious use. Therefore, even a suspicion \nabout drug allergy must be treated seriously. In cases where \nhypersensitivity reactions are developed, ECG must unavoidably \nbe recorded. When one encounters poor patient compliance, as \nwe did in this case, diagnosis may be established if only some, \nrather than all diagnostic criteria for ACS in hypersensitivity \nreactions, are fulfilled. It is noteworthy that administration of \nmast cell membrane stabilization drugs should be used as a \ntherapeutic strategy for patients prone to food induced allergy, \nfor atopic patients and such who have already experienced \nallergic angina and/or infarction.9, 10\nReferences\n1. Mori E, Ikeda H, Haramaki N, Hashino T, Ichiki K, Katoh A et al. \nVasospastic angina induced by nonsteroidal anti-inflammatory \ndrugs. Clin Cardiol 1997; 20:656-8.\n2. Nikolaidis LA, Kounis NG, Gradman AH. Allergic angina and \nallergic myocardial infarction: a new twist on an old syndrome. \nCan J Cardiol 2002;18:508-11.\n3. Forman MB, Oates JA, Robertson D, Jackson Roberts L, Virmani \nR. Increased adventitional mast cells in a patients with coronary \nspasm. N Engl J Med 1985;313:1138-41.\n4. McFadden EP, Clarke JG, Davies GJ, Kaski JC, Haider AW, \nMaseri A. Effect of intracoronary serotonin on coronary vessels \nin patients with stable angina and patients with variant angina. N \nEngl J Med 1991;324:648-54. \n5. Moreno-Ancillo A, Domingez-Noche C, Gil-Adrados AC, Cosmes \nMartn PM. Acute coronary syndrome due to amoxicillin allergy. \nAllergy Net 2004;59:466-7.\n6. Kounis N. Kounis syndrome (allergic angina and allergic \nmyocardial infarction):A natural paradigm? Int Journal of \nCardiology 2006;110:7-14.\n7. Kounis NG, Kouni SN, Koutsojannis CM. Myocardial infarction \nafter aspirin, and Kounis syndrome. J R Soc Med 2005;98:296. \n8. Nebeuer JR, Virmani R, Bennet CL. Hypersensitivity cases \nassociated with drug-eluting stents: a review of avaliable cases \nfrom the Research on Adverse Drug Events and Reports (RADAR) \nproject. J Am Coll Cardiol 2006;47:175-81.\n9. Nemmar A, Hoet PHM, Vermylen J, Nemery B, Hoylaerts \nMF. Pharmacological stabilization of mast cells abrogates late \nthrombotic events induced by diesel exhaust particles in hamsters. \nCirculation 2004;110:1670-7.\n10. Theoharides TC, Bielory L. Mast cells and mast cell mediators \nas targets of dietary supplements. Ann Allergy Asthma Immunol \n2004;93 (2 Suppl 1):S24-34.\n",
    "Link": "https://core.ac.uk/download/46602127.pdf"
}