{
    "Title": "Further Notes On Teaching In The Time Of #Ferguson",
    "Authors": "Mayorga, Edwin",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "eScholarship provides open access, scholarly publishingservices to the University of California and delivers a dynamicresearch platform to scholars worldwide.Peer ReviewedTitle:Call for ConversationsJournal Issue:Berkeley Review of Education, 5(2)Author:Mayorga, Edwin, Swarthmore CollegeMazid, Imrul, Impact Academy of Arts & Technology, Hayward, CaliforniaBritany,  , Oakland High School, 9th gradeWun, Connie, DataCenter, Oakland, CaliforniaSojoyner, Damien, University of California, Irvinequint, maisha, EastSide Arts Alliance, Oakland, CaliforniaBradley, Jennifer, Swarthmore CollegePublication Date:2015Permalink:https://escholarship.org/uc/item/00f5m1b0Local Identifier(s):ucbgse_bre_29701Abstract:Copyright Information:All rights reserved unless otherwise indicated. Contact the author or original publisher for anynecessary permissions. eScholarship is not the copyright owner for deposited works. Learn moreat http://www.escholarship.org/help_copyright.html#reuseAvailable online at http://escholarship.org/uc/ucbgse_bre Berkeley Review of Education              Vol. 5 No. 2, pp. 197–218 Further Notes on Teaching in the Time of #Ferguson1 Edwin Mayorga2 Swarthmore College Ferguson was where this semester began.  When non-indictment news from Ferguson began streaming in, I found myself searching. Searching for answers, searching for justice. I was inspired by the various collections of resources assembled by educators to support others as we all worked through this tragedy3. But having just moved with my family to Swarthmore College in Pennsylvania, I have thought about what it means to be teaching in the time of Ferguson. The Changing Same Before teaching, we must make sense of situations for ourselves. The failure to indict Darren Wilson was sadly not surprising. Instead it is a changing same. It speaks to the way oppressions, and racism specifically, are sown into the fabric of our society. As Ruthie Gilmore notes, \"[R]acism, specifically, is the sanctioned or extralegal production and exploitation of group-differentiated vulnerability to premature death.\"4 What happened in Ferguson was a sanctioning of the legal system as a group-differentiated, death-dealing machine. What happened in Ferguson is injustice by design within the racial capitalist, carceral state in which we live. The maintenance of racial and economic conditions in Ferguson, nationally, and globally become the legitimized motivation for state, and state-sanctioned, violence. In short, Black lives matter, but only inasmuch as they are of value in advancing what Robinson (1983) describes as racial capitalism. Once decoupled from that value, our bodies become disposable. This is the changing same that we must recognize, and continue to document and analyze, if we seek to abolish it. Centering our Humanity There is much to analyze about Ferguson and the killing of Michael Brown and the numerous other Black people and people of Color who have died premature deaths at the hands of the state. But for now, I turn to the undergraduate classroom.  In my haste to respond to injustice by sharing information and resources, I lost sight of the broader challenge to humanity that moments like these pose. I needed to give my \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t1 This essay is based on a previous post written by the author, Teaching in the Time of Ferguson (http://edwinmayorga.net/?p=515). Thanks to the various folks who have been putting these resources together since August. Specific thanks to Dr. Lee Smithey (@peacesociology) and the New York Collective of Radical Educators (@nycore3000). 2 Correspondence concerning this article should be addressed to: Edwin Mayorga, Swarthmore College, Department of Educational Studies, 500 College Avenue, Swarthmore, PA 19081. Email: emayorg1@swarthmore.edu. 3 Some of those resources are listed below. 4 Gilmore, R. W. (2007). Golden gulag: Prisons, surplus, crisis, and opposition in globalizing California. Berkeley, CA: University of California Press. 200     Call for Conversations  students and myself time and space to grieve over the negation of human life, and Black lives in particular. Engaging our grief, letting it circulate through us, is a part of moving forward. With that in mind, I sent out an email to all of my students. I shared information from the night before, encouraged them to continue following social media, and let them know that the college was organizing transportation to Philadelphia to participate in a march. I also offered up my office as a space for students to meet. Not many students stopped by, but a few did, and several others thanked me via email for sharing information and making the office available.  After attending the march in Philadelphia, Joelle Bueno, a student in my Introduction to Educational Studies course, noted in an email, Thank you so much for sharing about the protests in Philly. I really appreciate your dedication to us as students and as people, it really means a lot to me especially as a freshman. Joelle’s words demonstrate the impact of centering people in the classroom. When we show our students that they matter to us, and that the injustices happening in the world must matter to all of us, we are having an impact.  To me, teaching in the time of Ferguson requires us to teach with our humanity at the center. In carving out spaces to come together, we can begin to see each other and connect ourselves to stories of human struggle that are often, intentionally, blurred from sight. Groundwork Centering people in the classroom is an ongoing process rather than a single event. The groundwork begins in the planning of the curriculum and is as every bit as essential as is the content we teach. This semester began with Ferguson, and I had to immediately modify our early sessions to make certain that what was happening in the world was a part of our discussions on education. It became evident that in addition to space for discussion, students wanted more language and historical context for talking about racism and education. As part of a changing same, Ferguson and the protests that have ensued are markers of the long history of structural racism and abolition work in the U.S. These narratives are not often part of curriculum, but I contend that these stories are essential. Ferguson is also a mirror. Students are well-intentioned folks who recognize the complexities of privilege and see broader injustices. Still, social forces like structural racism are thought to happen somewhere else. Through our discussion, we came to recognize how we are all situated within structural oppression. We recognized that just as much work needed to be done within the college as was required beyond the college.  Hope and Radical Possibilities Ferguson was where the semester ended, and justice work was re/ignited. Coming to grips with complicity can often have a paralyzing effect on those who wish to act. The long march to freedom can sometimes seem too big, too impossible. I invited students to read Crawley’s stunning piece, Otherwise, Ferguson (2014), Duncan-Andrade’s Note to Educators: Hope Required when Growing Roses in Concrete (2009), Call for Conversations     201 and Chapter 10 of Jean Anyon’s book, Radical Possibilities (2005). In each of theses pieces, the call to fight injustice is clear, and the sustainability of the work is made possible when we are animated by the radical possibilities of an otherwise.  Hope, I have come to think, is something crafted through human relationships. We remain hopeful because the ideas and action we share with the people around us nourish a feeling that change is possible. In the days since our last class meeting, students have expressed a desire to continue having these conversations and continue taking action next semester. The march is a long one, but our commitment to justice keeps me hopeful and thinking about #FergusonNext. Author Biography Edwin Mayorga is an Assistant Professor of Educational Studies and Latin American and Latino Studies at Swarthmore College (PA). He directs both the Education in our Barrios project (#BarrioEdProj), a youth participatory action research project that examines educational policy and urban politics in Latino core communities in Philadelphia and New York City, and the Critical Education Policy Studies group (#CritEdPol). He is co-editor of What’s Race Got to Do with It? How Current School Reform Maintains Racial and Economic Inequality (Peter Lang; 2015; co-edited with B. Picower), and is a member of the New York Collective of Radical Educators (NYCoRE). References Anyon, J. (2005). Radical possibilities: Public policy, urban education, and a new social movement. New York, NY: Routledge. Crawley, A. (3 November, 2014). Otherwise, Ferguson. InterFictions Online. Retrieved from http://interfictions.com/otherwise-fergusonashon-crawley/ Desmond-Harris, J. (2014, September 2). Do’s and don’ts for teaching about Ferguson. [Blog post]. Retrieved from http://www.theroot.com/articles/culture/ 2014/09/teaching_about_ferguson_do_s_and_don_ts.html Duncan-Andrade, J. (2009). Note to educators: Hope required when growing roses in concrete. Harvard Educational Review, 79(2). Heierbacher, S. (23 August, 2014). Top #NCDD resources for addressing racial conflict & inequality. National Coalition for Dialogue and Deliberation. Retrieved from http://ncdd.org/15953 Hipkins III, J. (27 November, 2014). Teaching about Ferguson. Zinn Education Project. Retrieved from http://zinnedproject.org/2014/11/teaching-about-ferguson/  Sociologists for Social Justice (21 August, 2014). Ferguson syllabus. Retrieved from http://sociologistsforjustice.org/ferguson-syllabus/ Tritter, P. (Ongoing). Teaching and learning in a #Ferguson world. Boston Teachers Union, Director of Professional Learning. Online interactive google document. Retrieved from https://docs.google.com/document/d/ 1uMuREx5Up3TAl5rLsd3kzHqE-rcoeFFOTTA0blh2iNg/edit  Additional resources may be found on the online version of this essay, available at http://www.berkeleyreviewofeducation.com/fergusonblacklivesmatter_blog/further-notes-on-teaching-in-the-time-of-ferguson",
    "Link": "https://core.ac.uk/download/73340315.pdf"
}