{
    "Title": "Bio-nanotechnology application in wastewater treatment",
    "Authors": "A Biswas, A Kalaiselvi, A Pyatenko, A Rout, A Suganya, AE Danks, AG Ingale, AG Skirtach, AK Mittal, AM Awwad, AM Fayaz, B Le Ouay, B Sadeghi, BB Borse, BG Rasheed, BN Parimi, C Ito, CG Kumar, D Hebbalalu, D Philip, D Tilman, D Werner, DA Kumar, DC Adler, DE Carter, EV Barmina, F Afkhami, F Lin, F Pacheco-Torgal, FE Kruis, G González-Rubio, G González-Rubio, G Haferburg, G Yashni, G Yashni, GG Bovi, H Al Harbi, H Kurita, H Zeng, H Zhang, I Khan, JD Majumdar, JY Song, K Anandalakshmi, K Chaloupka, K Lukaszkowicz, K Punjabi, K Saranyaadevi, K Srinivasan, K Ueno, K Yamada, KM Kumar, KMMA El-Nour, L Cheng, L Christensen, L De Sio, M Ghaedi, M Kim, M Kowshik, M Nasrollahzadeh, M Panghal, M Rai, M Sorbiun, M Wu, MB Ningappa, MF Lengke, MH Gholami-Shabani, MH Mahdieh, MK Swamy, MM Rahman, MR Bindhu, MT Moustafa, N Ahmad, N Bala, N Saifuddin, NG Semaltianos, NI Hulkoti, NK Sajeshkumar, O Abdi, P Atkinson, P Bhattacharya, P Kunwar, P Marrow, P Matteini, P Nalawade, P Prakash, P Singh, PS Pimprikar, R Bhattacharya, R Zamiri, RG Palgrave, RS Patil, S Ahmed, S Ahmed, S Baek, S Deb, S Gupta, S Iravani, S Iravani, S Link, S Link, S Mobasser, S Raj, S Scaramuzza, S Sun, S Suresh, S Vivekanandhan, SK Devatkal, SL Logunov, SP Dubey, SP Kureel, SR Bonde, SS Kelkar, SS Shankar, SS Shankar, T Kudo, T Kumpulainen, T Mazhar, TS Ahmadi, V Kathiravan, V Kumar, V Ravichandran, V Thamilselvi, VA Kumar, VS Kumar, Y Tachibana, YN Slavin, Z Fan",
    "Year": "No year available",
    "Abstract": "The nanoparticles have received high interest in the ﬁeld of medicine and water puriﬁcation, however, the nanomaterials produced by chemical and physical methods are considered hazardous, expensive, and leave behind harmful substances to the environment. This chapter aimed to focus on green-synthesized nanoparticles and their medical applications. Moreover, the chapter highlighted the applicability of the metallic nanoparticles (MNPs) in the inactivation of microbial cells due to their high surface and small particle size. Modifying nanomaterials produced by green-methods is safe, inexpensive, and easy. Therefore, the control and modiﬁcation of nanoparticles and their properties were also discussed",
    "Keywords": "No keywords available",
    "Publisher": "Springer Nature",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "67\nJournal of Science and Technology\nEffects of Joule Heating and \nViscous Dissipation\non MHD Marangoni Convection \nBoundary Layer Flow\nRohana Abdul Hamida, Norihan Md. Arifinb, Roslinda Nazarc,\nFadzilah Md. Alib\naInstitute for Mathematical Research, Universiti Putra Malaysia,\n43400 UPM Serdang, Selangor, Malaysia.\nbDepartment of Mathematics, Faculty of Science, Universiti Putra Malaysia, \n43400 UPM Serdang, Selangor, Malaysia. \ncSchool of Mathematical Sciences, Faculty of Science and Technology, Uni-\nversiti  Kebangsaan Malaysia, 43600 UKM Bangi, Selangor, Malaysia.\nCorresponding emails: rosa_han86@yahoo.com, \nnorihan@math.upm.edu.my\nAbstract\nAn analysis is performed to study the effects of the Joule heating and viscous \ndissipation on the magnetohydrodynamics (MHD) Marangoni convection \nboundary layer flow. The governing partial differential equations are reduced \nto a system of ordinary differential equations via the similarity transformations. \nNumerical results of the similarity equations are obtained using the Runge-\nKutta-Fehlberg method. Effects of the magnetic field parameter, and the \ncombined effects of the Joule heating and the viscous dissipation are \ninvestigated and the numerical results are tabulated in tables and figures. It \nis found that the magnetic field reduces the fluid velocity but increases the \nfluid temperature. On the other hand, the combined effects of the Joule heating \nand viscous dissipation have significantly influenced the surface temperature \ngradient.\nKeywords: Marangoni convection; boundary layer; MHD; Joule heating; \nviscous dissipation.\n68\nJournal of Science and Technology\n1. INTRODUCTION\nIn recent years, many researchers have investigated the Marangoni convection \nand applied such convection into their problems. Marangoni convection is \ninduced by the variations of the surface tension gradients at the surface of \nimmiscible fluids (see Golia and Viviani, 1986). Kang and Kashiwagi (2002) \nhave studied the effect of the Marangoni convection in the ammonia-water \nabsorption process. Tan (2005) investigated the gas diffusion in liquids that \ncan cause the Marangoni convection. Further, Christopher and Wang (2001) \nstudied the Prandtl number effect on the Marangoni convection.\n On the other hand, the study of magnetohydrodynamics (MHD) is \nimportant in the heat and mass transport process. Merkin and Kumaran (2010) \nhave analyzed the unsteady MHD boundary layer flow on a shrinking surface. \nRashad and Bakier (2009) investigated the effects of magnetic field on the \nnon-Darcy forced convection boundary layer flow past a permeable wedge \nin a porous medium with uniform heat flux. An analysis of MHD boundary \nlayer flow over a moving vertical cylinder has been studied by Amkadni and \nAzzouzi (2006). Furthermore, there are many attempts to study the effect \nof the magnetic field on the Marangoni convection. Witkowski and Walker \n(2001) and Munakata et al. (2002) have employed the magnetic field on the \nMarangoni convection in the floating zone (FZ) silicone melt. On the other \nhand, the effects of the magnetic field, chemical reaction, and heat generation \non the thermosolutal Marangoni convection have been studied by Al-Mudhaf \nand Chamkha (2005). Exact analytical solutions of thermosolutal Marangoni \nflows in the presence of magnetic field has been examined by Magyari and \nChamka (2007, 2008).\n The effects of viscous dissipation and Joule heating are usually \ncharacterized by the Eckert number and the product of the Eckert number and \nthe magnetic parameter, respectively, and both effects are important in nuclear \nengineering (see Alim et al., 2007). Duwairi (2005) has presented the effects \nof Joule heating and viscous dissipation on the forced convection flow in the \npresence of thermal radiation. Aissa and Mohammadein (2005) have analyzed \nthe effects of the magnetic parameter, Joule heating, viscous dissipation and \nheat generation on the MHD micropolar fluids that past through a stretching \nsheet.\n The present study focuses on the effects of Joule heating and viscous \ndissipation on the MHD Marangoni convection. We also investigate the \ninfluence of the magnetic field parameter on the boundary layer flow and \n69\nJournal of Science and Technology\nheat transfer. The results show that the Joule heating and viscous dissipation \nas well as the magnetic parameter have significant effects on the Marangoni \nconvection boundary layer flow.\n2.  MATHEMATICAL PROBLEM\nWe consider the steady, two-dimensional, laminar boundary layer flow of an \nelectrically-conducting fluid over a flat surface. The surface is assumed to be in \nthe presence of surface tension due to temperature. Further, a strong magnetic \nfield of strength B0 is applied normal to the surface which then produces the \nmagnetic forces along the surface. Under the above assumptions and with the \nusual boundary layer approximations, the governing equations are (see El-\nHakiem et al., 1999) as follows:\nwhere u and v are the velocity components in the x and y directions, respectively, \nν is the kinematic viscosity, Δ is the electric conductivity, σ is the surface \ntension, B\n0\n is the uniform magnetic field strength, ρ is the density of the fluid, \nc\np\n is the specific heat at constant pressure, T is the fluid temperature, T\n∞ \nis the \nfluid temperature far from the surface, A is the temperature gradient coefficient \nand  μ is the dynamic viscosity.\nFurther, we use the similarity transformations as presented by Al-Mudhaf and \nChamkha (2005) and the standard definition of the stream function such that \nu=∂ψ/∂y and v=∂ψ/∂x  to obtain the similarity solution of the problems. The \nsimilarity transformations are given by\n70\nJournal of Science and Technology\nwhere M2=ΔB\n0\n2C\n2\n/ρC\n1\n is the magnetic field parameter, Pr is the Prandtl number \nand Ec=C\n1\n2/Ac\np\nC\n2\n2 is the Eckert number. It should be mentioned here again \nthat the viscous dissipation effect is examined using the Eckert number, Ec \nwhile the product of the Eckert number and the magnetic field parameter, M \ngives the Joule heating.\n3.  RESULTS AND DISSCUSSION\nThe nonlinear ordinary differential equations (7) and (8) subject to the boundary \nconditions (9) were solved numerically using the Runge-Kutta-Fehlberg \nfourth-fifth order (RKF45) method using Maple 12 and the algorithm RKF45 \nin Maple has been well tested for its accuracy and robustness (Aziz, 2009).  In \nthis method, it is most important to choose the appropriate finite value of the \nedge of boundary layer, n→∞  (say n\n∞\n  ) that is between 4 to 10, which is in \naccordance with the standard practice in the boundary layer analysis. We begin \nwith some initial guess value of n\n∞\n and solve the equations (7) and (8) subject \nto the boundary conditions (9) with some particular set of parameters to obtain \nthe surface velocity  f'(0)  and the temperature gradient  )0(q′- . The solution \nprocess is repeated until further changes (increment) in n\n∞\n do not lead to any \nchanges in the values of  f'(0) and )0(q′- , or in other words, the  results are \nindependent of the value of n\n∞\n. The initial step size employed is h = Δn = 0.1. \nThe present data is then validated by comparing it with the previously \nwhere\nWe apply (5) and (6) into the equations (1), (2) and (3) and get the following \nsystem of equations:\nwith the boundary conditions\n71\nJournal of Science and Technology\npublished work as depicted in Table 1. It is seen that the present results are in \nvery good agreement with the results obtained by Al-Mudhaf and Chamkha \n(2005). Then, we investigate the effects of the magnetic field parameter, M \non the surface velocity  f'(0) and the surface temperature gradient  )0(q′-  as \ndisplay in Table 2. In the presence of the Prandtl number, Joule heating and \nviscous dissipation, it is shown that the increase of M values tend to reduce \nboth the surface velocity and the surface temperature gradient. Thus, the heat \ntransfer rate at the surface also reduces as M increases. Moreover, in Table 3, \nthe effect of the Prandtl number, Pr on the surface temperature gradient when \nM = 1 and Ec = 0.2 is presented. As mentioned by Thirumaleshwar (2006), the \nPrandtl number values for gases are in the range of 0.7 to 1 while for water \nit is 1.7 to 13.7. The Prandtl number for heavy oils takes the values of 50 to \n100 000. It is observed that the surface temperature gradient is increasing as \nPr increases.\n Meanwhile Figure 1 illustrates the variations of the surface temperature \ngradient with the Eckert number for different values of the Prandtl number i.e. \nPr = 0.7, 7 and 100. It is worth mentioning that Ec = 0 means that there are \nno effects of Joule heating and viscous dissipation while Ec > 0 indicates the \ncombined effects of Joule heating and viscous dissipation. The figure shows \nthat as Ec increases, the surface temperature gradient decreases. Further, when \nwe consider higher Prandtl number, we notice further reduction of the surface \ntemperature gradients. Figures 2 and 3 present the effects of the magnetic field \nparameter M on the velocity profiles and temperature profiles, respectively. It \nis obvious from the Figure 2 that the increase of parameter M decreases the \nvelocity profiles. \n Meanwhile, as seen in the Figure 3, the parameter M tends to increase \nthe temperature profiles. However, the temperature profile can be reduced \nusing higher Prandtl number. Further, Figure 4 and 5 present the combined \neffects of the Joule heating and viscous dissipation on the temperature profiles \nwhen M = 1 for Pr = 0.7 and Pr = 7, respectively. It is noted that increasing \nthe values of the Eckert number will produce an increases in the temperature \nprofiles for both Prandtl number considered. Finally, it is worth mentioning \nthat all the profiles presented in Figures 2 to 5 satisfy the boundary conditions \n(9), and thus support the numerical results obtained.\n72\nJournal of Science and Technology\nTable 1: Comparisons of the present results with those of Al-Mudhaf \nand Chamkha (2005).\n Al-Mudhaf and Chamkha (2005)   Present\n  M f'(0)  -θ'(0)  f'(0)   -θ'(0)\n  0 1.587671 1.442203 1.587400 1.442076\n  1 1.315181 1.206468 1.314596 1.206059\n  2 0.9039450 0.7596045 0.9032119 0.7597828\n  3 0.6448883 0.4422402 0.6440222 0.4422687\n  4 0.4933589 0.2728471 0.4924782 0.2741291\nTable 2: Effects of M on the surface velocity, f'(0) and the surface temperature \ngradients,  )0(q′-  when Pr = 0.7 and Ec = 0.2.\n        M  f'(0)  )0(q′-\n         0  1.587400 1.188189\n        0.5  1.508289 1.107814\n        1.0  1.314596 0.912075\n                     1.5  1.093739 0.688528\n        2  0.903211 0.498001\nTable 3: Effects of the Prandtl number Pr on the surface temperature gradients,  \n )0(q′- when M = 1 and Ec = 0.2.\n        Pr   )0(q′-\n        0.7  0.912196\n        1  1.142406\n        5   2.729714\n        7  3.216857\n        10  3.815753\n        100  11.201822\n73\nJournal of Science and Technology\nFigure 1: Variations of the surface temperature gradients,  )0(q′-  with the Eckert \nnumber, Ec for different Prandtl number Pr.\nFigure 2: Effects of the magnetic field parameter, M on the velocity profiles\n74\nJournal of Science and Technology\nFigure 3: Effects of the magnetic field parameter, M on the temperature profiles when \nEc = 0.2 for different Prandtl number Pr.\nFigure 4: Effects of the Eckert number, Ec on the temperature profiles when Pr = 0.7, \nM = 1.\n75\nJournal of Science and Technology\nFigure 5: Effects of the Eckert number, Ec on the temperature profiles \nwhen Pr = 7, M = 1.\n4. CONCLUSIONS\nThe problem of MHD Marangoni convection boundary layer flow with Joule \nheating and viscous dissipation has been solved numerically in this paper. From \nthe results it can be concluded that in the presence of magnetic parameter M, \nthe surface velocity and the velocity profiles can be reduced. On the other hand, \nthe surface temperature gradients can be reduced by increasing the parameters \nM and Ec and with higher Prandtl number Pr. \nAcknowledgments \nThe financial support received in the form of a fundamental research grant \n(FRGS) from the Ministry of Higher Education Malaysia is gratefully \nacknowledged.\n76\nJournal of Science and Technology\nREFERENCES  \n[1] Aissa, W.A. & Mohammadein, A.A. (2005). “Joule Heating Effects on \n a Micropolar Fluid Past a Stretching Sheet with Variable Electric \n Conductivity”. Jounal of Computational and Applied Mechanics.\n Vol. 6. No. 1, pp. 3-13\n[2] Alim, M.A., Alam, M.D., & Mamun, A. (2007). “Joule Heating Effect \n on the Coupling of Conduction with Magnetohydrodynamic Free  \n Convection Flow from a Vertical Flat Plate”. Nonlinear Analysis: \n Modelling and Control. Vol. 12. No. 3, pp. 307-316.\n[3] Al-Mudhaf, A. and Chamkha, A.J. (2005). “Similarity Solutions   \n for MHD Thermosolutal Marangoni Convection over a Flat Surface in \n the Presence of Heat Generation or Absorption Effects”. Heat Mass \n Transfer. Vol. 42, pp. 112–121\n[4] Amkadni, M. & Azzouzi, A. (2006). “On a Similarity Solution of \n MHD Boundary Layer Flow over a Moving Vertical Cylinder”. \n Journal of Differential Equations and Nonlinear Mechanics. \n Vol. 2006, Article ID 52765, pp. 1–9.\n[5] Aziz, A. (2009). “A Similarity Solution for Laminar Thermal Boundary \n Layer over a Flat Plate with a Convective Surface Boundary \n Condition”. Commun. Nonlinear Sci. Numer. Simulat., \n Vol 14, pp. 1064-1068.\n[6] Christopher, D.M. & Wang, B. (2001). “Prandtl Number Effects for \n Marangoni Convection over a Flat Surface”. International Journal of \n Thermal Sciences. Vol. 40, pp. 564-570.\n[7] Duwairi, H.M. (2005). “Viscous and Joule Heating Effects on Forced \n Convection Flow from Radiate Isothermal Porous Surfaces”. \n International Journal of Numerical Methods for Heat and Fluid Flow. \n Vol. 15. No. 5, pp. 429-440.\n[8] El-Hakiem, M.A., Mohammadein, A.A., EL-Kabier, S.M.M., & \n Gorla, R.S.R. (1999). “Joule Heating Effects on Magnetohydrodynamic \n Free Convection Flow of a Micropolar Fluid”. International \n Communication Heat and Mass Transfer. Vol. 26. No. 2, pp. 219-227.\n77\nJournal of Science and Technology\n[9] Golia, C. & Viviani, A. (1986). “Non Isobaric Boundary Layers \n Related to Marangoni Flows”. Meccanica. Vol. 21, pp. 200-204.\n[10] Kang, Y.T. (2002). “Heat Transfer Enhancement by Marangoni \n Convection in the NH3-H2O Absorption Process”. International \n Journal of Refrigeration. Vol. 25, pp. 780-788.\n[11] Magyari, E. & Chamka, A. J. (2007). “Exact Analytical Solutions for \n the Thermosolutal Marangoni Convection in the Presence of Heat and \n Mass Generation or Consumption”. Heat and Mass Transfer. \n Vol. 43, pp 965-974.\n[12] Magyari, E. & Chamka, A. J. (2008). “Exact Analytical Solutions for \n the Thermosolutal Marangoni MHD Convection boundary layers”. \n International Journal of Thermal Sciences. Vol. 47, pp 848-857.\n[13] Merkin, J.H. & Kumaran, V. (2010). “The Unsteady MHD Boundary \n Layer Flow on a Shrinking Sheet”. Eropean Journal of Mechanics B/\n Fluids. Vol. 29, pp. 357-363.\n[14] Munakata, T., Someya, S., & Tanasawa, I. (2002). “Suppression of \n Marangoni Convection in the FZ Melt by High-Frequency Magnetic \n Field”. Journal of Crystal Growth. Vol. 235. No. 1-4, pp. 167-172.\n[15] Rashad, A.M. & Bakier, A.Y. (2009). “MHD Effects on Non-Darcy  \n Forced Convection Boundary Layer Flow Past a Permeable Wedge in \n a Porous Medium With Uniform Heat Flux”. Nonlinear Analysis: \n Modelling and Control. Vol. 14. No. 2, pp. 249-261.\n[16] Tan, K.K. (2005). “Predicting Marangoni Convection Caused by \n Transient Gas Diffusion in Liquids”. International Journal of Heat \n and Mass Transfer. Vol. 48, pp. 135-144. \n[17] Thirumaleshwar, M. (2006). Fundamentals of heat and mass transfer. \n India, Dorling Kindersley.\n[18] Witkowski, L.M. & Walker, J.S. (2001). “Flow Driven by Marangoni \n Convection and Rotating Magnetic Field in a Floating-Zone \n Configuration”. Magnetohydrodynamics. \n Vol. 37. No. 1-2, pp. 112-118.\n78\nJournal of Science and Technology\n",
    "Link": "https://core.ac.uk/download/12007141.pdf"
}