{
    "Title": "Assessing the utility of geospatial technologies to investigate environmental change within lake systems",
    "Authors": "Aitkenhead, Akyürek, Alcamo, Andersen, Andrew, Aplin, Awange, Baghdadi, Bartalis, Basist, Becker, Becker, Bindlish, Birkett, Birkett, Blad, Boughton, Chang, Chaplin, Chen, Churnside, Chédin, Cihlar, Clifford, Congalton, Crawford, Crétaux, Crăciunescu, dall'Amico, Dash, de Araujo Barbosa, de Groot, de Jeu, Deus, Diak, Dietz, Dokulil, Downing, Dozier, Duan, Döll, Eagleman, Economics, Eigenbrod, FAO, FAO AQUASTAT, Ferraro, Fily, Foster, Frappart, Freitas, Fuller, Galve, Gao, Gesell, Gillespie, Glenn, Gudmundsson, Gudmundsson, Haddad, Hall, Hall, Hansen, Heilman, Huang, Hutchinson, Hwang, Hüsler, Iguchi, IJC, Jackson, Jensen, Jiang, Kalma, Karimi, Keatley, Klein, Kling, Knoll, Kollár, Kongoli, Kovàcs, Kustas, Kutser, Kyle, König, Large, Larson, Lehner, Li, Li, Loew, Lu, Ludwig, Ludwig, Mao, Martinec, Matikainen, Mauser, McCabe, McDonald, McFarland, Meigh, Mercier, Michaelides, Miller, Milzow, Minacapilli, Mitsova, Mo, Muirhead, Nghiem, Njoku, Njoku, Nolin, Olofsson, Owe, Parinussa, Pereira, Pereira-Cardenal, Peterson, Petrovič, Pfeifer, Pinheiro, Ponchaut, Prata, Probeck, Pôças, Qian, Reichle, Renwick, Riera, Rocchini, Rodell, Rodell, Rowan, Rüdiger, Salomonson, Schindler, Schlenz, Schmugge, Schmugge, Seneviratne, Seppelt, Shiklomanov, Sobrino, Sobrino, Soranno, Soranno, Stephens, Stone, Suchenwirth, Swenson, Swenson, Sòria, Tapiador, Tapley, TEEB, Thornthwaite, Thornthwaite, Thornthwaite, Tomlinson, Tranvik, Tyler, UNEP, Valero-Garcés, Vereecken, Verpoorter, Verpoorter, Verstraeten, Vila, Voigt, Vörösmarty, Wada, Wagner, Wagner, Wagner, Wahr, Wan, Wang, Wang, Webster, Wen, Wigneron, Wilcox, Wilker, Williams, Williamson, Woodcock, Woodhouse, WWAP, Xu, Xu, Xu, Yang",
    "Year": "No year available",
    "Abstract": "Over 50% of the world's population live within 3. km of rivers and lakes highlighting the on-going importance of freshwater resources to human health and societal well-being. Whilst covering c. 3.5% of the Earth's non-glaciated land mass, trends in the environmental quality of the world's standing waters (natural lakes and reservoirs) are poorly understood, at least in comparison with rivers, and so evaluation of their current condition and sensitivity to change are global priorities. Here it is argued that a geospatial approach harnessing existing global datasets, along with new generation remote sensing products, offers the basis to characterise trajectories of change in lake properties e.g., water quality, physical structure, hydrological regime and ecological behaviour. This approach furthermore provides the evidence base to understand the relative importance of climatic forcing and/or changing catchment processes, e.g. land cover and soil moisture data, which coupled with climate data provide the basis to model regional water balance and runoff estimates over time. Using examples derived primarily from the Danube Basin but also other parts of the World, we demonstrate the power of the approach and its utility to assess the sensitivity of lake systems to environmental change, and hence better manage these key resources in the future",
    "Keywords": "No keywords available",
    "Publisher": "'Elsevier BV'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "                                                              University of DundeeAssessing the utility of geospatial technologies to investigate environmental changewithin lake systemsPoliti, Eirini; Rowan, John; Cutler, MarkPublished in:Science of the Total EnvironmentDOI:10.1016/j.scitotenv.2015.09.136Publication date:2016Document VersionPublisher's PDF, also known as Version of recordLink to publication in Discovery Research PortalCitation for published version (APA):Politi, E., Rowan, J. S., & Cutler, M. E. J. (2016). Assessing the utility of geospatial technologies to investigateenvironmental change within lake systems. Science of the Total Environment, 543(Part A), 791-806.10.1016/j.scitotenv.2015.09.136General rightsCopyright and moral rights for the publications made accessible in Discovery Research Portal are retained by the authors and/or othercopyright owners and it is a condition of accessing publications that users recognise and abide by the legal requirements associated withthese rights. • Users may download and print one copy of any publication from Discovery Research Portal for the purpose of private study or research. • You may not further distribute the material or use it for any profit-making activity or commercial gain. • You may freely distribute the URL identifying the publication in the public portal.Take down policyIf you believe that this document breaches copyright please contact us providing details, and we will remove access to the work immediatelyand investigate your claim.Assessing the utility of geospatial technologies to investigateenvironmental change within lake systemsEirini Politi ⁎, John S. Rowan, Mark E.J. CutlerGeography, School of Social Sciences, University of Dundee, Dundee DD1 4HN, UKH I G H L I G H T S• Lakes and their catchments provide im-portant ecosystem services• Multi-scale observations required tounderstand the response of lakes to cli-mate and anthropogenic pressures• Remote sensing is an importantgeospatial technology for deriving in-formation about lakes systems• We review the applicability of remotesensing in linking lake-catchment pro-cesses to assess lake response to envi-ronmental changeG R A P H I C A L A B S T R A C Ta b s t r a c ta r t i c l e i n f oArticle history:Received 10 March 2015Received in revised form 21 September 2015Accepted 25 September 2015Available online xxxxKeywords:Lake changeEcosystem servicesRemote sensingGeospatial technologyCatchment pressuresOver 50% of the world's population live within 3 km of rivers and lakes highlighting the on-going importance offreshwater resources to human health and societal well-being.Whilst covering c. 3.5% of the Earth's non-glaciat-ed land mass, trends in the environmental quality of the world's standing waters (natural lakes and reservoirs)are poorly understood, at least in comparisonwith rivers, and so evaluation of their current condition and sensi-tivity to change are global priorities. Here it is argued that a geospatial approach harnessing existing globaldatasets, along with new generation remote sensing products, offers the basis to characterise trajectories ofchange in lake properties e.g., water quality, physical structure, hydrological regime and ecological behaviour.This approach furthermore provides the evidence base to understand the relative importance of climatic forcingand/or changing catchment processes, e.g. land cover and soil moisture data, which coupled with climate dataprovide the basis to model regional water balance and runoff estimates over time. Using examples derived pri-marily from the Danube Basin but also other parts of the World, we demonstrate the power of the approachand its utility to assess the sensitivity of lake systems to environmental change, and hence better managethese key resources in the future.© 2015 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY license(http://creativecommons.org/licenses/by/4.0/).Science of the Total Environment xxx (2015) xxx–xxx⁎ Corresponding author.E-mail address: e.politi@dundee.ac.uk (E. Politi).STOTEN-18485; No of Pages 16http://dx.doi.org/10.1016/j.scitotenv.2015.09.1360048-9697/© 2015 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).Contents lists available at ScienceDirectScience of the Total Environmentj ourna l homepage: www.e lsev ie r .com/ locate /sc i totenvPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.1361. IntroductionThe world's freshwater ecosystems and the biodiversity they sup-port are vital components of the global biosphere, yet remain fragileand vulnerable to anthropogenic disturbance and climate change(Dokulil, 2013; Schindler and Donahue, 2006; Vörösmarty et al., 2000;Williamson et al., 2009). Whilst recognition grows of their role in thecarbon cycle at regional and continental scales (e.g. Knoll et al., 2013;McDonald et al., 2013; Renwick et al., 2008; Yang et al., 2008), under-standing their global significance to biogeochemical cycling and ecosys-tem services has been hampered by uncertainties about absolutenumbers and the distributions of different types, as well as limited in-formation on their ecological, chemical and physical condition(Downing et al., 2006; Verpoorter et al., 2012). Verpoorter et al.(2014) enumerated a global inventory of 117 million lakes(N0.002 km2), with a combined surface area of about 5 × 106 km2,equating to 3.7% of the Earth's non-glaciated land mass. In Europealone there are over 1.5 × 106 lakes with surface areas greater than0.01 km2 and at least 500,000 natural lakes larger than 0.1 km2(Kristiansen and Hansen, 1994). These systems span a continuum ofsize, depth, form, altitude, geology, climatic and hydrological regime.Importantly, lakes also sit within a wider landscape, catchment and hy-drological network that means one needs to look beyond the lake itselfto determine the drivers of lake water behaviour and any changes inthat. For example, the Danube Basin is some 801,463 km2 in size and ac-cording to the Global Lakes and Wetlands Database (Lehner and Döll,2004) includes 592 lakes N0.1 km2. The large numbers involved andthe relative remoteness of many lake districts, especially within largetransnational catchments such as the Danube, presents major chal-lenges in terms of managing the standing water resource and empha-sises the need to be able to generalise about behaviour based onlimited field observations.The role that aquatic systems play in underpinning society's activi-ties, health and well-being is increasingly being understood throughthe concept of ecosystem services, which links nature to an economicvalue to society (TEEB, 2010). Particularly since the launch of the UnitedNations Millennium Ecosystem Assessment (MEA) in 2005, there hasbeen an increase in the awareness of the ecosystem services providedby aquatic and terrestrial ecosystems amongst policy makers (deGroot et al., 2010), matched by a significant increase in the number ofscientific publications on the topic (de Araujo Barbosa et al., 2015;Large and Gilvear, 2014; Seppelt et al., 2011). Remote sensing has thepotential to provide an important source of information for quantifyingand mapping dynamic terrestrial and aquatic ecosystem services andhydrological processes, including approaches to hydrologic modellingas reviewed by Xu et al. (2014). In many cases, given the large catch-ment area of many of the most important river and lake systems inthe world (particularly those with large populations dependent uponthem and their attendant ecosystem services), the synoptic, wide areacoverage and frequent observations provided by satellite-based remotesensing are an important source of standardised information that is notprey to variability in national and regional in situ data collection meth-odologies and standards. As a result, remote sensing has become an im-portant geospatial technology for deriving information about lakes andtheir catchments, which alongside advances in in situ sensor systems tocapture spatial information in addition to measurements across time(Crawford et al., 2014) and analysis with Geographic Information Sys-tems (GIS), provides an important step forward in our ability to modellake and catchment status and behaviour.From both passive (e.g. multispectral and hyperspectral) and active(LiDAR and RADAR) remote sensing systems it is possible to retrieve thestate of important lake and catchment variables that may vary acrossspace at particular points in time. Recently, either directly or in combi-nationwith other data, remote sensing has been successfully usedwith-in the Danube Basin to map variations in biomass (Kovàcs, 2007),carbon stocks in riparian forests (Suchenwirth et al., 2014), habitatchange (Kollár et al., 2011), historical land cover change (Crăciunescuet al., 2010), evapotranspiration (Rodell et al., 2011) and soil moisture(dall'Amico et al., 2012), to name but a few examples. However, it is im-portant to recognise that whilst some catchment properties may be re-trieved directly from remotely sensed data (e.g. canopy height withLiDAR or leaf area index from optical data) some catchment properties,such as land use, may only be inferred from remotely sensed datathrough contextual associations across, whilst others, such as rawmate-rial production, will require remotely sensed data to be coupled withother ancillary datasets, for example in situ measurements andmodelled data (de Araujo Barbosa et al., 2015).Following decades of fundamental research and the launch of sever-al new satellite programmes a report by London Economics to the UKSpace Agency suggests that we stand at the dawn of a ‘New SpaceAge’ (London Economics, 2015, p. 104), one in which there will be sub-stantial growth in applications of remote sensing data. Indeed the futureof European (and global) remote sensing for catchment, ecosystem andlake-based studies looks very promising, particularly with respect todata availability and the new generation Copernicus satellites of the Eu-ropean Space Agency (ESA). The Copernicus satellites build on the suc-cess and capabilities of other currently operational (e.g. Landsat series)and non-operational (e.g. Envisat MERIS and AATSR) instruments andinclude the Sentinel-2 Multispectral Imager (MSI) (launched June2015), Sentinel-3 Ocean and Land Colour Instrument (OLCI) and Senti-nel-3 Sea and Land Surface Temperature Radiometer (SLSTR), thefirst ofwhich is due for launch late 2015. Sentinel-2 MSI has 13 wavebands inthe visible and NIR at 10–60 m spatial resolution and a 5-day revisittime. Sentinel-3 OLCI at a 300 m spatial resolution will employ 21wavebands in the visible and NIR. Sentinel-3 SLSTR will employ 9wavebands, with a nominal 500 m spatial resolution in the visible andNIR and 1 km at the TIR. In addition, Sentinel-3 will have a revisit timeof 1–2 days. These optical and thermal sensors combine short revisittimes, fine spatial resolutions and multiple spectral channels with afree data access policy. Herewe signpost some of the new opportunitiesfor catchment and lake studies provided by these new systems by col-lating experiences of previous research and how these and the plethoraof new data sources will contribute to future lake and catchmentmanagement.Several authors have provided comprehensive reviews of the poten-tial and current status of remote sensing to map and quantify a range ofecosystem services (e.g. Andrew et al., 2014; de Araujo Barbosa et al.,2015). This paper builds upon those comprehensive reviews and othersby exploring the utility of remote sensing to capture spatial and tempo-ral patterns of change in key catchment processes and the use of thesedata to inform policy and management decisions. Particular referenceis made to examples from the Danube Basin highlighting informationderived from remote sensing data relevant for catchmentwater balanceestimation and modelling, as well as land cover change and other criti-cal ecosystem functions. By focussing on the catchment we evaluatehow to derive information on drivers of change in lake behaviour ratherthan explicitly exploring the use of remote sensing to detect change inthe lake water quality itself, which is the subject a separate paper inthis Special Issue (Tyler et al., in this volume).2. Lakes, landscape limnology and remote sensingSoranno et al. (2010) introduced landscape limnology as a new con-ceptual framework for understanding lake behaviour based on a seriesof important comparative and regional limnological studies (e.g. Rieraet al., 2000; Webster et al., 2000; Soranno et al., 2009). Landscape lim-nology is the spatially-explicit study of lakes within freshwater, terres-trial and human landscapes to determine the effects of pattern onecosystem processes over multiple temporal and spatial scales (Fig. 1).It highlights that landscape settings influence lake functions throughthe hydromorphological settingmediated by the extent of humanmod-ification, superimposed upon which is the effect of climate change.2 E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136An extension to this framework is shown in Table 1, which uses fourhierarchical structuring elements consistentwith thewater body classi-fication attributes used in the EUWater Framework Directive (EUWFD,2000). The first element is the ecoregionwhich sets out the broadest cli-matic, physiographic and dominant biomes. Landscape setting estab-lishes the specific characteristics in terms of hydro-climatic factorssuch as continentality, the elevation of the lake and its catchment (e.g.whether montane, piedmont or lowland) and biodiversity characteris-tics. The lake-catchment relation captures the relative importance of‘catchment’ versus ‘lake’ processes in relation to water, sediment andnutrient budgets, including the critical role of autochthonous versus al-lochthonous carbon fluxes (cf. Tranvik et al., 2009; Kutser et al., 2015).Finally, lake morphometry (size, shape, orientation, water depth, etc.)governs lake processes and characteristics such as mixing regime, resi-dence time, shore zone energetics and riparian habitats (Hutchinson,1957).Untangling the effects of multiple pressures on lake structure andfunction, and determining the environmental pressures that will havethe largest effect on a given lake or lake type, is a challenge that requiresmulti-scale observations of a suite of functionally relevant and reliableindicators of lake ecosystem condition for a larger number of lakesthan has been possible with traditional monitoring. Remote sensingprovides a plethora of datasets and products that, in combination withancillary data (e.g. in situ measurements and observations, modelleddata), can be used to improve our understanding of lake system re-sponse to climate and non-climate pressures within a catchment. Forexample, land cover/use (and consequently trends in the ripariandevel-opment of a lakeshore), soilmoisture and elevation are, amongst others,standard remote sensing products, whilst water balance modellingtechniques have recently assimilated remotely sensed information onclimatic variables (e.g. evapotranspiration, precipitation and land sur-face temperature), soil moisture and vegetation properties. Taking thecatchment of Lake Balaton (the largest freshwater bodywithin the Dan-ube Basin) as an example, we hereby present examples of globaldatasets that are available from various sources at varying temporalfrequencies, time periods and spatial resolutions (Fig. 2, Table 2), andwhich are often used as catchment indicators of lake change. The nextsections review the applicability of remote sensing in deriving some ofthese products in the realm of limnological research at catchment-wide scales across the globe, and specifically in the Danube Basin.3. Catchment water balanceIn recent decades the combined effects of economic growth and rap-idly increasing global human population has led to increased demandfor freshwater, which in turn has resulted in the intensification ofwater withdrawal from surface freshwater bodies and groundwaterpools. Human activities have caused global water scarcity, particularlyin arid and semi-arid regions, where overuse of natural water resourceshas taken place (Wada et al., 2011). At the global scale agriculture is themain water consumer with over 75% of abstractions, far outweighingthe amounts used for industrial (20%) or domestic purposes (5%)(FAO, 2014; UNEP, 2008). However, significant regional variations alsoexist reflecting local climate and physiographic features (Shiklomanov,2000), imprinting an often complex picture of change when trying toassess the strong impact that global climate change has on freshwatersupplies (WWAP, 2012). Determining the extent and severity of im-pacts of human activities and climate change on water resources acrossthe globe, particularly in ungauged basins, has hitherto been a majorissue. This has often been addressed through water balance modellingthat can generate spatial and temporal variations of water availabilityin lake catchments and river basins, and thus contribute towards themanagement of water resources from local to global scales (Mitsova,2014).In principle, water balance models take into account the amount ofwater input through precipitation and snowmelt, and the amount ofwater output through evaporation, transpiration, surface (includingriver) runoff, groundwater discharge and percolation. There exist nu-merous water balance models, one of the earlier and more simplisticbeing the Thornthwaite and Mather (TM) model (Thornthwaite andFig. 1. Landscape limnology framework connecting local and regional lake characteristics with examples of globally available datasets and EO products (after Soranno et al., 2009). JAXAGSMaP_NRT (Japan Aerospace Exploration Agency Global SatelliteMapping of Precipitation in Near-Real-Time); ECMWF ERA-40 (European Centre forMedium-RangeWeather Forecasts40-year re-analysis model data); GRACE (NASA/DLR's Gravity Recovery and Climate Experiment); HydroSHEDS (WorldWildlife Fund Hydrological data and maps based on SHuttle Ele-vation Derivatives at multiple Scales); GLiM (Global Lithological Map database); UK NERC GloboLakes (United Kingdom Natural Environment Research Council GloboLakes project);HWSD (Harmonised World Soil Database); gROADS (Global Roads Open Access Data Set); GRanD (Global Reservoir and Dam database); ESA CCI LC (European Space Agency ClimateChange Initiative Land Cover).3E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136Mather, 1955, 1957), a revision of an earlier model by Thornthwaite(1948), which requires precipitation, air temperature and latitude toproduce estimates of evapotranspiration, soil moisture storage, snowstorage, surplus and runoff (McCabe andMarkstrom, 2007).Many stud-ies have since developed new or modified existing water balancemodels for use in different applications and at various spatio-temporalscales and the reader is referred to Xu and Singh (1998, 2004) andBoughton (2005) for comprehensive reviews of various water balancemodelling techniques.A key requirement of large hydrological systems, such as theDanubeBasin, is that thesewater balance techniques andmodels must be appli-cable to regional or even continental scales, which is potentially whereremote sensing can have a part to play. At a continental scale applicablewater balance models include FAO AQUASTAT (2001) that was devel-oped to map agricultural water use in Africa, WaterGAP that simulatesglobal water availability and use in large drainage basins (Döll et al.,2003; Alcamo et al., 2003) and GWAVA that models global water avail-ability with demonstrable applications in Africa, South America and Eu-rope (Meigh et al., 1999). In addition, the European Union Water andGlobal Change (WATCH) project created a multi-model ensemblebringing together nine large-scale hydrological models to comparetheir ability to capturemean annual runoff and quantify the uncertaintyrelated to themodelling outputs. It was found that even though the per-formance of each individual WATCH model differed, their ensemblemean produced reliable estimates of runoff in European catchments(Gudmundsson et al., 2012a, 2012b).The application of water balance modelling specifically within theDanube Basin in thepast has tended tomakeuse of historicweather sta-tion measurements and simulation data as input parameters (e.g.Mauser and Bach, 2009; Petrovič et al., 2010; Klein et al., 2011; Klinget al., 2012) rather than making direct use of remote sensing observa-tions. However, the GLOWA project (Global Change of the water cycle;funded by the German Ministry of Research and Education (BMBF)) isan example of one such initiative that exemplified the potential of re-mote sensing to address the impact of global change on regional waterresources. Within this initiative is included the GLOWA-Danube project(dedicated to theUpperDanubewatershed) that aims to investigate thesustainability of future water use using modelling techniques (Ludwiget al., 2003a). Within the GLOWA-Danube framework satellite-re-trieved land cover information was used in a physically-based waterbalance model to provide spatio-temporal estimates of evapotranspira-tion, soil moisture, snow cover and runoff (Ludwig et al., 2003b). Thestudy combined multi-temporal coarse spatial resolution NOAAAVHRR images and spectral unmixing techniques to produce sub-pixelland cover information at the fine scales required for the detailed de-scription of various hydrological processes, and showed that the ap-proach produced improved model results compared to the use ofconventionally used land cover data (e.g. CORINE maps).3.1. Role of remote sensing in water balance studiesWater balancemodels require a variety of data ranging from climaticvariables to information on soil and vegetation properties. Remote sens-ing has the potential to produce some of this information at largeenough spatial and temporal scales to fulfil the need for continuouswater resource monitoring applications at scales varying from local toglobal (Xu et al., 2014) and it is not uncommon for a combination of re-mote sensing sensors to be used in hydrological modelling and waterbalance applications (e.g. Awange et al., 2008; Milzow et al., 2011).Even though remotely sensed observations complement in situTable 1WFD compliant eco-geomorphic framework for contextualising lake behaviour.Adapted from Rowan (2010).4 E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136observations in providing data inputs for water balancemodelling tech-niques, its potentialwas realisedmore than four decades ago. For exam-ple, evapotranspiration estimations based on remotely sensed canopytemperatures date back to the 1970s (e.g. Stone and Horton, 1974;Blad and Rosenberg, 1976; Heilman et al., 1976; Jensen and Chery,1980), as does the estimation of remotely sensed soil water content,also known as soil moisture (Wang and Qu, 2009) and the mapping ofsnow cover (e.g. Kyle et al., 1978). On the other hand, precipitationFig. 2. Examples of climate and non-climate datasets depicting lake pressure attributes in the catchment of Lake Balaton. SRTM90m (Shuttle Radar Topography Mission at 90 m spatialresolution); gROADS (Global Roads Open Access Data Set); TEOW (Terrestrial Ecoregions of the World); GRanD (Global Reservoir and Dam database); HWSD (Harmonised World SoilDatabase); GLiM (Global Lithological Map database); IMF (International Monetary Fund); FAO (Food and Agriculture Organisation); NOAA (National Oceanic and Atmospheric Adminis-tration); AVHRR (Advanced VeryHigh Resolution Radiometer); NDVI (NormalisedDifference Vegetation Index); ECMWF ERA-40 (European Centre forMedium-RangeWeather Forecasts40-year re-analysismodel data); ESA GlobCover (European Space Agency Global Land Cover product); CRU (Climatic Research Unit); SEDAC (Socioeconomic Data & Applications Center);CIESIN (Center for International Earth Science Information Network).Table 2Examples of global data sources for deriving catchment attributes (period(s) of projected values are shown in square brackets).Dataset/database Product parameter(s) Time period Format UnitsSpatialresolutionHarmonised World Soil Database (HWSD) Soil type 2008 Raster SMU 1 kmGlobal Lithological Map Database (GLiM) Geology 2012 Raster – 62.5 kmGlobal Reservoir and Dam Database v.1.1 (GRanD) Location and age of dams; spatial extent ofreservoirs2011 Vector – –Terrestrial Ecoregions of the World (TEOW) 16 ecoregions 2001 Polygons – –HydroSHEDS (USGS) River network 2008 Vector – 1 kmGridded Population of the World v.3 (GPWv3) Population density 1990, 1995, 2000, [2005],[2010], [2015]Raster Persons perkm25 kmShuttle Radar Topography Mission v.4.1 (SRTM90m) DEM (elevation) 2008 Raster m 90 mClimatic Research Unit Time Series v.3.21 (CRU TS 3.21) Precipitation 1901–2012; monthly NetCDF mm 62.5 kmPotential evapotranspiration mmTemperature 10 × °CEuropean Centre for Medium-Range Weather Forecasts(ECMWF) ERA-40Runoff Sep 1957–Aug. 2002;monthlyNetCDF m/day ~15 kmGlobal Roads Open Access Data Set (gROADSv1) Road network 1980–2010 Vector – –European Space Agency (ESA) Climate Change Initiative(CCI) Land Cover (LC)Land cover 1998–2002, 2003–2007,2008–2012Raster – 300 mGridded Livestock of the World (FAO, Food andAgriculture Organisation)Cattle, poultry, buffalo, goat, pig, sheep 2000, 2005 Raster Animals perkm25 kmFertilisers (FAO) Nitrogen & phosphate 2002–2010; annual csv Tonnes per1000 ha–Irrigated land (actual & potential) (FAO) Agricultural area irrigated; Total areaequipped for irrigation1961–2011; annual csv 1000 ha –Gross Domestic Product (GDP) per capita, InternationalMonetary Fund (IMF)GDP per capita 1980–[2018]; annual csv $ (USD) –5E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136can be estimated using remotely sensed data and various global prod-ucts already exist, but their use in water balance modelling has only re-cently been realised (e.g. Pereira-Cardenal et al., 2011). Finally, there areno remote sensing products for air temperature, however Deus et al.(2013) propose the use of remotely sensed land surface temperature(LST) as a substitute for air temperature in water balance modelling,and several methods incorporate LST to estimate evapotranspiration(Verstraeten et al., 2008). Whilst Xu et al. (2014) and Karimi andBastiaanssen (2015) provide excellent reviews on the integration of re-motely sensed observations to hydrologicmodelling in general, herewebriefly review the status of remote sensing as a sources of functional in-formation to understand the role of the catchment in changing lakebehaviours.3.2. Remote sensing sensors, scales and products3.2.1. Evapotranspiration (ET)Remote sensing is a promising tool for the representation of the spa-tial distribution of evapotranspiration (ET) across large spatial scales,which is required for distributed water balance modelling (Glenn etal., 2007). Several approaches have been proposed in the literature,commonly using optical and thermal data, and less frequently satellitemicrowave data. There are two types of methods that are used to esti-mate ET from remote sensing data; empirical and physical models. Em-pirical or statistical relationships make use of remotely sensedvegetation indices, such as the normalised difference vegetation index(NDVI) or the soil-adjusted vegetation index (SAVI) (Glenn et al.,2007), which are based on the fraction of the ground area covered orshaded by vegetation (Pereira et al., 2015). However, these methodsare insensitive to conditions of water or salinity stress, which is nottrue for physical models (Pereira et al., 2015). Physical or analyticalmodels solve the surface energy balance (SEB) equation using land sur-face temperature (LST) estimates based on remote sensing observa-tions. The advantage of SEB models is that they can be used toestimate ET in areas with diverse vegetation types and heterogeneousvegetation cover (e.g. Minacapilli et al., 2009; Pôças et al., 2013). Thereader can refer to, for example, Glenn et al. (2007), Verstraeten et al.(2008), Kalma et al. (2008), Pereira et al. (2015) and Karimi andBastiaanssen (2015) for detailed reviews of ET estimation methodsbased on remote sensing data.The utility of remote sensing inwater balancemodelling, and partic-ularly in the estimation of ET, depends on the specifications of the sen-sor and the cloud conditions (Kalma et al. 2008). Medium spatialresolution sensors, such as the Advanced Spaceborne Thermal Emissionand Reflection Radiometer (ASTER) on-board the Terra satellite and theThematic Mapper (TM), Enhanced TM (ETM+) and Operational LandImager (OLI) on-board the Landsat series have a 16-day revisit capabil-ity, which means temporal interpolation techniques are needed to pro-vide the daily inputs often required for hydrological models. However,ASTER has a spatial resolution of 15m in the visible and NIRwavebandsand 90 m in the TIR wavebands, while OLI offers a pixel size of 30 m inthe visible and NIR and 100 m in the TIR, which in many cases aroundthe globe and particularly within the Danube Basin, makes them suit-able for mapping individual agricultural fields and smaller land parcels(Pereira et al., 2015). On the other hand, the Terra/Aqua Moderate Res-olution Imaging Spectrometer (MODIS) and NOAA Advanced Very HighResolution Radiometer (AVHRR) provide daily observations dependingon cloud cover at a spatial resolution of 1 km. Both MODIS and NOAAAVHRR can provide LST estimates with an accuracy of 1.0 °C at 1 kmor 5 km spatial resolution (Glenn et al., 2007) and less than 1.3 °C at4.4 km (Pinheiro et al., 2006), respectively. Finally, geostationary satel-lites at relatively coarse (1–5 km) spatial resolutions in the visible andTIR have very frequent revisit times (15–30 min) and could be used toderive LST, however their constant viewing angle introduces problemsat high latitudes which limits their global applicability (Diak et al.,2004).Overall, whilst the above illustrate the potential of remote sensing toprovide reliable information on ET, its practical application inwater bal-ance modelling has often been hindered by concerns over accuracy. AsKarimi and Bastiaanssen (2015) note, the reliability of remotely-sensedderived ET is often case and location specific, but the ensemblemean ETproducts currently under development may be a significant step to-wards addressing these concerns.3.2.2. Soil moistureThe most common method for the retrieval of soil moisture is theuse of microwave remote sensing sensors, both active and passive,and dates back to the 1970s (e.g. Eagleman and Ulaby, 1975;Schmugge et al., 1974; Njoku and Kong, 1977; Mo et al., 1982). Remote-ly sensed soil moisture can only be estimated in the uppermost layer ofthe soil surface (i.e. top few centimetres), but assimilation of these ob-servations within Soil-Vegetation-Atmosphere Transfer (SVAT) modelshelps retrieve soil moisture in the root zone (Wigneron et al., 2003),which is a key variable in hydrological modelling (e.g. Wilker et al.,2006; Seneviratne et al., 2010).There are many different surface soil moisture retrieval techniquesthat have been proposed in the literature, some used to derive globalproducts, and these can be both empirical and physically-based (deJeu et al., 2008; Vereecken et al., 2008). While passive microwave sen-sors (radiometers) detect microwave radiation that is naturally emittedby the Earth's surface, active microwave sensors (RADAR) transmit anelectromagnetic pulse and measure the scattered microwave energyback from the Earth surface. The success of microwave sensors in mea-suring soilmoisture lies in the fact that changes in the soil dielectric con-stant due to changes in water content are detectable, particularly atlow-frequency microwave regions (1–10 GHz) (e.g. Njoku and Kong,1977;Wagner et al., 2007; de Jeu et al., 2008). Amajor advantage of mi-crowave remote sensing is that can it be used day and night regardlessof cloud cover. A limitation is that dense vegetation cover and soilroughness introduce noise to soil moisture measurements (e.g.Wagner et al., 2007; de Jeu et al., 2008; Seneviratne et al., 2010), butlow-frequency microwave bands have been found to reduce this effect(Schmugge et al., 2002; Njoku et al., 2003). In addition, a recent studyin the Upper Danube basin demonstrated that soil moisture retrieval er-rors can be spatially diverse due to different factors (e.g. land surfaceheterogeneity) that introduce noise in the remote sensing observations,and that the retrieval accuracy strongly depends on the scale of observa-tion (Loew, 2008).Microwave instruments used in soil moisture retrieval include thenon-operational Nimbus 7 Scanning Multichannel Microwave Radiom-eter (SMMR) (27–148 km spatial resolution), and Aqua Advanced Mi-crowave Scanning Radiometer-EOS (AMSR-E) (38–56 km) for whichglobal soil moisture products exist (e.g. Njoku et al., 2003; Owe et al.,2008). The F-series Special Sensor Microwave Imager (SSM/I) and Spe-cial Sensor Microwave Imager Sounder (SSMIS) lack low-frequencywavebands that are desired for soil moisture retrieval. Nevertheless,soil moisture retrieval methods based on SSM/I data have been pro-posed in the literature (e.g. Jackson et al., 2002; Wen et al., 2005). Therelatively high-frequency TRMM TMI and WindSat radiometer datahave also been used for the retrieval of soil moisture datasets (e.g.Bindlish et al., 2003; Gao et al., 2006; Parinussa et al., 2012). ESA's SoilMoisture and Oceanic Salinity (SMOS) (30–50 km spatial resolution)was launched in 2009 and employs an L-band, which offers deeper veg-etation penetration making it potentially more reliable over denselyvegetated regions (Seneviratne et al., 2010). Within the upper Danuberegion initial results on the validation of soil moisture products sug-gested that radio-frequency interference can be a problem (dall'Amicoet al., 2012) but that the spatial pattern of soil moisture variability wassimilar to in situ measurements, even if SMOS tended to generally un-derestimate soil moisture (Schlenz et al., 2012).Radar scatterometers can also be suitable for the retrieval of soilmoisture, depending on the frequency they operate in (Seneviratne et6 E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136al., 2010). These include ESA's ERS-1/2 Advanced Microwave Instru-ment Scatterometer (AMI-SCAT) (50 km spatial resolution) and theMETOP-A/B/C Advanced Scatterometer (ASCAT) (50 km) (Wagner etal., 2003; Bartalis et al., 2007). Finally, NASA's Soil Moisture Active andPassive (SMAP)mission carries on-board active and passive L-band sen-sors and was launched on the 31st January 2015. The mission is de-signed to collect global observations of soil moisture at a spatialresolution of 9 km, with a revisit time of 2–3 days.Soil moisture itself is a Global Climate Observing System (GCOS) Es-sential Climate Variable (ECV) and ESA's Climate Change Initiative (CCI)programme has funded the creation of a more than 30-year long soilmoisture dataset by merging active (ERS AMI-SCAT and METOPASCAT) and passive (SMMR, SSM/I, TMI, and AMSR-E) soil moisture re-trievals (Wagner et al., 2012). This product at 0.25° spatial resolutionaims to address the discrepancies that have been observed (e.g.Reichle et al., 2007; Rüdiger et al., 2009) between different products de-veloped for different (or the same) microwave sensors.Other sensors that have been used in the retrieval of soilmoisture in-clude gravity recovery instruments (Seneviratne et al., 2010) and evenglobal positioning system (GPS) receivers (Larson et al., 2008). Seasonalvariations in terrestrial water content (TWC), including soil moisture,groundwater, snow and surface water, result in variations of the Earth'sgravity field, which can be accurately measured with NASA/DLR's Grav-ity Recovery and Climate Experiment (GRACE) (e.g. Tapley et al., 2004;Wahr et al., 2004; Andersen et al., 2005; Swenson et al., 2008; Rodell etal., 2009). However, separation of the soil moisture contribution to thetotal observed terrestrial water content requires knowledge of theother TWC components, making this technique complex and relianton additional data being available. In addition, any estimates can onlybe done at much coarser spatial resolutions (at best 400 km) thanthose offered by microwave remote sensing. GPS satellite receiversuse L-band frequencies, similar to the SMOS and SMAP sensors, andhave shown the potential to estimate soil moisture at spatial resolutionsof circa 300m, but the effects of ground roughness and of different veg-etation and soil types, requires further investigation (Larson et al.,2008). The reader is referred to Schmugge et al. (2002), Wigneron etal. (2003), de Jeu et al. (2008) and Seneviratne et al. (2010) for excellentreviews on the remote sensing of soil moisture.3.2.3. PrecipitationPrecipitation estimates with remote sensing can be generated usingboth in situ radar systems and space-borne sensors. Michaelides et al.(2009) and Tapiador et al. (2012) provide excellent reviews of remotesensing techniques for precipitation measurements. Typically, singlepolarisation weather radar systems have been used to derive rainfallrate, but limitations such as calibration issues and contamination byground returns amongst others make them less than ideal for precipita-tion mapping. Recent technological advances have led to the develop-ment of more suitable polarimetric radar systems (also referred to asdual-polarisation radars) that overcome some of the limitations at-tached to single polarisation weather radars (Michaelides et al., 2009).For about three decades, rainfall has been retrieved from satellite instru-ments employing the visible, infrared and microwave regions of thespectrum. However, most of the satellite observations are discardeddue to cloud contamination and issues with the variability of emissivityover land-water areas and especially in coastal areas. Another limitationis the coarse spatial resolution of the satellite sensors that ranges from10 km2 over land to 50 km2 over the ocean, and the common assump-tion that rainfall is horizontally and vertically homogeneous.According to Stephens and Kummerow (2007) the optimal ap-proach to retrieve precipitation from space is by combining data frompassive and active sensors. A major step towards this direction wasmade with the launch in 1997 of the space-borne Tropical Rainfall Mea-suring Mission (TRMM) that carries on-board two primary rainfall sen-sors; the 13.8 GHz Precipitation Radar (PR) and the TRMMMicrowaveImager (TMI). Numerous algorithms for the retrieval of rainfall fromTRMM data have since been developed (e.g., Iguchi et al., 2000;Haddad et al., 1997), leading to the TRMM PR 2A25 and TRMM TMI2A12 rainfall products. However, these two products exhibit spatialand seasonal differences that have yet to be explained (Wang et al.,2009) and are geographically limited to latitudes between 35°N–35°S.A third sensor on-board TRMM, the Visible and Infrared Radiometer(VIRS) can only provide indirect estimations of rainfall bymeans of pre-cipitation indices.Even thoughmost available precipitation retrievalmethods focus onrainfall rather than snowfall, high-frequency passive microwavewavebands (e.g. on AMSU) can provide snow detection and frozen pre-cipitation estimations (Kongoli et al., 2004; Vila et al., 2007;Michaelideset al., 2009). In fact, the Microwave Surface and Precipitation ProductsSystem (MSPPS) (now Microwave Integrated Retrieval System(MIRS)) is a suite of operational global products derived from theNOAA Advanced Microwave Sounding Unit (AMSU), including precipi-tation rate, total precipitable water and snow cover (Ferraro et al.,2005; Vila et al., 2007).The need for uniformly calibrated precipitation products that are in-dependent of variation caused by different sensors is to be addressed bythe international Global Precipitation Measurement (GPM) mission,which employs a constellation of passive microwave sensors. The GPMaims to provide high resolution satellite precipitation products every2–3 h for use in various applications, such as hydrology and climaticstudies. Building on the capabilities of the TRMM PR and TMI, theGPM-Core Observatory, which was launched in February 2014, coverslatitudes between 65°N–65°S and contributes to the GPM constellationof sensors that combined cover the entire globewith datasets (Levels 0–3) freely available online. A global dataset for satellite-derived rainfall isthe Global Satellite Mapping of Precipitation in Near-Real-Time(GSMaP_NRT) by the Japan Aerospace Exploration Agency (JAXA) Glob-al Rainfall Watch System (Ver. 3.0), which provides global (60°N–60°S)rainfall rate (mm/h) at hourly intervals by combining various remotesensing data, including the GPM-Core Microwave Imager (GMI),TRMM TMI, DMSP (Defence Meteorological Satellite Programme)SSMIS, NOAA AMSU and METOP AMSU.3.2.4. Snow coverBoth optical andmicrowave remote sensing are used for snow covermapping. Even though optical remote sensing is limited to mappingsnow extent, much more information can be derived from microwavedata; this includes snow water equivalent (SWE; mass of water perunit area), snow depth (SD) (a relevant measurement because of its re-lationship to SWE), snow extent, and snow state (wet/dry). The use ofoptical data is based on the fact that snow reflects radiation stronglyin the visible and very poorly in the NIR regions of the EM spectrum.Dozier (1989) mapped snow using the ratio of Landsat TM reflectancein the visible and NIR, a technique that had been previously used inthe 1970s (e.g. Kyle et al., 1978) and was later adapted to develop thenormalised-difference snow index (NDSI) for MODIS (Hall et al., 2002;Hall and Riggs, 2007) and Landsat ETM+ (Salomonson and Appel,2004). NOAA AVHRR has also been used to map snow cover (e.g.Gesell, 1989; Voigt et al., 1999; Akyürek and Şorman, 2002;Matikainen et al., 2002; Hüsler et al., 2012) despite its coarse spatial res-olution (1 km), because it has a longdata archive and a very frequent re-visit time (twice daily). A limitation of using optical data to map snowcover is that it is often difficult to separate clouds from snow, becausesnow may show a similar spectral response to clouds in the visibleand TIR (Akyürek and Şorman, 2002; Miller et al., 2005). Another chal-lenge is that the reflectance of snow decreases with impurity and age(seasonal and even daily ageing) (König et al., 2001; Dietz et al., 2012)and vegetation (resulting in surface heterogeneity) might also affectthe reflected signal (Nolin, 2010).Snow attenuatesmicrowave radiation,which is positively correlatedwith the amount of snow in the snowpack (Chang et al., 1987; König etal., 2001; Clifford, 2010). In a similar manner to soils, the dielectric7E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136Table 3Linkage between selected catchment/landscape features, fluvial processes, ecosystems services and their detection with remote sensing. (builds on Andrew et al., 2014; Large and Gilvear, 2014). Indicativemeans the list is not exhaustive.Catchment feature,or land coverInferred processesand characteristicsEcosystem functions Ecosystem services (indicative) RS products (required) Remote sensing source (indicative)CatchmentdelineationCatchment area, morphometry and hydrodynamic behaviour Range of freshwater and terrestrialhabitatsWater quantity and quality;seasonalityTopography DEM derived from varied sources,including LiDAR, RADAR,UAV-based photography and aerialphotographySlope Low slopes reduce energy gradient for transfer of water, sediment &nutrients, promoting storage and biogeochemical processing;reworking of sediment in active reachesHydraulic diversity; channeldynamism; habitat creation;sediment storage; habitatheterogeneity; increased wettedperimeterFlood mitigation; water quality Topography DEM derived from varied sources,including LiDAR, RADAR,UAV-based photography and aerialphotographyCatchment waterbalance and waterlevel fluctuationsWater dynamics, quantity, quality and provenance of water andsediment runoff controlling biogeochemical processes includingnutrient flux; snow accumulation; runoff volumes and timings;groundwater recharge and connectivity within alluvial flatlands;seasonal variations in water levels; movement of migratory species;crop phenologyProvisioning; supporting andregulating; cultural climateregulation; removal of pollutants;fish productionWater supply; biodiversity;carbon sequestration; floodmitigation and regulation;migratory species; tourismEvapotranspirationPrecipitationSoil moistureWater, snow/ice extentand durationWater levelGroundwaterThermal RS, VIs, climate dataRADAR, PMRADAR (e.g. SMAP)Optical, RADAR, PMRADAR altimetryGravity surveys, subsidenceHyporheic zonesand groundwaterLinks to water flow and water quality in surface waters Groundwater dependent terrestrialecosystems including wetlandsWater supply;Flood mitigation and regulation;Biogeochemical filtration;biodiversityLand cover mapSpecies map, spectraldiversityMultispectral and multitemporalRS, HS.Range or variability ofbiochemistry, spectral indices orreflectance variationHydromorphologicalalterationElimination of flood inundation; loss of channel dynamism; alteredsupply of sediment & nutrientsLoss of natural land cover;hydrological alteration; habitatchangeNone Land coverFeature extraction (e.g.embankment length,presence of dams etc)Multispectral RS, HSRiparian/river bankwoodlandShading, allochthonous leaf litter and woody debris input Habitat creation and hydraulicdiversity; cooling of water, foodsourceBiodiversity; fisheries Spectral diversityProxy indicators (e.g.canopy structure,productivity, gap fraction)Range or variability ofbiochemistry, spectral indices orreflectance variationVaried e.g. LiDAR, Multispectral, HS,HY, multi-temporal RSFloodplain physicalhabitat mosaicHydromorphological heterogeneity and channel dynamism; variedland use patternsRange of freshwater-terrestrialhabitats; ecotone creationBiodiversity; fisheries Spectral diversity, speciesmap, land cover map, LAI,biomassRange or variability ofbiochemistry, spectral indices orreflectance variation, LiDAR, imagetexture, Multispectral, HS, HY8E.Politietal./ScienceoftheTotalEnvironmentxxx(2015)xxx–xxxPleasecitethisarticleas:Politi,E.,etal.,Assessingtheutilityofgeospatialtechnologiestoinvestigateenvironmentalchangewithinlakesystems,SciTotalEnviron(2015),http://dx.doi.org/10.1016/j.scitotenv.2015.09.136CatchmentdisturbancePotential for changing hydrological regime, channel dynamism,nutrient cycling, water quality, biodiversityPotential loss/degradation of naturalland cover; hydrological alterationChanged natural ecosystemservicesChange in biomass/planttraitsPlant stressFire detectionDrought monitoringMulti-temporal RSVIs, HYThermal anomalies, fire products(e.g. MODIS)Water content, surface temperature& ETWetlands Plant and animal succession processes; enhanced nutrient cycling andstorage; semi-aquatic habitatsCarbon sequestration, phosphorousuptake and denitrification; habitatheterogeneity; flow attenuation;refugiaWater supply; water quality;biodiversityLand cover mapSpecies map; spectraldiversityMultispectral and multitemporalRS, HS.Range or variability ofbiochemistry, spectral indices orreflectance variationFloodplain forest Substrate stabilisation; enhanced hydraulic processes Flow attenuation, enhanced nutrientcycling and storage; habitatheterogeneityCarbon sequestration; floodmitigation; biodiversity; waterqualityLand cover map; biomass Multispectral and multitemporalRS, HSFloodplain lakes Water storage; nutrient cycling Refugia; habitat heterogeneity Water supply; carbonsequestration; water quality;fisheries; biodiversityLand cover mapWater colour(phytoplankton,suspended matter, CDOM)and water clarity, LWST,ice coverMultispectral and multitemporalRS, HS.Spectral analysis, multispectral RS.Thermal RSAgriculture Potential for increased runoff; enhanced sediment input; water qualitydeteriorationLoss of natural land cover;hydrological alterationNatural ecosystem servicesreduced with increased cropproductionLand cover map, LAI Multispectral and multitemporalRS, HS, HY, LiDARWoodlandplantationSubstrate stabilisation; enhanced hydraulic roughness Flow attenuation; biomass increase Timber production; floodmitigationLand cover map, biomass Multispectral and multitemporalRS, HS, HY, LiDARUrban areas Potential for increased runoff and water quality deterioration Loss of natural land cover;hydrological alterationNone Land cover map Multispectral and multitemporalRS, HSLiDAR (Light Detection and Ranging);MS (Multispectral, e.g. Landsat ThematicMapper); HS (High spatial resolution imagery (e.g.WorldView-3, Google Earth); HY (hyperspectral imagery/data); PM (passivemicrowave); VIs (vegetation indices); ET(evapotranspiration); CDOM (coloured dissolved organic matter); LWST (lake water surface temperature).9E.Politietal./ScienceoftheTotalEnvironmentxxx(2015)xxx–xxxPleasecitethisarticleas:Politi,E.,etal.,Assessingtheutilityofgeospatialtechnologiestoinvestigateenvironmentalchangewithinlakesystems,SciTotalEnviron(2015),http://dx.doi.org/10.1016/j.scitotenv.2015.09.136constants of ice and water are very different, which enables the use ofmicrowave remote sensing to map snow. The depth of snow that canbe mapped depends on the microwave wavelength; ranging from aminimum of around 2 cm (Dietz et al., 2012) to a maximum of 100times themicrowavewavelength (Clifford, 2010). Inmicrowave remotesensing of snow, the size and shape of the snow crystals can affect theestimations (Foster et al., 1999), as well as depth, temperature, snowstate and density (Schmugge et al., 2002). In addition, the presence ofdense vegetation and liquidwater in the snowpack can lead to underes-timation of SD and SWE (Dietz et al., 2012), when passive microwavesensors are used. Using early morning satellite overpasses (local time)can minimise the impact of wet snow on snow mapping (Schmuggeet al., 2002). Alternatively, active microwave remote sensing is moresuitable for mapping wet snow (e.g. Baghdadi et al., 1997; König et al.,2001), with the added bonus of finer spatial resolutions than passivemicrowave satellite sensors.In the 1980s, the US NationalWeather Service (NWS) developed op-erational remote sensing products for snow hydrology, using NOAAAVHRR and GOES to produce periodic river basin snow cover extentmaps (Schmugge et al., 2002) and since 2002 the Aqua AMSR-E hasbeen used to produce a global SWE Level 3 product. MODIS data havealso been used to derive a suite of snow products at various spatial(500 m–30 km) and temporal (daily-monthly) resolutions. In addition,the snowmelt runoff model (SRM)was adapted to use remotely-sensedsnow cover information at basin-scales (Martinec et al., 2008). Thereader can refer to, for example, König et al. (2001), Schmugge et al.(2002), Clifford (2010), Nolin (2010) and Dietz et al. (2012) for moredetailed reviews on the remote sensing of snow cover.3.2.5. Land surface temperature (LST)Atmospherically corrected brightness temperature retrieved usingremote sensing thermal sensors are used in land surface temperatureretrieval. There are three techniques for the retrieval of LST from remotesensing data; single channel, generalised split window (GSW) and dualangle (or dual algorithm) (DA) approach. The single channelmethod re-quires a comprehensive radiative transfer model and atmospheric pro-files. The split window approach, combines two thermal wavebandsand accounts for atmospheric effects based on the differential absorp-tion in adjacent infrared bands. However, because of the large emissiv-ity differences between thermal wavebands over land due tovegetation, topography and soil, this method can be problematic. Landsurface emissivity studies have been conducted to overcome this prob-lem and various techniques have been proposed in the literature forNOAA AVHRR and Terra/Aqua MODIS (e.g. Wan and Dozier, 1996;Becker and Li, 1990; Mao et al., 2005; Pinheiro et al., 2006), (A)ATSR(e.g. Sòria and Sobrino, 2007; Galve et al., 2009) and MSG Spinning En-hanced Visible and Infrared Imager (SEVIRI) (e.g. Jiang and Li, 2008;Qian et al., 2013; Freitas et al., 2013). The Terra/Aqua MOD11 LST prod-uct uses a split-window approach that utilises thermal bands 31 and 32.The dual angle approach is based on the differential absorption of a sin-gle waveband due to different viewing angles. In order to apply thistechnique two scenes simultaneously acquired by different satellites,e.g. the geostationaryMSG and polar-orbiting Television InfraredObser-vation Satellites (TIROS-series) (Chédin et al., 1982) or a single scenefrom a satellite withmulti-angle acquisition capability, such as the (Ad-vanced) Along-Track Scanning Radiometer ((A)ATSR) on-boardEnvisat, can be used. The second option is more commonly employedusing (A)ATSR data (e.g. Kustas and Norman, 1997; Sobrino et al.,1996, 2004; Sòria and Sobrino, 2007) or GOES andMultifunction Trans-port Satellite (MTSAT) data (Freitas et al., 2013). Finally, a robust empir-ical technique has been developed specifically for the Terra AdvancedSpaceborne Thermal Emission and Reflection Radiometer (ASTER); theTemperature Emissivity Separation (TES) algorithm (Gillespie et al.,1998) that uses ASTER TIR wavebands to estimate LST. The two mainadvantages of using Terra ASTER for LST retrievals are its fine spatial res-olution (90 m) and more frequent revisit capability (twice daily)compared to other thermal sensors (e.g. NOAA AVHRR, (A)ATSR,MODIS, etc.).Even thoughmostly thermal sensors are used in LST-retrievals, thereexist a few studies where passive microwave sensors were employed(Tomlinson et al., 2011), which have the advantage of providing mea-surements even on cloudy days. Despite the coarse spatial resolutionof passive microwave sensors (5–70 km depending on frequency), theAMSR-E (Chen et al., 2011) and more commonly the SSM/I (e.g.McFarland et al., 1990; Basist et al., 1998; Peterson et al., 2000;Williams et al., 2000; Fily et al., 2003) have been used to estimate LST.For examples of in-depth reviews on the remote sensing of land surfacetemperature, the reader can refer to Prata et al. (1995), Dash et al.(2001), Schmugge et al. (2002), Tomlinson et al. (2011) and Li et al.(2013).4. Mapping catchment land cover and other drivers of lakebehaviourThere are multiple catchment drivers of lake change due to intensi-fication of human activities and climate change. Lakes across the globecan be affected by a combination of different stressors and pressures,based on vicinity to human establishments, type and intensity ofhuman activitieswithin the catchment, type and ratio of natural over al-tered landscape in the catchment, protection status and geographical lo-cation. Human activities such as agriculture, deforestation, urbanisationand industrial activities can be grouped under the umbrella of landcover/land use change (LULC), whichmay have various direct and indi-rect effects on lake water quality, for example increased nutrient load-ing and eutrophication (e.g. Huang et al., 2013; Keatley et al., 2011),pollution (e.g. IJC, 1980), acidification (e.g. Nghiem et al., 2011), anoxicconditions (e.g. Valero-Garcés et al., 2000). The impact of other humanactivities such as tourismand commercialfishing on lake ecosystem sta-tus and ecosystem services is not possible to map and quantify with re-mote sensing unless their impact is measured indirectly. For example,by mapping forest area reduction due to tourism-related development(Chaplin and Babyn, 2013) or estimating epipelagic fish distributionand abundance in shallow waters (Churnside et al., 2003).Despite the potential of remote sensing to provide direct estimationof a wide variety of ecosystem functions and services (cf. those de-scribed above) both Andrew et al. (2014) and de Araujo Barbosa et al.(2015) note that the majority of published studies that have attemptedto map ecosystem functions and services (and by inference relatedcatchment processes) do so using indirect proxies, such as land coverand land use data, derived mainly from remotely sensed sources(Table 3). It is pertinent, therefore, to reflect briefly on how land coverinformation is derived, and more importantly, the limitations and con-siderations to its application for monitoring change in ecosystem func-tions and services of large areas.Perhaps the most common and one of the most basic forms of landcover analysis using remotely sensed data is land cover classification.This relates spectral and textural informationwithin an image to specif-ic land cover classes (as defined by the user) to produce a land covermap, from which land use may be inferred. There are many methodsof image classification, from ‘traditional’ statistically-based per-pixelmethods that assign individual pixels to land cover classes based upontheir spectral response, to object-based approaches which segmentthe landscape into parcels based upon spectral response, shape, textureand other object characteristics. Additionally, a classification may be‘hard’ where pixels are assigned to a single class, or ‘soft’ where pixelsare assigned multiple class memberships. The latter is particularly rele-vant, when information relating to small scale changes in land cover areimportant and where measuring change requires greater precision.More often it is used when the spatial resolution of the instrumentdoes not match the intrinsic scale of land cover heterogeneity withinan area of interest. For example, Probeck et al. (2005) were able to de-rive subscale land cover information from relatively coarse (1 km)10 E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136NOAA AVHRR imagery of the upper Danube by using a fuzzy classifica-tion approach, from which results were produced that comparedfavourably with independent datasets. A similar approach was used byLudwig et al. (2003b). In both cases the fuzzy classification methodused was spectral unmixing but alternatives include the use of artificialneural networks (e.g. Aitkenhead et al., 2008) and other types of ma-chine learning.The methods used to classify remotely sensed data are a field of re-search in themselves, and whilst helpful reviews of the current stateof land cover extraction from remote sensing are available (e.g. Cihlar,2000; Aplin, 2004; Li et al., 2014), the myriad of methods and ap-proaches leads to variability in the land cover map outputs derived byindividual researchers and groups, limiting their wider applicability.To address this, some studies have employed the use of standardisedLULC products (e.g. Table 4). These products tend to be produced froma single satellite sensor, removing variability associated with multiplesensor characteristics. Additionally, products may be single-year ormulti-year products, enabling change to be detected using astandardised set of data characteristics and land cover classes. Thus,the use of a LULC product may reduce some of the uncertainty associat-ed with individuals undertaking a classification exercise in isolation.However, the uptake in use of LULC products has been slow, put downpartly to a lack of awareness but also a lack of confidence in spatial ac-curacy (Pfeifer et al., 2012; Congalton et al., 2014). Most operationalproducts are still restricted to coarse spatial resolution data (Table 4),which whilst providing frequent temporal updates may be a deterrenttowards their use for some ecosystem studies.An additional limitation of LULC analysis is determining a biophysi-cal basis for linking particular LULC classes to ecosystem functions andservices. For individuals and groups undertaking their own classificationthere is often a tension when defining appropriate LULC classes to mapbetween those features and classes that can be extracted from remotelysensed data, i.e. those that are spectrally separable, and those featuresand classes that are directly correlated with ecosystem function and/or catchment processes. The resulting class definitions are, therefore,often a pragmatic solution using features and LULC classes that can bedetected remotely and using these as proxy indicators of the environ-mental variable of interest (e.g. Table 3). These proxies, however, mayhave limited relevance, being often the result of hypothesised but large-ly untested relationships (Andrew et al., 2014; Seppelt et al., 2011) lead-ing to unreliable outputs when compared to field observations (e.g.Eigenbrod et al., 2010). This potentially becomes evenmore problemat-ic when using standardised LULC products, where there are often incon-sistencies in class definitions between products (Congalton et al., 2014)and where different products are produced at different spatial resolu-tions, thus limiting their use as proxy indicators.Also, by assuming that the same ecosystem value can be applied tothe whole of a particular class ignores any scale dependency in ecosys-tem processes and leads to inaccuracies when compared with indepen-dently observed data (Eigenbrod et al., 2010). Thus ecosystem servicesderived from land cover information will be highly dependent uponthe efficacy of linking a land cover class to a particular ecosystemservice/function, the spatial resolution of the data and the accuracy ofimage classification (de Araujo Barbosa et al., 2015).The accuracy of image classification is an important, but often ig-nored factor in determining the reliability of areal change in landcover class(es) derived from a classified map. Change in key indicatorclasses, such as woodland or urban areas, are important in understand-ing changes in lake water quality, habitat and other critical ecosystemservices. However, as Olofsson et al. (2013) effectively argue, informa-tion relating to the accuracy of land cover outputs and products, includ-ing commonly used measures such as overall accuracy and the kappacoefficient, fail to provide enough information to effectively judge theeffect that classification error has on estimates of areal change. To ad-dress this they suggest mapped areas should be adjusted using a strati-fied estimator approach (Olofsson et al., 2013). At the very least, theuncertainty and error associated with the mapping of ecosystem prop-erties should be addressed and reported, with Rocchini et al. (2013)providing a useful summary of good practise for this very purpose.Even when using globally available LULC products the stated accuracyis not always acceptable for the purpose of mapping change(Congalton et al., 2014). Karimi and Bastiaanssen (2015) noted thatthe overall accuracies reported for global land cover maps varied be-tween 69 and 87%, suggesting that such products should be used withcaution in water accounting applications.All of the limitations above suggest that whilst LULC information de-rived from remotely sensed sources has the potential for quantifyingand mapping selected catchment and ecosystem functions and servicesacross large areas, the limitations in terms of applicability (biophysicalbasis of land cover classes), data quality (accuracy) and data properties(spatial and temporal resolution) should be considered carefully whendeciding how such data should be used. Fuller et al. (2003) provide auseful commentary on experiences of mapping the UK with remotelysensed data highlighting the limitations of comparing between prod-ucts, whilst Seppelt et al. (2011) provide a useful review of critical ques-tions that should be raised when reviewing ecosystem serviceassessments at a regional scale, which are directly relevant to remotesensing-based studies.5. Remote sensing of lake level and volumeFinally, whilst this review has thus far focussed on catchment func-tions and characteristics, it is also pertinent to briefly assess the potentialof remote sensing to provide information regarding lakes themselves. Theremote sensing techniques and sensors used to map lake water qualityare reviewed by Tyler et al., in this Special Issue. Remote sensing canalso have a role to play in detecting water bodies (e.g. Verpoorter et al.,2014), and estimating lake water level change and volume.Bothwater level and volume are importantwith respect to lake ecol-ogy, being determinants of water residence time, flushing rate andmixing. They are also highly influenced by human activities, with theconstruction of dams and impoundments, and associated freshwaterwithdrawal for domestic, agricultural and industrial use responsiblefor significantly altering water level (and, thus, volume) in some lakesTable 4Example global land cover datasets suitable for large area land cover analysis.Product Sensor Satellite Spatial resolution Temporal resolutionGLC20001 VGT SPOT 1 km Single date: 2000MCD12Q12 MODIS Aqua, Terra 500 m Annual: 2001–2007ESA CCI-LC3 MERIS ENVISAT 300 mThree epochs: 2008–2012;2003–2007; 1998–2002ESA CCI LC Seasonality(Three products: vegetation, snow cover & burned area)MERIS ENVISAT 300 m Annual1 European Commission (EC) Global Vegetation Monitoring (GVM) Unit Global Land Cover (GLC) 2000 product.2 NASA Land Processes Distributed Active Archive Center (LP DAAC) Land Cover Type product.3 European Space Agency (ESA) Climate Change Initiative (CCI) Land Cover (LC) product.11E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136and reservoirs globally (in Lake Chad, for example). However, not alllakewater level change is caused by direct human intervention. Climatechange and natural climatic fluctuations are also important drivers ofwater level change/fluctuation in freshwater bodies, particularly inclosed lake basins in endorheic regions (Hutchinson, 1957).5.1. Remote sensing of lake water levelWater level change can be retrieved from remote sensing altimetrydata (e.g. Birkett, 1995; Crétaux and Birkett, 2006; Hwang et al., 2011;Mercier et al., 2002; Ponchaut and Cazenave, 1998; Swenson andWahr, 2009) with very high accuracy (e.g. 3–33 cm; Birkett andBeckley, 2010; 25–53 cm; Frappart et al., 2006). Altimeters can beradar (microwave) or laser (visible and IR), but the second are sensitiveto the presence of clouds. They both transmit pulses and receive thereflected signal, so the theoretical basis for measurements is similar(Duan and Bastiaanssen, 2013). Lake surface water level is estimatedby calculating the difference between satellite height in respect to a ref-erence surface (e.g. Earth's centre) and the satellite-to-surface range(calculated by the time taken for the pulse to return to the sensorsince transmission), correcting at the same time for instrumental, atmo-spheric and other effects (Duan and Bastiaanssen, 2013). The disadvan-tage of altimeters is that they can only returnmeasurements from alongtheir track, which does not cover the globe. As a result, only specificwater bodies (that fall into the satellite's track) can be detected. Laser al-timeters such as the Geoscience Laser Altimeter System (GLAS) on-board ICESat (Ice, Cloud, and land Elevation Satellite) are more suitablefor relatively small water bodies due narrower footprint size (~100 m)compared to radar altimeters (several kilometres).Several radar altimeters were until recently or currently operational,including ERS Radar Altimeter (RA) and Envisat RA-2, the Poseidon sen-sors on-board TOPEX/Poseidon, Jason-1 and Jason-2 (or Ocean SurfaceTopographyMission, OSTM), and GeoSat Fellow On (GFO) Radar Altim-eter. These sensors were used to create three distinguished databasesthat include lakewater level estimates: (1) ESA's River and Lake project,(2) US Department of Agriculture (USDA) Global Reservoir and LakeMonitoring (GRLM) programme, and (3) Laboratoire d'Etudes enGéophysique et Océanographie Spatiales (LEGOS) and Geodesy, Ocean-ography and Hydrology from Space (GOHS) Hydroweb. A fourth data-base is based on ICESat laser altimetry; ICESat-GLAS level 2 GlobalLand Surface Altimetry data (ICESat-GLAS). For an excellent overviewof these databases see Duan and Bastiaanssen (2013).5.2. Remote sensing of lake water quantity (volume)Lake water quantity (volume) cannot bemeasured directly from re-mote sensing. Water level information is combined with bathymetricinformation of the water body in order to produce estimates of lake vol-ume. Apart from using traditional sonar techniques, bathymetric mapscan also be produced using GPS and laser transit survey data (e.g.Wilcox and Los Huertos, 2005), and in fact the notion of a laserbathymeter is not new (Muirhead and Cracknell, 1986). To replace theneed for bathymetric predictions, new techniques that make use of vis-ible and IR-based lake surface area estimations have been developed forthe retrieval of lakewater volume (e.g. Duan and Bastiaanssen, 2013; Luet al., 2013). Finally, satellite altimetry-derived water levels of lakes canprovide estimates of lake water volume change, when combined withsatellite or otherwise-derived surface water area (e.g. Becker et al.,2010) or detailed bathymetric maps (Crétaux and Birkett, 2006).6. Observations and conclusionsWe began this review by presenting a suite of datasets (Fig. 2), somederived from remote sensing, that have the potential to capture bothstatus and change in lake catchments. This is presented as a precursorto understanding both the causes and drivers of lake change, andwhich can complement direct observations of lake behaviour by satel-lite remote sensing (Tyler et al., in this issue).Whilst by nomeans an ex-haustive review of the capabilities of remote sensing and geospatialtechnologies in this field, this paper points towards some of the keycatchment variables that can be estimated, both directly and indirectly,as well as the limitations and challenges currently faced.From the work that is reviewed it is clear that remote sensing is animportant tool for mapping ecosystem functions and aiding our under-standing of catchment drivers of lake change, with promising resultsfrequently reported. However, it is also clear that many of the resultsare highly specific to a particular time and/or place, and thus a manifes-tation of the ‘one time one place’ approach identified by Woodcock(2002) as a common cause of uncertainty in the application of remotelysensed data for other applications. Time and again various reviews pointto continued issues with respect to multiple scales, sensors, reliabilityand othermethodological constraints that limit the operational applica-tion of remote sensing for extracting critical ecosystem functions. Manysuggest further work is needed to develop techniques that combinemulti-source information to provide disaggregated products for catch-ment monitoring and modelling.In part a response to these issues, several reviews refer to increasingefforts to integrate information across a variety of sensors and scales,and the development of many standardised remotely sensed products(Andrew et al., 2014, Pfeifer et al., 2012). Issues of spatial and biophys-ical relevancy persist, but with the advent of higher spatial resolutionglobal datasets becoming available (e.g. Hansen and Loveland, 2012)and the introduction of new complementary in situ sensor systems ca-pable of measurements at high temporal and spatial -frequencies(Crawford et al., 2014) at least some of these concerns will continueto be addressed.As stated in our introduction, the future of remote sensing for catch-ment, ecosystem and lake-based studies looks very promising. ESA's Co-pernicus programme will not only include Sentinel's 2 and 3 (whichthemselves will include multiple versions, e.g., Sentinel 3A, 3B and 3C,thereby providing a constellation of ‘observers’) but also includes a C-band SAR sensor on-board Sentinel-1 (launched April 2014) to provideobservations of ice, oil spills and land surface monitoring. Additionally,future missions such as ESA's BIOMASS (planned for 2020) will provideenhanced information on above-ground biomass dynamics at 50m spa-tial resolution, whilst ESA's FLEX (Fluorescence Explorer), Germany'sEnMAP (30 m spatial resolution) and NASA's HYSPIRI (60 m) satellitesensors will allow regional to global assessments of plant biophysicaland biochemical status, biogeochemical cycling, erosion monitoringand ecosystem fragmentation and disturbance. Thus the range ofspaceborne sensors for deriving quantitative estimates of critical eco-system and catchment variables appears to be in good shape lookingforward.In addition to newoptical and SAR sensors described above and else-where in this review, there is clearly much progress in developinggeospatial technologies which will have the potential to revolutionisethe mapping of ecosystem functions. These include the developmentof UAV platforms for low cost, high resolution data gathering, as wellas new hyperspectral sensor technologies and multispectral LiDARthat have the potential for direct estimation of biophysical variables(Woodhouse et al., 2011) and plant traits, removing the need for reli-ance on simple proxies. Furthermore, the existence of platforms that fa-cilitate the use of extensive datasets and long remote sensing archives,such as the Google Earth Engine (GEE) for environmental data analysis,can andwill provide, in part, the necessary infrastructure that the era of‘Big Data’ asks for.Tomaximise the exploitation of new technologies for ecosystem ser-vice assessment Andrew et al. (2014) note the need for close collabora-tion between remote sensing scientists, ecologists and social scientists.Clearly, for this application the same is true of remote sensing scientistsand limnologists, hydrologists, ecologists and many more to truly un-derstand the drivers of lake change and behaviour across the globe,12 E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136with thepotential formuchof this to be informed by remote sensing ob-servations. Multidisciplinary collaboration is a necessity for the integra-tion and assimilation of geospatial data and new technologies inhydrological modelling and traditional limnological studies, and inorder to be able to understand and interpret both the uncertainties ofthe data used and the research outputs. The inclusion of remote sensingscientists in limnological research is therefore considered prudent andoften an essential step towards understanding remote sensing dataand the specific uncertainties, interpretation and limitations related toremote sensing products before their use. In this respect, projects suchas the UK Natural Environment Research Council-funded GloboLakesproject (Global Observatory of Lake Responses to EnvironmentalChange) is one of several initiatives to address issues of lake change injust such a way, andwhichwill lead to paradigm shifting developmentsin the characterisation of the planet's freshwater resources and re-sponses to environmental change.AcknowledgementsThis work was supported by NERC Consortium Grant NE/J024279/1— GloboLakes (Global Observatory of Lake Responses to EnvironmentalChange): www.globolakes.ac.uk The Authors also wish to thank theconstructive feedback from the anonymous reviewers.ReferencesAitkenhead, M.J., Flaherty, S., Cutler, M.E.J., 2008. Evaluating neural networks and evi-dence pooling for land cover mapping. Photogramm. Eng. Remote. Sens. 74,1019–1032.Akyürek, Z., Şorman, A.Ü., 2002. Monitoring snow-covered areas using NOAA-AVHRRdata in the eastern part of Turkey. Hydrol. Sci. J. 47, 243–252. http://dx.doi.org/10.1080/02626660209492927.Alcamo, J., Döll, P., Henrichs, T., Kaspar, F., Lehner, B., Rösch, T., Siebert, S., 2003. Develop-ment and testing of the WaterGAP 2 global model of water use and availability.Hydrol. Sci. J. 48, 317–337. http://dx.doi.org/10.1623/hysj.48.3.317.45290.Andersen, O.B., Seneviratne, S.I., Hinderer, J., Viterbo, P., 2005. GRACE-derived terrestrialwater storage depletion associated with the 2003 European heat wave. Geophys.Res. Lett. 32, L18405. http://dx.doi.org/10.1029/2005GL023574.Andrew, M.E., Wulder, M.A., Nelson, T.A., 2014. Potential contributions of remote sensingto ecosystem service assessments. Prog. Phys. Geogr. 38, 328–353.Aplin, P., 2004. Remote sensing: land cover. Prog. Phys. Geogr. 28, 283–293.Awange, J.L., Sharifi, M.A., Ogonda, G., Wickert, J., Grafarend, E.W., Omulo, M.A., 2008. Thefalling Lake Victoria water level: GRACE, TRIMM and CHAMP satellite analysis of thelake basin. Water Resour. Manag. 22, 775–796.Baghdadi, N., Gauthier, Y., Bernier, M., 1997. Capability of multitemporal ERS-1 SAR datafor wet-snow mapping. Remote Sens. Environ. 60, 174–186.Bartalis, Z., Wagner, W., Naeimi, V., Hasenauer, S., Scipal, K., Bonekamp, H., Figa, J.,Anderson, C., 2007. Initial soil moisture retrievals from the METOP-A AdvancedScatterometer (ASCAT). Geophys. Res. Lett. 34, L20401. http://dx.doi.org/10.1029/2007GL031088.Basist, A., Grody, N.C., Peterson, T.C., Williams, C.N., 1998. Using the Special Sensor Micro-wave/Imager to monitor land surface temperatures, wetness and snow cover. J. Appl.Meteorol. 37, 888–911.Becker, F., Li, Z.-L., 1990. Towards a local split window method over land surfaces. Int.J. Remote Sens. 11, 369–393. http://dx.doi.org/10.1080/01431169008955028.Becker, M., LLovel, W., Cazenave, A., Güntner, A., Crétaux, J.-F., 2010. Recent hydrologicalbehavior of the East African great lakes region inferred from GRACE, satellite altime-try and rainfall observations. Compt. Rendus Geosci. 342, 223–233.Bindlish, R., Jackson, T.J., Wood, E., Gao, H., Starks, P., Bosch, D., Lakshmi, V., 2003. Soilmoisture estimates from TRMM Microwave Imager observations over the SouthernUnited States. Remote Sens. Environ. 85, 507–515.Birkett, C., 1995. The contribution of TOPEX/POSEIDON to the global monitoring of climat-ically sensitive lakes. J. Geophys. Res. 100, 25179–25204.Birkett, C.M., Beckley, B., 2010. Investigating the performance of the Jason-2/OSTM radaraltimeter over lakes and reservoirs. Mar. Geod. 33, 204–238.Blad, B.L., Rosenberg, N.J., 1976. Evaluation of resistance and mass transport evapotrans-piration models requiring canopy temperature data. Agron. J. 68, 764–769.Boughton, W., 2005. Catchment water balance modelling in Australia 1960–2004. Agric.Water Manag. 71, 91–116.Chang, A.T.C., Foster, J.L., Hall, D.K., 1987. Nimbus-7 SMMR derived global snow cover pa-rameters. Ann. Glaciol. 9, 39–44.Chaplin, J., Babyn, L., 2013. Using remote sensing and GIS to investigate the impacts oftourism on forest cover in the Annapurna Conservation Area, Nepal. Appl. Geogr.43, 159–168.Chédin, A., Scott, N.A., Berroir, A., 1982. A single-channel, double-viewing angle methodfor sea surface temperature determination from coincident METEOSAT and TIROS-N radiometric measurements. J. Appl. Meteorol. 21, 613–618.Chen, S., Chen, X., Chen, W., Su, Y., Li, D., 2011. A simple retrieval method of land surfacetemperature from AMSR-E passive microwave data — a case study over SouthernChina during the strong snow disaster of 2008. Int. J. Appl. Earth Obs. Geoinf. 13,140–151.Churnside, J.H., Demer, D.A., Mahmoudi, B., 2003. A comparison of Lidar and echosoundermeasurements of fish schools in the Gulf of Mexico. ICES J. Mar. Sci. 60, 147–154.http://dx.doi.org/10.1006/jmsc.2002.1327.Cihlar, J., 2000. Land cover mapping of large areas from satellites: status and research pri-orities. Int. J. Remote Sens. 21, 1093–1114.Clifford, D., 2010. Global estimates of snow water equivalent from passive microwave in-struments: history, challenges and future developments. Int. J. Remote Sens. 31,3707–3726. http://dx.doi.org/10.1080/01431161.2010.483482.Congalton, R.G., Jianyu, G., Yadav, K., Thenkabail, P., Ozdogan, M., 2014. Global land covermapping: a review and uncertainty analysis. Remote Sens. 6, 12070–12093.Crăciunescu, V., Flueraru, C., Stăncălie, G., 2010. The usage of the historical cartographicdatasets and the remote sensing data for the better understanding and mapping ofthe 2006 Danube floods in Romania. Acta Geod. Geophys. Hung. 45, 112–119.Crawford, J.T., Loken, L.C., Casson, N.J., Smith, C., Stone, A.G., Winslow, L.A., 2014. High-speed limnology: using advanced sensors to investigate spatial variability in biogeo-chemistry and hydrology. Environ. Sci. Technol. 49, 442–450.Crétaux, J.-F., Birkett, C., 2006. Lake studies from satellite radar altimetry. Compt. RendusGeosci. 338, 1098–1112.dall'Amico, J.T., Schlenz, F., Loew, A., Mauser, W., 2012. First results of SMOS soil moisturevalidation in the Upper Danube Catchment. IEEE Trans. Geosci. Remote Sens. 50,1507–1516.Dash, P., Göttsche, F.-M., Olesen, F., Fischer, H., 2001. Retrieval of land surface temperatureand emissivity from satellite data: physics, theoretical limitations and currentmethods. J. Indian Soc. Remote Sens. 29, 23–30.de Araujo Barbosa, C.C., Atkinson, P.M., Dearing, J.A., 2015. Remote sensing of ecosystemservices: a systematic review. Ecol. Indic. 52, 430–443.de Groot, R.S., Alkemade, R., Braat, L., Hein, L., Willemen, L., 2010. Challenges in integrat-ing the concept of ecosystem services and values in landscape planning,managementand decision making. Ecol. Complex. 7, 260–272.de Jeu, R.A.M., Wagner, W., Holmes, T.R.H., Dolman, A.J., van de Giesen, N.C., Friesen, J.,2008. Global soil moisture patterns observed by space borne microwave radiometersand scatterometers. Surv. Geophys. 29, 399–420. http://dx.doi.org/10.1007/s10712-008-9044-0.Deus, D., Gloaguen, R., Krause, P., 2013. Water balance modeling in a semi-arid environ-ment with limited in situ data using remote sensing in Lake Manyara, East AfricanRift, Tanzania. Remote Sens. 5, 1651–1680. http://dx.doi.org/10.3390/rs5041651.Diak, G.R., Mecikalski, J.R., Anderson, M.C., Norman, J.M., Kustas, W.P., Torn, R.D., DeWolf,R.L., 2004. Estimating land surface energy budgets from space; review and current ef-forts at the University of Wisconsin-Madison and USDA-ARS. Am. Meteorol. Soc.http://dx.doi.org/10.1175/BAMS-85-1-65.Dietz, A.J., Kuenzer, C., Gessner, U., Dech, S., 2012. Remote sensing of snow — a review ofavailable methods. Int. J. Remote Sens. 33, 4094–4134.Dokulil, M.T., 2013. Impact of climate warming on European inlandwaters. InlandWaters4, 27–40. http://dx.doi.org/10.5268/IW-4.1.705.Döll, P., Kaspar, F., Lehner, B., 2003. A global hydrological model for deriving water avail-ability indicators: model tuning and validation. J. Hydrol. 270, 105–134.Downing, J.A., Prairie, Y.T., Cole, J.J., Duarte, C.M., Tranvik, L.J., Striegl, R.G., McDowell,W.H.,Kortelainen, P., Caraco, N.F., Melack, J.M., Middelburg, J.J., 2006. The global abundanceand size distribution of lakes, ponds, and impoundments. Limnol. Oceanogr. 51,2388–2397.Dozier, J., 1989. Spectral signature of alpine snow cover from the Landsat Thematic Map-per. Remote Sens. Environ. 28, 9–22.Duan, Z., Bastiaanssen, W.G.M., 2013. Estimating water volume variations in lakes andreservoirs from four operational satellite altimetry databases and satellite imagerydata. Remote Sens. Environ. 134, 403–416.Eagleman, J.R., Ulaby, F.T., 1975. Remote sensing of soil moisture by Skylab radiometerand scatterometers sensors. J. Astronaut. Sci. 23, 147–159.Economics, L., 2015. The Case for Space. Report to the UK Space Agency Available athttp://www.ukspace.org/wp-content/uploads/2015/07/LE-Case-for-Space-2015-Full-Report.pdf.Eigenbrod, F., Armsworth, P.R., Anderson, B.J., Heinemayer, A., Gillings, S., Roy, D.B.,Thomas, C.D., Gaston, K.J., 2010. The impact of proxy-based methods on mappingthe distribution of ecosystem services. J. Appl. Ecol. 47, 377–385.FAO, 2014. Coping with water scarcity: An action framework for agriculture and food se-curity. FAO Water Report 38. Food and Agriculture Organization of the United Na-tions, Rome.FAO AQUASTAT, 2001. Available at http://www.fao.org/nr/water/aquastat/main/index.stm.Ferraro, R.R., Weng, F., Grody, N.C., Zhao, L., Meng, H., Kongoli, C., Pellegrino, P., Qiu, S.,Dean, C., 2005. NOAA operational hydrological products derived from the AdvancedMicrowave Sounding Unit. IEEE Trans. Geosci. Remote Sens. 43, 1036–1049.Fily, M., Royer, A., Goïta, K., Prigent, C., 2003. A simple retrieval method for land surfacetemperature and fraction of water surface determination from satellite microwavebrightness temperatures in sub-Arctic areas. Remote Sens. Environ. 85, 328–338.Foster, J.L., Hall, D.K., Chang, A.T.C., Rango, A., Wergin, W., Erbe, E., 1999. Effects of snowcrystal shape on the scattering of passivemicrowave radiation. IEEE Trans. Geosci. Re-mote Sens. 37, 1165–1168.Frappart, F., Calmant, S., Cauhopé, M., Seyler, F., Cazenave, A., 2006. Preliminary results ofENVISAT RA-2-derived water levels validation over the Amazon Basin. Remote Sens.Environ. 100, 252–264.Freitas, S.C., Trigo, I.F., Macedo, J., Barroso, C., Silva, R., Perdigão, R., 2013. Land surfacetemperature from multiple geostationary satellites. Int. J. Remote Sens. 34,3051–3068. http://dx.doi.org/10.1080/01431161.2012.716925.13E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136Fuller, R.M., Smith, G.M., Devereux, B.J., 2003. The characterisation and measurement ofland cover change through remote sensing: problems in operational applications?Int. J. Appl. Earth Obs. Geoinf. 4, 243–253.Galve, J.M., Coll, C., Prata, F., 2009. Monthly land surface temperature maps over Europeanzone using advanced along track scanning radiometer data for 2007. Proceedings ofthe Geoscience and Remote Sensing Symposium. 2009 IEEE international, IGARSS2009 4, pp. 292–295.Gao, H., Wood, E.F., Jackson, T.J., Drusch, M., Bindlish, R., 2006. Using TRMM/TMI to re-trieve surface soil moisture over the Southern United States from 1998 to 2002.J. Hydrometeorol. 7, 23–38.Gesell, G., 1989. An algorithm for snow and ice detection using AVHRR data, an extensionto the APOLLO software package. Int. J. Remote Sens. 10, 897–905. http://dx.doi.org/10.1080/01431168908903929.Gillespie, A., Rokugawa, S., Matsunaga, T., Cothern, J.S., Hook, S., Kahle, A.B., 1998. A tem-perature and emissivity separation algorithm for advanced spaceborne thermal emis-sion and reflection radiometer (ASTER) images. IEEE Trans. Geosci. Remote Sens. 36,1113–1126.Glenn, E.P., Huete, A.R., Nagler, P.L., Hirschboeck, K.K., Brown, P., 2007. Integrating remotesensing and ground methods to estimate evapotranspiration. CRC Crit. Rev. Plant Sci.26, 139–168.Gudmundsson, L., Tallaksen, L.M., Stahl, K., Clark, D.B., Dumont, E., Hagemann, S.,Bertrand, N., Gerten, D., Heinke, J., Hanasaki, N., Voss, F., Koirala, S., 2012a. Comparinglarge-scale hydrological model simulations to observed runoff percentiles in Europe.J. Hydrometeorol. 13, 604–620.Gudmundsson, L., Wagener, T., Tallaksen, L.M., Engeland, K., 2012b. Evaluation of ninelarge-scale hydrological models with respect to the seasonal runoff climatology inEurope. Water Resour. Res. 48, W11504. http://dx.doi.org/10.1029/2011WR010911.Haddad, Z., Smith, E.A., Kummerow, C.D., Iguchi, T., Farrar, M., Darden, S., Alves, M., Olson,W., 1997. The TRMM ‘Day-1’ radar/radiometer combined rain-profiling algorithm.J. Meteorol. Soc. Jpn. 75, 799–809.Hall, D.K., Riggs, G.A., 2007. Accuracy assessment of the MODIS snow-cover products.Hydrol. Process. 21, 1534–1547.Hall, D.K., Riggs, G.A., Salomonson, V.V., DiGirolamo, N., Bayr, K.J., 2002. MODIS snow-cover products. Remote Sens. Environ. 83, 181–194.Hansen,M.C., Loveland, T.R., 2012. A review of large areamonitoring of land cover changeusing Landsat data. Remote Sens. Environ. 122, 66–74.Heilman, J.L., Kanemasu, E.T., Rosenberg, N.J., Blad, B.L., 1976. Thermal scanner measure-ment of canopy temperatures to estimate evapotranspiration. Remote Sens. Environ.5, 137–145.Huang, J., Zhan, J., Yan, H., Wu, F., Deng, X., 2013. Evaluation of the impacts of land use onwater quality: a case study in the Chaohu Lake Basin. Sci. World J. 2013, 329187.http://dx.doi.org/10.1155/2013/329187.Hüsler, F., Jonas, T., Wunderle, S., Albrecht, S., 2012. Validation of a modified snow coverretrieval algorithm from historical 1-km AVHRR data over the European Alps. RemoteSens. Environ. 121, 497–515.Hutchinson, G.E., 1957. A treatise on limnology, Volume I, Geography, physics and chem-istry. Wiley, New York.Hwang, C., Kao, Y., Tangdamrongsub, N., 2011. A preliminary analysis of lake level andwater storage changes over lakes Baikal and Balkhash from satellite altimetry andgravimetry. Terr. Atmos. Ocean. Sci. 22, 97–108.Iguchi, T., Kozu, T., Meneghini, R., Awaka, J., Okamoto, K., 2000. Rain-profiling algorithmfor the TRMM precipitation radar. J. Appl. Meteorol. 39, 2038–2052.IJC, 1980. Pollution in the Great Lakes basin from land use activities. Report, InternationalJoint Commission.Jackson, T.J., Hsu, A.Y., Neill, P.E.O., 2002. Surface soil moisture retrieval and mappingusing high-frequency microwave satellite observations in the Southern Great Plains.J. Hydrometeorol. 3, 688–699.Jensen, J.R., Chery Jr., D.L., 1980. Landsat crop identification for watershed water balancedeterminations. Int. J. Remote Sens. 1, 345–359. http://dx.doi.org/10.1080/01431168008948247.Jiang, G.-M., Li, Z.-L., 2008. Split-window algorithm for land surface temperature estima-tion fromMSG1-SEVIRI data. Int. J. Remote Sens. 29, 6067–6074. http://dx.doi.org/10.1080/01431160802235860.Kalma, J.D., McVicar, T.R., McCabe, M.F., 2008. Estimating land surface evaporation: a re-view of methods using remotely sensed surface temperature data. Surv. Geophys.29, 421–469.Karimi, P., Bastiaanssen, W.G.M., 2015. Spatial evapotranspiration, rainfall and land usedata in water accounting — part 1: review of the accuracy of the remote sensingdata. Hydrol. Earth Syst. Sci. 19, 507–532.Keatley, B.E., Bennett, E.M., MacDonald, G.K., Taranu, Z.E., Gregory-Eaves, I., 2011. Land-Use Legacies Are Important Determinants of Lake Eutrophication in theAnthropocene. PLoS ONE 6, e15913. http://dx.doi.org/10.1371/journal.pone.0015913.Klein, B., Krahe, P., Lingemann, I., Nilson, E., Kling, H., Fuchs,M., 2011. Assessing climate changeimpacts on water balance in the Upper Danube Basin based on a 23 member RCMEnsemble. Proceedings of the XXVth Conference of the Danube Countries, Hungary.Kling, H., Fuchs, M., Paulin, M., 2012. Runoff conditions in the upper Danube basin underan ensemble of climate change scenarios. J. Hydrol. 424–425, 264–277.Knoll, L.B., Vanni, M.J., Renwick, W.H., Dittman, E.K., Gephart, J.A., 2013. Temperate reser-voirs are large carbon sinks and small CO2 sources: Results from high-resolution car-bon budgets. Glob. Biogeochem. Cycles 27, 52–64. http://dx.doi.org/10.1002/gbc.20020.Kollár, S., Vekerdy, Z., Márkus, B., 2011. Forest habitat change dynamics in a riparianwoodland. Spat. Stat. 7, 371–376.Kongoli, C., Grody, N.C., Ferraro, R.R., 2004. Interpretation of AMSU microwave measure-ments for the retrievals of snow water equivalent and snow depth. J. Geophys. Res. -Atmos. 109, D24111.König, M., Winther, J.-G., Isaksson, E., 2001. Measuring snow and glacier ice propertiesfrom satellite. Rev. Geophys. 39, 1–27.Kovàcs, F., 2007. Assessment of regional variations in biomass production using satelliteimage analysis between 1992 and 2004. Trans. GIS 11, 911–926.Kristiansen, P., Hansen, H.O. (Eds.), 1994. European rivers and lakes: Assessment of theirenvironmental stateEEA Environmental Monographs 1. Denmark, European Environ-ment Agency.Kustas, W.P., Norman, J.M., 1997. A two-source approach for estimating turbulent fluxesusing multiple angle thermal infrared observations. Water Resour. Res. 33,1495–1508.Kutser, T., Verpoorter, C., Paavel, B., Tranvik, L.J., 2015. Estimating lake carbon fractionsfrom remote sensing data. Remote Sens. Environ. 157, 138–146.Kyle, H.L., Curran, R.J., Barnes, W.L., Escoe, D., 1978. A cloud physics radiometer. Proceed-ings of Third Conference on Atmospheric Radiation, Davis, CA, pp. 107–109.Large, A.R.G., Gilvear, D.J., 2014. Using Google Earth, a virtual globe-imaging platform, forecosystem services-based river assessment. River Res. Appl. http://dx.doi.org/10.1002/rra2798.Larson, K.M., Small, E.E., Gutmann, E.D., Bilich, A.L., Braun, J.J., Zavorotny, V.U., 2008. Use ofGPS receivers as a soil moisture network for water cycle studies. Geophys. Res. Lett.35, L24405. http://dx.doi.org/10.1029/2008GL036013.Lehner, B., Döll, P., 2004. Development and validation of a global database of lakes, reser-voirs and wetlands. J. Hydrol. 296, 1–22.Li, Z.-L., Tang, B.-H.,Wu, H., Ren, H., Yan, G., Wan, Z., Trigo, I.F., Sobrino, J.A., 2013. Satellite-derived land surface temperature: current status and perspectives. Remote Sens. En-viron. 131, 14–37.Li, M., Zang, S.Y., Zhang, B., Li, S.S., Wu, C.S., 2014. A review of remote sensing image clas-sification techniques: the role of spatio-contextual information. Eur. J. Remote Sens.47, 389–411.Loew, A., 2008. Impact of surface heterogeneity on surface soil moisture retrievals frompassive microwave data at the regional scale: the Upper Danube case. Remote Sens.Environ. 112, 231–248.Lu, S., Ouyang, N., Wu, B., Wei, Y., Tesemma, Z., 2013. Lake water volume calculation withtime series remote-sensing images. Int. J. Remote Sens. 34, 7962–7973. http://dx.doi.org/10.1080/01431161.2013.827814.Ludwig, R., Mauser, W., Niemeyer, S., Colgan, A., Stolz, R., Escher-Vetter, H., Kuhn, M.,Reichstein, M., Tenhunen, J., Kraus, A., Ludwig, M., Barth, M., Hennicker, R., 2003a.Web-based modelling of energy, water andmatter fluxes to support decision makingin mesoscale catchments — the integrative perspective of GLOWA-Danube. Phys.Chem. Earth 28, 621–634.Ludwig, R., Probeck, M., Mauser, W., 2003b. Mesoscale water balance modelling in theUpper Danube watershed using sub-scale land cover information derived fromNOAA-AVHRR imagery and GIS-techniques. Phys. Chem. Earth 28, 1351–1364.Mao, K., Qin, Z., Shi, J., Gong, P., 2005. A practical split-window algorithm for retrievingland-surface temperature from MODIS data. Int. J. Remote Sens. 26, 3181–3204.http://dx.doi.org/10.1080/01431160500044713.Martinec, J., Rango, A., Roberts, R., 2008. Snowmelt Runoff Model (SRM) User's Manual.New Mexico State University Press, New Mexico.Matikainen, L., Kuittinen, R., Vepsäläinen, J., 2002. Estimating drainage area-based snow-cover percentages from NOAA AVHRR images. Int. J. Remote Sens. 23, 2971–2988.http://dx.doi.org/10.1080/01431160110071923.Mauser, W., Bach, H., 2009. PROMET — large scale distributed hydrological modelling tostudy the impact of climate change on the water flows of mountain watersheds.J. Hydrol. 376, 362–377.McCabe, G.J., Markstrom, S.L., 2007. Amonthly water-balancemodel driven by a graphicaluser interface. U.S. Geological Survey Open-File report 2007–1088 (6 pp.).McDonald, C.P., Stets, E.G., Striegl, R.G., Butman, D., 2013. Inorganic carbon loading as aprimary driver of dissolved carbon dioxide concentrations in the lakes and reservoirsof the contiguous United States. Glob. Biogeochem. Cycles 27, 1–11.McFarland, M.J., Miller, R.L., Neale, C.M.U., 1990. Land surface temperature derived fromthe SSM/I passive microwave brightness temperatures. IEEE Trans. Geosci. RemoteSens. 28, 839–845.Meigh, J.R., McKenzie, A.A., Sene, K.J., 1999. A grid-based approach to water scarcity, esti-mates for Eastern and Southern Africa. Water Resour. Manag. 13, 85–115.Mercier, F., Cazenave, A., Maheu, C., 2002. Interannual lake level fluctuations (1993–1999)in Africa from Topex/Poseidon: connections with ocean–atmosphere interactionsover the Indian Ocean. Glob. Planet. Chang. 32, 141–163.Michaelides, S., Levizzani, V., Anagnostou, E., Bauer, P., Kasparis, T., Lane, J.E., 2009. Precip-itation: measurement remote sensing, climatology and modelling. Atmos. Res. 94,512–533.Miller, S.D., Lee, T.F., Fennimore, R.L., 2005. Satellite-based imagery techniques for day-time cloud/snow delineation from MODIS. J. Appl. Meteorol. 44, 987–997.Milzow, C., Krogh, P.E., Bauer-Gottwein, P., 2011. Combining satellite radar altimetry,SAR surface soil moisture and GRACE total storage changes for hydrologicalmodel calibration in a large poorly gauged catchment. Hydrol. Earth Syst. Sci.15, 1729–1743.Minacapilli, M., Agnese, C., Blanda, F., Cammalleri, C., Ciraolo, G., D'Urso, G., Iovino, M.,Pumo, D., Provenzano, G., Rallo, G., 2009. Estimation of actual evapotranspiration ofMediterranean perennial crops by means of remote-sensing based surface energybalance models. Hydrol. Earth Syst. Sci. 13, 1061–1074. http://dx.doi.org/10.5194/hess-13-1061-2009.Mitsova, D., 2014. Coupling land use change modelling with climate projections to esti-mate seasonal variability in runoff from an urbanizing catchment near Cincinnati,Ohio. Int. J. Geo-Inf. 3, 1256–1277.Mo, T., Choudhury, B.J., Schmugge, T.J., Wang, J.R., Jackson, T.J., 1982. A model for micro-wave emission from vegetation-covered fields. J. Geophys. Res. 87, 11,229–11,237.http://dx.doi.org/10.1029/JC087iC13p11229.14 E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136Muirhead, K., Cracknell, A.P., 1986. Airborne lidar bathymetry. Int. J. Remote Sens. 7,597–614. http://dx.doi.org/10.1080/01431168608954714.Nghiem, V.T., Nedjai, R., Messaoud, N.N., 2011. The consequences of changes in forest landcover in the Alpine and Jurassic massifs on the physico-chemical status of deep lakewaters. J. Alp. Res. 99–3.Njoku, E.G., Kong, J.A., 1977. Theory for passivemicrowave remote sensing of near-surfacesoil moisture. J. Geophys. Res. 82, 3108–3118.Njoku, E.G., Jackson, T.J., Lakshmi, V., Chan, T.K., Nghiem, S.V., 2003. Soil moisture retrievalfrom AMSR-E. IEEE Trans. Geosci. Remote Sens. 41, 215–229.Nolin, A.W., 2010. Recent advances in remote sensing of seasonal snow. J. Glaciol. 56,1141–1150.Olofsson, P., Foody, G.M., Stehman, S.V., Woodcock, C.E., 2013. Making better use of accu-racy data in land change studies: estimating accuracy and area and quantifying un-certainty using stratified estimation. Remote Sens. Environ. 129, 122–131.Owe, M., de Jeu, R., Holmes, T., 2008. Multisensor historical climatology of satellite-de-rived global land surface moisture. J. Geophys. Res. 113, F01002. http://dx.doi.org/10.1029/2007JF000769.Parinussa, R.M., Holmes, T.R.H., de Jeu, R.A.M., 2012. Soil moisture retrievals from theWindSat spaceborne polarimetric microwave radiometer. IEEE Trans. Geosci. RemoteSens. 50, 2683–2694.Pereira, L.S., Allen, R.G., Smith, M., Raes, D., 2015. Crop evapotranspiration estimation withFAO56: past and future. Agric. Water Manag. 147, 4–20. http://dx.doi.org/10.1016/j.agwat.2014.07.031.Pereira-Cardenal, S.J., Riegels, N.D., Berry, P.A.M., Smith, R.G., Yakovlev, A., Siegfried, T.U.,Bauer-Gottwein, P., 2011. Real-time remote sensing driven river basin modellingusing radar altimetry. Hydrol. Earth Syst. Sci. 15, 241–254.Peterson, T.C., Basist, A.N., Williams, C.N., Grody, N.C., 2000. A blended satellite-in situnear-global surface temperature dataset. Bull. Am. Meteorol. Soc. 81, 2157–2164.Petrovič, P., Mravcová, K., Holko, L., Kostka, Z., Miklánek, P., 2010. Basin-wide water bal-ance in the Danube River Basin. In: Brilly, M. (Ed.), Hydrological Processes of the Dan-ube River Basin. Springer Science + Business Media http://dx.doi.org/10.1007/978-90-481-3423-6_7.Pfeifer, M., Disney, M., Quaife, T., Marchant, R., 2012. Terrestrial ecosystems from space: areview of earth observation products for macroecology applications. Glob. Ecol.Biogeogr. 21, 603–624.Pinheiro, A.C.T., Mahoney, R., Privette, J.L., Tucker, C.J., 2006. Development of a daily longterm record of NOAA-14 AVHRR land surface temperature over Africa. Remote Sens.Environ. 103, 153–164.Pôças, I., Cunha, M., Pereira, L.S., Allen, R.G., 2013. Using remote sensing energy balanceand evapotranspiration to characterize montane landscape vegetation with focuson grass and pasture lands. Int. J Appl. Earth Obs. Geoinf. 21, 159–172.Ponchaut, F., Cazenave, A., 1998. Continental lake level variations from Topex/Poseidon(1993–1996). C. R. Acad. Sci. Ser. IIa 326, 13–20.Prata, A.J., Caselles, V., Coll, C., Sobrino, J.A., Ottlé, C., 1995. Thermal remote sensing of landsurface temperature from satellites: current status and future prospects. RemoteSens. Rev. 12, 175–224. http://dx.doi.org/10.1080/02757259509532285.Probeck, M., Ludwig, R., Mauser,W., 2005. Fusion of NOAA AVHRR imagery and geograph-ical information system techniques to derive subscale land cover information for theupper Danube watershed. Hydrol. Process. 19, 2407–2418.Qian, Y.-G., Li, Z.-L., Nerry, F., 2013. Evaluation of land surface temperature and emissivi-ties retrieved fromMSG/SEVIRI data with MODIS land surface temperature and emis-sivity products. Int. J. Remote Sens. 34, 3140–3152. http://dx.doi.org/10.1080/01431161.2012.716538.Reichle, R.H., Koster, R.D., Liu, P., 2007. Comparison and assimilation of global soil mois-ture retrievals from the AdvancedMicrowave Scanning Radiometer for the Earth Ob-serving System (AMSR-E) and the Scanning Multichannel Microwave Radiometer(SMMR). J. Geophys. Res. 112, D09108.Renwick, W.H., Vanni, M.J., Zhang, Q., Patton, J., 2008. Water quality trends and changingagricultural practices in a Midwest US watershed, 1994–2006. J. Environ. Qual. 37,1862–1874.Riera, J.L., Magnuson, J.J., Kratz, T.K., Webster, K.E., 2000. A geomorphic template for theanalysis of lake districts applied to the Northern Highland lake district, Wisconsin,USA. Freshw. Biol. 43, 301–318.Rocchini, D., Foody, G.M., Nagendra, H., Ricotta, C., Anand, M., He, K.S., Amici, V.,Kleinschmit, B., Förster, M., Schmidtlein, S., Feilhauser, H., Ghisla, A., Metz, M.,Neteler, M., 2013. Uncertainty in ecosystem mapping by remote sensing. Comput.Geosci. 50, 128–135.Rodell, M., Velicogna, I., Famiglietti, J.S., 2009. Satellite-based estimates of groundwaterdepletion in India. Nature 460, 999–1002. http://dx.doi.org/10.1038/nature08238.Rodell, M., McWilliams, E.B., Famiglietti, J.S., Beaudoing, H.K., Nigro, J., 2011. Estimatingevapotranspiration using an observation based terrestrial water budget. Hydrol. Pro-cess. 25, 4082–4092.Rowan, J.S., 2010. Developing a lake hydromorphology typology for the UK. SNIFFER Re-search Report WFD104 (50 pp.).Rüdiger, C., Calvet, J.-C., Gruhier, C., Holmes, T.R.H., de Jeu, R.A.M., Wagner, W., 2009. Anintercomparison of ERS-Scat and AMSR-E soil moisture observationswithmodel sim-ulations over France. J. Hydrometeorol. 10, 431–447.Salomonson, V.V., Appel, I., 2004. Estimating fractional snow cover fromMODIS using thenormalized difference snow index. Remote Sens. Environ. 89, 351–360.Schindler, D.W., Donahue, W.F., 2006. An impending water crisis in Canada's westernprairie provinces. Proc. Natl. Acad. Sci. U. S. A. 103, 7210–7216.Schlenz, F., dall'Amico, J.T., Loew, A., Mauser, W., 2012. Uncertainty assessment of theSMOS validation in the Upper Danube Catchment. IEEE Trans. Geosci. Remote Sens.50, 1517–1529.Schmugge, T., Gloersen, P., Wilheit, T.T., Geiger, F., 1974. Remote sensing of soil moisturewith microwave radiometers. J. Geophys. Res. 79, 317–323.Schmugge, T.J., Kustas, W.P., Ritchie, J.C., Jackson, T.J., Rango, A., 2002. Remote sensing inhydrology. Adv. Water Resour. 25, 1367–1385.Seneviratne, S.I., Corti, T., Davin, E.L., Hirschi, M., Jaeger, E.B., Lehner, I., Orlowsky, B.,Teuling, A.J., 2010. Investigating soil moisture–climate interactions in a changing cli-mate: a review. Earth Sci. Rev. 99, 125–161.Seppelt, R., Dormann, C.F., Eppink, F.V., Lautenbach, S., Schmidt, S., 2011. A quantitativereview of ecosystem service studies: approaches, shortcomings and the road ahead.J. Appl. Ecol. 48, 630–636.Shiklomanov, I.A., 2000. Appraisal and assessment of world water resources. Water Int.25, 11–32. http://dx.doi.org/10.1080/02508060008686794.Sobrino, J.A., Li, Z.-L., Stoll, M.P., Becker, F., 1996. Multi-channel and multi-angle algo-rithms for estimating sea and land surface temperature with ATSR data. Int.J. Remote Sens. 17, 2089–2114. http://dx.doi.org/10.1080/01431169608948760.Sobrino, J.A., Sòria, G., Prata, A.J., 2004. Surface temperature retrieval from Along TrackScanning Radiometer 2 data: algorithms and validation. J. Geophys. Res. 109,D11101. http://dx.doi.org/10.1029/2003JD004212.Soranno, P.A., Webster, K.E., Cheruvelil, K.S., Bremigan, M.T., 2009. The lake landscape-context framework: linking aquatic connections, terrestrial features and human ef-fects at multiple spatial scales. Verh. Int. Ver. Limnol. 30, 695–700.Soranno, P.A., Cheruvelil, K.S., Webster, K.E., Bremigan, M.T., Wagner, T., Stow, C.A., 2010.Using landscape limnology to classify freshwater ecosystems for multi-ecosystemmanagement and conservation. Bioscience 60, 440–454.Sòria, G., Sobrino, J.A., 2007. ENVISAT/AATSR derived land surface temperature over a het-erogeneous region. Remote Sens. Environ. 111, 409–422.Stephens, G.L., Kummerow, C.D., 2007. The remote sensing of clouds and precipitationfrom space: a review. J. Atmos. Sci. 64, 3742–3765.Stone, L.R., Horton, M.L., 1974. Estimating evapotranspiration using canopy temperatures:field evaluation. Agron. J. 66, 450–454.Suchenwirth, L., Stümer, W., Schmidt, T., Förster, M., Kleinschmit, B., 2014. Large-scalemapping of carbon stocks in riparian forests with self-organising maps and the k-nearest neighbor algorithm. Forests 5, 1635–1652.Swenson, S.C., Wahr, J., 2009. Monitoring the water balance of Lake Victoria, East Africa,from space. J. Hydrol. 370, 163–176.Swenson, S., Famiglietti, J., Basara, J., Wahr, J., 2008. Estimating profile soil moisture andgroundwater variations using GRACE and Oklahoma Mesonet soil moisture data.Water Resour. Res. 44, W01413.Tapiador, F.J., Turk, F.J., Petersen, W., Hou, A.Y., García-Ortega, E., Machado, L.A.T., Angelis,C.F., Salio, P., Kidd, C., Huffman, G.J., de Castro, M., 2012. Global precipitationmeasure-ment: methods, datasets and applications. Atmos. Res. 104, 70–97.Tapley, B.D., Bettadpur, S., Ries, J.C., Thompson, P.F., Watkins, M.M., 2004. GRACE mea-surements of mass variability in the earth system. Science 305, 503–505. http://dx.doi.org/10.1126/science.1099192.TEEB, 2010. The economics of ecosystems and biodiversity available at http://www.teebweb.org/resources/ecosystem-services/.Thornthwaite, C.W., 1948. An approach toward a rational classification of climate. Geogr.Rev. 38, 55–94.Thornthwaite, C.W., Mather, R.J., 1955. The water balance. Publications in Climatology 8.DIT, Laboratory of Climatology, Centerton, New Jersey, USA, pp. 1–86.Thornthwaite, C.W., Mather, R.J., 1957. Publ. no. 10. Laboratory of Climatology, Centerton,New Jersey, USA.Tomlinson, C.J., Chapman, L., Thornes, J.E., Baker, C., 2011. Remote sensing land surfacetemperature for meteorology and climatology: a review. Meteorol. Appl. 18,296–306. http://dx.doi.org/10.1002/met.287.Tranvik, L.J., Downing, J.A., Cotner, J.B., Loiselle, S.A., Striegl, R.G., Ballatore, T.J., Dillon, P.,Finlay, K., Fortino, K., Knoll, L.B., Kortelainen, P.L., Kutser, T., Larsen, S., Laurion, I.,Leech, D.M., Leigh McCallister, S., McKnight, D.M., Melack, J.M., Overholt, E., Porter,J.A., Prairie, Y., Renwick, W.H., Roland, F., Sherman, B.S., Schindler, D.W., Sobek, S.,Tremblay, A., Vanni, M.J., Verschoor, A.M., Von Wachenfeldt, E., Weyhenmeyer, G.A.,2009. Lakes and reservoirs as regulators of carbon cycling and climate. Limnol.Oceanogr. 54, 2298–2314.Tyler, A.N., Hunter, P.D., Spyrakos, E., Groom, S., Constaninescua, A., Kitchen, J.,Paun, A., 2015. Developments in Earth observation for the assessment andmonitoring of inland, transitional, coastal and shelf-sea waters. Sci. Total Environ.(in this issue).UNEP, 2008. Vital water graphics — an overview of the state of the world's fresh and ma-rine waters. 2nd edition. UNEP, Nairobi, Kenya 92-807-2236-0.Valero-Garcés, B.L., Navas, A., Machin, J., Stevenson, T., Davis, B., 2000. Responses of a sa-line lake ecosystem in a semiarid region to irrigation and climate variability. AMBIO:J. Hum. Environ. 29, 344–350.Vereecken, H., Huisman, J.A., Bogena, H., Vanderborght, J., Vrugt, J.A., Hopmans, J.W., 2008.On the value of soil moisture measurements in vadose zone hydrology: a review.Water Resour. Res. 44. http://dx.doi.org/10.1029/2008WR006829.Verpoorter, C., Kutser, T., Tranvik, L., 2012. Automated mapping of water bodies usingLandsat multispectral data. Limnol. Oceanogr. Methods 10, 1037–1050. http://dx.doi.org/10.4319/lom.2012.10.1037.Verpoorter, C., Kuster, T., Seekell, D.A., Travnik, L.J., 2014. A global inventory of lakes basedon high-resolution satellite imagery. Geophys. Res. Lett. 41. http://dx.doi.org/10.1002/2014GL060641.Verstraeten, W.W., Veroustraete, F., Feyen, J., 2008. Assessment of evapotranspiration andsoil moisture content across different scales of observation. Sensors 8, 70–117.Vila, D., Ferraro, R., Joyce, R., 2007. Evaluation and improvement of AMSU precipitation re-trievals. J. Geophys. Res. 112, D20119. http://dx.doi.org/10.1029/2007JD008617.Voigt, S., Koch, M., Baumgartner, M.F., 1999. A multichannel threshold technique forNOAA AVHRR data to monitor the extent of snow cover in the Swiss Alps. Proceed-ings of IUGG99 Symposium HS2, interactions between the cryosphere, climate andgreenhouse gases, Birmingham. IAHS Publ. no. 256.15E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136Vörösmarty, C.J., Green, P., Salisbury, J., Lammers, R.B., 2000. Global water resources: vul-nerability from climate change and population growth. Science 289, 284–288.Wada, Y., van Beek, L.P.H., Bierkens, M.F.P., 2011. Modelling global water stress of the re-cent past: on the relative importance of trends inwater demand and climate variabil-ity. Hydrol. Earth Syst. Sci. 15, 3785–3808.Wagner, W., Scipal, K., Pathe, C., Gerten, D., Lucht, W., Rudolf, B., 2003. Evaluation of theagreement between the first global remotely sensed soil moisture data with modeland precipitation data. J. Geophys. Res. 108, 4611. http://dx.doi.org/10.1029/2003JD003663.Wagner, W., Blöschl, G., Pampaloni, P., Calvet, J.-C., Bizzarri, B., Wigneron, J.-P., Kerr, Y.,2007. Operational readiness of microwave remote sensing of soil moisture for hydro-logic applications. Nord. Hydrol. 38, 1–20.Wagner, W., Dorigo, W., de Jeu, R., Fernandez, D., Benveniste, J., Haas, E., Ertl, M., 2012. Fu-sion of active and passive microwave observations to create and essential climatevariable data record on soil moisture. ISPRS Annals of the Photogrammetry, RemoteSensing and Spatial Information Sciences, I-7, eXXII ISPRS Congress, Melbourne,Australia.Wahr, J., Swenson, S., Zlotnicki, V., Velicogna, I., 2004. Time-variable gravity from GRACE:First results. Geophys. Res. Lett. 31, L11501. http://dx.doi.org/10.1029/2004GL019779.Wan, Z., Dozier, J.A., 1996. Generalized split-window algorithm for retrieving land-surfacetemperature for space. IEEE Trans. Geosci. Remote Sens. 34, 892–905.Wang, L., Qu, J.J., 2009. Satellite remote sensing applications for surface soil moisturemonitoring: a review. Front. Earth Sci. China 3, 237–247. http://dx.doi.org/10.1007/s11707-009-0023-7.Wang, N.-Y., Liu, C., Ferraro, R., Wolff, D., Zipser, E., Kummerow, C., 2009. TRMM 2A12Land precipitation product — status and future plans. J. Meteorol. Soc. Jpn. 87,237–253.Webster, K.E., Soranno, P.A., Baines, S.P., Kratz, T.K., Bowser, C.J., Dillon, P.J., Campbell, P.,Fee, E.J., Hecky, R.E., 2000. Structuring features of lake districts: landscape controlson lake chemical responses to drought. Freshw. Biol. 43, 499–515.Wen, J., Jackson, T.J., Bindlish, R., Hsu, A.Y., 2005. Retrieval of soil moisture and vegetationwater content using SSM/I data over a corn and soybean region. J. Hydrometeorol.Spec. Sect. 6, 854–863.Wigneron, J.-P., Calvet, J.-C., Pellarin, T., Van de Griend, A.A., Berger, M., Ferrazzoli, P., 2003.Retrieving near-surface soil moisture frommicrowave radiometric observations: cur-rent status and future plans. Remote Sens. Environ. 85, 489–506.Wilcox, C., Los Huertos, M., 2005. A simple, rapid method for mapping bathymetry ofsmall wetland basins. J. Hydrol. 301, 29–36.Wilker, H., Drusch, M., Seuffert, G., Simmer, C., 2006. Effects of the near-surface soil mois-ture profile on the assimilation of L-band microwave brightness temperature.J. Hydrometeorol. 7, 433–442.Williams, C.N., Basist, A., Peterson, T.C., Grody, N.C., 2000. Calibration and validation ofland surface temperature anomalies derived from the SSM/I. Bull. Am. Meteorol.Soc. 81, 2141–2156.Williamson, C.E., Saros, J.E., Vincent, W.F., Smol, J.P., 2009. Lakes and reservoirs as senti-nels, integrators, and regulators of climate change. Limnol. Oceanogr. 54, 2273–2282.Woodcock, C.E., 2002. Uncertainty in remote sensing. In: Foody, G.M., Atkinson, P.M.(Eds.), Uncertainty in Remote Sensing and GIS. Wiley, Chichester.Woodhouse, I., Nichol, C., Sinclair, P., Jack, J., Morsdorf, F., Malthus, T.J., Patenaude, G.,2011. A multispectral canopy LiDAR demonstrator project. IEEE Geosci. RemoteSens. Lett. 8, 839–843.WWAP, 2012. The United Nations World Water Development Report 4: ManagingWaterunder Uncertainty and Risk. World Water Assessment Programme, Paris, UNESCO.Xu, C.-Y., Singh, V.P., 1998. A review on monthly water balance models for water re-sources investigations. Water Resour. Manag. 12, 31–50.Xu, C.-Y., Singh, V.P., 2004. Review on regional water resources assessment models understationary and changing climate. Water Resour. Manag. 18, 591–612.Xu, X., Li, J., Tolson, B.A., 2014. Progress in integrating remote sensing data and hydrologicmodelling. Prog. Phys. Geogr. 38, 464–498.Yang, H., Xing, Y., Xie, P., Ni, L., Rong, K., 2008. Carbon source/sink function of a subtrop-ical, eutrophic lake determined from an overall mass balance and a gas exchange andcarbon burial balance. Environ. Pollut. 151, 559–568.16 E. Politi et al. / Science of the Total Environment xxx (2015) xxx–xxxPlease cite this article as: Politi, E., et al., Assessing the utility of geospatial technologies to investigate environmental changewithin lake systems,Sci Total Environ (2015), http://dx.doi.org/10.1016/j.scitotenv.2015.09.136",
    "Link": "https://core.ac.uk/download/30664731.pdf"
}