{
    "Title": "Gene therapy for allergic diseases",
    "Authors": "Joos, Guy, Maes, Tania, Tournoy, Kurt",
    "Year": "No year available",
    "Abstract": "Airway diseases such as allergic asthma and rhinitis are characterized by a T-helper type 2 (Th2) response. Treatment of allergic airway diseases is currently limited to drugs that relieve disease symptoms and inflammation. In the search for new therapeutics, efforts have been made to treat allergic airway disease with gene therapy, and many preclinical studies have demonstrated its impressive potential. Most strategies focus on blocking the expression of proinflammatory proteins or transcription factors involved in the disease pathogenesis using antisense oligonucleotides, DNAzymes, small interfering RNA, or blocking of microRNAs using antagomirs. Changing the Th1/Th2 balance by overexpressing Th1-stimulating factors is another treatment option. Although the proof of concept is convincing in animal models, progress in humans remains limited. In this review, we focus on preclinical models to describe the recent developments and major breakthroughs for treating allergic airway diseases with gene therapy",
    "Keywords": "No keywords available",
    "Publisher": "'Springer Science and Business Media LLC'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "AIRWAY EPITHELIUMIgEIgG1B-cellPlasma cellSmooth mucle cellsMyofibroblastDendritic cellIL-12 TGF-βTnaiveTGF-β, IL-6, IL-1IL-4MHCIITCRCD40CD86T-BETIFN-γTNFTH1STAT1FoxP3IL-10TGF-βTregSTAT5LYMPH NODERORγtIL-17TH17STAT3GATA-3STAT6IL-5 IL-4IL-13IL-13TH2IL-9Cav1IL-1RAT cellNeutrophilMacrophageBlood vesselIL-4RαAMCEarly phase responseIgEEosinophil Mast cellFcεRIOxygen radicalsMajor basic proteinLate phase responseLeukotrienesHistamineProstaglandin D2CytokinesSykCCR3 + βcIL-4RαIL-4RASphKAllergenMucusSTAT6IL-4RαIL-4RAAMCFor personal use only, can not be distributed.  The final publication is available at www.spingerlink.com: Current Allergy and Asthma Reports      DOI: 10.1007/s11882-011-0177-8",
    "Link": "https://core.ac.uk/download/55713613.pdf"
}