{
    "Title": "The Elementary Persuasive Letter: Two Cases Of Situated Competence, Strategy, And Agency",
    "Authors": "Anderson, Diane Downer",
    "Year": "No year available",
    "Abstract": "Research on persuasive writing by elementary children posits primarily a developmental perspective, claiming that elementary-age children can effectively argue through talk but not through writing. While this view is commonly held, this article presents counterevidence. Drawing on two cases of third and fourth grade children writing persuasive letters gathered during six-month naturalistic studies of literacy practices and social identities in contrastive communities (one urban, one suburban), these data challenge the developmental generalization by showing that children in these settings can write persuasively. Further, this work complicates understandings of children\\u27s persuasive writing by showing how assignments and local cultures shape children\\u27s writing. Evidence is developed through rich description of the case study settings and instructional tasks, a typology of the children\\u27s persuasive strategies, and a critical discourse analysis of the children\\u27s persuasive letters. This study suggests that children in both communities are capable of persuasive writing, although they enact different patterns of response, drawing on locally learned discourses. The settings, the hybridity of the persuasive letter as both argument and letter, and the children\\u27s habitus may account for some of the differences in how the children address the tasks through ranges of centeredness and agentive strategies. Differing patterns of response suggest new frames for viewing and fostering children\\u27s argumentative competence in a range of settings, including understandings of agency. The author encourages a research agenda that accounts for socially situated classroom and community practices, and argues for ongoing research and critique of the power and place of persuasive writing for children in a range of schools",
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " Swarthmore CollegeWorks   Educational Studies Faculty Works   2008  The Elementary Persuasive Letter: Two Cases Of Situated Competence, Strategy, And Agency  Diane Downer Anderson Swarthmore College, danders1@swarthmore.edu   Let us know how access to this work benefits you.  Follow this and additional works at: http://works.swarthmore.edu/fac-education  Part of the Education Commons   Recommended Citation Diane Downer Anderson. (2008). \"The Elementary Persuasive Letter: Two Cases Of Situated Competence, Strategy, And Agency\". Research In The Teaching Of English. Volume 42, Issue 3. 270-314. http://works.swarthmore.edu/fac-education/3  This work is brought to you for free and open access by the Swarthmore College Libraries. It has been accepted for inclusion in Educational Studies Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. The Elementary Persuasive Letter: Two Cases of Situated Competence, Strategy, and AgencyAuthor(s): Diane Downer AndersonSource: Research in the Teaching of English, Vol. 42, No. 3 (Feb., 2008), pp. 270-314Published by: National Council of Teachers of EnglishStable URL: http://www.jstor.org/stable/40171755 .Accessed: 17/07/2014 14:29 .Your use of the JSTOR archive indicates your acceptance of the Terms & Conditions of Use, available at .http://www.jstor.org/page/info/about/policies/terms.jsp .JSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range ofcontent in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new formsof scholarship. For more information about JSTOR, please contact support@jstor.org.National Council of Teachers of English is collaborating with JSTOR to digitize, preserve and extend access toResearch in the Teaching of English.http://www.jstor.org This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsThis content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions270 Research in the Teaching of English Volume 42, Number 3, February 2008 The Elamantarv Persuasive latter: Two Casas of Situated Compatanca, Stratagv, and Agancv Diane Downer Anderson Swarthmore College Research on persuasive writing by elementary children posits primarily a developmental per-spective, claiming that elementary-age children can effectively argue through talk but not through writing. While this view is commonly held, this article presents counterevidence. Drawing on two cases of third and fourth grade children writing persuasive letters gathered during six-month naturalistic studies of literacy practices and social identities in contrastive communities (one urban, one suburban), these data challenge the developmental generalization by showing that children in these settings can write persuasively. Further, this work complicates understandings of children's persuasive writing by showing how assignments and local cultures shape children's writing. Evidence is developed through rich description of the case study settings and instruc-tional tasks, a typology of the children's persuasive strategies, and a critical discourse analysis of the children's persuasive letters. This study suggests that children in both communities are ca-pable of persuasive writing, although they enact different patterns of response, drawing on lo-cally learned discourses. The settings, the hybridity of the persuasive Jetter as both argument and letter, and the children's habitus may account for some of the differences in how the children address the tasks through ranges of centeredness and agentive strategies. Differing patterns of response suggest new frames for viewing and fostering children's argumentative competence in a range of settings. including understandings of agency. The author encourages a research agenda that accounts for sodally situated classroom and community practices, and argues for ongoing research and critique of the power and place of persuasive writing for children in a range of schools. Introduction (Acme Road School) Dear Mrs. Salvo, My name is Brianna and I am a fourth grader at Acme Road School. I am writing to you because I think we should learn to speak a different language. It will help us to be prepared for high school & college. It gives us time to practice it over before we go to high school. If we talk to someone who speaks a different language This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elem e ntar11 Persuasive leuer 271 we will know how to communicate with them. I want to know if we could learn to speak a different language. Maybe you could get some books and a language teacher. Thank you for reading my letter. Bye! Sincerely, Brianna (Westdale-Lincoln School) Dear Lawrence, You must know how I feel about this boy girl thing. I think it is a good idea. I mean, Adam was a pretty good girl! Also, I swear that my mom said everybody she talked to said I was the best actor. I mean it! You should know that I played a girl! Here are my reasons for feeling this way: One reason is because if you look at the costumes you couldn't tell who was a boy and who was a girl. Also my mom doesn't lie to me often. It doesn't matter if you are a boy or a girl, it's how good an actor you are. You could win an award for being an actor even if you were a boy playing a girl. After reading this you should know my position. My position is strong right now. Most people agree with me. My position is strong even though I had to wear tights, pink ones! I was a flamingo and I liked it! Sincerely, Bart For Brianna and Bart, fourth graders in two socio-economically contrastive schools just 5.2 miles from one another (pseudonyms have been used for all loca-tions, teachers, and students), writing persuasive letters to the principal and an unfamiliar theater director, respectively, was an engaging task. The children in both settings completed the task competently, although quite differently, as one can see from Bart and Brianna's letters. Yet persuasive writing opportunities oc-curred rarely during their school year. While developmental research in children's persuasive writing (Anderson, Chinn, Chang, Waggoner, & Yi, 1997; Bereiter & Scardamalia, 1982; Golder, 1992; Golder & Courier, 1994; McCann, 1989) and common beliefs about children's abilities might discourage teachers from assign-ing persuasive writing in elementary classrooms, the third and fourth graders in these urban and suburban elementary classrooms could write persuasively. El-ementary persuasive writing is a powerful genre because it is a scaffold to argu-mentative writing in high school and college, and for citizenship in a democracy. This analysis of two classroom cases of children writing persuasive letters suggests that teachers who include persuasive writing in their curricula and scaffold such writing through talk, explicit forms, and topics on which children have much to say will find that children display competence in their persuasive thinking and writing. However, this analysis shows persuasive writing to be too simple a label for this complicated, varied, situated, and hybridized set of discursive practices. A traditional developmental view suggests that elementary school children can argue orally but are developmentally unready for the complex cognitive task This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions272 Research in the Teaching ol English Volume 42 February 2008 of putting their argumentative thinking into writing, commonly called persuasive writing in elementary classrooms. Developmental views claim the genre is com-plex and children's cognitive abilities develop too slowly to accomplish persuasive writing (Anderson, et al., 1997); children can argue orally but not in writing (Bereiter & Scardamalia, 1982; Golder, 1992; Golder & Courier, 1994; McCann, 1989); and young children lack strategic persuasive and rhetorical sophistication (Crowhurst, 1983; Felton & Kuhn, 2001; McCann, 1989). Golder (1992) has ar-gued further that \"one decisive factor in successful persuasion is the speaker's ability to 'decenter' him/herself, that is, to change from a self-centered focus to a listener-oriented focus, so as to ascertain the listener's perspectives and adapt to them\" (p. 188). He further claims that\" developmental change is clearly evidenced by a tran-sition from a predominantly 'I' discourse to a predominantly 'we' discourse\" (Golder, 1992, in Golder & Courier, 1994, p. 189), a process that happens over time as children mature. I will argue here that aspects of children's persuasive writing that have previously been accounted for as developmentally determined, including issues of centeredness, may be, instead, by-products of social activity. The developmental assumption that children are unable to write persuasively is problematic when one considers elementary-age children's lack of exposure to argumentative texts. Children may be influenced in their persuasive writing by the genres with which they are most familiar from early instruction, such as nar-rative ( Crowhurst, 1983). Children lack instruction in and cumulative experience with specialized genres (Knudson, 1991, 1992), including the reading and writing of persuasive texts (Crowhurst, 1991). These studies suggest that children's lack of school experience with persuasive texts contributes to their lack of skill and to their underperformance on standardized tests in this genre. This situation might be understood to reflect the ain't been taught phenomenon, a concept in special education in which children are locked into remedial placements because they do not have access to the general curriculum needed to progress out of special educa-tion and into the general curriculum, for which one needs prior knowledge. Indeed, children seem rarely immersed in persuasive texts in elementary school. There is, at most, infrequent use of this and other non-narrative genres for el-ementary school reading (Duke, 2000; Pappas, 2006) and a recent review of the past two decades of elementary school writing research makes no mention of per-suasive writing in a section headed \"The development of written genres\" (Chapman, 2006, p. 23). One might reasonably infer, from the lack of non-fiction reading texts and the omission of references to persuasive writing in elementary class-rooms, that this genre of writing is minimally present at best. Although Graves ( 1989) and Derewianka (1990) promoted persuasive writing instruction for young children in the 1980s and 1990s, this genre has only slowly begun to seep into instructional materials (Angelillo, 2005; Christensen, 2000; Reader's Handbook, 2002; Write Source, 2004) albeit without an extensive research base. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementary Persuasive Letter 273 The results of high stakes assessments that test persuasive writing, coupled with a lack of persuasive reading and writing in elementary schools, suggest a critical need for research on persuasive writing in a range of elementary contexts using other than developmental frames, for example, that account for the com-plex intersection of schooled literacy and discursive community practices. Such frames might include experiential or socio-cultural perspectives. Persuasive writ-ing is the primary genre on which students will be assessed as writers, often begin-ning as early as fourth grade and culminating in a written essay on the Scholastic Achievement Test. Persuasive writing is too important a genre to wait until middle school to begin instruction if there is evidence that children in earlier years are capable of writing persuasively. Additionally, the persuasive essay, in all of its dis-cipline- and context-specific permutations, may be considered a de facto genre of power in US society. From the essays written for college admissions applications and in college and university classes, to OP-ED pieces in the New York Times, to Web-blogs, the persuasive essay has the power to enhance the academic capital of individuals and to inspire and incite constituencies. In this article I use the persuasive letters of the urban Acme Road and subur-ban Westdale-Lincoln students and descriptions of their writing milieus to argue for a more complex view of persuasive writing as socially situated literacy prac-tice: When given instructional opportunities as those provided in the cases de-scribed here, children can write persuasively; they do so by drawing on teachers' instruction and on local discourses. The Story of the Questions In the early 1990s, as a new curriculum director for a group of elementary schools ranging from poor and working class to upper middle class, I worked with teachers to develop and implement a local persuasive writing assessment for grades three through six. The assessment was scored through a Registered Holistic Scoring Rubric developed by the New Jersey Department of Education. Administrators and teacher-leaders wanted to know if the children were prepared to write a persuasive essay as a pre-test for what was then the Eighth Grade Early Warning Test, and they advocated for the development of a curriculum and teacher-training based on assessment data. While some of the teachers expressed comfort with the task, one teacher, from the poorest and most predominantly working-class school, Mrs. K, wrote a scathing letter to me, which represented a few other teachers' discomfort with the task. She claimed, \"Children have no opinions,\" and children in \"her school\" couldn't be expected to write persuasive essays. Through further discussions, I learned that Mrs. K's letter reflected two viewpoints: Elementary children cannot be expected to write argument, which for her entailed having \"opinions,\" because they are not developmentally ready; and poor and working-class children in particular cannot be expected to write in this genre, perhaps This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions274 Research In lhe Teaching or Inglish Volume 42 February 2008 because they lack the cultural experience to do so, or perhaps because they wiU not need such skills in the future. I began to think about the intersection of particular writing practices, academic expectations, and social class, and how that intersec-tion might impact classroom practices and student performance. In 1997 and 2000, during lengthy literacy studies that I conducted in two socio-economically contrastive communities, teachers asked third and fourth grad-ers to write persuasive letters. At the more affluent suburban Westdale-Lincoln School, teachers Theresa and Kelly invited children to explore their stances on cross-gender theater casting in small group discussions, and to write persuasive letters after they experienced cross-gender casting in their classroom play, The Llama's Secret. At the less affluent urban Acme Road School, Mr. Gold and the district literacy leader, Mrs. Smith, asked third and fourth graders to write letters to the principal arguing for school improvement. The teachers in both schools assigned tasks based on students' experience and interest. They provided the chil-dren with templates for writing (described under \"participants\" in my methodol-ogy section, below), and the children wrote persuasively to specific audiences. When they completed the tasks, I found that children in both classroom communities had written quite competently (based on Toulmin, Rieke & Janik's [1981 persua-sive construction) first two formal elements of an argument: claims and grounds), considering the lack of persuasive texts in elementary classrooms in general and developmental beliefs about children's lack of facility with persuasive writing. While I did not set out to investigate persuasive writing specifically, after the two studies were completed I was struck with two unexpected impressions. First, based on school assessment data (see Table l) in which the suburban Westdale-Lincoln children scored higher than the urban Acme Road children, I expected the children from the more socio-economically advantaged suburban commu-nity to write far more competently than their counterparts in the poor and work-ing-class community. Yet the urban children's letters seemed generally more pow-erful, concise, and to the point than the suburban letters. The suburban letters, on the other hand, seemed repetitive and self-centered. Second, in spite of the rela-tive competence of both sets ofletters, I was intrigued by how different the letters were in length, in formality, in strategies, and in tone. I wanted to know more precisely how the letters in my research sites were persuasive and what that might mean for the children's futures as academic writ-ers and test-takers. I wondered about the ways in which social-class positions and discursive knowledge might be involved in persuasive writing. I wondered how children's rhetorical strategies previously seen as products of development might be linked to the contexts in which they learned to talk and write. The overriding questions guiding this study were \"What does children's per-suasive writing look like in two contrastive settings, and what influences shape the This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementary Persuasiue letter 275 TABLE 1: Demographic Facts Suburban School District Urban School District 2005 Pennsylvania State Average Economically disadvantaged households 7.9% 67.6% 28.1% Single-parent households with children 10.2% 33.0o/o 11.0% Residents with bachelor's degree 23.8% 8.5% 23.8% Students' proficiency in reading 82.4% 21.0% 64.4% Students' proficiency in math 78.5% 20.3% 61.1% 2005 Average SAT scores 1169 767 1028 •sources: All data obtained from Standard and Poor's School Evaluation Services (accessed 4/03/06) and the Pennsylvania Department of Education <http://www.pde.state.pa.us/> (accessed 4/03/06). children's persuasive writing?\" I used the two cases as an opportunity to analyze the following sub-questions: • How are the letters persuasively competent? What strategies did students employ to persuade their respective audiences? • How did the immediate classroom settings and instructional experiences shape student writing? • How is the genre of the persuasive letter implicated in students' writing? • How are social-class positions, discursive knowledge, and agency involved in persuasive writing? In the next sections, I establish a frame of situated socio-cultural practice in children's persuasive writing in order to raise questions about the place and mean-ing of persuasive writing in elementary classrooms. I explain the intersection of social practice, identities, and discourse to lay the foundation for interrogating ideas of persuasive strategies, centeredness, and agency. Then, using theoretical frames of socially situated practice and critical discourse, I describe and interpret two cases of children's persuasive writing across the two socio-economically con-trastive settings in order to demonstrate the situated competence and complexity of the children's writing. I show how the teachers' assignments in their respective settings shaped but did not determine student performance. I identify the strate-gies children used to convince adults of their point of view as a way to account for the situated discursive and strategic persuasion in the children's writing. I argue that children can write persuasively and should be given access to opportunities to read and write persuasive texts. I further argue that it is incumbent upon re-searchers to learn how persuasive writing, as a discourse of power, functions in This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions276 Research ltlhe Teaching or Inglish Volume 42 February 2008 situated practice-even among young children-in order to inform curriculum development. Theoretical Frames Although early research frames persuasive writing developmentally, Yeh {1998), Crowhurst (1991), and Crammond (1998) have noted the social practice and discourse aspects of learning to write persuasively, complicating developmental and even experiential explanations. Yeh, in acknowledging the constraints of ethnicity, gender, and setting on students' persuasive writing, claims that minori-ties who have limited access to the discourses of dominant culture benefit greatly from the use of heuristics, that is, explicit procedures for accomplishing the complex task of articulating claims, support, and elaborations in persuasive writing. While Yeh focuses persuasive instruction on giving minorities access to the discourses of the dominant culture, Crowhurst ( 1991) implies that instruction might include a more expansive range of persuasive strategies, including, perhaps, non -dominant discursive practices. Crowhurst asserts that persuasive writing is, in practice, a \"complex cognitive and rhetorical task\" and that \"students must learn that there are many ways of elaborating and supporting reasons, and many different ways of persuading- that irony and allegory, for example, may persuade as well as, and sometimes better than, reasons clearly stated and well-supported\" (p. 332). Crammond {1998) claims further that \"meaningful assessment or production of persuasive text cannot proceed unless grounded in an appreciation for the social context or community in which it occurs\" (p. 16). Although Yeh ( 1998), like Delpit (1986), suggests the explicitteaching of domi-nant discourses and genres to children outside of mainstream middle-class US society, these children do not lack discursive practices. The pervasive view that the inadequate home discourses of minorities, poor, and working-class children pre-vent them from excelling in school-based literacy (Sigel, 1984; 1991; Ellsworth & Sindt, 1994)1 often obscures a more complex understanding of how literacy, and development, are socio-culturally shaped. For example, as Heath (1983) showed in Ways with Words, working-class African American children from the Trackton community were more prepared to use sophisticated figurative language in their discourse than they were to show basic one-to-one word correspondence, and may have benefited from a more challenging and rich early school literacy experi-ence, such as the expansive discursive instruction advocated by Crow hurst ( 1991). Explanations of persuasive writing as socio-cultural practice opened ways for me to understand the suburban and urban letters in my study and helped me to explore the distance between what the developmental research has claimed and what these data show. Therefore, I assumed that, like all literacy practices, the writing of the children in these two schools was socially situated discursive prac-tice. I turned to recent studies of literacy, identity, and discourse as social practices This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementarv Persuasive Lener 277 to frame my analysis (Dyson, 2003; Lewis, 2001; Rogers, 2003; Sperling, 2003) so that I might learn more about the children's persuasive writing strategies. These recent studies assume oral and written discourse to be cultural resources, that is, funds of knowledge (Moll, Amanti, Neff, & Gonzalez, 1992) that children bring to school and may or may not be asked to use in their responses to school tasks. Bourdieu' s conception of habitus, field, and capital ( 1999; Bourdieu & Passeron, 1990) helps to explain what children bring to school and how the school responds. Bourdieu explains how habitus (the sets of internalized dispositions drawn from cultural capital that persons accrue over time) operates in social spheres. Social locations influence how people learn, act, and construct identities. Literacy is an aspect of habitus, \"a complex functional process that is exquisitely context-bound\" (Sperling, 2003, p. 138); this process is value-laden, entails issues of equity and discrimination, and has political consequences (p. 146). Thus, literacy practices are intertextual and multi-voiced social practices (Bakhtin, 1981, 1986), bearing the imprints oflocal discourses as well as schooled discourses, intersecting as well with ideologies and institutional interests. Learning is at once developmental and socio-cultural, as Vygotsky ( 1978) has claimed. In their theory of legitimate pe-ripheral participation, Lave and Wenger ( 1991) explain the ways in which people become, i.e. are socialized into particular identities, by participating alongside others in particular practices through language. Lave and Wenger understand learning as \"an aspect of all activity\" (p. 38) and as a \"way of being in the social world\" (p. 24). As people live, talk, and act, they absorb the habitus of a given community, and are absorbed into a \"community of practice\" (p. 95) and its discourses through lan-guage and activities. They become literate beings particular to their communities; who they are and what they do are one and the same. \"Learning and a sense of identity are inseparable: They are aspects of the same phenomenon\" (Lave & Wenger, 1991, p. 115). Yet what literacies one acquires, and the literate person one becomes, will show in one's writing and has political consequences across time and spaces. Like Lave and Wenger (1991), Gee (1996) understands the social identity and participation aspects oflearning. Gee claims that\"learning involves engaging in a process whereby one becomes a fuller and more valued participant in a specified social practice\" (cited in Lewis, 2001 , p. xvii). Gee, too, conceives of discourse as central to learning. Gee's use of discourse analysis goes beyond classroom talk to include how identities are constructed within broader institutional discourses and the ideologies they index. For example, Anyon ( 1980) found evidence that schools tend to educate for particular social classes through differentiated classroom in-struction, a \"hidden curriculum\" located in classed communities, and thereby in-dex students' futures. Gee ( 1999) has used critical discourse analysis to show how socially situated working-class and upper-middle-class identities are inscribed in the ways that adolescents speak to their interests and values. Invoked discourses This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions278 Research In the Teaching or English Volume 42 February 2008 can index the \"hidden curriculum;' as well as position persons locally, ideologi-cally, and institutionally. In describing the classroom settings and analyzing these persuasive letters, I have drawn on the theories of Bourdieu (1999), Vygotsky (1978), and Lave and Wenger (1991), as well as followed the lead of Anyon (1980), Gee (1990, 1996, 1999), and others (Lewis, 2001; Rogers, 2003, 2004; Sperling, 2003) to show how social positions, and concomitant identities, are discursively embedded in writing tasks and how local discourses stand in relation to expectations for schooled per-suasive writing. For the children, becoming writers through contextualized lit-eracy tasks stood at the intersection of literacy practices, social identity forma-tion, and discourses. The persuasive letters produced by the children were nested in contrastive classroom settings, which in turn were nested in local communities, which in turn were nested in institutional discourses. Methods Given the institutional importance of persuasive writing and its importance to children's social futures, I wanted to understand the contexts, processes, and products of the persuasive events at Acme Road and Westdale-Lincoln schools. Persuasive writing tasks at any given school might appear culturally neutral, but they are not. Each task grows out of the community in which it is embedded. Each task in this study evoked a response that, in the end, had the children in the two communities writing in ways that were argumentatively effective yet strategically different, in ways that indexed present social identities and reflected potentially different social and academic futures. The analysis of these two cases in contrastive classrooms resulted from ethnographic techniques of data collection informed by socio-cultural and critical discourse perspectives on literacy. Data Collection I collected data in combined third and fourth grade classrooms in both schools as part of larger literacy studies on the intersections of literacy practices and social identities, each conducted within a period of two to four months of preliminary weekly observations (September through December) and six months of intense, three-days-per-week participant-observation {January through June). The Westdale-Lincoln study in a suburban district was conducted in 1996-1997 and the Acme Road study in a nearby urban district was conducted in 2000-2001. Westdale-Lincoln was originally chosen because its progressive curriculum and instruction allowed me access to children's talk as they practiced literacy (Anderson, 2002). Acme Road was chosen after an extensive search for an urban classroom that was multi-age and instructionally progressive such that it allowed me access to student talk as students participated in language arts. In both cases, it was important that the teachers and principals welcomed classroom research. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The 11emen1arv Persuasive Lener 279 Although the classrooms were in communities and school districts of differ-ing social classes, there were strong commonalities of instructional methods in the two sites. Both classrooms showed some degree of what Dyson (1993) calls a permeable curriculum, one that welcomed children's language and experiences from home and the community, creating a degree of seamlessness between children's social, cultural, and school lives (B. V. Street, personal communication, July 3, 1998 )-although the suburban classrooms, with their student -centered, non-textbook curriculum, allowed more of the children's self-initiated literacies in to the classroom (see Anderson, 2002, and Anderson, in press, for examples). All three multi-age classroom teachers (two in Westdale-Lincoln, one at Acme Road) were involved with the language and literacy program at a nearby university, ei-ther through a post-graduate program or through an intensive teacher in-service program, based on an ideology of literacy as psycholinguistic and socio-cultural practice. For the full studies, of which these two case analyses are a part, I used ethno-graphic methods of data collection: participant observation; field notes; transcripts of audio-taped literature discussions and writing conversations; interviews with children, teachers, and principals; and site documents. For the present analysis, I drew on field notes, informal interviews with teachers and principals, audiotapes of discussions, and site documents from the specific persuasive writing event in each setting. The persuasive letters that form these cases emerged spontaneous to the sites, i.e., the teachers assigned the persuasive letters as part of their classroom curricula and shaped the tasks on their own, without assignment from me (al-though I was encouraging to the teachers in these tasks) as the participant-observer or in response to an out-of-school curricular directive or upcoming as-sessment. In this analysis, descriptions of the sites and the specific literacy events were drawn from field notes and daily informal interviews with teachers regard-ing their lesson plans. In the case of the play \"The Llama's Secret\" in Westdale-Lincoln School, two audio-taped and transcribed discussions and one set of hand-written notes taken by the classroom teacher were used for this analysis. In the case of the letter to the principal at Acme Road School, I depended upon field notes of the actual event, one retrospective interview with the teacher, and an informal conversation with the principal (see Tables 1 & 2). Sites Suburban Westdale-Lincoln School and urban Acme Road School are 5.2 miles apart, near in a geographical sense, but quite distant demographically. Data from these adjacent communities are startling in their contrasts (see Table 1). The economically disadvantaged households of the urban district outnumber those of the suburban district by more than eight to one. There are three times as many single-parent households in the urban as compared with the suburban district. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions280 Research in the Teaching of English Volume 42 February 2008 Not surprisingly, the suburban district encompasses approximately four times as many children who read and do mathematics proficiently than the urban district. Racially, the urban district is officially described as almost 90o/o \"Black\" and the suburban district as over 86o/o \"White\" (see Table 2). Yet, the two classrooms in which these studies took place were more mixed than one would expect, given these data (see Table 3). Acme Road, in the urban district, in particular, included a more racially mixed group of children. Westdale-Lincoln School Westdale-Lincoln School is located in a K-12 suburban regional district in Westdale and has 6,500 year-round residents. The district consists of one high school, one middle school, three elementary schools, and one kindergarten center. Although students at Westdale-Lincoln are bussed in from other areas of the district, the school is primarily comprised of children from Westdale and the TABLE 2: District Enrollment of Racial/ Ethnic Groups (2004) Suburban School District Urban School District State Average White 86.3% 2.9% 77.2% Black 7.5% 89.5% 14.9% Hispanic 0.7% 7.5% 5.4% Asian/ Pacific Islander 5.3% 0% 2.3% American Indian/ Alaska Native 0.1% 0% 0.1 o/o • Source: All data obtained from Standard and Poor's School Evaluation Services, 2004. www.schoolmatters.com, accessed 6/9/06. TABLE 3: Gender and Ethnicity of Classes Theresa & Kelly's Classes Suburban Westdale-Lincoln ( n=45) Mr. Gold's Class Urban Acme Road (n=29) European-American 40 13 African-American 2 14 Asian or Asian-American 3 0 Latino/ a 0 2 Male 25 17 Female 20 12 This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementarv Persuasive Leiter 281 nearby small town of Lincoln. Ninety-three percent of the students are categorized as White/European American and 7% as non-White, including African American, Asian American, or Latino. While the residents of tiny Lincoln are primarily working class to middle class, Westdale is a mix of affluent professional, executive elite, and middle-class residents. The school, like all of the schools in the district, has received a Presidential Blue Ribbon of Excellence. It is highly influenced by the presence of a small college two blocks away, which sends college student observers and student teachers into the school. Additionally, the resources of professorial and professional parents and the college's facilities and arboretum serve the school. The percentage of children on federally-funded free or reduced lunch at the time of the study was a mere 2.5, although socio-economic background did not correlate with race or ethnicity in this school. Westdale-Lincoln is structurally and aesthetically beautiful. It is built of lo-cally quarried stone and permanent artist-in-residence productions grace the ex-teriors and interiors of the building. The principal, a progressive African Ameri-can woman, was a former teacher at the school, with a commitment to literature and the fine and performing arts. She and the superintendent invested their own time and money into such activities as children's chamber music groups. They were committed to out-of-school support for children who could not afford pri-vate lessons or musical instruments. Although Westdale-Lincoln has won national school awards and graduated a high proportion of gifted children, the principal felt compelled in the mid-1990s to schedule monthly all-school meetings to teach proper auditorium behavior and conduct efforts such as the \"Smart AND Polite\" program. She described the complaints she'd heard from visitors that children were noisy in the hallways, in-formal and impolite to strangers who entered the building, and unruly (e.g., not forming lines or being quiet when asked) on field trips. Parents were ever-present in the school, free to walk into their children's class-rooms at any time. The home and school association was robust as they conducted fundraising for curricular efforts and enriched classrooms with materials. Parents were involved in chairing such committees as \"Dimensions in Math.\" Parents whose children didn't get into the \"right\" teacher's classroom complained directly to the principal; one stood outside her daughter's multiage classroom door taking notes to justify her complaints. Parents called their children's teachers directly and fre-quently, often offering advice on how to teach their child correctly. Teachers at Westdale-Lincoln responded to the parents' extreme interest in various ways. A fifth grade teacher called parents regularly to check in and ask the parents for their input. Others worked hard to include parents in classroom ac-tivities, including reading to and with children. However, some teachers worked to keep parents at the edges of or outside of their classrooms in spite of the tacit open-door culture of the school. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions282 Research In the TeaChing ol English Volume 42 February 2008 Acme Road School In contrast, Acme Road School is located at the edge of a small mid-Atlantic post-industrial city of extreme poverty in an area comprised of small homes and tree-lined streets. In 2000, the graffiti on the federal highway that cuts through the city in which Acme Road School sits read \"Heart over Capital.\" At the time of the study, the school contained approximately 425 students in grades 2 through 8. Low-income students comprised 61% of the students, with 53o/o on federally free lunch and 8% on reduced lunch programs. Although it was not the poorest of the city's elementary schools, this was a school that served children of poor and working-class parents. Like Lincoln-Westdale School, socio-economics were not consistent with race or ethnicity. A child was just as likely to be poor or working class no matter his/her race or background. The principal was a European American woman who had been an adminis-trator in the district for most of her career and a principal at Acme Road off and on for a few years; I often saw her in the hallways and classrooms. Students, fac-ulty, and staff respected her as she had a reputation as organized, kind, and firm. She was willing to enact whatever the school district's central office mandated and expected her teachers to implement curriculum and tests, but she did not micromanage curriculum or instructional methods. Parents and visitors had less access to Acme Road School and classrooms than in the suburban school. Everyone had to be \"buzzed into\" the building and sign in at the office before proceeding, with permission, to a classroom. I rarely saw par-ents in the school during the day, although they were often lined up outside, in cars and on foot, to pick up their children at the end of the day. Occasionally they stopped by a teacher's classroom after school, but they were more likely to talk with teachers during official conferences or outside of the school when a teacher brought his or her class out for dismissal. Parents, grandparents, or guardians tended to check on the children's behavior and progress. I did not hear curricu-lum and instruction discussed by parents and teachers during this study. For ex-ample, one grandfather stopped by at least once a week to check up on his grand-son, a struggling reader with behavior problems, a boy whose estranged mother had, reportedly, recently taught him to shoplift. Another student's mother was a parent-teacher association officer who helped in the library. These were the only parents or grandparents I actually saw in the classroom during the six months I was involved in intensive data collection. Participants Westdale-Lincoln School: Kelly and Theresa,s Multi-age Classes Kelly and Theresa, European American teachers in their twenties, were close professional friends who worked together to prepare curriculum and to organize the children for combined grade teaching and flexible grouping. The children addressed the teachers by their first names, a common but not universal practice in This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The llementarv Persuasive leiter 283 Westdale-Lincoln School. Children were grouped by competencies and interests rather than by grade level. Kelly and Theresa were liked and beloved by their students. Their child-centered and individually focused classrooms, where chil-dren spent most of their time working in groups or on their own projects, were often noisy, busy spaces; Kelly and Theresa worked hard, but with entreaties rather than loudness, to obtain quiet and to get the children's attention. There were a total of 45 children in the Westdale-Lincoln study, 20 girls and 25 boys. Of the 45 children, 40 were European American, 3 were Asian or Asian American, and 2 were African American (see Table 5). Parents of one child de-dined permission for participation in the study. Theresa and Kelly designed their own language arts curriculum, which could be described as a language experience approach (Moffett & Wagner, 1983) or whole language (Atwell, 1998; Calkins, 1994; Goodman, 1986; Weaver, 1990 ). There were no textbooks, but there were daily literature discussion groups based on a range of teacher-chosen trade books purchased in multiples of six, and content area writ-ing of the narrative, expository, personal, and poetic genres. During discussions, children argued vigorously, often in girl-versus-boy dyads. A process approach to writing (Calkins, 1994) was used which included pre-writing experiences, draft-ing, conferencing with teachers and peers, revising, and editing. Students spent most of their language arts time reading self-chosen trade books, writing in re-sponse to teacher assignments, writing their own stories, and talking, often about what they were reading and writing. The children spoke and wrote such that their strong opinions, on everything from sexism to what their stuffed animals were worth on resale, were dear to any audience. They also wrote lengthy stories alone and in single-sex groups, and their stories often crossed home-school boundaries (Anderson, 2002; Anderson, in press). Standardized tests were not linked directly to the curriculum. Students in the district and school were among the highest scoring students in the state. Teachers and parents assumed children would do well no matter the curriculum. The teach-ers did not differentiate between third and fourth graders, although the fourth grade girls in Kelly's class occasionally organized themselves into their own group, complaining loudly about the immaturity of their third grade classmates. Acme Road School: Mr. Gold,s Combined Class Mr. Gold, an early middle-aged European American man, was well liked by his students, their parents, and the principal. Because he had few discipline problems, he spent most of his time teaching. He responded firmly and strongly to misbehavior, often isolating a student in the room or taking away a privilege, such as computer or recess time. When students were too noisy or misbehaving, he responded first by bellowing, \"OK. OK guys\" and then calling individual students out with specific instructions for moving or getting quiet. When he had the students' attention, he would speak quietly and icily to restore order. He and the This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions284 Research In the Teaching of English Volume 42 February 2008 students recovered from these moments very quickly, and amity would return. I never saw him send a student to the office, but I did see other teachers send misbehaving students to his class. As one of the few male teachers in the school and the only one in the lower grades, his authority carried weight with the children and was respected by the parents. Mr. Gold's class was comprised of29 students, although the numbers changed throughout the year as students moved in or out of the classroom or were classi-fied in need of special education. There were 55% non-European American stu-dents (14 African American and 2 Latino) and 45% European American (13). There were 12 females (7 third graders and 5 fourth graders) and 17 males (12 third graders and 5 fourth graders). (See Table 3.) According to Mr. Gold, he had asked for the best of the fourth graders because he had volunteered to take the combined multi-age class. Multi-age and combined classes are usually designed for reasons of instructional philosophy (as in the Westdale-Lincoln School), or for convenience, when there are not enough students to fill two classes of third and fourth graders (as in the Acme Road School) {Chase & Doan, 1994; Goodlad & Anderson, 1987). Although Mr. Gold had been trained at a local university in whole language methods of teaching, and yearned to use them, he was restricted to using the grade-leveled textbooks that were labeled \"whole language,\" yet were different from phon-ics-based basal readers primarily in their inclusion of trade literature and writing tasks. He separated his third and fourth graders for language arts instruction (as well as mathematics), because the district monitored his students' progress through textbook-linked chapter tests and district tests that were administered regularly. Additionally, standardized tests were more closely linked to the curriculum through the textbook. He did manage to \"squeeze in\" content-area writing (narrative, ex-pository, and poetic genres) with the assistance of a traveling literacy leader, who came in once a week to give a separate lesson. Mr. Gold also worked to get stu-dents to revise, edit, and re-copy their writing, although the textbook took up much of the class time for language arts. When he had a choice of activities sug-gested by the teaching manual, he tended to choose those that required students to think, write, and discuss. After the standardized tests were administered in the spring, Mr. Gold imple-mented literature discussion groups in which the children focused on their roles as discussion leaders, vocabulary mavens, and questioners. In general, students sought agreement on themes, character traits, predictions of the next section of text, and whether a book was good or bad. Mr. Gold also organized extended projects with the students, such as his own popular research project on birds. Mr. Gold had set up a feeding station outside his window that attracted a rich range of local species. Thus, the children spent the year eagerly awaiting the time when they could choose a bird and do their written and visual bird projects. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON Tha llamantarv Parsuaslva lanar 285 Students worked to complete assignments accurately and in such a way that would please Mr. Gold. Although there were typical conflicts and teasing between children, the children tended to express conflicts on the playground and out of the sight of their teacher. Peer arguments rarely entered the realms of the Mr. Gold's classroom and curriculum. In the next section, I describe how the persuasive writing tasks evolved in each class. I will show how the children were prepared for writing by their class-room experiences and specific instruction for the writing task. The Persuasive Writing Tasks Westdale-Lincoln Letters: Dear Lawrence Kelly and Theresa, committed to progressive notions of education (Bruner, 1960/ 1977, 1966; Dewey, 1938/1997), had the agency to develop their own third and fourth grade curriculum. The principal expected them to create a program-based multi-age classroom, and they were not bound to particular textbooks or grade-leveled practices. They planned their routines and curriculum the summer before school started. They combined their classes for much of the day to provide opportunities for enrichment and acceleration of precocious children and for collaborations among children, but without separating the children by grade. They wanted classrooms in which children could satisfy their own interests; therefore, they provided choices for children in reading, writing topics, and projects. Kelly and Theresa felt, and I could see, that most of the children thrived in their program. As well, one can see in Table 3 that children in their suburban district performed well on standardized tests, and study participants were no ex-ception. Because children in the school tended to do well on standardized tests, they were not overly constrained by annual assessments. Most of the children ap-peared self-initiating, responsible, capable of making good choices, and usually capable of staying on task. The teachers found that a few children needed more structure than they provided, and they attempted to individualize with more struc-ture, deadlines, and limited choices for those students. As the year proceeded, however, Kelly and Theresa became more and more concerned about the sexist behaviors of the children. The school is located in a town where a liberal sense of equity pervades and feminists abound, and where there are competitive boys and girls' soccer teams, male and female doctors and professors, and the occasional stay-at-home dad. Yet the children were very fo-cused on gender differentiation, perhaps because those lines were so clearly con-tested and blurred within their community. In other words, in a context in which being a girl or boy did not easily differentiate children vis-a-vis activities and dress, the children did more work on their own to establish those distinctions (see Ander-son, 2002). There were daily comments spoken loudly by some boys and soto voce by some girls, and behaviors that demonstrated how the children were working to This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions286 Research In the Teaching or English Volume 42 February 2008 place themselves in gendered roles, as they understood them. For example, one day Kelly asked the children to \"clean up and line up at the door\" for outdoor recess. Although Kelly used the inclusive word \"children,\" all of the girls except one promptly started cleaning up while all of the boys promptly lined up, without cleaning up. Kelly restated her directive slightly differently: \"All boys and girls should clean up, and then all boys and girls should line up:' By being conscious of children's gender play (Thorne, 1993) and interpreting much of it as cultural sexism, Kelly and Theresa determined that they would use a classroom Noah's-ark-type text, The Llama's Secret(Palacios & Reasoner, 1993 ), as their impromptu class play. They rewrote it so the girls would play the male ani-mal parts and the boys would play the female animal parts. They created strong female parts, reasoning that the boys needed to know that women are powerful. To the teachers, the children appeared to accept the cross-gender casting. After practicing for approximately five weeks, the children performed The Llama's Se-cret for the school and for the parents. But the children were not quite as amenable to the cross-gender casting as the teachers apparently believed. Tensions of a gendered nature arose during small-group rehearsals that were supervised by parents and/or myself (the researcher) while the teachers were in their classrooms conducting small instructional groups. An ongoing conversational topic between boys and girls was that of\"voice;' with boys insisting that boys have deeper voices than girls and girls insisting that voice differences occur after puberty. Dave, for example, asked, \"If boys have girls' parts, shouldn't they make their voices higher and shouldn't girls with boy's parts make their voices lower?\" Callie responded, \"No! I have a low voice:' Boys and girls were also very interested in the costumes that a small group of parents were assem-bling. In general, the girls noted with glee and the boys with annoyance that both the boy and girl animals would be dressed the same, even when that meant that both girl and boy flamingoes (playing the opposite sex) would be wearing pink tights. The rehearsals and informal discussions gave the students much to draw on in their post-performance formal discussions and letters about cross-gender casting. After the play was performed, the teachers arranged the students randomly in three groups for formal discussions prior to writing their letters, with the teachers and myself acting as non-directive facilitators. Two discussions were audio-taped; one was captured in extensive notes (the tape recorder malfunctioned). Children were asked how they felt about the experience of boys playing girls' parts and girls playing boys' parts. They talked at length about physical factors (clothing, voice, hair, age, size, facial expressions, make-up, and pierced ears), non-physical factors (acting skill, talking, audience reaction, behavior, and cursing), and the quality of the experience (their personal feelings, opportunities and challenges in acting, creativity, and actors being coerced into playing roles they did not want to play). Much of what they said functioned to distinguish between boys and girls. For This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The llemenlarv Persuasive Lener 287 example, boys and girls focused on how boys curse more than girls, although there was no cursing in the play. The discussions took approximately 30 minutes, after which students went back to their classrooms to write their Dear Lawrence letters. The quality of the discussions was reciprocal and argumentative, with students able to present their ideas, hear them argued, and rebut counter-arguments. Teach-ers controlled the discussions to the extent of letting everyone speak but not to the extent of controlling the content or students' opinions. In order to \"stretch\" (Theresa, interview) the children with a more compli-cated writing genre, the teachers organized a format for the students to follow, assigned an addressee ahead of time, and agreed to present the assignment to the students so that, through scaffolding, the children would be aided in writing an academic essay in which they presented an argument and assumed a particular stance. The addressee was a theater director that the children did not know, Mr. Lawrence Holbrook, whose name was written on the board. The handout con-tained a standard format for a letter and the template for each of three paragraphs, which started with the following sentence stems: Paragraph 1: You must know exactly how I feel ... Paragraph 2: Here are my reasons for feeling this way ... Paragraph 3: Having read this, you should know my position ... The students were directed to take a position on whether they thought cross-gender casting was a good idea or bad idea and to draw on their experience, the discussion, and their opinions to argue their position. The letter form (heading, body, dosing) was not discussed. Of the 38 essays that were turned in, 26 children took a stance in favor of cross-gender casting, six were against it, and six were ambivalent.l Acme Road Letters: Dear Mrs. Salvo The first time I visited Mr. Gold's multi -grade class, I was collecting classroom data for a district-wide literacy evaluation. Mr. Gold appeared to be carefully slipping rich literacy experiences into an otherwise tightly constrained curriculum, one on which the children were tested every six weeks. Mr. Gold was organized, firm, and kind. The students seemed genuinely happy to be in his classroom. Mr. Gold seemed pleased to have a visitor to his class, as did the children, who immediately shared their writing with me and asked for help with spelling. He talked about his classroom reading and writing practices, his students, and teach-ing in general. I found Mr. Gold to be committed to the children and open to new ideas, in spite of textbooks, assessments, and a district culture of low expectations for the children. Thus, I asked and was granted permission to do a follow-up study in literacy practices and social identities in his classroom during the 2000-2001 school year. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions288 Research In the Teaching of Inglish Volume 42 February 2008 Mrs. Smith, a district literacy leader, was an African-American woman who lived in the community. She arrived once or twice each week and led the children into personal reflection and self-esteem building writing, often of the poetic type. She always arrived with props (usually candles, seashells, pieces of cloth, and bas-kets of inexpensive prizes for the well-behaved and first-finished). The children shared with me that they loved her for her smile, her soothing voice, and the posi-tive energy she generated. She seemed to glow with enthusiasm, and they seemed to thrive in her presence. While Mr. Gold was kind and fair, but firm and authori-tative, Mrs. Smith was warm, sweet, and encouraging. One week, Mrs. Smith and Mr. Gold led the children in a discussion about Acme Road School and their ideas about what would make the school a better place. Mr. Gold made clear to the students that the principal, Mrs. Salvo, would take their letters of suggestion seriously and that she often picked an idea or two from students' letters to her to implement. The principal later told me that she did this exercise with the children every year because \"it makes them feel more in-vested in their school, and they feel like they have some influence over their school.\" When the children offered little immediate response to the topic, Mr. Gold suggested maybe they could write about something that they were presently not allowed to have or do. As the children came up with ideas, Mrs. Smith listed them on the board. They were encouraged to draw on their experiences in the school and community. Teachers and students did not argue with or disparage any of the suggestions during brainstorming. Based on a rumor that the school would soon be privatized, some children suggested that they be allowed to study a language, such as Spanish. They also suggested that they be allowed to wear bandannas, have more outdoor recess, and have soda available to them, as well as to the teach-ers, in vending machines. Even the suggestion about wearing bandannas was ac-cepted with little discussion, with everyone seeming to understand that the ban-danna ban was due to gang activity in the city. Mrs. Smith modeled the letter form on the chalk board, including a standard heading; a body, including a persuasive idea and three facts to support their idea; a thank you; a dosing; and a signature. In their letters, the students made many suggestions, including having more/longer recess and gym (six students), getting soda machines (three), allowing the use of bandannas (three), receiving instruc-tion in foreign languages (two), allowing gum chewing (two) ,installing playground equipment (two), bringing kindergarten and first grade back to the school (two), lengthening the school day (one), instituting school on Saturday( one), creating a celebration at the end of the year (one), having no homework (one), creating a gymnastics program (one), and making a clubhouse (one). By the time I left the research site at the end of the year, the principal had not decided which of the ideas to implement. The following year the school was privatized, and the princi-pal was re-assigned. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementary Persuasive Letter 289 While this literacy experience was not typical of daily experience for the chil-dren in this school, it was typical of an occasional open assignment between Mr. Gold's class and the principal. Although use of the persuasive letter has more gen-erally moved into schools from state-administered assessments, and is generally done as test preparation prior to a test, at Acme Road it occurred as enrichment from the literacy leader after the standardized assessment. The children seemed to perceive the challenge of the persuasive letter to the principal as a fun, un-graded assignment, perhaps supportive of assessments that would arise further into their futures. Additionally, Mr. Gold and Mrs. Smith's emphasis on standard letter form, including a \"thank you:' is not surprising, given that this letter grew out of a re-quest from students to the principal, someone in a local position of authority and power. While the Westdale-Lincoln children were writing to advise a stranger in the theater profession, the Acme Road children were writing to a proximate other, a respected local authority, whom they knew and who knew them in turn. Data Analysis Data analysis was re-iterative, with each pass through the data yielding a new set of categories and suggesting a new analytic lens. Ultimately, the analysis allowed me to describe how writing the genre of the persuasive letter evolved differently in each school, producing letters that engaged their addressees in quite different ways (see Tables 4 and 5). In my first pass through these data, I analyzed the content (topics & opin-ions), length, general appearance (neatness & legibility), and tone (attitude & for-TABLE 4: Data Analysis- Suburban Westdale-Lincoln Data Source Categories Pass 1 Rehearsals for class play Class play 3 small group discussions (audio taped) Persuasive letters Content Length General form General tone Template (handout) Informal teacher/principal interviews Pass 2 Persuasive letters (speech segment coding) Stances Reasons Elaborations Forms 1-you statements (including politeness) Pass 3 Persuasive letters (persuasive strategies coding) Benefit of others Repetitions Politeness Engagement with addressee This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions290 R esea reb In I he Teachl na of Enallsh Volume 42 February 2008 TABLE 5: Data Analysis- Acme Road Data Source Categories Pass 1 Class discussions Content Classroom instruction Length Template on chalkboard General form Persuasive letters General tone Informal teacher/principal interviews Pass 2 Persuasive letters (speech segment coding) Stances Reasons Elaborations Forms 1-you statements (including politeness) Pass 3 Persuasive letters (persuasive strategies coding) Benefit of others Repetitions Politeness Engagement with addressee mality) of the letters. I wanted to discern, in a general way, the students' ideas and to appreciate the general strategies the children used to convey their stances and reasons. However, I also wanted to discern their rhetorical strategies more specifi-cally. Although written argument is traditionally analyzed using the four elements of an argument-grounds, warrants, backing, and qualifiers (Toulmin, Rieke, & Janik, 1981)-these categories were insufficient for the children's letters, as these categories did not capture these children's complex persuasive strategies, the \"many different ways of persuading\" that Crowhurst ( 1991, p. 332) referred to. I wanted, then, to understand the assignments in a contextualized way and to discern how the children enacted their social and cultural locations through their writing, as Crammond (1998, p. 16) recommended. In my second pass through these data, therefore, I used meaningful language segments as the unit of analysis to unpack the various functions that words and phrases served in the letters. I broke the letters into meaningful segments: sen-tences, phrases, and words that performed different functions within the letters. For example, in the sentence, \"I think you should do this because it is fun,\" I iso-late the following overlapping segments and their function: I think you (establishes I-you, subject/object relationship) you should do (directive) do this (claims stance; \"this\" refers to the stance established earlier in the paper) because it is fun (supplies reason/support for stance) This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The llamantarv Parsuaslva tauar 291 Discourse analysis of this type is interpretive, tentative, and inexact. However, this type of speech-segment analysis gives a grounded theorist (Strauss & Corbin, 1990) quantitative support for findings and conclusions. Every speech segment in the letters from the two schools was classified ac-cording to how it functioned in the letter. I drew from interactional sociolinguistics (Davies & Harre, 1990; Gee, 1991; Ochs, 1993; Tannen, 1993; Wortham, 2001) to begin to account for the children's stances and content to see how each speech segment functioned within each letter. Tannen ( 1993) specifically provides dis-course analytic tools for seeing how language indexes the social world through frames of expectation that are evident on the surface of language. \"Because it is fun\" expresses an expectation of\"not fun\" by marking the activity as \"fun.\" Coates (1993), Davies and Harre (1990), and Ochs (1993) provide tools for seeing how social positioning is embedded in discourse, such as pronominal positioning of the writer telling the audience what to do inherent in\" You should do this.\" Wortham (2001) has shown how persons narrate themselves as they\"readily adopt charac-teristic positions, with respect to others and within recognizable cultural patterns in everyday social action\" (p. 12). In the example above, the writer enacts a cul-tural practice of providing a reason, \"because it is fun,\" while positioning her/ himself as the \"teller:' thus mitigating the harshness of the telling with a cheery reason. The categories that I isolated included form, stances, reasons for stances, elabo-ration of stances or reasons, 1-you statements, including politeness. I coded as \"form\" all phrases that were in standard letter form and able to be removed from the letter without losing central meaning. I coded as \"stances\" a student's direct statements of a position or an opinion, such as \"cross gender casting is a good idea.\" I coded as \"reasons\" those reasons that directly supported stances, and I coded as \"elaboration\" explanations or further discussion, stances, or reasons. 1-you statements were those phrases that established the author or audience, or their relationship, such as \"I mean ... ,\" \"don't you ... ?\" and \"I think you should ... \" I counted students' \"please\" and \"thank you\" statements as politeness within the category of I -you statements, because they were interactive with the audience. The categories derived from this coding reflected a number of quantifiable differ-ences in the letters but did not reveal the variety of underlying discursive strate-gies that the children employed to persuade their adult audiences. I found the I-you category, including politeness, to be especially intriguing. This layer of analysis allowed me to see quantitative similarities and differences that suggested qualita-tive nuances between the letters that might account for differences in tone as the children engaged with their addressees. For a third pass through the data, I drew once again upon the sociolinguistic approaches noted earlier (e.g., Davies & Harre, 1990; Gee, 1999; Ochs, 1993; Tannen, 1993; and Wortham, 2001 ), as well as upon critical sociolinguistic tools that would This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions292 Research In the Teaching or Inglish Volume 42 February 2008 help me to probe the intersections of discourse, identity, and the particular genre of written argumentative persuasion. I drew on the emerging field of critical dis-course analysis (CDA) to link the discourses employed in the letters to relation-ships of power (Fairclough, 1992; Rogers, 2004; Titscher, Meyer, Wodak, & Vetter, 2000). CDA is a method that looks to describe, interpret, and explain. Accordingly, \"the validity of CDA results is not absolute and immutable but always open to new contexts and information which might cause the results to change\" (Titscher, et al., 2000, p. 164). Yet CDA allowed me to probe the discourses of the letters to understand the nuanced qualitative differences between them, especially at the intersection of writers' interactions with their addressees and the rhetorical forms they drew upon. In this last pass through the data, I coded for persuasive strategies, working from the ground up (Strauss & Corbin, 1990) to see how the children in each setting responded to the persuasive writing task. I looked to the centeredness of the letters, asking how discourse signals the degree to which the persuasive writer is self-centered or audience-centered, and how the writer enacts a predominantly I or we focus (Golder & Courier, 1994). Although the concept of centeredness is presented in the literature as a developmental and maturational issue, I probed the ways in which centeredness might also signal social-class positions and local discourses. I looked at how the children might be drawing on forms and identities peculiar to their locations to interact with their addressees. The following catego-ries resulted: 1) persuading for the benefit of self or others; 2) insistently repeating stances and reasons; 3) using politeness toward addressee; 4) appealing to the in-terests or perspectives of the addressee; and 5) posing suggestions, directives, and questions to the addressee. Notable differences emerged across the sites, as well as grounds for typicality (see Tables 6 & 7). If the children were interpreting their assignments in ways particular to the tasks, and activating discursive responses based on their funds of knowledge and the habitus of their locations, what might that mean in terms of social practice on an academic task and what consequences might accrue over time and tasks? I used the results of the three passes through the data to discern substantive emerging themes and to triangulate them with the assignments, the local school settings, and the greater contexts of their local schools. Results This analysis of two cases of persuasive writing suggests that teachers who include persuasive writing in their curricula and scaffold the task through use of talk, explicit forms, and choices of topics on which children have much to say, will find that children are competent persuasive writers and thinkers. Counter to the developmental research, children can write persuasively, even when instruction is This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementarv Persuasive llltter 293 TABLE 6: Persuasive Strategies Used by Suburban Westdale-Lincoln Chlldren Persuasive strategy %of students Examples For benefit of others 47% This is very important to theater-goers; The students should be able to decide what gender they want to be in a play; Some of my friends did not enjoy the experience of being a girl but some did. For benefit of self 58% I know it would be fun for me; I feel I could be more creative; I have a male puppy so I wanted to be a male puma; I was a flamingo and I liked it. Single repetition 56% I think that switching roles has problems/! think that it's a good idea not to switch roles; It is also just plain fun/Second, it is fun. Multiple repetition 25% The idea of males playing the female roles and the females playing the males is good/It's a good way to practice your acting/It's a good way to practice your acting playing both boys and girls/It's a good way to practice your acting skills. Politeness 11% Thanks for listening to my opinion; Nice writing to you; Please take all of this into consideration; Thank you for listening to my letter. Appeal to interests/ perspective of addressee 8% As a casting director you should understand the importance of using flexibility in casting characters. Suggestions to addressee 36% I also think that you should have a play at your theater where all the male roles are played by females and all the female roles are played by males. Directives to addressee 19% Write back; If you don't want to use my comments you should ask your actors; I think~ should have people play the opposite gender in your recitals or plays. Questions to addressee 33% What would you think about being a girl in a play?; If you were in a play would you want to play a girl?; Do you think so?; Do you care if you play a girl part even though you're a man? limited and infrequent. However, assignments, teacher scaffolds, local contexts, and social-class positions also shape children's responses to persuasive tasks in ways that should be of concern to researchers, literacy practitioners, and curriculum developers. These data indicate that when persuasive tasks evolve out of local settings, children may be socialized to practice persuasion, and persuasive writing, in ways that draw on local discourses and values such that they are more or less verbose/concise, polite/agentive, formal/informal, or centered/decentered in their persuasions. The very hybridity of the persuasive letter, as both argument and letter, seems key in how we lead children to draw on the values and discourses This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions294 Research lnlhe Teaching or English Volume 42 February 2008 TABLE 7: Persuasive Strategies Used by Urban Acme Road Children Persuasive strategy %of students Examples For benefit of others 43% Earn more money in fund raisers and give money to the good; Some people are allergic to it (milk); So that the kids who go by our school don't have to cross so many roads and end up getting hit by a car. For benefit of self 57% It helps me create an adventure; I want to speak Spanish and French to I could be a Spanish and French artist; When we go out it makes me feel happy. Single repetition 17% I want playground equipment/ Again, please get recess equipment. Multiple repetition 0% Politeness 74% Thanks for reading my letter; Thank you for your time; Thank you for listening to my letter; Thanks for help. Appeal to interests/ perspective of addressee 43% Some people get cranky or get in trouble or get sent to you; If we were in school longer we wouldn't be fighting as much; I can concentrate on your work and tests. Suggestions to addressee 4% You can talk to Mr. Carson about it; I hope you can do this, this year; Maybe you could get some books and a language teacher. Directives to addressee 0% Questions to addressee 0% they have, and socialize them to discourses that may or may not advantage them at local (community) and more global (high-stakes assessment, mainstream dis-course) levels. In a sense, this hybridity may imply a \"third space\" (Gutierrez, Baquedano-Lopez, & Turner, 1997; Lefebvre, 1991; Rowe & Leander, 2005; Soja, 1989) in which school and local discourses merge to form a discourse unique to the situated assignment. In my first pass through these data, I could see that children in both schools responded explicitly to the persuasive letter tasks presented, perhaps because the tasks were grounded so explicitly in their experiences and/or interests. They took stances, mounted reasons for their stances, composed sequential arguments, and addressed an audience. In general, students in both schools wrote in complete sentences and had a sense of paragraphing. In both cases, paragraphs were estab-lished in the formats presented by the teachers. Both sets of children wrote in a form that looked like a letter. Both sets of children made serious attempts to meet the expectations, as they understood them, of the task that the teachers presented. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON Tha Elementary Persuasive Lallar 295 In a sense, the children could be thought of as using or spending their words to do particular kinds of work, including persuasion, in their letters. However, as I have said already, the suburban letters were lengthier, seemed repetitive, often addressed the audience by first name, appeared self-centered, and omitted typical politeness I would have expected from a letter addressed to an adult stranger. The urban letters, on the other hand, were shorter in length, concise in stances and reasons, addressed the audience's interests, and seemed appropriately polite as letters to a respected and known adult, the school principal. In many ways, they seemed more appropriate than the suburban letters (Fairclough, 1992} in the sense that they reflected a better understanding of authority in the relationship between author and addressee. The relatively crude categories in the second pass through the data supported my initial impressions but alerted me to differently nuanced but effective patterns of strategies in their letters, such that developmental explanations of writing (Anderson, et al., 1997; Bereiter & Scardamalia, 1982; Golder & Courier, 1994; McCann, 1989) or deficit -based explanations of discourse (Sigel, 1984, 1991} were insufficient to explain them. Additionally, I began to see that the non-parallel cat-egories emerged from the hybridity of the tasks as a merging of two genres, argu-ment and letter. On the surface, the suburban Westdale-Lincoln letters were lengthy (an aver-age of 33 sentences per letter), elaborate in reasons, and rich in interesting gender content. The urban Acme Road letters were concise (an average of 19 sentences per letter), neat, organized, and polite. Also, as Figure 1 indicates, the children in the two schools wrote in quantifiably different ways. The children of Westdale-Lincoln devoted more language segments to taking stances (21%) and mounting reasons (23%) than the Acme Road children (stances 10%; reasons 14%), while the Acme Road children more frequently established form (25%) than did the Westdale-Lincoln children (9%). The proportion of I-You (W-L 30%; AR 25%} statements (\"I think you should ... \") and elaborations (W-L 17%; AR 20%) were similar between schools, although the Westdale-Lincoln children wrote more than twice the number of I-you statements than the Acme Road students. Additionally, the Acme Road children devoted 6% of their language segments to politeness (please, thank you), while the Westdale-Lincoln children devoted fewer than .3% of theirs in this way (four of the thirty six children whose letters were turned in expressed politeness). All but one of the Acme Road children be-gan their letter \"Dear Mrs. Salvo,\" while 78% of the Westdale-Lincoln children used Mr. Holbrook's last name. The others wrote \"Dear Lawrence:' Although these differences may be attributable to the differences in tasks, critical analysis compli-cates that simple explanation with issues oflocal habitus and social class. As one can see from Tables 6 and 7, children in both settings frequently per-suaded in the interests of themselves (AR 57%; W-L 58%) and others (AR 43%; This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions296 IISIIrCit lnlhl TIICIIIAI II EIIIISb Volume 42 February 2008 FIGURE 1: Persuasive Letters W-L 4 7%). However, the children of urban Acme Road were more likely to appeal to the interests/perspectives of the addressee, their principal ( 43% ), than the sub-urban Westdale-Lincoln children were to appeal to the interests/perspectives of the theater director (8%). The Westdale-Lincoln children were more likely to di-rect, question, and make suggestions to the theater director on how to implement their stance on casting (19%, 33%,36%, respectively) than the Acme Road chil-dren were to direct, question, or make suggestions to their principal regarding their idea for how to make the school better (0%, 0%,4%). Additionally, more children from Acme Road expressed politeness to their principal (74%) than the Westdale-Lincoln childi-en did to the theater director they did not know ( 11%). In these two tasks, the children from Acme Road appear more polite, more addressee-centered, and less agentive than the children from Westdale-Lincoln, who appear less polite, less addressee-centered, and more agentive. Importantly, the tasks set forth by the teachers in each setting implied certain types of responses. Yet the children sometimes followed the teacher/task leads, sometimes took a strategy to an extreme, and sometimes brought in a strategy that was not implied or discussed. For example, apparently taking things to an extreme, 25% of the children in suburban Westdale-Lincoln repeated a stance or reason more than once. Not all children from urban Acme Road expressed polite-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementary Persuasive leiter 297 ness, although the classroom example included explicit examples of politeness. The classroom example and discussion of Mr. Gold and Mrs. Smith did not direct the children to address the principal's interests or perspective, yet 43% of the chil-dren did so. And, although Kelly and Theresa supplied a format for the letters that addressed the theater director as Mr. Lawrence Holbrook, 22o/o of the children addressed him, an adult, by his first name, a practice common in that community. Two Letters I now use a \"telling\" (Patton, 1980, p. 351) letter from each school, one that, in each case, illustrates strategies used by the children in that setting. I do so to elucidate a way of seeing the letters through a socially situated and critical-discourse-analysis lens to show how the strategies congealed into effectiveness (Mitchell, 1984). I use the letters as touchstones to help the reader understand the complex interpreta-tions and questions presented in my later analysis and the discussion. In suburban Westdale-Lincoln School, Sally, a European American, wrote a mid-length letter to the hypothetical theater director. Sally was a bright, shy, soft-spoken, non-argumentative third grader, among the youngest of the students. I never saw Sally engaged in the oral gender arguments that characterized her male and female classmates. Yet, as a member of this privileged suburban community, and as the child of a lawyer and social worker, local discourses of power and iden-tity emerged in her letter. 3 1 Dear Mr. Lawrence Holbrook 2 You must know exactly how 3 I feel about switching parts. 4 I feel like people should play 5 parts of the other gender. 6 I think people should do this because 7 it will give people a chance to 8 experience something that they 9 might not get to experience again. 10 I personaly think that you should 11 do that because it will give 12 people a chance to experience the 13 other gender. 14 Some people don't like to do that 15 but I think its just silly. 16 Here are my reasons for feeling 17 this way: 1. It is good to try something 18 that you may not get another This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions298 ResearCh In tle TeaChing ol Engllsl Volume 42 February 2008 19 opportunity to express again. 20 You can learn what 21 differences there are between 22 the two genders. 23 It is good to experience the other 24 gender you can learn something 25 from doing so. It can be 26 interesting to play a part 27 of the opposite sex. 28 It is a good experience 29 if anyone is offered a 30 part of the opposite sex and 31 refuses I would take it! 32 Having read this you should 33 know what my position is. That 34 it is great to switch parts 35 and I have nothing against it. 36 I really like the idea and 37 think that everyone should do it. 38 I also admire it and think 39 that everyone should use it 40 in their plays. 41 Sincerely, 42 Sally Like most of the Westdale-Lincoln letters, Sally's letter takes a stance and backs it up with lengthy and repetitive arguments based, to a large extent, on her opin-ions and feelings. In lines 2-5, she introduces her stance with two long sentences in the first paragraph. In lines 3-4, she takes up the teacher-supplied prompt of\"I feel\" and repeats it. In lines 4-5, she takes the stance that \"people should play the parts of another gender.\" She uses \"I think\" throughout the letter (lines 6, 10, 15, 37) to frame her stance. Her initial grounds for this claim in lines 7-9, \"it will give people a chance to experience something that they might not get to experience again,\" are repeated in various forms throughout herletter (lines 12-13, 18-19, 23-25, 28-29). Sally notes in line 14, \"Some people don't like to do that,\" but dismisses their opinion with her personal opinion in line 15, \"but I think that's just silly.\" In line 17, she switches to a more objective, less self-referential phrasing, \"it is good,\" and continues with \"You can learn\" (line 20), \"It is good\" (line 23), \"It can be\" (line This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The llementarv Persuasive tetler 299 25), and \"It is good\" (line 28). Finally, she once more reinserts herself with a hypo-thetical case, entailing fictive and personal evidence, at the end of her objective string of repetitions by stating, \"if anyone is offered a part of the opposite sex and refuses I would take it!\" (lines 29-31). Sally seemed to find little need to address the interests or perspective of the theater director in her letter, but she does direct the addressee {lines 10-11) with \"you should do that:' Although she takes on an objective, omniscient voice in the middle of her letter, the beginning and the end are framed with her own personal and seemingly valid opinion. In line 14, the lone instance of directly speaking for others, \"some people don't like to do that;' is dismissed with an evaluative, possi-bly condescending, \"But I think that's just silly\" in line 15, possibly a judgment upon those who would disagree with her, perhaps her peers, perhaps Mr. Lawrence Holbrook. Although Sally does not address Mr. Holbrook by his first name as many of her classmates did, she does not explicitly express politeness. Her writing, rather, shows her valuing and reiterating her experiences and opinions over those of others. In many ways, it is a strong letter in terms of stance, evidence, elabora-tion, and personal confidence and enthusiasm. In urban Acme Road School, Derek Holmes, who wrote the following letter, was an animated, friendly, mischievous, fourth grade African-American boy. I chose this letter as \"telling\" (Patton, 1980, p. 351) but also because in many ways it stands in contrast to Derek himself, who was cheerful, loud, and argumentative on a daily basis with his friends. In contrast, in his letter he performs with the sophisti-cation and restraint that was characteristic of the Acme Road letters, using the discourse resources available in his community: 1 Dear Mrs. Salvo, 2 My name is Derek Holmes. I am in 4th grade, 3 and I would like to know if we could have an extra 4 10 min recess by next year. 5 I think we should (do) this because somedays 6 the kids have a hole lot of energy, and they need to release 7 all of it. Then when they get into class they become bored and fall asleep 8 some people get cranky, and get into trouble, or sent to you. 9 I'm writing to you to see if we could have the change by next 10 year. 11 Thank you for giving me some of your 12 time, and for reading it. 13 Sincerely, 14 Derek Holmes This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions300 Research lnlhe Teaching or Inglish Volume 42 February 2008 Derek employs an assortment of formal strategies and argumentative tech-niques to accomplish the task of convincing Mrs. Salvo to increase recess by 10 minutes. His stance is introduced in an indirect question in the form of a request in lines 3-4, signifying his lower position in regard to the more powerful principal. In lines 6-7, he reinforces his stance with concise grounds as to why his request is valid: He bases his case on the needs and behaviors of his fellow classmates, show-ing logical and deductive reasoning. Although these may be his personal opin-ions, he claims them as his own in line 5 only after his indirect question in lines 3-4. In the remainder of his letter, he casts his appeals to the principal's interests and does not personalize or claim them directly as his own opinions. Derek draws conclusions from what he knows to be true in lines 6 and 7, that because \"kids have a hole lot of energy, and they need a release for all of it ... when they get into class they become bored and fall asleep.\" Derek continues to ma-nipulate cause and effect with further grounds in line 8, \"some people get cranky, and get into trouble,\" which appeals to the principal's position, because, in line 8, \"some people\" get \"sent to you.\" He is speaking through the behavior of the stu-dents, and through the interests of his principal, speaking to his interest in a longer recess through them. Derek voices his opinion obliquely, what Wortham (2001) and Bakhtin (1981) call \"refraction\", through the interests of his principal and the behavior of the students, as if to implant this idea as the principal's idea. Wortham ( 200 1 ) says that \"by speaking through or ventriloq uating other's voices, narrators can establish positions for themselves\" (p. 67-68). Derek establishes his position as being in favor of extra recess time by aligning himself with the interests of the principal. He elaborates with a timeline for implementation, politely mitigated with the conditional and subjunctive \"I'm writing to you to see if we could have the change by next year\" [italics added]. Although this request may actually be a sug-gestion, he does not construct it as such. Derek doses with politeness, thanking his principal for her time and for the actual act of reading his letter. Overall, Derek's letter is restrained, concise, and polite. While the children in both schools wrote competent persuasive letters, we can also see that there are differences between how they approached persuasion and how they engaged with their audiences. The urban children presented themselves as polite, formal, concise, de-centered, and solicitous, and the suburban children presented themselves as agentive, verbose, repetitive, opinionated, and self-cen-tered. While these differences might be partially explained by the very different assignments given by the teachers, the tone of the letters and the ways that the children engaged with their audiences raised questions for me about how the genre of the persuasive letter could appear so different from school to school, what the children understood persuasion to be, why children of the same age would vary across schools in their centeredness, and whether the suburban children were, indeed, more agentive than the urban children, especially in positioning them-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementary Persuasive leuer 301 selves vis a vis their intended audiences. In the next section I bring a critical eye to the data from the two schools as a way to explore alternative explanations for the patterns of writing in these assignments. Patterns of Persuasive Response As indicated above, I would suggest that the differences in the children's letters from the two communities can be traced to a complex interaction of task, genre, and local settings, raising questions about habitus, identity, and agency. While the students responded within their contexts to the tasks as set forth by their teachers, the teachers constructed tasks within their contexts as well. Both groups of children drew upon their lifeworlds, everyday social and dialogic interactions (Gee, 1999, p. 124, based on Habermas, 1984), to write persuasively. The Acme Road children drew upon their general school experiences and classroom instruction to address a specific task and a personally known audience. The suburban Westdale-Lincoln children drew upon topic-specific rehearsals, informal arguing, and formal discussions over the course of five weeks. The urban Acme Road children had a class discussion initiated and led by their teachers. The Westdale-Lincoln students spent time in barely supervised chatter and arguments around rehearsals; their more formal teacher-facilitated discussions were a resource that fostered their agency and self-importance regarding their opinions. The experiences, topics, and scaffolds used by the teachers in these particular local settings were, if not unique to the settings, consistent with the instructional habitus of the settings. While the suburban teachers' scaffold for the letter may have foregrounded the stance/argument aspect of the persuasive letter, the urban teachers prompted their children into standard business-type letters that promoted politeness and recognized the power of the principal addressee. The teachers primed their students to write in particular and contrastive ways in terms of oral preludes to writing and experiences. Perhaps the lengthy letters by the Westdale-Lincoln students were their way of holding the \"floor\" and the attention of their audience, a learned agentive strategy. The Acme Road children, who frequently thanked the principal for her time, wrote shorter letters (perhaps in acknowledgement of their principal's busywork life or as a way to acknowledge the importance of her role), strategies that were valued in their community. In suburban Westdale-Lincoln, writing topics emerged directly from the stu-dents' interests and experiences. Theresa and Kelly didn't walk into their instruc-tional year with set persuasive writing topics in hand. Instead, they let students bring writing topics into the classroom from home, from sleepovers with friends, and from the play The Llama's Secret, which took on a life of its own when the teachers opportunistically used it to address the children's sexist behaviors. As the children became engaged and argumentative about the concept of cross-gender theater casting, the teachers again seized an opportunity to turn gender conflict into a writing assignment. The oral discussions that preceded writing may have This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions302 Research in the Teaching ol English Volume 42 February 2008 facilitated written argument and fostered an attitude of\"holding the floor\" and barraging the audience with one's opinions. Kelly and Theresa were progressive educators whose teaching pedagogy was consistent with the progressive upper-middle-class community in which they taught. It is difficult to imagine the topic of cross-gender theater casting coming up in urban Acme Road, or any other com-munity for that matter, without the specific children and course of events in this situation. In comparison, the topic of how to improve their school was part of the cur-riculum in Mr. Gold's class and in other Acme Road classes. The topic, which implies that the school needs improvement, is especially suited to the interests of poor and working-class children in a school district that has a poor reputation for achievement. Although it may be a topic that could be used in many schools, at any time, it was especially effective when used by a respected principal, teacher, and literacy leader in a school that strived to help children to feel empowered. It is a topic handed down to students from above, and rather than emerging from a specific experience, it has emerged from a more general, community experience and is linked to the place of their school institution in the greater world of school-ing. In the absence of weeks of arguing with one's peers, as was done in the subur-ban school, the urban Acme Road children drew on a public discourse of disad-vantaged schools to focus on their principal, whom they perceived as the power figure in their school. The Hybridity of the Persuasive Letter While the persuasive letter is a hybrid genre, comprised of the genre of argument within the genre of a letter, the responses of the children could also be considered a hybrid, or mixed, response to what they were instructed to do. Their local discourses and socialization, i.e. habitus, prepared them to interpret the task in a space created by such intersections. The children, due to their differing habitus, may have been signaled, within their situations, to draw on different genre discourses in response to the task. While teachers in both communities used the standard form for a letter in instruction, the urban Acme Road teachers emphasized it, modeled it on the board and brainstormed particular ways to express politeness. A look back at Figure 1 shows how, for the urban children, the form of the letter dominated their responses. And, while the children focused greatly on form and politeness, they also worked effectively to persuade. For the urban children, the letter aspect of the task rose at least as high in their attention as the argumentative aspects. The suburban Westdale-Lincoln teachers modeled standard letter form but did not spend much time on it. In the Westdale-Lincoln children's writing, 1-you statements predominated, along with repetitive stances, reasons, and elaborations. For these suburban children, argument rose higher in their attention than letter This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementarv Persuasive letter 303 form; and within student interpretations came strategies and ways of engaging with the audience that may have indicated quite different understandings of what it means to write persuasion. While one might assume that the teacher's lack of emphasis is what tipped the suburban children towards their basic inattention to letter form and politeness, I would argue for another explanation. Without the emphasis on form and politeness, and in spite of a model that addressed the the-ater director as Mr. Lawrence Holbrook, many children drew upon the habitus of their community- to call adults by their first names, to speak eye-to-eye with authority, to value their own opinions, to repeat them in order to hold the floor-in their writing. Persuasion, Opinion, and Centeredness The suburban Westdale-Lincoln children tended to present complex, opinionated support for their stances, positing long, logical, but convoluted trains of reason. For example, one boy claimed that he called himself\"Wo-MAN. WO for Woman and Man for man because I like to be a half-girl, half boy.\" His reasons were that he \"understands girls:' he had \"friends who are just like boys that are gir Is,\" \"girls are his best friends but so are boys:' and he \"loves playing soccer and sports.\" Additionally, he taught his class and a girl friend to play soccer, he \"loves girls, too:' and \"girls are really like boys.\" According to him, \"it does not matter ... especially if they are animal parts.\" He had presented a long string of both connected and unconnected evidence, most of which was actually his personal opinion, to support his stance. The urban Acme Road letters were less likely to follow a long string of piled up, opinionated reasons. They were more likely to be concise, as if they were pre-senting a bulleted list of support for their stances. One girl, for example, stated simply that she would like first and second grade to be \"put back\" into the school because, \"it would be nice to have them back, even more money in fundraisers to give toys to the good classes, so that the kids that go past our school don't have to cross so many streets and end up getting hit by a car:' Another student, arguing for soda machines, appealed to the school's need for money by stating, \"You can make more money for the school so you can buy books and recess stuff.\" He also cared about the people in the school, \"because some get so hot in school and get thirsty and can't do their work.\" He claimed that teachers \"get so mad and get hot and they can go down the hall and get a soda.\" He would be \"pleased to have a soda machine\" for the other people, students in the school. I suspect that he, too, got hot and thirsty and could not do his work, and was of the opinion that he should have had access to a soda machine, but had chosen the tactic of speaking to other's interests in order to persuade. If I had only the suburban letters to analyze, within the context of the devel-opmental research, the children's self-centered rhetorical stances might seem natu-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions304 Research in the Teaching Of Inglish Volume 42 February 2008 ral and normatively developmental, as Golder and Courier (1994) have noted. However, when the suburban letters are contrasted with the urban letters, the notion of centeredness and the language used for opinions and persuasion is more com-plicated. The urban Acme Road children were more likely to de-center as they mounted their evidence, used politeness, and spoke to the interests of the ad-dressee to convince her, as Derek did. The suburban children tended to write long, self-centered letters in which they expressed opinions, asked questions and made direct demands on the theater director to whom they were writing, with little apparent politeness. Like Sally, they worked hard to \"hold the floor\" and repeated their stances over and over. Centeredness may be socio-culturally shaped, a by-product of and a set of practices that serve a community as the community raises its children to take on adult roles in that community. For example, the suburban Westdale-Lincoln children used the constructions of \"think\" and \"feel;' with many students stating that they \"enjoyed\" the cross-casting experience, that it was a \"ton of fun,\" with one boy \"feeling really good about playing a girl in the play\" and stating unequivocally, \"I love playing a girl in the play:' However, their feelings were frequently expressions of thought rather than emotion. Following the teachers' scaffold, they were more likely to use ex-pressions of feeling to emphasize opinions, such as, \"One thing I feel is important for you to know,\" \"so now you probably know my reason for feeling this way,\" \"I feel strongly that,\" and \"I would like you to know how I feel.\" The use of\"feeling\" to stand in for \"thinking\" may, in fact, have been a sophisticated rhetorical strat-egy, likely unwittingly modeled by the teachers in their suggested essay format, that mitigated the students' direct stances and reasons. On the other hand, urban children only occasionally used the \"feel\" construction to speak to a cognitive stance. Thus engagement with one's audience is shaped through rhetorical strategies shaped in social practice. Agency: Engagement with Audience Linguistic habitus (Bourdieu, 1999) as tools and signs (Vygotsky, 1978) provided the children with differing ways of engaging their audiences with an eye to power. The students' degree of centeredness and their tendencies to write letters that were more or less opinion-centered or argument-centered, or longer or more concise, shaped quite differently how they engaged with their audience and expressed agency. For example, the frequent repetitions of the children from suburban Westdale-Lincoln seemed to account to some degree for the greater length of their letters. While the format set up by Kelly and Theresa implied repetition, and not all children were repetitive, I wondered whether the suburban children were badgering their addressee, positioning themselves as having opinions worth repeating, or simply invoking a discourse found in the typical five-paragraph essay in which one states a thesis, supplies three supporting reasons/paragraphs, and then restates the thesis. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elementarv Persuaslvelener 305 Annette Lareau (2003 ), in her study of how race, class, and family life inter-sect with schooling, found that middle-class children learned ... a sense of entitlement. They felt they had a right to weigh in with an opinion, to make special requests, to pass judgment on others, and to offer advice to adults .... (these) are highly effective strategies today because our society places a premium on assertive, individualized actions executed by persons who command skills in reasoning and negotiation. (p. 133) Like Lareau's middle-class children, the suburban Westdale-Lincoln children seemed to be learning and reiterating strategies of entitlement through their ex-perience of persuasive writing. They were practicing, through writing, how to ex-press their opinions and persuade others to think as they did through self-centered focus, familiarity with adults, and holding the floor through repetitions of stances and reasons. In contrast, the urban children seemed to be practicing audience-centered focus, politeness towards adults, and sharing the floor as they spoke to the interests of their audience. Although, given these data, one might consider the suburban children to feel more entitled and more agentive than the children of Acme Road, we might also consider another explanation-local mean-ings of agency. Markus (2006) has said that patterns of agency observed in middle-class America differ from those of the working class, as they differ between European Americans and Asian Americans. While European Americans and middle-class Americans equate agency with freedom of choice located in an independent, au-tonomous self, working-class Americans and Asians equate agency with interde-pendence, tradition, integrity and discipline. While one analysis might be that the suburban children expressed more agency than the urban children, as seen through their strategies for holding the floor and writing to Mr. Holbrook as if he were their equal, an alternative explanation is that the children in each community had differing notions of persuasion and agency. Gee (1999, p. 124) describes the ways in which !-statements and their predi-cates can be categorized in five ways: as cognitive, affective, states and actions, abilities and constraints, and achievements. The suburban students tended to use a greater proportion of I -statements that expressed their strong, unequivocal cog-nitive and affective stances, engaging with Mr. Lawrence Holbrook \"eye to eye\" as if they were seeing him as an equal. Students used statements such as \"I mean,\" \"I think I,\" \"I think you:' \"I know,\" \"I swear;' \"I believe,\" \"I do not believe:' \"That is what I think,\" \"I also think,\" and \"This is what I think about the subject:' along with the \"feel\" statements discussed earlier. Rhetorical turns to the theater director from the children took the form of direct questions, suggestions, and directives, such as: \"Do you agree?\" \"What do you think?\" ''As a casting director you should:' \"Do you like this idea or not?\" This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions306 Research In the Teaching of English Volume 42 February 2008 \"Think of it!\" \"If you were in a play would you want to play a girl?\" \"Do you think so?\" \"Right?\" \"You should:' \"Shouldn't you?\" \"You should ask your actors,\" \"You can learn something from doing so,\" and \"You should try it,\" \"I hope you will consider\" or \"I would like to give you a suggestion.\" The suburban letters con-tained minimal expressions of asking permission or favor, as students tempered their opinions in an unsolicited bit of advice, or expressed unequal footing from a child to an adult. In contrast, the \"!-statements\" of the urban Acme Road children, as they en-gaged with their principal, were mitigated with hope, desire, politeness, and favor. Although a few children made strong statements of appeal (\"I think you should:' \"I think we can have a clubhouse in the playground,\" \"I think girls should be al-lowed to wear bandannas\"), they were more likely to express their stances with non-cognitive modifiers and modals, such as \"I would like to bring back kinder-garten and first grade:' \"I would like to do that,\" \"I would like to be taught lan-guages other than English,\" \"I wanted to talk with you about gym:' \"I'm trying to have fifteen more minutes of gym,\" and \"I wanted to know if we can have no homework.\" Additionally, unlike the !-centered suburban children, the urban children ex-pressed their stances in \"we\" constructions: \"We would like more gym; I think we should do this.\" They also shifted into \"we\" requests, such as, \"Can we have gym-nastics?\" \"Can we have no homework?\" and \"Can we be allowed to chew gum?\" The urban children were in the position of explicitly hoping and requesting help, such as \"Could you help me soon?\" \"I hope you can do this,\" \"I will ask you a favor:' \"Would you please do something about this?\" and \"Could you please help me soon so girls can wear bandannas?\" The urban children engaged the principal with few suggestions and no ques-tions or directives, but more explicit politeness. Their letters were drenched in appropriate politeness: \"Thank you for reading my letter ;\"'Again, I will be pleased:' \" I will ask you a favor,\" \"Thanks for help:' and \"Thank you for listening to my letter.\" Many students thanked the principal for her time. The urban children may appear to have been less agentive than the suburban children. But another explanation may be that the urban children derived their agency from the'cues of their situation, cues that fostered politeness and spoke to the interests of persons in authority, such as their principal. Their letters suggest they held a local, perhaps working-class, understanding of agency entailing inter-dependence and power-aware strategies for addressing authority. The suburban children, on the other hand, in spite of school-wide efforts to foster politeness and classroom efforts to address gender issues, invoked a dis-course of repetition, eye-to-eye interaction with adults, and questions, sugges-tions, and directives to adults, mitigated with self-centered feelings because that was how they were learning to become upper-middle-class adults in their com-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elemeatarv Persuasive letter 307 munity. These patterns of response suggest both novel ways of viewing children's persuasive strategies as well as possibilities for further research. Discussion In summary, we can see that the children in both Acme Road and Westdale-Lincoln wrote letters that demonstrate degrees of competence and relatively sophisticated, although differing, persuasive strategies. The specific assignments and formal instruction in each setting cued the children to draw on differing discursive strategies to write quantifiably and qualitatively different letters, but did not simply determine their responses. Rather than viewing the teachers' instruction as culturally neutral, these data suggest that instruction, even on something as simple as a persuasive writing task, was imbedded in and consistent with the local contexts and their discursive practices. From these data, we may surmise that practices of persuasive strategy, centeredness, and agency are learned social practices. What has formerly been seen solely as developmental can be seen from a different perspective as a discursive by-product of social practice, a \"way of being in the social world\" (Hanks in Lave & Wenger, 1991, p. 24) that children draw upon when faced with a task. The hybrid persuasive letter task signaled two genres to the children. The let-ter, with its need for formalities and politeness, predominated among the urban Acme Road children who were writing to a known and proximate adult, their principal. The argumentative essay, with its implications for logic and holding the floor, predominated in suburban Westdale-Lincoln, where the children were writ-ing to an unknown and distant adult, the theater director. The genres of argument and letter dominated in ways that were situated to the particular tasks and audi-ences, and were linked to the children and their respective communities' more general hegemonic positions in society. The persuasive letter, as a hybrid genre, may be problematic in how it rein-forces and instantiates the dominance of local discourses. The teachers and stu-dents enacted the persuasive letter differently in each setting, with all the rhetori-cal strategies the essay and letter genres entail, situated in their specific local settings and nested in complexities of socioeconomics, race, gender, ethnicity, and power. The urban children, in spite of their argumentatively competent letters, paid at-tention to form and politeness and simply wrote less text. They did not practice a discourse of opinionating at length. The suburban children tended to the argu-mentative tasks more than the letter forms and wrote lengthy, repetitive letters. This may be habitus at work such that the hybridity of the genre signals different rhetorical acts, i.e. discursive dispositions, to the students. However, when rhe-torical acts (e.g., politeness, familiarity, agency, and centeredness) repeat over time they coalesce into practices. Theoretically, across spaces and time, the coalescence This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions308 Research In the Teaching of English Volume 42 February 2008 of discursive strategies into default practices will matter to individuals and groups of people. Although not determinative, discourse practices form the habitus from which children draw when asked to perform on argumentative and persuasive tasks in both the here and now, and in the future in other situated tasks. Will the children who are socialized to write concisely and politely be disad-vantaged in their future? Will the children who are socialized to write at length and hold the floor by repeating their stances and reasons be positioned to achieve better on standardized tests? Perhaps. Les Perelman (2005; Wertheimer, 2005), Director of the Writing Center at MIT, has conducted studies of SAT essays and found that length and verbiage, not accuracy and argument, are more predictive of high scores. If the children who were the subjects of this study continued to write as they did in this sample, the suburban Westdale-Lincoln children would be advantaged and urban Acme Road children would be disadvantaged, although we can see that in the third and fourth grades these children were both writing competently while based in their local communities and values. However, the persuasive letter also presents an opportunity, when seen in its complex hybridity (Mahiri, 2004; Miano, 2004; Sperling, 2004), for developing broad strategies for power among children across locales. The children in both schools would benefit from knowing when to be polite and when to be direct, when to speak to the concerns of the audience and when to assert their own con-cerns, and how to distinguish between logical argument, rhetorical strategy, and tactful persuasion. While there is no doubt that the Westdale-Lincoln children wrote at length and expressed their opinions repeatedly, one cannot assume that their letters are more competent than the direct, concise, and audience-aware let-ters of the children of Acme Road. According to Crammond ( 1998 ), \"mastery of persuasive writing is important because it empowers students - it enables them to produce, evaluate, and act on the professional, ethical, and political discourse that is central to our democratic society\" (p. 230). However, persuasive writing and its effectiveness are highly situ-ated endeavors. If persuasive writing is central to students' academic futures and their empowerment as US citizens, persuasive writing in all of its complexities should be taught, read, written, and analyzed as early as the third and fourth grades. Yet narrative texts continue to dominate elementary classrooms and the few per-suasive instructional resources that exist are limited in scope and do not take cul-ture and audience into account (Derewianka, 1990; Write Source, 2002, 2004). If we continue to define the problem of writing argumentatively as develop-mental and use research across age spans to determine that young students do not write argument as well as older students, we constrain the very real experiences that will advantage them in using the power-laden discourse of argument. If we use the narrowly conceived five-paragraph essay as the standard for persuasive This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The Elemenlarv Persuasive Lener 309 writing, then we turn writing performance into a contrivance that fails to recog-nize the very real persuasive strategies that people use effectively in their commu-nities of practice. While persuasive argument means taking a position and mount-ing evidence and reason to support that stand, persuasion also consists of appealing to the interests of the audience or addressee with tactics that accrue in discourse in communities of practice. As Sperling (2003) has asked, \"whose literacy is more ideal than another's? Whose classroom practice is more limited than the other's?\" (p. 147). Naturalistic research that captures the legitimate local strategies that students use to persuade is desperately needed in order to inform the effective teaching of written argument. As a genre that occurs, as far as we know, infrequently in el-ementary classrooms, persuasive tasks do not lend themselves to massive data col-lections within one classroom, one limitation of the cases analyzed here. Because these data were opportunistically analyzed from data collected in larger studies, intentional follow-up interviews pertaining to persuasive writing are not avail-able. Additionally, the conclusions and speculations about position and power in student writing are not generalizable beyond the specific classrooms where these data were collected, although this analysis suggests social-class and power-based concerns. Yet the dichotomies found in these data also reveal issues that may be important to children's social and academic futures. Children will write to some degree as teachers instruct and cue them to write, they will write as their local contexts socialize them to write, they will write to fit into their local milieu, and they will write to appear to their addressees as they wish to appear. Finally, I recommend that educators consider the serious disadvantage for children when they are not afforded opportunities to learn a range of empower-ing written discourses through explicit instruction (Delpit, 1986) and critical lan-guage awareness (Fairclough, 1992). Secondary students in middle-class and upper-class schools and in honors classes may receive the most instruction and experience with written argument because they are freer from the constraints of testing and basic skills curricula than are poor and working-class students. How-ever, all elementary children should be reading and writing appropriately leveled persuasive texts because they can and because it may be crucial to their academic futures. Instruction that draws on the capital children acquire through social class positions has the potential to produce children who can write argument and choose appropriate strategies for the intended audience. While the urban children here would benefit from learning strategies for holding the floor, writing at length, and being agentive as the middle class understands agency, the suburban children would also benefit from learning to be concise and, as their principal tried to teach them in a school-wide effort, how to be \"Smart AND Polite.\" This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions310 Research in lhe Teaching ol English Volume 42 February 2008 AUTHOR'S NOTE A Faculty Research Grant and a Lang Fellowship at Swarthmore College supported the research and writing of this manuscript. The author is grateful to Jill Gladstein, Lisa Smulyan, Brian Street, Lawrence Sipe, Hillary Anderson, the reviewers, and the editors for their helpful suggestions. ENDNOTES I. Confounding the class and discourse problem, a few cognitive psychologists, drawing on the work of Sigel {1984, 1991), have argued that discourses learned in the home and community (e. g. dinner table conversations) cognitively advantage or disadvantage children. \"Parents ... vary greatly in the degree to which they talk with children about non-present events, people, places, or things ... There is evidence that this kind of interaction is less common among lower-class families, but middle-class families also vary considerably to the degree to which they engage children in con-versation about non-present aspects versus concrete, here-and-now aspects\" (Copple, Sigel, & Saunders, 1979, p. 25, drawing on McGillicuddy-DeLisi. Sigel, & Johnson. 1979). Sigel and his adherents recommend classroom instruction that uses a range of cognitive \"distancing\" strategies in order to build children's representational competence, thus leading to higher level thinking, such as sequencing, discrepancy resolution, and problem-solving (Ellsworth & Sindt, 1994). They view oral discourse from home as an issue of cultural deficit or advantage. Yet Heath (1983) and others (Taylor & Dorsey-Gaines, 1988), in viewing a variety of engagements in talk and literacy practices, have shown that persons in non-mainstream communities are not literate or illiterate, not simply disadvantaged by their own discourses and knowledge, they are differently literate. The ways in which literacies interact with schooled literacy expectations account for children's success or struggle. Coincidently, Sigel's theory of psychological distance formed the theoretical basis for Head Start and its High Scope Curriculum (Copple, Sigel, & Saunders, 1979). 2. This entire experience is typical of the ways in which instruction in the Westdale-Lincoln School evolved in the 1990s. Drawing on student interests and local issues. progressive teachers were encouraged to shape talk-rich, time-absorbing, theme-based curricula that seemed closer to out-of-school play or co-curricular activity than traditional school instruction. For example, another teacher at this time had used her students' interest in the little stuffed animal Beanie Babies® to allow her students to create Beanie Baby Town in an unused office. She explained Beanie Baby Town to the principal and parents as a chance for students to use math (engineering), social stud-ies (community-planning), and collaboration skills in third grade. 3. Numbered lines refer to where the children established line breaks. Misspellings and other mis-cues have been retained. REFERENCES ANDERSON, D. D. (2002). Casting and recasting gender: Children constituting social identities through literacy practices. Research in the Teaching of English, 36, 391-427. ANDERSON, D. D. (IN PRESS). Reading Salt and Pepper: Social practices, unfinished narra-tives, and critical interpretations. Language Arts. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The nemeatarv Persuasive letter 311 ANDERSON, R., CHINN, C., CHANG,}., WAGGONER, M.,&Y1, H. (1997). On the logical integrity of children's arguments. Cognition and Instruction, 15, 135-167. ANGEULW, J. (2005). Writing to the prompt: When students don't have a choice. Ports-mouth, NH: Heinemann. ANYoN, J, ( 1980). Social class and school knowledge. Curriculum Inquiry, 11,3-41. ATWELL, N. (1998). In the middle: New understandings about reading, writing, and learning (2nd ed.). Portsmouth, NH: Heinemann. BAKHTIN, M. (1981). The dialogic imagina-tion. (C. Emerson & M. Holquist, Trans.). Austin: University of Texas Press. BAKHTIN, M. ( 1986). The problem of speech genres (V. McGee, Trans.). In C. Emerson & M. Holquist (Eds.), Speech genres and other late essays (pp. 60-102). Austin: University of    Texas Press. BEREITER, C., & SCARDAMALIA, M. (1982). Fromconversation to composition: The role of instruction in a developmental process. In R.Glaser (Ed.), Advances in instructional psychology(Vol. 2, pp. 1-64). Hillsdale, NJ: Erlbaum. BouRDJEU, P. ( 1999). Structures, habitus, practices. In A. Elliott (Ed.), The Blackwell reader (pp. 107-118). Oxford: Blackwell. BouRDIEU, P., & PASSERON, J.-C. (1990). Reproduction in education, society, and culture (R. Nice, Trans.). London: Sage. BRUNER, J. S. (1966). Toward a theory of instruction. Cambridge, MA: Harvard University Press. BRUNER, J, S. ( 1977). The process of education. Cambridge, MA: Harvard University Press. (Original work published 1960). CALKINS, L. (1994). The art of teaching writing. New edition. Portsmouth, NH: Heinemann. CHAPMAN, M. (2006). Preschool through elementary writing. In P. Smagorinsky (Ed.),Research on Composition (pp. 15-47). New York: Teachers College Press. CHASE, P., & DoAN, J, (1994). Full circle: A new look at multi-age education. Portsmouth, NH: Heinemann. CHRISTENSEN, L. (2000). Reading, writing, and rising up: Teaching about social justice and the power of the written word. Milwaukee, WI: Rethinking Schools. COATES, ]. ( 1993). Women, men, and language. New York: Longman. COPPLE, c., SIGEL, 1., & SAUNDERS, R. ( 1979). Educating the young thinker: Classroom strategies for cognitive growth. New York: D. Van Nostrand. CRAMMOND, J. (1998). The uses and complex-ity of argument structures in expert and student persuasive writing. Written Commu-nication, 15, 230-268. CROWHURST, M. ( 1983, April). A developmen-tal perspective on persuasive writing. Paper presented at the annual meeting of the Conference on College Composition and Communication, Detroit, MI. CROWHURST, M. (1991). Interrelationships between reading and writing persuasive discourse. Research in the Teaching of English, 25,314-338. DAVIES, B., & HARRE, R. ( 1990). Positioning: The discursive production of selves. The Journal for the Theory of Social Behavior, 20, 43-63. DELPIT, L. (1986). Skills and other dilemmas of a progressive black educator. Harvard Educational Review, 56,379-385. DEREWIANKA, B. (1990). Exploring how texts work. Rozelle, Australia: Primary English Teaching Association. DEWEY, J, ( 1997). Experience and education. New York: Touchstone. (Original work published 1938). DUKE, N. K. (2000). 3.6 minutes per day: The scarcity of information texts in first grade. Reading Research Quarterly, 35,202-224. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions312 Research In lhe Teaching at English Volume 42 February 2008 DYsoN, A. H. ( 1993). Soda/ worlds of children learning to write in an urban primary schooL New York: Teachers College Press. DYSON, A. H. (2003). The brothers and sisters learn to write: Popular literades in childhood and school cultures. New York: Teachers College Press. ELLSWORTH, P. C., & SINDT, v. G. (1994). Helping \"Aha\" to happen: The contributions of Irving Sigel. Educational Leadership, 51 ( 5), 40-45. FAIRCLOUGH, N. (1992). Critical language awareness. New York: Longman. FELTON, M., & KuHN, D. (2001). The development of argumentative discourse skill. Discourse Process, 29, 135-153. GEE, ]. P. ( 1990). Sodalliteracies: Ideology in discourses. New York: Palmer. GEE, J. P. (I 991). A linguistic approach to narrative. Journal of Narrative and Life History, 1(1), 15-39. Gee, J.P. (1996). Soda/linguistics and literades: Ideology in discourses. Briston, PA: Taylor & Francis. GEE, ]. P. ( 1999). An introduction to discourse analysis theory and method. London: Routledge. GowER, C. ( 1992). Production of elaborated argumentative discourse: The role of cooperativeness. European Journal of Psychology of Education, 7, 49-57. GowER, C., & CouRIER, P. (1994). Argumen-tative text writing: Developmental trends. Discourse Processes, 18, 187-210. GoooLAD, }.I., & ANDERSON, R. H. (1987). The non-graded elementary school (Rev. ed.). New York: Teachers College Press. GooDMAN, K. (1986). What's whole in whole language? Portsmouth, NH: Heinemann. GRAVES, D. (1989). Investigate nonfiction. Portsmouth, NH: Heinemann. GUTIERRFZ, K., BAQUEDANO-loPFZ, P., & TuRNER, M. G. ( 1997). Putting language back into language arts: When the radical middle meets the third space. Language Arts, 74, 368-378. HABERMAS, }. ( 1984). Theory of communica-tive action (T. McCarthy, Trans., Vol. I). London: Heinemann. HEATH, S. B. ( 1983 ). Ways with words: Language, life, and work in communities and classrooms. New York: Cambridge University Press. KNUDSON, R. ( 1991 ). Effects of instructional strategies, grade, and sex on students' per-suasive writing. journal of Experimental Education, 59, 141-152. KNUDSON, R. ( 1992). Analysis of argumenta-tive writing at two grade levels. Journal of Educational Research, 85, 169-179. LAREAU, A. (2003). Unequal childhoods: Class, race, and family life. Berkeley: University of California Press. LAvE,]., & WENGER, E. (1991). Situated learning: Legitimate peripheral participation. New York: Cambridge University Press. LEFEBVRE, H. (1991). The production of space {D. Nicholson-Smith, Trans.). Oxford: Blackwell. LEwrs, C. (2001). Literacy practices as social acts: Power, status, and cultural norms in the classroom. Mahwah, NJ: Erlbaum. MAHIRI, J. (2004). New teachers for new times; The dialogical principle in teaching and learning electronically. In A. F. Ball & S. W. Freedman (Eds.), Bakhtinian perspectives on language, literacy, and learning (pp. 213-231). New York: Cambridge University Press. MARKUS, H. R. (2006). It's a free country; Social class, agency, and choice. Tri-College Lecture Series, Swarthmore College, April 18,2006. McCANN, T. ( 1989). Student argumentative writing knowledge and ability at three grade levels. Research in the Teaching of English, 23, 62-76. McGILLICUDDY-DELisi,A. V., SIGEL, I. E., & JoHNSON,]. E. (1979). The family as a system of mutual influences: Parental beliefs, This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and ConditionsANDERSON The llementarv Persuasive Lauer 313 distancing behaviors and children's represen-tational thinking. In M. Lewis & L.A. Rosenbaum (Eds.), The child and its family: The genesis of behavior (Vol. II, pp. 91-106), New York: Plenum. MIANO, A. A. (2004). Voices in dialogue-hybridity as literacy, literacy as hybridity: Dialogic responses to a heteroglossic world. In A. F. Ball & S. W. Freedman (Eds.), Bakhtinian perspectives on language, literacy, and learning (pp. 307-314). New York: Cambridge University Press. MITCHELL, J. C. ( 1984 ). Typicality and the case study. In R. F. Ellen (Ed.), Ethnographic research: A guide to conduct (pp. 238-241 ). New York: Academic Press. MoFFETT, J., & WAGNER, M. J. (1983). Student-centered language arts and reading, K-13: A handbook for teachers (3rd ed.). Boston, MA: Houghton-Mifflin. MOLL, L., AMANT!, C., NEFF, D., & GoNZALEZ, N. ( 1992). Funds of knowledge for teaching: Using a qualitative approach to connect homes and classrooms. Theory into Practice, 31,131-141. OcHS, E. ( 1993). Constructing social identity: A language socialization perspective. Research on Language and Social Interaction, 26,287-306. PALACIOS, A. & REASONER, C. ( 1993). The llama's secret. Mahwah, NJ: Troll Associates. PAPPAS, C. C. (2006). The information book genre: Its role in integrated science literacy research and practice. Reading Research Quarterly, 41,226-250. PA'JTON, M. Q. (1980). Qualitative evaluation methods. Beverly Hills, CA: Sage Publications. PERELMAN, L. (2005). New SAT: Write long, badly, and prosper. Jewish World Review. Retrieved July 21, 2006, from www.jewishworldreview.com/0605/ perelman.php3 RoGERS, R. (2003 ). A critical discourse analysis of family literacy practices: Power in and out of print. Mahwah, NJ: Erlbaum. RoGERS, R. (Eo.) (2004). An introduction to critical discourse analysis in education. Mahwah, NJ: Erlbaum. RowE, D. W., & LEANDER, K. M. (2005). Analyzing the production of third space in classroom literacy events. In B. Maloch, J. V. Hoffman, D. L. Schallert, C. M. Fairbanks, & J. Worthy (Eds.) 54th Yearbook of the National Reading Conference (pp. 318-333). Oak Creek, WI: National Reading Confer-ence. SiGEL, r. E. (1984). A constructivist perspec-tive for teaching thinking. Educational Leadership, 42(3), 18-21. SiGEL, l. E. (1991). Parents' influence on their children's thinking. In A. Costa (Ed.), Developing minds: A resource book for teaching thinking(Rev. ed., Vol. 1, pp. 43-46). Alexandria, VA: Association for Supervision and Curriculum development. SoJA, E. W. (1989). Postmodern geographies: The reassertion of space in critical social theory. London: Verso. SPERLING, M. (2003). Tenth grade literacy and the mediation of culture, race, and class. In S. Greene & D. Apt-Perkins (Eds.), Making race visible: Literacy research for cultural understanding (pp. 131-148). New York: Teachers College Press. SPERLING, M. (2004). Is contradiction contrary? In A. F. Ball & S. W. Freedman (Eds.), Bakhtinian perspectives on language, literacy, and learning (pp. 232-251 ). New York: Cambridge University Press. STRAuss, A., & CoRBIN, J. (1990). Basics of qualitative research: Grounded theory procedures and techniques. London: Sage Publications. TANNEN, D. (1993). What's in a frame? Surface evidence for underlying expecta-tions. In D. Tannen (Ed.), Framing in discourse. New York: Oxford University Press. TAYLOR, D., & DoRSEY-GAINES, C. (1988). Growing up literate: Learning from inner-city families. Portsmouth, NH: Heinemann. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:59 PMAll use subject to JSTOR Terms and Conditions314 Research In lhe Teaching of English Volume 42 February 2008 THORNE, B. (1993). Genderplay: Girls and boys in school. New Brunswick, NJ: Rutgers University Press. TITSCHER, S., MEYER, M., WoDAK, R., & VETTER, E. (2000). Methods of text and discourse analysis. London: Sage. TouLMIN, S., RIEKE, R., & JANIK, A. (1981). An introduction to reasoning. New York, McMillan. VYGOTSKY, L. (1978). Mind in society: The development of higher psychological processes. Cambridge, MA: Harvard University Press. WEAVER, C. (1990). Understanding whole language: From principles to practice. Portsmouth, NH: Heinemann. WERTHEIMER, L. (2005). MIT professor finds fault with SAT essay. Retrieved July 21, 2006, from www.npr.org/templates/story/ story.php?storyld=4634566 WoRTHAM, S. (2001 ). Narratives in action: A strategy for research and analysis. New York: Teachers College Press. WRITE SOURCE. (2002). Reader's handbook: A student guide for reading and learning. Wilmington, MA: Houghton Mifflin Great Source Education Group. WRITE SouRCE (2004). Inside writing: Persuasive essays. Wilmington, MA: Houghton Mifflin Great Source Education Group. YEH, S. (1998). Empowering education: Teaching argumentative writing to cultural minority middle-school students. Research in the Teaching of English, 33, 49-83. 2007 Promising Researcher Winners Named: Amanda Haertling Thein, University of Pittsburgh, \"She's Not a Prostitute!: Re-read-ing Working-Class Girls' Responses to Literature through an Examination of Interpre-tive Practices\"; Tara Star Johnson, Purdue University, Indiana, \"Crossing the Line: When Pedagogical Relationships Go Awry\"; Steven Talmy, University of British Columbia, \"The Cultural Productions of the ESL Student at Tradewinds High: Contingency, Mulitidirectionality, and Identity in L2 Socialization.\" In commemoration of Bernard O'Donnell, the NCTE Standing Committee on Re-search sponsors the Promising Researcher Award. The 2007 Promising Researcher Award Committee Members are Deborah Hicks, Chair, Colette Daiute, Joel Dworin, Mary J uzwik, and Yolanda Majors. Sarah Freedman is the Chair of the Standing Committee on Research. Funding Opportunity The NCTE Research Foundation's Cultivating New Voices program is designed to pro-vide support, mentoring, and networking opportunities for early career scholars of color. The program aims to work with graduate students and early career scholars of color to cultivate their ability to draw from their own cultural/linguistic perspectives as they conceptualize, plan, conduct, and write their research. Please visit http:/ /www.ncte.org/ groups/research/voices/120698.htm for more information. The deadline for program proposal submissions is March 1 0, 2008. ",
    "Link": "https://core.ac.uk/download/84122008.pdf"
}