{
    "Title": "Development of a protocol that allows safe consumption of the hypoallergenic apple cultivar Santana",
    "Authors": "Maas, M.P., van der, Schenk, M.F.",
    "Year": "No year available",
    "Abstract": "The apple (Malus ×domestica) cultivar Santana was shown to have a low allergenicity in a previously reported clinical trial. A protocol was developed to validate these results outside a clinical setting and to market the Santana as a hypoallergenic apple for large-scale consumption. This protocol was designed to ensure safe consumption of the Santana by consumers suffering from apple allergy. We tested the protocol in a pilot in 100 supermarket stores and evaluated in an internet-based survey with 295 respondents. Forty-one percent of the consumers with an apple allergy did not have an allergic reaction to the Santana. Only five percent of the allergic consumers that tried the Santana reported a strong allergic reaction. In concordance with this, the majority (78%) of the mild apple allergic consumers appreciated the Santana. The developed protocol is considered suitable for safe consumption of the Santana providing that information about the possibility of having an allergic reaction among consumers with a mild apple allergy is added to the label",
    "Keywords": "No keywords available",
    "Publisher": "'International Society for Horticultural Science (ISHS)'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " 549\nDevelopment of a Protocol that Allows Safe Consumption of the \nHypoallergenic Apple Cultivar Santana  \n \nM.P. van der Maas M.F. Schenk \nApplied Plant Research Plant Research International \nWageningen University and Research Centre Wageningen University and \nWageningen Research Centre \nThe Netherlands Wageningen \n The Netherlands \n \nKeywords: Malus ×domestica, apple cultivar Santana, apple allergy, consumer survey \n \nAbstract \nThe apple (Malus ×domestica) cultivar Santana was shown to have a low \nallergenicity in a previously reported clinical trial. A protocol was developed to \nvalidate these results outside a clinical setting and to market the Santana as a \nhypoallergenic apple for large-scale consumption. This protocol was designed to \nensure safe consumption of the Santana by consumers suffering from apple allergy. \nWe tested the protocol in a pilot in 100 supermarket stores and evaluated in an \ninternet-based survey with 295 respondents. Forty-one percent of the consumers \nwith an apple allergy did not have an allergic reaction to the Santana. Only five \npercent of the allergic consumers that tried the Santana reported a strong allergic \nreaction. In concordance with this, the majority (78%) of the mild apple allergic \nconsumers appreciated the Santana. The developed protocol is considered suitable \nfor safe consumption of the Santana providing that information about the possibility \nof having an allergic reaction among consumers with a mild apple allergy is added to \nthe label. \n \nINTRODUCTION \nAbout 2% of the population in Northern and Central Europe suffers from allergy \nto apple (Kootstra et al., 2007). The majority of these people suffer from a type of food \nallergy called oral allergy syndrome (OAS; Ortolani et al., 1988). The primary measure to \ndeal with this allergy is to avoid eating fresh apples (Kootstra et al., 2007). This limits \ntheir normal dietary intake, which is not an ideal situation because apples contribute to a \nwell-balanced and a healthy diet. \nProducts that have a reduced allergenicity are called hypoallergenic. Consumption \nof such products results in a reduced allergic reaction or no allergic reaction in part of the \nconsumers that react to the allergenic counterparts. The Dutch apple cultivar Santana was \nidentified as hypoallergenic in a screening test among 21 apple cultivars using the prick to \nprick method and in a small-scale Double Blind Placebo Controlled Food Challenge \n(Bolhaar et al., 2005). Kootstra et al. (2007) confirmed these results in an open challenge \nand found that eight out of fifteen (53%) apple allergic patients did not develop any \nallergy complaints to the Santana. This differed significantly from the number of subjects \nwho reacted to the apple cultivars Topaz (7%) and Golden Delicious (7%). In addition, \nfour out of seven individuals that did react to the Santana experienced symptoms that \nwere less severe than after consumption of the other two cultivars. Seventy-three percent \nof the test subjects stated that they would eat the Santana apple in the future.  \nThis study examines whether the Santana is suitable for marketing and \nconsumption by apple allergic consumers using a special protocol. \n \nMATERIALS AND METHODS \nA protocol was developed to ensure that the Santana was made available for \nconsumers with apple allergy in a medical, legal, logistic and commercial warranted way.  \nThe protocol was established in cooperation with the Dutch Food Allergy \nFoundation and with scientists in the field of allergy. The protocol was put in practice in \nProc. IInd IS on Human Health Effects of F&V\nEd.: B. Patil \nActa Hort. 841, ISHS 2009 \n 550\ncooperation with the Dutch supermarket chain Albert Heijn. \nThe information leaflet that was enclosed with the product redirected consumers to \nan internet page that provided additional information on apple allergy. The consumers \nwere then prompted to fill in a survey. The survey included items on the severity of the \napple allergy in general, the occurrence of an allergic reaction to the Santana, the severity \nof the symptoms in case an allergic reaction had occurred, the appreciation of the \nSantana, the use of allergy medication after eating Santana, and the consultation of a \nfamily doctor/allergologist before eating the Santana.  \n \nRESULTS AND DISCUSSION \n \nThe Protocol \nThe following measures were included in the protocol:  \n1. Measures to prevent mixing of the Santana with other apple cultivars. Mixing should \nbe prevented throughout the production chain in order to avoid exposure of apple \nallergic consumers to cultivars which do induce an allergic reaction. The following \nsteps were taken: exclusion of Santana orchards with pollinators in the Santana rows, \nstorage in separate storage houses and packaging of the Santana prior to the shipment \nto selling in the stores. Special instructions were given to the workers involved to avoid \nmixing with other apples. \n2. Measures to restrict consumption of the Santana to consumers with a mild apple \nallergy. Previous studies showed that the Santana is not allergenic to part of the apple \nallergic consumers. Others with an apple allergy are still expected to have an allergic \nreaction to the Santana. Therefore, people who suffer from a severe allergic reaction to \napples and who experience swelling responses or worse were strongly advised not to \ntry the Santana. The package of the Santana read on the label: “suitable for people with \na mild apple allergy; first read the enclosed information leaflet”. \n3. Measures to minimize the consequences of having an allergic reaction to the Santana \n(restriction to mild was considered insufficient to guarantee the absence or a sufficient \nreduction of all allergic reactions). Some patients with a mild apple allergy will still \nhave an allergic reaction to the Santana. Therefore, an extra safety precaution was \nrequired to minimize the consequences of an allergic reaction: the enclosed information \nleaflet, included an appeal to follow a safe testing procedure. This step-wise procedure \nwas described on the leaflet and could be carried out by consumers themselves at \nhome. \n \nConsumer Survey \nThe survey was completed by 295 consumers with an apple allergy who had all \ntried the Santana. The results in Table 1 show that the majority of these respondents \nclassified themselves as having a mild or moderate apple allergy.  \nInformation about the reaction to the Santana is presented in Table 2. The most \nimportant observations are: \n1. The percentage of consumers who could eat the Santana without having an allergic \nreaction was highest in the “mild” apple allergy class (52%).  \n2. The percentage of consumers who could eat the Santana without having an allergic \nreaction in the “moderate” and “severe” classes were lower (35 to 32%). \n3. The majority (78 to 84%) of the consumers in all apple allergy classes appreciated \n(score 5-7) the Santana. \n4. Experiencing an allergic reaction or not, had a large influence on appreciation. All \nconsumers that had no allergic reaction to the Santana appreciated the Santana. \nThe severity of the allergic reaction to the Santana among the consumers that did \nexperience an allergic reaction was generally mild. Only five percent of the consumers \nreported having a strong allergic reaction, while four percent of the consumers used \nallergy medication after consumption of the Santana. Three percent of the respondents \nconsulted a family doctor before eating the Santana. \n 551\nThe protocol covered the measurements that could be taken in terms of product \nresponsibility on the part of the retailer especially the avoidance of severe allergic \nreactions occurring . Some consumers with a severe allergy did, however, try the Santana. \nConsumers have their own responsibilities to act on the suggestions that were provided \nwith the product. \n \nCONCLUSIONS \nThe results from the sales pilot indicated that the applied protocol was suitable to \nallow safe consumption of the Santana by apple allergic consumers. The majority of these \nconsumers appreciated the Santana, although a considerable number of them still had a \nmild allergic reaction to the Santana. The step-wise testing protocol minimizes the \nconsequences of these reactions. Information about the possibility of the occurrence of an \nallergic reaction in individuals that have a mild apple allergy should be added to the \ninformation label, as omitting this information may raise false expectations. \n \nACKNOWLEDGEMENTS \nThis research was financed by the Dutch Ministry of Agriculture, Nature and Food \nQuality. \n \nLiterature Cited \nBolhaar, S.T.H.P., van de Weg, W.E., van Ree, R. et al. 2005. In vivo assessment with \nprick-to-prick testing and double-blind, placebo-controlled food challenge of \nallergenicity of apple cultivars. J. Allergy Clin. Immunol. 116:1080-1086. \nKootstra, H.S., Vlieg-Boerstra, B.J. and Dubois, A.E.J. 2007. Assessment of the reduced \nallergenic properties of the Santana Apple. Annals of Allergy, Asthma & Immunology \n99: 522-55. \nOrtolani, C., Ispano, M., Pastorello, E., et al. 1988. The oral allergy syndrome. Annals of \nAllergy 61: 47-52. \nPastorello, E.A., Pravettoni, V., Varioli, L., et al. 1999. Clinical role of a lipid transfer \nprotein that acts as a new apple- specific allergen. J. Allergy Clin. Immunol 104: \n1099-1106. \n \nTables \n \nTable 1. Number of respondents in the consumer survey, divided according to the self-\nreported severity of the allergic reaction to apple in general. \n____________________________________________________________________ \nClassification Description1 Number of Percentage (%) \napple allergy  respondents     \n____________________________________________________________________ \nMild Itching and irritation     77  26 \nModerate Slight swelling    187  63 \nSevere Severe swelling      31  11 \n and shortness of breath \nVery severe 2 Life threatening      0    0 \n symptoms \n1 Reference to mouth, lips, tong, nose, eyes and throat  \n2 The application of this protocol is restricted to the Netherlands, Belgium and Luxemburg. In these North-\nWest European countries, most people who suffer from apple allergy have a relative mild form of allergy. \nThe allergy class “very severe” is expected to be extremely rare among apple allergic consumers in these \ncountries. In contrast, a type of apple allergy that is caused by lipid transfer proteins may result in very \nsevere symptoms in southern Europe (Pastorello et al., 1999).  \n 552\n \nTable 2. Appreciation of the Santana by respondents with an apple allergy. Numbers in \nthe table are percentages. \n____________________________________________________________ \nAllergic Appreciation   \nreaction to of the Santana                 Classification apple allergy1_____ \nthe Santana by consumers2 Mild  Moderate Severe \n                          (%)                  (%)                 (%) \nNo        1-4     0    0    0    \nNo        5-7   52  35  32 \n \nYes        1-4   22  17  16 \nYes        5-7   26  48  52 \nTotal        1-4   22  17  16 \nTotal        5-7   78  83  84 \n1 According to the classification in Table 1 \n2 Scale 1 to 7 with “1” labeled as “no appreciation at all” and “7” labeled as “high appreciation” \n",
    "Link": "https://core.ac.uk/download/pdf/29247803.pdf"
}