{
    "Title": "Education",
    "Authors": "Sorby, Angela",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "e-Publications@Marquette",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Marquette Universitye-Publications@MarquetteEnglish Faculty Research and Publications English, Department of1-1-2013EducationAngela SorbyMarquette University, angela.sorby@marquette.eduPublished version. \"Education,\" in Emily Dickinson in Context. Ed. Eliza Richards. Cambridge; NewYork: Cambridge University Press, 2013: 36-48. Publisher Link. © 2013 Cambridge UniversityPress. Used with permission.CHAPTER 3 Education Angela Sorby Emily Dickinson's own words complicate the story of her education. In 1862, she wrote to Thomas Wentworth Higginson: \"I went to school -but in your manner of the phrase - had no education\" (L261) . Although Dickinson did not attend Harvard like Higginson, she was actually superbly educated at home, at Amherst Academy, and at Mt. Holyoke Female Seminary. So why disavow this background? Why draw a distinc-tion between \"school\" and \"education\"? Jed Deppman has argued that \"for those who seek to join their thought with Dickinson's, the issue of word definitions represents a key mediation between her private poetic concerns and the larger, volatile cultural climate of metaphysical instability that included bur far transcended the making of dictionaries.'\" Any account of Dickinson's education, then, must consider what education meant in the worlds that she inhabited, and how she negotiated it to meet her evolv-ing needs as a poet. In her poems and letters, Dickinson displays a strong autodidactic streak; she uses educational texts and mentors to study what she wants to learn, not necessarily what they want to teach. However, even as she asserts her individuality, she continually cultivates pedagogical rela-tionships that are affective as well as intellectual. Dickinson draws on the spiritual, romantic, and scientific dimensions of her schooling, but she defines education, above all, as a labor of love - with all the risks and inti-macies that love entails. Dickinson's earliest educational experiences were steeped in what Deppman calls metaphysical instability, for competing strains of Calvinism, romanticism, and affective sentimentalism contributed to her emerging worldview. Dickinson's formal schooling reflected the religious orthodoxy of her community. From the Calvinist perspective, literacy matters because it is a crucial path to salvation. In Corderius Americanus, Cotton Mather cautions parents not to let their children \"die without instruction,\" because through careful study children can steer their inher-ently evil natures toward redemption.' Dickinson's community was still Education 37 steeped in Calvinist doctrine and treated education (including girls' edu-cation) as a serious enterprise with clear aims. At the same time, as Jane Donahue Eberwein has argued, Con-necticut Valley Calvinism was under tremendous pressure from early nineteenth-century advances in Biblical scholarship, the arts, and the sci-ences. Geographically isolated Amherst was hardly a hotbed of romantic revolurion, but outside influences trickled in: students arrived at Amherst College from elsewhere (and many taught at Amherst Academy after graduation); Parley's Magazine, and later Harper's Monthly and The Atlan-tic Monthly, came through the mail; and of course Dickinson cultivated far-flung friends and mentors, especially in her youth. Her Calvinist edu-cation was thus supplemented with fragments of transatlantic romantic thought, scientific rationalism, and secular liberalism. Romantics believed that education should draw out the natural genius of the individual. In his essay \"Education,\" Emerson amplifies: I believe that our own experience instructs us that the secret of Education lies in respecring the pupil. It is nor for you to choose what he shall know, whar he shall do. Ir is chosen and foreordained, and he only holds the key to his own secrer. J Puritans want to teach children through direct instruction, so they can apprehend the word of God. Romantics, by contrast, want to teach children indirectly, through experience, so they can discover the voice within themselves. Dickinson acknowledged her debt to Emerson when she wrote to Otis Lord, \"Ralph Waldo Emerson, whose name my Father's Law Student taught me, has touched the secret spring\" (L750). Here, Dickinson succinctly describes Romantic pedagogy: Emerson, like all good teachers, simply led her to the wellspring of her own genius. The third discourse in Dickinson's education is perhaps the most strongly influential, trumping both Calvinist orthodoxy and Romantic individualism. It is, however, also the hardest to define, because it is neither an intellectual movement nor a moral stance. In 1887, a year after Dickinson's death, Higginson tried to put his finger on the zeitgeist of antebellum New England, lamenting the decline of \"the sentimental,\" which he defines as ... a certain rather melodramatic self-consciousness, a render introspection in rhe region of rhe heart, a kind of studious cosseting of one's finer feel-ings. Perhaps it is nor generally recognized how much more abundant was this sort of thing forty years ago than now, and how it moulded the very temperaments of those who were born into ir, and grew up under it.4 -Sorby During her education, Dickinson wrestled with Calvinism and experi-mented with Romanticism, but she also cultivated a vast archive of emo-tional responses that made everything she learned personal almost to the point of pain. This sentimental education served as an overarching frame for all of her other lessons, and ultimately infused her poetry with a life-or-death urgency that went beyond teleological questions of spiritual salvation or transcendence. Dickinson's education began at home. The Dickinson family owned two editions of the New England Primer, from 1830 and 1843. The Primer was frequently updated during its long reign, but Webster's 1843 Primer is \"certified\" as an exact reprint of the 1691 Benjamin Harris version, indexing the Dickinson family's allegiance to \"true and fundamental doctrines\" that were otherwise on the wane. To learn from the Primer was to read against the expansively liberal grain ofJacksonian America. However, as Pat Crain has argued, even the conservative Primer is an internally inconsistent doc-ument that reveals tensions within Calvinism, and here Dickinson found provocative raw materials for her imagination.5 For instance, in February of 1850 Dickinson sent a valentine to William Cowper Dickinson, con-taining an original verse that begins: \"Life is but a strife / 'Tis a bubble / 'Tis a dream\" (L33). To illustrate, she pasted in a woodcut of a sleeping king, clipped from the Primer. Such repurposing, from textbook to valen-tine, registers Puritan individualism, while also marking the human con-nections that were so crucial to Dickinson's art. The Primer also contains hymns and verses by Isaac Watts, whose meters echo through Dickinson's quatrains . .As late as 1882, Dickinson was reworking Watts's famous lines, \"Now I lay me down to sleep,\" from the Primer: Now I lay thee down to Sleep -I pray the Lord thy Dust to keep -And if thou live before thou wake -I pray the Lord thy Soul to make -( F1575 J1539) Dickinson's prayer is disconcerting because the body - dust - takes precedence over the soul; indeed, the speaker hopes that the dead person will remain at peace as a physical corpse, inverting the Christian dream of resurrection. To use Watts prayer - and his familiar meter - is to mark the distance between her early training and her later heterodoxies. Ironically, Dickinson's confidence in her creative powers probably stemmed in part from her Calvinist upbringing, which stressed the pro-fundity of every soul. As another Watts poem from the Primer begins: .. l Education Though I am young a little one, If I can speak and go alone, Then I must learn to know the Lord And learn to read his holy word.6 39 If anyone learned well how to \"speak and go alone,\" it was Emily Dickinson. Dickinson was sent to a District common-school at the age of seven, but her serious institutional education began at the age of nine, in September of 1840, when she and her sister Lavinia enrolled in Amherst Academy. Amherst Academy was a rigorous school that had been co-founded by her grandfather, Samuel Fowler Dickinson, in 1814. Its published aims were Calvinist, but its pedagogical approach was progressive, reflecting the influences of Romantic educators who tried to engage children's natu-ral passions and interests. As early as 1827, a school flier announced that \"Languages will be taught in such a manner, that the study of text books may be a study of interestingfocts and sentiments as well as of words and their grammatical relations.\"? Dickinson attended the school on and off for seven years, between 1840 and 1847. Her letters reflect an ardent enthu-siasm for her classes; as she wrote to Abiah Root in 1845, \"We have a very fine school. ... I have four studies. They are mental Philosophy, Geology, Latin, and Botany. How large they sound, don't they?\" (L6). In the 1840S it was unusual for girls to be classically trained, but Dickinson took the Academy's Latin course for three years, and Alfred Habegger suggests that she \"would have been a very different poet if she hadn't studied the language.\" Citing Lois Cuddy, he argues that her background in Latin explains Dickinson's \"extreme dislocations of stan-dard English word order and her use of such grammatical terms as 'abla-tive'\" (Habegger, 141-2). However, Dickinson's stylistic quirks cannot be solely rooted in her classical training. After all, the classically educated Higginson was confounded by these very dislocations. Rather, as with the New England Primer, Dickinson wrestled with her school textbooks, intel-lectually and emotionally, breaking the barrier between ''facts and senti-ments. \" On the flyleaf of her copy of Virgil's Aeneid, Dickinson wrote: Forsan et haec olim memnisse juvabit. Aeneid 1-203 Afterwards you may rejoice at the remembrance of these (our school days) When I am far away then think of me - E. Dickinson (quoted in Habegger, 141) This inscription reveals several nascent habits of mind. First, Dickinson is fusing a \"feminine\" genre, the autograph album, with a \"masculine\" genre, -Sorby the Latin textbook. Second, she is not just translating Virgil verbatim, bur also adding her own addendum of our school days. And third, she is imag-ining reading and writing as intimate, affective strategies: \"When I am far away then think of me.\" Virgil may have influenced Dickinson, but she in turn inflected Virgil, applying both the literal pressure of her pencil and the interpretive pressure of her highly personalized gloss on the Aeneid as a token of girlhood friendship. Ironically, Dickinson's gender, which restricted her on so many fronts, may have helped her cultivate idiosyncratic habits of mind precisely because her educational goals were less fixed than those of most boys. For instance, her brother Austin (and, for that matter, T. W Higginson) had to master Latin to succeed at college. But because Dickinson was not Harvard-bound, she could pick and choose among \"college prep\" subjects. Indeed, in her final year at the Academy, she switched from the Classical course back into English, a zigzag she also performs in one of her earliest poems: \"Sic transit gloria mundi,\" \"How doth the busy bee,\" \"Dum vivimus vivaII1us,\" I stay mine enemy! Oh \"veni, vidi , vici!\" Oh caput cap-a-pie! And oh \"memento mori\" When I am far from thee! (h13) Dickinson's parodic recitation mixes Latin phrases with Isaac Watts, whose didactic \"busy bee\" diligently \"improves each shining hour.\"8 But she also inserts a plea that she be personally remembered, just as she did in her copy of the Aeneid This poem is animated by an ironic voice that overwrites even stock phrases with its cheeky individuality. Textbook passages lose their original meaning when breathlessly juxtaposed, working to express the speaker's own idiosyncratic vision. For instance, \"Dum vivimus vivamus\" tech-nically means \"while we live, let us live,\" but in Dickinson's poem the v-v-v alliteration links it to the noise a bee makes. Isaac Watts's insect is no longer a Calvinist worker-bee; rather, he buzzes aimlessly in a pagan tongue. Likewise the speaker is not a child of Amherst, where evangelical Christianity pervaded every school textbook. Rather, she is a discursive product of the nineteenth-century marketplace of ideas, in which every-thing is possible but nothing is certain. Random phrases, thrown together, 4 J Education 41 create an amusing pastiche that lampoons authorities from Isaac Watts to Isaac Newton but never settles on any fixed truth. Amherst Academy did not rely solely on the kind of mindless recita-tion that Dickinson parodies in \"Sic transit gloria mundi.\" Teachers also required students to write and perform original compositions. In an 1842 letter to Jane Humphrey, Dickinson described one such performance: .. . this Afternoon is Wednesday and so of course there was Speaking and Composition - there was one young man who read a Composition the Subject was think rwice before you speak - he was describing the reasons why anyone should do so - one was - if a young gentleman - offered a young lady his arm and he had a dog who had no tail and he boarded at the tavern think twice before you speak .. .. I told him I thought he had better think twice before he spoke - . (L3) Two critical aesthetic tendencies are evident in this early letter. First, Dickinson is delighting in the split between the cliche \"think twice before you speak\" and its potential undoing by an incompetent speaker. Also, she is observing that ordinary language can quickly devolve into nonsense, and that nonsense can destabilize consensus reality. Later she would use these insights to unpack social bromides; for example, \"They say that 'Time assuages,' / Time never did assuage\" (F86I J686). Conventional phrases - think twice before you speak, time heals all wounds - are a source of inspiration precisely because they contain (but do not assuage) troubling ambiguities. Erika Scheurer makes a case that these Wednesday composition sessions contributed to Dickinson's original voice. She points out that Amherst Academy's approach was Pestalozzian, reflecting \"the beginnings of a larger nationwide transition in the area of writing pedagogy from a focus on rote learning and correctness to more of an emphasis on the actual practice of original composition, with the goal of students gaining fluency and agency as writers.\"9 However, although Dickinson was surely capable of fluent prose, her poems and letters frequently disrupt their own flow. Indeed, her leaps of logic, twisted syntax, and dislocated imagery echo the roughness of the passage about the dog with no tail, although of course her textured style is deliberate. Science pedagogy was especially strong at Amherst Academy, and also at Amherst College, where Academy students could attend lectures. One important figure in Dickinson's early scientific education was Edward Hitchcock, a geologist who became president of Amherst College and a close friend of the Dickinson family. Hitchcock had discovered the world's largest collection of dinosaur tracks, but he was a lifelong anti-Darwinist -42 Sorby and offered science courses predicated on the \"argument from design,\" that the natural world proves the existence and majesty of God. At the same time, Hitchcock's Elementary Geology (used at both Amherst Academy and Holyoke) proceeds carefully from physical evidence, distin-guishing between science and religion: \"Revelation does not attempt to give instruction in the principles of science: nor does it use the precise and accurate language of science; but the more indefinite language of common life. Nor does science attempt to teach the peculiar truths contained in revelation.\"10 Dickinson would take the split between science and religion only a half-step further when she declared, 'Faith' is a fine invention When Gentlemen can see -But Microscopes are prudent In an emergency. (F202 J185) Hitchcock might have recoiled in hortor at the notion of faith as an inven-tion, but his Elementary Geology establishes - in spite of its evangelical slant - that scientific truths can be accessed only through microscopes, not through the Bible. In terms of Dickinson's education, what matters is the unsettled quality of so much scientific knowledge and evidence in the 1840s: it was possible to shoehorn dinosaur tracks into a Biblical under-standing of the universe, but it was not easy. Dickinson's formal education was predicated on the assumption that students were progressing toward a full acceptance of Christianity. After Amherst Academy, Dickinson proceeded to Mt. Holyoke Female Seminary, and had she confirmed her faith there, her career as a student would have reached its expected culmination. The school's founder, Mary Lyon, was an Amherst Academy alumna and a Hitchcock protegee, but she exerted greater spiritual pressure on her students than Dickinson had previously encountered. Amanda Porterfield has observed that conversion offered nineteenth-century Christians reassurance about death, a release from social constraints, and the easing of an \"emotional despair to which women especially were prey.\"\" However, Dickinson remained what Lyon called a \"no-hoper,\" a student who would never accept Christ. She could not attend Harvard, left Holyoke within a year, and was barred from most professions; without the end-point of conversion, her formal schooling lost its raison d' etre. Because she could not (and/or would not) convert, Dickinson was forced to construct her own aims as she continued her education beyond l Education 43 school. Her personal accounts always put greater emphasis on teachers than on institutional trajectories. In the letter that dismisses her formal education as \"no education,\" she gives a glowing account of mentoring: When a little girl, I had a friend who taught me Immortality; but venturing too near, himself, he never returned. Soon after my tutor died, and for several years my lexicon was my only companion. Then I found one more, but he was not contented I be his scholar, so he left the land. (L26I) This passage outlines an ideal vision of an education based on relation-ships and processes, rather than outcomes. For Dickinson, the best teach-ers teach through indirection and example. She is seeking, not direct instruction, but intuitive, mutual, Emersonian pedagogy, replete with the emotional highs and lows of a close friendship. Thomas H. Johnson notes that the \"Immortal\" friend was almost cer-tainly Benjamin Franklin Newton, a Unitarian who shared his transcen-dental enthusiasms with her and - after he left Amherst in r850 - sent her Ralph Waldo Emerson's Collected Poems. Other critical mentors included Joseph B. Lyman, the Reverend Charles Wadsworth, Samuel Bowles, and, of course, Thomas Wentworth Higginson. Higginson was baffled by Dickinson's insistence on her role as his student; as he recalled in The Atlantic Monthly: \"From this time and up to her death (May r5, r886) we corresponded at varying intervals, she always persistently keeping up this attitude of 'Scholar,' and assuming on my part a preceptorship which it is almost needless to say did not exist. Always glad to hear her 'recite,' as she called it, I soon abandoned all attempt to guide in the slightest degree this extraordinary nature, and simply accepted her confidences, giving as much as I could of what might interest her in return.\"1l Perhaps, how-ever, Dickinson's sense of Higginson as a \"preceptor\" was not rooted in a need for guidance, but in a desire for emotional exchange. Naoko Saito points out that for Emerson, friendship is critical to education, because as we learn \"we are not engaged in isolated or secluded meditation, or in a kind of aesthetic self-indulgence. It is in the patient process of the conjoint metamorphosis of the self and the culture that the human soul is reborn.\"') To flourish as a poet, Dickinson did not require (or accept) Higginson's lit-erary advice, but Sutely she cultivated his friendship as part of an affective pedagogy, or \"conjoint metamorphosis,\" that linked her to her culture. In many of Dickinson's poems, intersubjective emotions do not merely facilitate learning. Rather, in keeping with her sentimental outlook, the s 44 Sorby full articulation of emotional experiences is one key purpose of education. Here she works out the possibilities: We learned the Whole of Love -The Alphabet - the Words -A Chapter - then the mighty Book -Then Revelation closed -(F53I 1568) At first, the learners seem fixed on a path toward conversion, but Revelation closes and they veer off course. By the final two stanzas they are gazing on each other rather than at their book: But in Each Other's eyes An Ignorance beheld -Diviner than the Childhood's And each to each, a Child -In the first line, \"Each Other\" is capitalized and the focus is on the stu-dents as they try to talk about \"What Neither - understood - / Alas! that Wisdom is so large - / And Truth - so manifold!\" Have the students in this poem wasted their education? No: the first stanza asserts that they have learned something - love - even if they remain suspended in partial ignorance. The very act of studying together results in a \"conjoint meta-morphosis,\" whereby the divine self - the Child - is revealed. Dickinson is often celebrated as an isolated autodidact. Her poetry and her letters, however, show that she also saw education as an ateleological emotional process: a way to encounter, but not necessarily to understand fully, the self and the world through others. NOTES 1 Jed Deppman, Trying to Think with Emily Dickinson (Amherst: University of Massachusetts Press, 2008), lIO. 2 Cotton Mather, Corderius Americanus: A discourse on the good education of chil-dren, &c. &c. delivered at the fUneral of Ezekiel Cheever, principal of the Latin school in Boston; who died, August, 1108, in the ninety-fourth year of his age. With an elegy and an epitaph (1708, reprint 1827), 13. 3 Ralph Waldo Emerson, \"Education,\" Emerson's Complete Works, ed. JE Cabot (New York: Riverside Edition, 1883), 142. 4 Thomas Wentworth Higginson, \"The Decline of the Sentimental,\" The New World and the New Book (New York: Lee & Shepherd, 1891), 178. 5 Patricia Crain, The Story of A : The Alphabetization of America .from the New England Primer to the Scarlet Letter (Palo Alto, CA: Stanford University Press, 2000), 15-38. • Education 45 6 !he New-England Primer: improved for the more easy attaining the true read-ing 0/ English: to which is added !he Assembly 0/ Divines, and Mr. Cotton's Catechism (Ira Webster, 1843) , 44. 7 Quoted in John Luke Parkhurst, The Teacher's Guide and Parent's Assistant (1827), 332. 8 Isaac Watts, ''Against Idleness and Mischief,\" Divine and Moral Songs for Children (1715), n.p. 9 Erika Scheurer, \"'[S]o of course there was speaking and Composition - ': Dickinson's Early Schooling as a Writer,\" ED], I8.1 (20°9),1-2. 10 Edward Hitchcock, Elementary Geology (New York: Dayton and Saxton, 1840), 281. II Amanda Porterfield, Mary Lyon and the Mt. Holyoke Missionaries (New York: Oxford University Press, 1997) . 12 Thomas Wentworth Higginson, \"Emily Dickinson's Letters,\" Atlantic Monthly, (October 1891), 450. 13 Naoko Saito, !he Gleam o/Light: Moral Perfectionism and Education in Dewey and Emerson. (New York: Fordham University Press, 2006), 16. ",
    "Link": "https://core.ac.uk/download/213080744.pdf"
}