{
    "Title": "Design as a driver of innovation in the East Midlands",
    "Authors": "TBR Economics",
    "Year": "No year available",
    "Abstract": "This study reports on research and consultation with local stakeholders to discuss the role of design as part of the innovation agenda in the East Midlands. A key finding of this research iss that the East Midlands has a very strong design industry and that businesses in the region use design to a much greater extent than in most other regions",
    "Keywords": "No keywords available",
    "Publisher": "emda",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " 19  Design as a Driver of Innovation in the East Midlands  A report prepared for emda   TBR Economics  2006    This work, with the exception of logos, photographs and images and any other content marked with a separate copyright notice, is licensed under a Creative Commons Attribution 2.0 UK: England & Wales License  The use of logos in the work is licensed for use only on non-derivative copies. Under this licence you are free to copy this work and to make derivative works as long as you give the original author credit.   The copyright is owned by Nottingham Trent University.                      This document forms part of the emda Knowledge Bank                             Design as a Driver of Innovation in the East Midlands $  4             Design as a  Driver of Innovation  In The East Midlands    Enquiries about this report may be addressed to:  Owen Buttolph Paul Miller Andrew Graves David Beeton      TBR Economics TBR House 16 Jesmond Road Newcastle upon Tyne, NE2 4PQ  Telephone: +44 (0) 191 281 9955 Fax: +44 (0) 191 281 9966 Email: Info@tbr.co.uk www.tbr.co.uk  This report is © Trends Business Research, 2006  PN00806R_Final_Reportv10.doc    Table of Contents |    © TBR Economics  PN00806R  TABLE OF CONTENTS EXECUTIVE SUMMARY ................................................................................1 1. INTRODUCTION AND BACKGROUND ...............................................3 1.1 CONTEXT ..............................................................................................3 1.2 REPORT STRUCTURE ................................................................................3 1.3 CREATIVITY, INNOVATION AND DESIGN ........................................................3 1.3.1 RECOMMENDATION: Creativity, Innovation and Design ................................4 1.4 UK COMPETITIVENESS AND THE BALANCE OF TRADE: A LARGER PERSPECTIVE.......4 2. THE STRATEGIC IMPORTANCE OF DESIGN......................................6 3. DESIGN AND INNOVATION IN THE EAST MIDLANDS ......................8 3.1 INNOVATION IN THE EAST MIDLANDS ..........................................................8 3.2 RECOMMENDATION: AUGMENTING THE COMMUNITY INNOVATION SURVEY (CIS) 8 3.2.1 The East Midlands Design Industry .............................................................9 3.2.2 The Use of Design .....................................................................................9 3.2.3 Initiatives ...............................................................................................11 3.3 DESIGN AS REGIONAL STRATEGIC PRIORITY ................................................11 3.3.1 Strategic issues for Businesses .................................................................12 3.3.2 Strategic issues for HEIs ..........................................................................12 3.3.3 Strategic Issues for East Midlands Business Support ...................................12 3.3.4 RECOMMENDATION: Design as a Strategic Innovation Priority ....................12 3.4 LINKS TO THE REGIONAL INNOVATION STRATEGY AND ACTION PLAN.................13 3.4.1 Knowledge Exchange...............................................................................13 3.4.2 Innovation Support for Business ...............................................................13 3.4.3 Creating the Environment for Innovation ...................................................14 3.4.4 Fostering and Enabling Emerging Technologies..........................................15 3.5 TARGETING INTERVENTION......................................................................15 3.5.1 RECOMMENDATION: Targeting Intervention..............................................16 4. THE PRACTICAL APPLICATION OF DESIGN ...................................18 4.1 THE COX RECOMMENDATIONS..................................................................18 4.2 THE DESIGNING DEMAND PROGRAMME ......................................................18 4.2.1 The role of the RDA.................................................................................20 4.2.2 The Core Program ...................................................................................20 4.2.3 Costs......................................................................................................20 4.2.4 Conclusion ..............................................................................................21 4.3 DD IN OTHER REGIONS ..........................................................................21 4.3.1 Potential Benefits to the East Midlands ......................................................22 4.4 POTENTIAL RISKS, ISSUES, AND OPPORTUNITIES..........................................22 4.4.1 Improving Business by Design ..................................................................22 4.4.2 Economic Impact.....................................................................................24 4.4.3 Regional Fit ............................................................................................26 4.4.4 Evaluation ..............................................................................................27 4.4.5 Introduction of “NEWCO” .........................................................................28 Table of Contents |    © TBR Economics  PN00806R  4.4.6 Sustainability ..........................................................................................28 4.4.7 RECOMMENDATION: Designing Demand ...................................................29 5. A REGIONAL HUB OF THE NATIONAL DESIGN CENTRE (NDC) ......30 5.1 EXISTING INITIATIVES IN THE UK AND BEYOND ...........................................30 5.1.1 The Lighthouse (Glasgow)........................................................................31 5.1.2 Design of the Times (DOTT 07) ................................................................31 5.1.3 The Design Centre for the North...............................................................32 5.1.4 NDC in London: The HUB.........................................................................32 5.1.5 International ‘Design Centres’...................................................................33 5.2 ISSUES WITH A PHYSICAL ENTITY..............................................................35 5.2.1 Length and Cost of Investment and Long Run Impact ................................35 5.2.2 Understanding Demand ...........................................................................36 5.2.3 Region Size and Population distribution .....................................................36 5.2.4 Existing infrastructure..............................................................................36 5.2.5 Nascent Hub ...........................................................................................37 5.3 ISSUES WITH VIRTUAL............................................................................37 5.3.1 Confusion with Existing Initiatives.............................................................37 5.3.2 RECOMMENDATION: The National Design Centre.......................................37 6. CONCLUSIONS................................................................................38 6.1 THE STRATEGIC IMPORTANCE OF DESIGN ...................................................38 6.2 DESIGN AND THE REGIONAL INNOVATION STRATEGY .....................................38 6.3 THE COX RECOMMENDATIONS..................................................................39 6.3.1 Designing Demand ..................................................................................39 6.3.2 Regional Hub of the National Design Centre...............................................40 6.4 SUMMARY OF KEY RECOMMENDATIONS.......................................................40 TABLE OF FIGURES Figure 1 UK Balance of Trade in Goods and Services ........................................................5 Figure 2 The Application of Design ...............................................................................10 Figure 3 Outsourcing of Design ....................................................................................10 Figure 4 The Designing Demand Programme.................................................................19 Figure 5 Risks/Opportunities Associated with IBBD and DD.............................................24 Figure 6 Korean Design Centre.....................................................................................33 Figure 7 Taiwan Design Centre in Nangang Software Park ..............................................34 Figure 8 Fusionopolis...................................................................................................35   Executive Summary | 1   © TBR Economics  PN00806R  Executive Summary Innovation is identified as one of ten strategic priorities in the Regional Economic Strategy for the East Midlands. However, current innovation performance does not meet its potential in the Region.   A number of recent studies have emphasised the importance of design as an enabler of innovation. Accordingly, the East Midlands Development Agency (emda) commissioned TBR Economics to present a view on whether design should be a strategic innovation priority for the Region’s economy, and if so how.    TBR undertook desk research and consultation with local stakeholders to discuss the role of design as part of the innovation agenda in the Region. A key finding of this research was that the East Midlands has a very strong design industry and that businesses in the Region use design to a much greater extent than in most other regions.  With regards to how design might be applied, TBR Economics reviewed the Regional Innovation Strategy for the East Midlands, and two of the recommendations made in the Cox Review of Creativity in Business (the Designing Demand programme, and the National Design Centre network).   The Regional Innovation Strategy for the East Midlands identifies a number of priority areas for intervention and this report examines how these can be used to promote the strategic use of design. In particular, the establishment of iNets will provide opportunities for, and disseminate the benefits of design as an enabler of innovation. Guidance is given on how interventions should be targeted, emphasising the opportunities to work with SMEs and priority sectors in the Region.  On reviewing the Designing Demand programme, it is recommended that emda should consider implementing this within the Region. However, before any such decision is made, a number of key issues should be considered to determine the appropriateness for the East Midlands. In particular;  • emda should investigate the ease with which the programme can be integrated with existing initiatives, such as Improving Business by Design. • Due consideration needs to be given to the long-term sustainability of the programme.  Specifically, the scale and length of emda’s commitment (e.g. funding and expertise) has yet to be established. • It is important to maintain the current momentum in design and implementation of the DD programme would need to be managed with the utmost sensitivity to avoid adversely impacting this momentum. • An outstanding question is the extent to which the East Midlands region can supply the level of skill and expertise required to drive the success of the DD programme. • There are potential challenges for marketing the Design Council brand in the Region.     In relation to establishing a regional hub of the National Design Centre, it is recommended that this initiative should not be actively pursued at present.  It is the consultants’ view that it is not a step that, at this current juncture, is necessary to meet the needs of the East Midlands economy. However, as economic conditions change and, perhaps, positive advancement is made through the Regional Innovation Strategy and, perhaps the Designing Demand programme, it is possible such a scheme may become more relevant.  It is recommended, therefore, that emda closely monitors the progress of other regions trialling this programme, Executive Summary | 2   © TBR Economics  PN00806R  as well as progress in its own initiatives in order to review this recommendation. A number of key considerations are highlighted as to the areas that should be monitored, including:   • The scale of investment required. • The most appropriate location of a physical asset that must to serve its ‘audience’ effectively • The consequent economic benefits to the participating region.  • The type of companies that benefit and engage with these initiatives.  In summary, the report outlines a series of key recommendations as to how design can be adopted as a strategic priority within the East Midlands and highlights a number of important considerations to guide future action. These include:  • Marketing design as the link between creativity and innovation. • Making design a strategic innovation priority by exploiting regional strengths. • Augmenting the Community Innovation Survey. • Embedding design into the Region’s support services. • Commissioning a Rapid Prototyping Audit to understand the current capability in the Region.  • Establishing design as a Key Performance Indicator. • Targeting intervention on SMEs with the desire, potential, and ability to grow as well as priority sectors.     Introduction and Background | 3   © TBR Economics  PN00806R  1. Introduction and Background TBR Economics has been commissioned by the East Midlands Development Agency (emda), to undertake research to identify whether and how design can be sustained as a strategic innovation priority in the East Midlands.  The aim of emda is for the East Midlands to become a dynamic economy founded upon innovative and knowledge focussed businesses competing successfully in the global economy.  Emda wishes to build on the Region’s strengths and the purpose of this report is to examine the feasibility of whether and how design can be sustained as a strategic innovation priority.  1.1 Context The consultation document for the revised Regional Economic Strategy (RES) for the East Midlands identified innovation as one of 10 strategic priorities. However, current innovation performance does not meet its potential.  Specifically, there is evidence that business investment in R&D is concentrated in a small number of R&D intensive companies whilst many companies undertake very little or no R&D; expenditure on R&D from government and higher education in the Region is below average, turnover attributed to new or improved products is significantly below average, productivity is generally below average and the number of graduate level employees is below average.1  In order to combat this, emda believe it is necessary to2: • Encourage and build mechanisms to actively bring together the science and industry base with the aim to increase the rate and level of innovation across the Region. • Stimulate and support businesses, particularly SMEs, to advance the adoption of innovation with the aim to drive improved productivity and competitiveness • Foster the development of a supportive innovation environment with the aim of building an integrated network of innovative organisations and individuals and where innovation success is recognised and celebrated  • Ensure that creativity and design play an important role alongside science and technology in product and process innovation.  1.2 Report Structure This report is structured into 5 sections as follows:  1. Section 1 looks at design in the broader context, and gives some background into its role in the East Midlands by drawing on previous research. 2. Section 2 discusses the Design Council’s Designing Demand (DD) programme and the implications for implementing this programme in the East Midlands. 3. Section 3 discusses the Cox Review’s recommendation for a Nation Design Centre (NDC) and looks at a number of international examples; and the issues associated with an East Midlands NDC are discussed. 4. Section 4 looks at a number of additional recommendations for emda that fall out of the discussion and the findings of our research. 5. Section 5 brings together and presents all recommendations in a coherent table. 1.3 Creativity, Innovation and Design The definitions of creativity, innovation and design vary in the literature, and much time and effort goes into identifying what each means, how it is interrelated, or dependent upon the others.  The definitions adopted in this report are as proposed by the Cox Review3:                                                 1 Department of Trade And Industry, Community Innovation Survey (CIS) 2 From the Invitation to tender 3 Cox Review: http://www.hm-treasury.gov.uk/independent_reviews/cox_review/coxreview_index.cfm Introduction and Background | 4   © TBR Economics  PN00806R  • ‘Creativity’ is the generation of new ideas – either new ways of looking at existing problems, or of seeing new opportunities, perhaps by exploiting emerging technologies or changes in markets. • ‘Innovation’ is the successful exploitation of new ideas. It is the process that carries them through to new products, new services, new ways of running the business or even new ways of doing business. • ‘Design’ is what links creativity and innovation. It shapes ideas to become practical and attractive propositions for users or customers. Design may be described as creativity deployed to a specific end.  Accordingly, design can help transform diverse inputs, such as scientific knowledge or new technology. 1.3.1 RECOMMENDATION: Creativity, Innovation and Design   Consideration should be given to ‘marketing’ the fact that ‘creativity’, ‘innovation’ and ‘design’ are all crucial, interrelated elements, which should not be considered in isolation of each other. In other words, design is an enable of innovation.  1.4 UK Competitiveness and the Balance of Trade: A Larger Perspective The UK faces an accelerating decline in its balance of trade (difference between exports and imports).  Figure 1 shows the nature of this decline and identifies that it is due to the decline in the balance of trade in Goods (as opposed to services).  Specifically, the UK imports far more Goods than it exports.  The overall unevenness in the balance of trade is remediated slightly by the steady growth of net trade in services (the UK is a net exporter).  Looking at this picture might lead one to predict that these trends will continue; that the UK will export fewer and fewer Goods and become more reliant on imports.  A great deal has been spoken about the decline of manufacturing and this has led many to the opinion that UK will inevitably lose its manufacturing base and become a service-based economy.  Whether this is a result of giving up on a UK manufacturing future, an opinion that the importance of UK manufacturing is negligible, or the preference for a service-based economy; this ignores several important facts:  • Total output of manufacturing is increasing, but its share of total UK output is decreasing. Nevertheless, at least some segments are proving resilient. • The loss of UK manufacturing will deprive the service economy (which services manufacturing amongst others) of the symbiotic relationship that exists between the co-location of designers and manufacturers.  This may have negative impacts on the service industries. • Manufacturing and services are similar in that they both face competitive threats, and there is no reason to expect that service industries won’t face the same challenges that manufacturers currently face.            Introduction and Background | 5   © TBR Economics  PN00806R  Figure 1 UK Balance of Trade in Goods and Services  20051948197719962001198819911961-£70,000-£60,000-£50,000-£40,000-£30,000-£20,000-£10,000£0£10,000£20,000£30,000Source: Office of National Statistics 2005 ref(W1/C1)GoodsServicesTotalThe Strategic Importance of Design | 6   © TBR Economics  PN00806R  2. The Strategic Importance of Design The concept of innovation has expanded in recent years to encompass more than just the generation and use of new technology. While R&D has traditionally been the focus of policy initiatives, there is now an increased recognition of the importance of design and creativity in driving innovation, increasing productivity, and improving business performance. For example, the DTI Innovation Report4 asserts that design skills are vital to business innovation and can enhance a company’s performance.   There are two recent major studies that consider the importance that design and creativity have in the modern UK economy. The first is the DTI Economics paper on Creativity, Design and Business Performance.5  The second is the Cox Review of creativity in business, which was run in parallel to the DTI study. The Cox Review focuses on the increasing competitive threat to UK business from developing countries (e.g. China, Russia, Brazil, India); and highlights the fact that not only does UK manufacturing face this ongoing threat, but that there is no reason to think that service industries will not be affected as well.  Clearly, the threat to Manufacturing is not new, and the “decline of manufacturing” is in danger of becoming a cliché.  But the threat to services is less appreciated.  These perspectives are mirrored in Figure 1, which clearly shows that the ability of the UK to export its manufacturing has continued to decrease (evidenced by the balance of trade in Goods) but the increase in net trade of services masks the threat that Cox speaks of.  Cox goes on to say that the capacity to meet this threat, and to exploit the new demand created by rapidly expanding economies, will be contingent upon UK firms’ ability to create innovative, high quality, high value added products and bring these quickly and effectively to market.  Cox lays out 5 recommendations in order to confront these and other issues:   1. Tackle the issue of awareness and understanding, advocating procurement in the Designing Demand programme, which has been developed and piloted by the Design Council over the last four years, and making it widely available to SMEs throughout the UK and those that work with them. 2. Raise the profile of the UK’s creative capabilities by way of a network of centres of creativity and innovation across the UK, with a national hub in London. 3. Improve the effectiveness of government support and incentive schemes, prominent among which is the Research and Development (R&D) Tax Credits system. 4. Tackle the issue, in higher education, of broadening the understanding and skills of tomorrow’s business leaders, creative specialists, engineers and technologists. 5. Take steps to use the massive power of public procurement, both centrally and locally, to encourage more imaginative solutions from suppliers.  For the purposes and remit of this report, particular attention is paid to the first two recommendations.  Whilst the Cox Review looks at specific recommendations that focus on how to harness the power of design and creativity, the DTI’s paper looks at how design and creativity impact on business performance more generally.  It sets out the current state of knowledge on the economics of creativity and design. It identifies that the ability to generate a diverse set of                                                4 DTI Innovation Report: Competing in the global economy – the innovation challenge, 2003, http://www.dti.gov.uk/files/file12093.pdf 5  DTI Economics Paper No. 15: www.dti.gov.uk/economics/economics_paper15.pdf    The Strategic Importance of Design | 7   © TBR Economics  PN00806R  business options through new ideas is a central feature of innovation in all firms and is therefore critical to sustained economic growth.  The DTI report asserts that design:  • Enhances product and service quality by altering or adding characteristics and the performance of products and services • Differentiates products and services because design creates diversity • Enhances company image by influencing brand image/loyalty and perception of quality • Lowers production costs by impacting on component configuration and increasing reliability.  So whilst we know design can be a key strategic driver of productivity and business performance it is difficult to prove because estimating its impact is difficult.  “There are various challenges to estimating the impact of design on firm performance. Establishing the direction of causality between design and firm performance is important. Finding that high performing firms spend more on design does not necessarily prove that design activities lead to success – it may simply be that higher performing firms can afford to spend more on activities related to design. Many factors other than design influence firm performance (for example competitive conditions, investment in capital). In order to obtain an unbiased estimate of the impact of design, the effects from design need to be separated out from these other factors.”  DTI no. 15, pg 29  Strategic issue  1: A large amount of research has recently been undertaken which examines the links between design, innovation and business performance.  Specifically, the Cox Review and the DTI Economics Paper no. 15 stress the value of design as a tool to improve business performance both directly, and indirectly by increasing innovation. Whilst it is clear that design can be a key strategic driver of productivity and business performance it is difficult to prove because estimating its impact is difficult.  Nevertheless, both the Cox Review and the DTI recommend it as a crucial element for the success of UK enterprise.          Design and Innovation in the East Midlands | 8   © TBR Economics  PN00806R  3. Design and Innovation in the East Midlands The East Midlands Regional Economic Strategy identifies innovation as a regional strategic priority and identifies the related aim of becoming “a Region of highly productive, globally competitive businesses.”6 This is echoed in the Regional Innovation Strategy (RIS) and Action Plan for the East Midlands which identifies that for “business to prosper in the future they will need to adopt innovation as a core driver of competitiveness.”  The implication of these statements is that innovation is important both for the Region’s economic development, and to maintain a competitive and productive economy that can compete not just with other UK businesses, but also in the international economy. 3.1 Innovation in The East Midlands  Innovation performance in the East Midlands is mixed.  Whilst Business Enterprise Research and Development (BERD) is high compared to the national average, it is relatively low in the government and higher education sectors.  Furthermore, despite the high levels of expenditure on R&D in the East Midlands, this is not always translated into successful market outcomes.  Specifically, only 4% of turnover can be attributed to new or improved products.7  Whilst this may not take account of the industrial complexion of the East Midlands (i.e. relatively fewer final producers), there is a clear need to improve the effective commercialisation of R&D in the Region.   Innovation (i.e. the successful exploitation of new ideas), has the potential to increase the productivity and competitiveness of enterprise, and thus is a crucial component of any Region’s economic development.  Furthermore, it is key element of the East Midland’s Regional Economic strategy. 3.2 RECOMMENDATION: Augmenting the Community Innovation Survey (CIS) The CIS found that East Midlands businesses have a poor innovation record.  We assume that this is a regional result from the survey and as such it is insufficiently detailed for emda to take strategic decisions.    Ideally, emda would wish to know the sectors affected – preferably to 4/5 digit SIC – to link the result to the regional economic strategy. According to our understanding, CIS results were not available commercially, so it would not be possible for a consultant to consider them.  (This may not apply to academic bodies).    Nevertheless, it would be possible to replicate CIS to deliver the information that emda needs, and we recommend that this happen, because it would enable the more accurate targeting of programmes such as DD, or IBBD and therefore the delivery of greater impact.  Furthermore, it would enable emda to establish key metrics for design in the Region and facilitate the establishment of design as a KPI.                                                   6 East Midlands Regional Economic Strategy http://www.emda.org.uk/res/ 7 East Midlands Regional Economic Strategy, page 20. Design and Innovation in the East Midlands | 9   © TBR Economics  PN00806R  3.2.1 The East Midlands Design Industry Research into the creative industries in the East Midlands by Comedia8 in 2003 found evidence of a relatively large and vibrant design industry concentrated in Leicester Shire9; a subsequent in depth investigation of the design industry in Leicester Shire by TBR Economics in 2005 found that the East Midlands has one of the strongest design concentrations outside of London.10    The 2005 TBR report revealed a number of interesting features of the industry. Specifically, it found that:  • The East Midlands design concentration is located primarily in Leicester Shire • The East Midlands as a whole does not have a significant design industry compared to the rest of the UK • The design industry in Leicester Shire is comprised of a large number of small diverse businesses • The design industry in Leicester Shire exhibits higher productivity than the rest of the Region’s economy as a whole • The majority of the East Midland’s design industry’s demand is from outside the Region and there is a strong international demand too • There are a number of barriers to growth such as location, access to skills and cash-flow issues, industry fragmentation and a general lack of knowledge of the local design industry and its skills across the wider economy.   3.2.2 The Use of Design According to the most recent survey undertaken by the Design Council into the use of design by UK businesses, the East Midlands recognises the value of design more than any other Region in the UK.11  Almost 30% of East Midlands businesses believe design is crucial to their bottom-line success compared to the UK average of 15%.  In the past three years 43% of  East Midlands businesses have increased their investment in design and whilst a third (33%) still don’t invest in design at all, this is still below the UK average (42%).  Survey research undertaken by WM enterprise on behalf of TBR Economics reveals similar attitudes towards design by the Region’s businesses. For example, 52% of businesses use design to develop new products, 38% use design to develop new services and 37% to design new processes (See Figure 2 below).                                                            8 The Creative Industries In The East Midlands, COMEDIA 2003.  For the full report please visit http://www.emda.org.uk/documents/cimappingfull.pdf 9 This term was given to the aggregation of Rutland the Leicestershire County (including Leicester). 10 Maximising the Potential of the Leicester Shire Design Industry TBR Economics 2005. 11 Design Council (2006) Design in Britain 2005 – 06. http://www.designfactfinder.co.uk/ Design and Innovation in the East Midlands | 10  © TBR Economics  PN00806R  Figure 2 The Application of Design                   Source: WM Enterprise 2006; TBR ref(W2/C8)  Figure 3 shows the tendency for companies to deploy design using external delivery.  For example, almost 30% of businesses using design to develop new products employ external design consultants for the task.  Businesses developing new processes were least likely to use external designers whilst businesses developing new components were the most likely to hire an outside consultant.   So not only do the Region’s businesses use design to a greater degree than other region, but also almost a third (27%) use external designers.  This is very similar to the estimate for the East Midlands in the Design Council’s survey, which shows that 28% of companies hire external design consultants.  Given that the national average is 19%, there is clearly above average demand for the services of design consultants in the East Midlands.   Figure 3 Outsourcing of Design                  Source: WM Enterprise 2006; TBR ref(W2/C9)   0%10%20%30%40%50%60%new products new services new processes new marketingmaterialnew packaging new components0%5%10%15%20%25%30%35%40%new products new services new processes new marketingmaterialnew packaging new componentsDesign and Innovation in the East Midlands | 11  © TBR Economics  PN00806R  Strategic issue  2: The use of design by businesses in the East Midlands is high relative to the national average.  This is born out in higher demand for external design consultancy as well as a greater use of design internally (i.e. embedded design).  This lends support for the justification of design as a strategic innovation priority in the Region. 3.2.3 Initiatives  There are an abundance of design related initiatives throughout the East Midlands.  These include:  • Design Factory – Linking Designers and Manufacturers • Improving Business by Design – Helps Companies with product development • Design Forum • HEI initiatives   There is a large amount of diverse activity within the Region’s Higher Education establishments.  During the course of our research we spoke to stakeholders in12:  • DeMontfort University • Loughborough University • Derby University • University of Northampton  • Lincoln University  Whilst our purpose is not to map its entirety within this report, our research has revealed an abundance of design related activity taking place within HEIs in the Region.  Some examples of the type of activity currently taking place include student Placements, DTI Knowledge Transfer Partnerships (KTPS), innovation centres, special research institutes (e.g. Rapid Manufacturing, Ergonomics, Construction), business development initiatives that include: incubation units, shared resources, links to university expertise, beneficial rental agreements and so on.  However, some types of activity are underrepresented, specifically:  • Value adding interaction between SMEs and Universities, which is due to a lack of incentives and resources on HEI’s part, and a lack of time and resources on the SME’s part. • Proactive exploration by Universities of new synergies due to lack of incentives and resources.  Often Universities have business development opportunities, but these are outside their immediate remit.13 • Linked up activity.  The opportunities for more collaboration exist, but exploiting them is difficult due in part to the issues stated above, but also because bringing universities together is a very difficult task. 3.3 Design as Regional Strategic Priority Whilst the justification for using design as a key strategic driver of innovation may be obvious at a national level, variations across regional economies are likely to raise issues that make an unequivocal stance towards the role of design as a strategic priority untenable.  It is clear that the Region exhibits strength in design (evidenced by a large number of design consultancies and a greater appreciation/usage of design by the Region’s businesses compared to the UK), and the main issue is whether (and how) design should be a strategic priority in the East Midlands.                                                  12 Stakeholder included people in business development as well as academic departments. Unfortunately, our attempts to speak with Nottingham Trent University were unsuccessful despite interest on both sides. 13 This was highlighted in our consultation with Universities Design and Innovation in the East Midlands | 12  © TBR Economics  PN00806R   The literature from the DTI and Sir George Cox lay out strong theoretical arguments for the use of design in this way, however there are a number of practical issues which need to be considered as well. 3.3.1 Strategic issues for Businesses • Intellectual Property Rights issues are an ongoing concern for design consultancies. Designers of new products face a universal difficulty in remunerating and protecting their design investment.  There are a number of issues such as how a design is valued (e.g. when it goes into the development of what becomes a successful, profitable product or service), or how copyrights are protected and enforced.          • Collaboration and synergy between Higher Education Institutions and SMES.  There is another ongoing difficulty of exploiting the potential synergy from the collaboration of SMEs and the Region’s HEIs.  This stems in part from the perennial difficulty of engaging SME’s. These businesses are often time-poor and may realise the importance of design as a driver of innovation but lack the time to develop it in their business.  • Linking design supply and demand (i.e. challenge developing supply chains).  Whilst the Region’s businesses appreciate design to a greater extent than the UK average, the ability for companies to hire external consultants to fulfil their design requirements depends on a number of issues.  For example, having an awareness of and access to the design consultancies in the Region and the ability to communicate quickly, effectively, and profitably with them is crucial for the effective use of design as a driver of innovation.   • Promoting and sustaining the use of design internally.  For design to be an effective strategic tool, it must be sustainable.   For example, it must be embedded within the psyche of the Region’s businesses as part of a systematic approach to enterprise. Whilst theoretically investing in design appears to be a formula for successful innovation, the opportunity cost of this investment must be accounted for alongside alternative approaches. • The strength of East Midland’s design industry is Leicestershire based.  In other words, the other counties are weaker and when this is taken into account the overall strength of the East Midlands compared to the rest of the UK is not as significant. 3.3.2 Strategic issues for HEIs • In regards to collaboration and synergy between Higher Education Institutions and SMES, the incentives are lacking for HEI involvement.  Specifically, whilst opportunities may exist, HEIs often do not have time or funds to invest in developing relationships with SMEs even though they would be beneficial for the regional economy.  • Many of thr Region’s HEIs have a very strong design presence and these tend to complement one another.  Any strategic use of design must take account of these strengths and synergies and must exploit them where possible. 3.3.3 Strategic Issues for East Midlands Business Support • Many businesses feel that there are too many initiatives and many lack effectiveness.  Thus the strategic use of design must avoid creating more confusion. • Any decision to implement new design programmes in the Region must take account of existing initiatives and ensure that the effectiveness of these is not compromised unless absolutely necessary. 3.3.4 RECOMMENDATION: Design as a Strategic Innovation Priority Given the potential value of design as a driver of innovation, the considerable momentum that design currently has in the Region, greater use of design by regional businesses, and the presence of a strong design industry; emda should make design a strategic innovation priority. Design and Innovation in the East Midlands | 13  © TBR Economics  PN00806R  3.4 Links to the Regional Innovation Strategy and Action Plan The Regional Innovation Strategy for the East Midlands identifies four interconnected strategic themes on which to base future action:  • Knowledge exchange. • Innovation support for business. • Creating the environment for innovation. • Fostering enabling and emerging technologies.  The intention of these themes is to consolidate the number of innovation initiatives supported by emda and establish priority areas for intervention. In accordance with this, the following four sections consider opportunities to promote the strategic use of design in the East Midlands in relation to the initiatives outlined in the RIS.  3.4.1 Knowledge Exchange Through proactive targeting of appropriate tools and mechanisms it is possible to increase the number and quality of knowledge exchange interactions between the Region’s businesses and further and higher education institutions. The RIS identifies that this will be achieved by business-focused iNets that bring together stakeholders around particular technology areas or industry sectors.  These networks offer the opportunity to leverage and broker design capabilities within the Region. This will facilitate the provision of specialist help and skills and lead to the establishment of new partnerships. One such example is the potential to overcome the acknowledged difficulty of engaging SMEs with Universities.  The iNets will also enable wide dissemination of positive experiences and best practice to promote confidence and belief in the value that can be derived from design. This can be related to the assertion of the Cox Review that SMEs are strongly influenced by the experience of other companies in the same locality, particularly those with which they have business links.   Combining organisations from different stages in supply chains offers potential for exciting innovation from closer involvement of suppliers and customers. The potential for cross-fertilisation of ideas and opportunities between industrial sectors should also be explored. 3.4.1.1 RECOMMENDATION: Leveraging Potential Synergies Between SMEs and HEIs In our discussions with HEIs (and design SMEs in TBR’s earlier work for emda) it became clear that both groups had a desire to interact with the other, but there was a lack of clarity about what could be achieved, and how it could be achieved.  Thus when considering design as a strategic tool, it is crucial that the clear understanding of the design expertise housed in the Region be identified to a sufficient degree of detail such that opportunities for leveraging synergies can be identified and possibly exploited.  TBR’s work has analysed the Region’s capacity in Leicester Shire, in terms of design businesses, HEIs, and local government initiatives and this will aid significantly in this process. 3.4.2 Innovation Support for Business The RIS identifies that specialist innovation support will be offered to business by the iNets, which will also clearly signpost more general support offered by Business Link. Such support will play a vital role in improving the productivity and competitiveness of SMEs.  The Cox Review identifies that key barriers for smaller companies are a lack of time and the high cost of innovation for smaller companies. It is possible that these barriers are merely perceived, whereby businesses believe neither the time nor the cost to be justified. In this Design and Innovation in the East Midlands | 14  © TBR Economics  PN00806R  instance the objective of any intervention should be to help businesses understand how design can be used to improve performance. However, where these barriers are real, innovation support should be concerned with helping businesses access the necessary funding and expertise.  A related area is to ensure that appropriately skilled and qualified individuals are trained. Consideration of this should not just address current needs, but also the future requirements for design specialists and design-aware business leaders. 3.4.2.1 RECOMMENDATION: Embed Design into the Region’s Support Services  Emda should look to embed design within its support services wherever the underlying objectives include raising levels of innovation within the Region’s businesses.    Enabling businesses to exploit the design expertise available in the Region is a crucial to using design as a driver of innovation; of equal importance is instilling the importance of design as a tool within the Region’s businesses.  Every opportunity to ‘sell’ design to companies should be exploited by using the East Midland business support network to embed its importance in driving innovation.  A further advantage to this approach is that it is sustainable in that the delivery infrastructure already exists.  A further important consideration is that any such provision is branded consistently and in a clear and simple way. 3.4.3 Creating the Environment for Innovation An environment for innovation is concerned with establishing an integrated network of facilities, organisations and individuals where innovation success is recognised and celebrated. The RIS identifies that a key enabler of this aspiration is the Regional Innovation Portal on the Innovation East Midlands website. It is intended that this become a focal point to promote inward investment and facilitate cross-iNet collaboration. The portal is a way of clearly communicating the importance of innovation to individuals.  It is clear that the portal can also be used to promote the Region’s design strengths and encourage more strategic use of design. In addition to raising awareness of the benefits and opportunities associated with design, this could also play an important role in building ambition and confidence among businesses and individuals.  In relation to the physical infrastructure for the Region, a distinct objective should be to create an atmosphere in which ideas and creativity can thrive. This not only requires the provision of appropriate facilities and training, but also the brokerage of opportunities through iNets and cross-network collaboration.  There are a number of tools and methods, which can be used to create an environment for   innovation; one of these is Rapid Prototyping (RP).  This is method is focused on product innovation and is crucial in transforming a 2 dimensional concept into a finished product.  The Region has a considerable, but fragmented RP capability. 3.4.3.1 RECOMMENDATION: Rapid Prototyping The Manufacturing and Engineering Centre at Cardiff (MEC) has identified the relationship of rapid prototyping to design and manufacture.  Specifically, rapid prototyping can be valuable tool in the creation of new products, and thus has applications in numerous industries. We understand that there is significant rapid prototyping capacity in the Region but it is spread out and there is no single repository of what exists. At the same time, we know from other work we have done, that rapid prototyping technologies are complex and there are many of them. Design and Innovation in the East Midlands | 15  © TBR Economics  PN00806R   We recommend that emda commission a Rapid Prototyping Audit to understand the current capability in the Region (and in neighbouring region as boundaries are arbitrary).   A. This would highlight the resource’s strengths, weaknesses, opportunities and gaps in the Region.  Rapid prototyping is a crucial tool in most product development processes and the current infrastructure is a potential asset to the Region.  B. Currently this resource is not being used to its full potential.  There are many RP technologies and it is doubtful that all are represented in the Region.  We suggest building on the expertise of MEC and the MTA14. 3.4.4 Fostering and Enabling Emerging Technologies The East Midlands has acknowledged research and industry strengths. A key objective of the RIS is to recognise and develop these strengths and prioritise investments related to the future prosperity of the Region.   Design has significant potential to add value to this process and will be crucial in responding to changing market needs and emerging technological opportunities. For example, the DTI Innovation report identifies that design can facilitate technology transfer yet is rarely used in this manner. This was investigated by a Design Council project with University College London Ventures, which demonstrated the added benefits that design can bring in enabling technology transfer from Universities to industry. These benefits included: speeding up the process of commercialisation, communicating credibility to potential investors and partners, and visualising future applications of products which enabled the retention of a higher degree of IP.  There are also opportunities to use to design to develop better goods and services. In addition to improving functionality and aesthetics, there is also potential to used design to meet the goals of sustainable living and energy conservation. 3.4.4.1 RECOMMENDATION: Design as a Key Performance Indicator (KPI) Noting that the iNets will work closely with their stakeholders to develop and implement criteria for selecting and prioritising emerging technologies for support, and given the importance that Cox places on the role of design in this process (linking creativity to innovation), the iNets should find a way to establish design as a Key Performance Indicator.  This should include measuring the use of design both internally and externally by businesses and should be developed to allow sufficiently detailed analysis including the types of design used and purpose, the type of businesses using design, and tracking the use of design to changes in performance.     3.5 Targeting Intervention The Community Innovation Survey identifies that larger firms are more likely to spend on innovative activities than smaller firms. Accordingly, the fact that over 90% of the Region’s businesses are SMEs may explain the fact that many companies undertake little or no R&D.                                                  14 The Manufacturing Technologies Association is the pre-eminent trade association representing the machine tool and manufacturing technologies industry in the UK and retains a wealth of expertise on the subject.  The MTA represents companies who manufacture or import products in the machine tool, equipment and manufacturing technologies sector. The MTA promotes the interests of its members in home and overseas markets and also owns and organises the UK’s premier machine tool and manufacturing technology exhibition, MACH.  Perhaps more importantly, the MTA retains very strong links to its business networks and acts as a gateway to them.  The possibility exists of suppliers being prepared to ‘donate’ tooling and there is considerable evidence that this is possible particularly where there might be a university link.  The MTA has a strong international focus and therefore understands a number of the competitive issues facing UK manufacturing. Design and Innovation in the East Midlands | 16  © TBR Economics  PN00806R  The Cox Review emphasises the potential benefits associated with encouraging innovation in SMEs and stresses that these businesses should be reached at a local level. Cox notes that many previous efforts have focused on encouraging start-ups and University spin-outs, and that while these are undoubtedly essential for economic success, they are not sufficient. “What an ‘enterprise economy’ requires is not so much more SMEs, but more SMEs that don’t want to remain SMEs” (Cox Review, pg 12). This emphasises the need to target organisations with the ambition and potential for growth.  In designing an intervention, it is important to recognise that perspectives vary between sectors on the relative importance of design. For example Tether15 shows 41% of manufacturers see design as integral to their business compared to only 6% in trade and leisure.   There is significant potential to promote design in the sectors identified in the RES as having the greatest potential to contribute to the East Midland’s economy (transport equipment, construction, food and drink and healthcare). In particular, the Community Innovation Survey identified the manufacture of transport equipment as being the industry sector that invests the highest percentage of innovation expenditure in design. Furthermore, the DTI Economics paper identifies that manufacturing accounts for two thirds of reported design spending. Therefore, given that the Region has strong manufacturing base, which accounts for almost 23% of regional GDP, it would appear that there is significant potential to encourage the use of design as a means to innovation.  It is also important to recognise that outside of these priority sectors there is likely to be a number of solidly managed but low-growth companies that could be transformed with an injection of creativity and design.  In terms of geography, it is important to ensure that there is sufficient provision across the Region and that interventions are co-ordinated to avoid confusion and give maximum return on investment. This coordination can be achieved through close working with organisations that have a detailed understanding of local needs and opportunities, such as Sub Regional Strategic Partnerships, local authorities and universities.  In addition to boosting firm competitiveness, there is also scope for creativity and design to generate wider societal gains. For example, consumers can benefit from a greater variety and improved products and services. Furthermore, design can also be used to limit the environmental impact of production by reducing material use and energy consumption. Accordingly, when evaluating any potential intervention it is important to assess the value derived in this wider context.   3.5.1 RECOMMENDATION: Targeting Intervention Emda should consider how it targets interventions with regards to design.  Specifically, when targeting activity emda should:  • Focus on its priority sectors because there is significant potential to encourage the use of design as a means to innovation AND these sectors have established themselves in the Region.   • Understand how the appreciation of design, ability to harness design effectively, increase innovation and optimise ROI, differs between sectors.  This will enable opportunities to be ranked and prioritised.                                                15 Tether, B.S. (2005) The Role of Design in Business Performance (http://www.dti.gov.uk/files/file14796.pdf) Design and Innovation in the East Midlands | 17  © TBR Economics  PN00806R  • Differentiate between SMEs that have a desire and potential to grow and those that don’t and place a higher priority on these types of SMEs instead of focussing efforts primarily on encouraging start-ups and University spin-outs. • Identify and understand interventions where beneficial externalities may exist with regards to additional/wider impacts (e.g. social, environmental) • Ensure sufficient provision across the Region whilst avoiding confusion. This is most likely to be achieved by dovetailing with existing infrastructure. The Practical Application of Design | 18  © TBR Economics  PN00806R  4. The Practical Application of Design Design is crucial to innovation, and whilst emda should look to integrate design into the RIS, there are a number of issues with regards to how this is done.  Emda have shown interest in two of the Cox recommendations as practical, specific, applications of design.   The first two Cox recommendations (mentioned in section 2 and repeated below for convenience) have arisen from the examination of a number of key strategic issues that relate to the application of design as a driver of innovation and business performance in the UK.  The recommendations are for the Region to:   1. Tackle the issue of awareness and understanding, through the Designing Demand programme, which has been developed and piloted by the Design Council over the last four years, and making it widely available to SMEs throughout the UK and those that work with them 2. Raise the profile of the UK’s creative capabilities by way of a network of centres of creativity and innovation across the UK, with a national hub in London.   In the following sections we examine these two recommendations within the specific context of the East Midlands and explore some of the key issues that emda needs to consider if and when implementing Designing Demand and National Design Centre. In addition, we make a number of recommendations with regards to the how these initiatives should be approached now, and in the future.   4.1 The Cox Recommendations  In this section and the next, two of the Cox Review’s recommendations are discussed in the context of the East Midlands.  Specifically, the merits of each are discussed along with the potential risks and disadvantages associated with implementing each within the Region.  4.2 The Designing Demand Programme The objective of the Designing Demand (DD) programme is to improve business performance through the strategic and effective use of design, and instil processes for ongoing, systemic economic development. DD helps businesses take concepts from idea to commercial success, create products that connect with customers, manage design effectively, meet competitive challenges, and establish a culture of innovation.  Investment in the programme will provide:  • Products/services to raise understanding of how design can drive business growth • Quality Assurance from the Design Council, which includes skilled experts, and a framework to build regional capacity (i.e. facilitators and mentors).   SME’s interested in using design can be matched with design firms in order to help them develop services/products.  Examples might be the re-branding of a company, or developing new and improved versions of existing products based upon market research.  The key point is that the use of design, in its plethora of different applications, can improve business performance by driving innovation and productivity.    The 6 phases/steps of the programme are laid out in Figure 4 below: The Practical Application of Design | 19  © TBR Economics  PN00806R  Figure 4 The Designing Demand Programme16                                                                     16 This diagram has been created by compiling information from discussions with other RDAs, discussions with the Design Council, and other promotional material for the DD programme. The Design Council undertakes a Design Audit to determine the supply and demand for design in the region AWARENESSRDA commissions a company to market and advertise the programme.  Branded by the Design Council, the RDA and delivery partners.  Design Council recommends no less than 5% of project budget spent on this phase.RDA and business intermediaries use their business networks to encourage sign-upSIGNUPCompanies register an interest in the program and provide basic information to the Design Council.Companies' information is used to channel them into an appropriate an kickstart workshopUNDERSTANDThis phase includes the \"Kick-start\" workshops for businesses as well as 1 day workshops for designers and business intermediaries.  It serves as a practical introduction to design and the programme.  Companies are assessed on their suitability for the core programme, those not continuing are encouraged to maintain contact. COMMITThis phase acts as a filter; businesses consult with mentors and designers to determine whether they will undertake the core programme.Companies undertake the programme and their progress trackedIMPLEMENTBusinesses either enter the Accelerate, Innovate, or Immersion programme.Managers encouraged to be promoters of the programme.  Lessons learned from each stage are fed back. ALUMNIAfter completing the programme businesses are encouraged to maintain contact and establish networks.  Some businesses become champions of the prgramme and help to market it to potential future usersThe Practical Application of Design | 20  © TBR Economics  PN00806R  4.2.1 The role of the RDA If emda implemented DD, it would be jointly responsible for managing the programme along with the Design Council.  This would involve hiring a project manager and any relevant support staff.  In addition to managing DD, the RDA may source regional mentors, designers, and facilitators and put them forward for approval by the Design Council.  The RDA also retains some responsibility in the marketing and awareness phases.  This might involve hiring a local advertising or marketing company and overseeing the process.  Whilst the specific nature of the RDA’s role may vary, the key point is that the successful operation of the programme depends to a large degree on the RDA and is contingent upon it supplying the necessary expertise.      4.2.2 The Core Program The core of the programme is split into three areas:  • Accelerate • Innovate • Immersion  The Accelerate module helps a company take forward one project as far as possible over a 6 to 12 month period.  It focuses on one (though it could be more) live intervention which is supported by a design mentor who is fully funded by the programme and who oversees the implementation of the intervention.  Participants of the programme can originate from a number of areas including the kick-start workshops, referrals from other business support organisations, or enter the programme independently at this stage.     The Innovate module assists small start-ups in turning unique ideas or technologies into successful products or services over a 12 to 18 month period.  A key goal of Innovate is to help reduce the risk commercial risk of the new technology ventures and at the same time increase its investment prospects through design-led innovation.      The Immersion module is for mature medium sized manufacturers.  It is the most intensive and costly; aimed at exploiting strategic opportunities through the use of design over an 18-month period.  It is a much more selective programme because it requires a company that is willing and able to invest in design in a strategic and focussed way. 4.2.3 Costs Whilst the costs of the full programme will vary depending on the number of participants.  The marginal cost of an additional participant may vary depending on the scale of the programme.  In other words, the costs per company may not be linear as the scale of DD increases.  This means that in costs terms, there may be optimal or preferable programme sizes.  Whilst the scale of DD may be determined by other factors, emda should understand the cost schedule in more detail so that the opportunity to minimise the cost per business is exploited if possible.  For example, the marketing and evaluation costs are largely fixed or sunk costs.  Initially this means that increasing the scale will decrease the cost per business.  Simply increasing the scope of the programme will be limited by emda’s overall budget, the potential loss of efficiency if it surpasses its optimal size, and more importantly, saturating the demand from the Region’s businesses.    The most recent estimates from the Design Council suggest that the cost per delegate for a workshop is roughly £350.  This applies to advisers, designers, and SMEs attending kick-start workshops, and also Accelerate, Innovate, and Immerse workshops.  This cost is comprehensive in terms of the delivery the programme (i.e. mentoring/advising companies in the Accelerate, Innovate, and Immerse programmes).  About half of this cost is paid to the Design Council for the kick-start workshops, and around 10% for the Accelerate, Innovate, The Practical Application of Design | 21  © TBR Economics  PN00806R  and Immerse modules.  The cost per delegate excludes the other fixed investments into the programme such as:  • Setup • Marketing • Project management and administration  • Evaluation  The Design Council provides some rough recommendations for the scale of these, but ultimately are left up to the discretion of the RDA. 4.2.4 Conclusion The programme has been well thought-out, and a large amount of investment has gone into its development.  The DTI and the Design Council have invested a combined £4m into DD. Therefore, the programme could be effective. 4.3 DD in other Regions At this point a number of region have undertaken or are currently undertaking pilots of the programme or are planning to undertake a component of the programme.  These include:  • ONE North East – currently under a strategic agreement with the Design Council to take forward the programme and have been trying to agree on a business plan since February 2006.   • Yorkshire Forward – currently piloting the ‘Accelerate’ component of the programme in South Yorkshire Objective 1 areas. • London – recently concluded a pilot of the ‘Immersion’ component and will shortly decide on whether to take forward full ‘Immersion’ programme. • South East in discussions to take forward the ‘Accelerate’ component.  Whilst we did not speak to all nine English regions a number of interesting points were raised regarding each RDA’s experience with the programme to date. Though each RDA has different challenges in its Region, is working with a different level of regional design capability and infrastructure, and is investing in the programme in different ways, there were still a number of common themes:  • Overall satisfaction with the quality and effectiveness of DD in the regions where activity has taken place. • Concerns that local personnel should be used (i.e. mentors, designers etc) if possible. • Some concerns over the capacity of the Region to supply qualified mentors (skill set difficult to find). • Difficulties with the procurement process, especially given the issues regarding the purchase of the Design Council’s intellectual property with public money; and whether DD should be treated as a service provided to the RDA (and thus required to go out to tender) or whether it equates to the RDA transferring its business support role to the Design Council.  • Slight wariness regarding the characteristics of the Design Council’s proposed private delivery company (Newco) and how this might influence the effectiveness of the programme.  At the moment, the nature of Newco, how it will be setup, run, and deliver DD are unclear.  ONE North East have agreed to enter into a business model without knowing the details of Newco, but are ensuring that the Design Council is flexible with regards to its nature. • A clear-cut gap in similar provision, and subsequent opportunity identified for the implementation of the programme (i.e. minimal overlap with existing initiatives). The Practical Application of Design | 22  © TBR Economics  PN00806R  • The need for the Design Council’s regional project manager to understand the local delivery mechanism (e.g. Business Link) and be able to assimilate the RDA’s perspective.  However, ONE Northeast will commission a delivery partner to handle the RDA’s responsibilities for the programme and is not precluding potential partners without design expertise since it believes a complimentary relationship (e.g. Delivery Partner’s business support expertise and Design Council’s design expertise) can be successful.   4.3.1 Potential Benefits to the East Midlands The potential benefit to the East Midlands is significant.  Existing programmes have pointed to the fact that successful use of design by companies could see increases in turnover, productivity, and business performance and more importantly, the impetus for cultural change within the Region’s industries. 4.4 Potential Risks, Issues, and Opportunities In addition to the potential benefits to the programme there are a number of potential risks associated with implementation of the DD programme.  In the following sub-sections these risks are discussed and reveal that the decision to implement or forego the DD opportunity is an important one, riddled with subtle but important issues. 4.4.1 Improving Business by Design Improving Business by Design is a programme funded by Leicestershire Strategic Economic Partnership, which bears a strong resemblance to the DD programme (especially the Accelerate and Immersion modules).  The program has involved the creation of a design unit that proactively sources new product ideas within companies and seeks to realise these ideas through a network of practitioners.  For example, this includes businesses wishing to make the transition from supplying components to offering their own line of products.  The design input into new development is sourced from local design companies after the mentors help a company develop a brief.  The programme is effectively a compliment to the Manufacturing Advisory Service, and does not help companies with such methods as lean manufacturing.  Nevertheless designers are intimately aware of the manufacturing issues and how these relate to a product design (and vice versa).    The programme draws on the expertise of DeMontfort University. However those delivering the programme are not employees of the University.  The program is currently at the end of its first full year and has been going for roughly a year and a half with a year currently remaining on its contract.  In this time the resources available to LSEP have facilitated investment of over £0.5m into the program, which has allowed 16 companies to take forward the creation of new products.  Of these companies, 15 have invested an average of £15,000 into the process.  It is often the case that companies have new innovative product ideas, but need a large capital investment before the product can be realised.  Virtually every company in the program has made an investment, which has resulted in an average 7-fold increase in turnover (e.g. £15,000 investment yields £100,000 increase in turnover). 4.4.1.1 Choices Available Clearly there are similarities between the IBBD and DD programmes.17  From one point of view the existence of this programme presents a difficult political challenge to emda, from another,                                                17 The Immersion module is effectively the same as the IBBD programme, with DeMontfort University acting as the ‘honest broker.’ The Practical Application of Design | 23  © TBR Economics  PN00806R  its existence is a fortuitous precursor which can inform future integration of DD.  On this basis there are three possible courses of action:    1. Keep IBBD, and launch the DD programme  2. Keep IBBD, do not launch DD 3. Rescind IBBD, launch DD   Risks of choice 1:  A risk associated with the first choice is the duplication and replication of activity.  The duplication would be a potential waste of emda investment monies and could decrease efficiency. The programmes are very similar and the presence of both may lead to competition between the two.  This would most likely confuse the message of both programmes in addition to creating confusion amongst the business population by adding another tier of business support.  Any confusion could result in damaging the reputations of both programmes.    Opportunities of choice 1: Sufficient and prudent planning could ensure that the DD programme initially compliments IBBD and possibly succeeds it as a Region-wide programme with a more strategic focus. However, in order to avoid the risks identified above, it would be crucial that the Design Council, emda, and DeMontfort (e.g. Peter Ford) were willing and able to work together and reach a solution for successful integration.  In this way, the use of design could be expanded across the Region by exploiting the accumulated intelligence, expertise, and reputation of the IBBD programme.  Risks of choice 2:  The main risk associated with foregoing the DD programme is the lost expertise and process, which the programme would bring into the Region and thus any associated economic impact.  A number of other region are either planning to undertake the programme or are currently implementing it and there is a risk emda will “miss the boat.”  Opportunities of choice 2:  Since IBBD is currently present only in Leicestershire it would need to be expanded in order to become a regional programme.  The process of rolling the programme out would need to give due consideration to the key factors that have made the programme successful so far.  In other words, it should not be assumed that the programme could simply be expanded successfully throughout the Region.  It will inevitably face a number of the same issues that the implementation of DD programme would face.    Risks of Choice 3:  IBBD has gained impetus over the past year and withdrawing the programme could destroy this momentum and potentially put ‘design’ back significantly n Leicestershire.  Any set-up costs (sunk costs) may be lost and need to be re-paid as the initial inertia associated with establishing a new programme is overcome again.  There  is a risk of confusion as one program replaces another.  There are also political risks for emda.  As it will be seen to be abandoning a regional programme for a national one (helicoptered in) and unless the reasons and benefits are clear, this will damage emda’s reputation.  This could lead to a loss of rapport with local stakeholders, and withdrawing IBBD could jeopardise future interactions with local delivery partners.    Opportunities of choice 3:  Starting over could give emda more freedom to develop the use of design as a strategic driver and therefore would have the greatest benefit for the Region.     These risks/opportunities have been couched in terms of IBBD and DD, but they apply equally to any regional design initiative which substitutes for DD (or vice versa).  The key risks are summarised in Figure 5 below.  The Practical Application of Design | 24  © TBR Economics  PN00806R  Figure 5 Risks/Opportunities Associated with IBBD and DD  4.4.2 Economic Impact Any investment in the East Midlands should take account of the impact it will have on the regional economy.  Specifically, understanding the economic impact of an investment, both in terms of the number of jobs it will create and the gross value added is crucial. If one of emda goals is to optimise its investment it must take into account the marginal benefit to the regional economy of each additional pound it spends.  Obviously, this ratio (benefit to cost) will differ and the issues that drive the impact of emda spend on the economy are:  • The target of the spend (who is in direct receipt of the investment?) • The linkages within the economy (how well are industrial supply chains developed within the Region?) • The Region’s income and purchasing behaviour (what is the Region’s propensity and ability to buy regional products and services?)    The main issue is whether the investment stays within the Region.  In other words, if the target of the spend is outside the Region or the linkages between business supply chain are poor within the Region, or the Region does not buy its own good and services then the impact in terms of new jobs and additional wealth (GVA) will be LOWER.  These issues may seem subtle but have the potential to change the impact of any given investment substantially.  Choice Risks Opportunities Keep IBBD, and implement the DD programme Duplication and replication,   Competition between programmes,  Confuses message and adds another tier of business support,  Potentially damaging to emda and DC reputation, Waste of emda money, DC unlikely to consent to this scenario. Use expertise and accumulated knowledge of market from IBBD to launch DD across the Region and maximise potential for successful integration.  Choice Risks  Keep IBBD, do not implement DD Challenges rolling out IBBD, If other region take up programme emda may “miss the boat”, Forego expertise and good practice and potential increase in regional performance. Exploit inertia and expertise of IBBD and spread the use of design to other parts of the Region with a successful “home-grown” program. Rescind IBBD, implement DD Withdrawing IBBD puts ‘design’ back, Loss of sunk costs, Initial inertia of starting new programme,  Risk of confusion,  Emda seen abandoning home-grown initiative,  Loss of rapport with local stakeholders, Potential jeopardising of future interactions with local delivery partners.   Freedom for emda to develop a completely new programme. The Practical Application of Design | 25  © TBR Economics  PN00806R  In terms of investing in the DD programme, the issues described above can be summarised by the following questions:  • Around 80% of the cost of the programme is in wages.  Will the “employees” be native to the East Midlands?     • Do the potential target companies source their input from other companies in the Region?   • Assuming target companies buy design, will they buy regional design and if so how much will they buy?  A key target of the of the DD programme is that at least 50% of the designers, mentors and facilitators on the programme are from the East Midlands.  This ensures that at least 50% of the direct spend on wages goes to the regional economy.18  However, in order to fulfil this target, personnel will need to be trained and accredited by the Design Council and potentially required to refresh and update their qualifications with the Design Council.  Thus the ability for the East Midlands to supply suitably qualified people for accreditation, and commit to maintaining qualifications is necessary if the Region is to capture the direct and indirect impacts of the spend on wages.  It is unlikely in the beginning of the programme that the East Midlands will meet this target, and whilst it is in both the RDA’s and Design Council’s interest to increase regional involvement in this respect, this is dependent on the capacity of the Region.  This is not just about impact, but the success and effectiveness of the programme.      Strategic issue  3: The ability for emda to find and employ local mentors, facilitators, and designers is crucial not only to maximising the economic impact on the Region, but in maximising the potential success of the DD programme.  One of the lessons learned in other region is that it is difficult to find individuals with the right skills to be successful mentors and this must be considered as a possible issue in the East Midlands.  Investing in companies or industries that have a well-developed regional supply chain will increase the economic impact on the Region, all else being equal.  While this is a general point that applies to any intervention, this makes the supply chain issue all the more critical.  The implication is not that emda should invest in companies with local supply chains necessarily, but that the development of local supply chains will increase the propensity for investment to have a strong multiplier effect on the wealth and employment in the Region.    Another target of the DD programme is to use the region’ design industry to fulfil the design needs of target companies.  A preliminary stage of the DD programme is to conduct a ‘design audit’, which looks at the supply and demand of design in the Region.  This audit would draw upon any existing research studies in order to build up an understanding of the implications for implementing the programme in the East Midlands (and hopefully take into account the issues highlighted in this report in addition to any others).  Nevertheless, if there is incompatibility between design supply and demand, a possible solution is to source design from outside the Region.  This might transpire for a number of reasons including:  • Lack of specific design expertise (e.g. East Midlands Design has expertise in many areas, but there are a number of industries where expertise is not widely available such as design for medical and pharmaceutical industries). • Capacity/size issues noting that a large proportion of the East Midlands Design industry is comprised of a number of very small businesses and freelancers.                                                18 This is important because, for example, increasing the wages of people in the Region means they will spend more money in the Region buying products and services from the Region’s firms.  If these wages are given to someone outside the Region, these direct and indirect impacts are lost. The Practical Application of Design | 26  © TBR Economics  PN00806R  • Businesses may be reluctant to invest in small design business (the Design Council recommends that only design companies employing at least 5 should be involved),  • Conversely, small design businesses may be reticent to undertake projects that represent a large proportion of their total turnover. • The possibility of exacerbating the well-known dilemma that design-companies (in the UK and East Midlands) can have exceptional design skills but poor management skills and business acumen.19  • The Region will be to some extent dependent on the Design Council’s perception of regional design capacity. Emda must take a view on this, but in our view should exercise a degree of caution about the capital centric danger associated with this.   Clearly, businesses are not beholden to using local design companies and will source suppliers based on a number of factors, many of which will prevail over a supplier’s location.  This process can be helped or hindered by the programme and there is little apparent incentive for the Design Council to try HARD to encourage regional business to source regionally.   Nevertheless, TBR’s study of the Leicestershire design industry suggests that the area has the largest concentration of design businesses outside London, and this will increase the potential for regional design delivery. 4.4.2.1 Summary of Economic Impact Issues Strategic issue  4: If and when buying the DD programme, emda needs to understand the subtle but important sensitivities that impact on the effectiveness of its investment. Specifically, since 80% of the cost of the programme is on wages the extent to which ‘employees’’ are native will affect the overall impact.  Furthermore, the extent to which the regional design industry can fulfil the design needs of the target companies will determine the impact on the Region.  Whilst it may be unavoidable that design expertise is bought from other regions, the opportunity for local designers to capitalise on new demand should be maximised and there is a danger that it might not be.  At this point, there is no conclusive evidence as to the level of impact the DD programme would have on the Region.    4.4.3 Regional Fit  Regardless of whether design is effective or not (and our conclusion is that it is), the ability for a company to “use design” in its business differs.  More specifically, this will depend on such details as:  • Company type (what does the company do?) • Ability to invest time and resources (can the company invest in design?) • Location in the supply chain (is the company producing to a specification?)  No matter how well design is used in a particular sector it may be poor investment given the nature of the firm.  Businesses may be restricted in both the product they make and the process used to make it and this limits their ability to invest in and use design.  Whilst beyond the remit of this report, there is strong anecdotal evidence from our research that the industrial structure of the East Midlands poses potential challenges in the roll out of a widespread design programme.  Specifically, a large proportion of manufacturers in the Region are:  A. Micro businesses engaged in low-cost workshop fabrication; working in steel, timber, plastics and other materials. B. Micro high technology companies capable of hi-tech, high precision, component manufacturing.                                                19 Design Business Association, British Design Innovation, TBR  The Practical Application of Design | 27  © TBR Economics  PN00806R   The challenge with A is that it is very difficult to sell design to low-cost fabricators given the nature of what they do.  The challenge with B is that it is equally difficult to sell design to component makers who are focussed upon the furnace of technology investment, with direct industrial customers such as Rolls Royce, BAE, Caterpillar and so on.  Many of these engineering companies embody the best of UK industrial investment, but they do not make finished goods, they make precision components for larger assemblies.   A further issue is the prevalence of lifestyle businesses in the Region.20  Whilst these businesses will undoubtedly find it more difficult to maintain the status quo without proactively seeking new markets and opportunities, they cannot be forced to innovate.   None of these issues are meant to contradict the potential value that design can have, but given a limited investment resource, emda should not take the view that design is for everyone.  Instead, emda needs to understand who might be the ‘top 10% of companies’ in terms of their ability to truly innovate.  Coupled with this point is the ability for companies to invest in design.  There is an important distinction that needs to be made between businesses that don’t realise the potential of design and thus do not use it, and those that realised the potential value of design but can’t use it.21  The implications for assistance are different; in the former awareness needs to be raised, in the latter businesses require help to enable their use of design.  Furthermore, telling businesses that appreciate design but can’t use it that design is valuable will only agitate and aggravate current scepticism of business support.   4.4.4 Evaluation Another issue is the inability to fully evaluate the DD programme. Specifically, it is not possible to evaluate the overall economic impact of the investment in the DD programme up to this point.  That said, the outputs from the programme so far have been encouraging.  Furthermore, the Design Council have been slightly conservative about the value of the DD programme’s output.  Specifically, the long run impacts of integrating design into a business have not been identified.  For example, the benefit to a company of including a director with design expertise onto its board has not been explored.  More generally a key objective of the programme is to instil processes for ongoing, systemic economic development and it is not clear that the potential economic benefits from this have been explored by the Design Council.  Indeed, these types of benefits are very difficult to estimate or quantify.  The point is that the outputs confirmed thus far should be considered conservative.  These include:  • Private sector investment • Job creation  Bearing in mind the issues described in the section on economic impact (i.e. destination of investment, source of employment) the overall benefit to the Region will differ.  Like any investment, there is set amount of time required before enough data is available to effectively analyse a programme.  Thus RDA’s wishing to undertake the program immediately must do so without the benefit of this information.   Whilst some evaluation material exists on the program, as far as we have been able to tell, this is mostly limited to anecdotal evidence.                                                20 Maximising The Potential of The Leicester Shire Design Industry. TBR Economics 2005. 21 An interesting observation highlighted by the IBBD programme is that businesses can often find it easier to secure (for example) £250,000 for an investment than £15,000, and that there is lack of provision for access to medium sized investment, and an element of bureaucracy and red-tape when accessing what is available.  The Practical Application of Design | 28  © TBR Economics  PN00806R   By evaluation we don’t mean just case studies of businesses in the programme but a robust as possible understanding of the cost and benefits noting that some of the benefits will be intangible and difficult to quantify.     Furthermore, the existence of evaluations of the programme in other region will not substitute for an evaluation of the programme in the East Midlands.  There will inevitably be a number of East Midlands specific factors whose effects on the programme cannot be estimated by looking elsewhere.  This implies the need to pilot the programme in the East Midlands if emda decides to implement DD.  Whilst a thorough ex ante evaluation may not be feasible, the Design Council recommends that £50,000 be spent on evaluating the programme once undertaken, and has developed a framework for it which is consistent across all region.  The benefit of the Design Council’s framework is that it maximises the potential for replicable, consistent, and comparable information gathering.  However, it is crucial that emda bear in mind issues such as economic impact and regional fit in its evaluation.  For example, knowing the total investment made by companies is not as useful as understanding how this investment has impacted on the local supply chain or how the Region has benefited from the investment.    Strategic issue  5: Neither the DD program or the IBBD programme have been formally evaluated and in order to compare the economic impact on the East Midlands and overall value for money of these programmes, a framework of analysis needs to be established and implemented before these two (and any others) can be effectively compared and inform a decision as to what the best course of action is.  The cost of DD programme includes an evaluation cost and the DC provide an evaluation framework, but emda should bear in mind the issues identified in this report as part of the frameworks for any subsequent evaluation.  4.4.5 Introduction of “NEWCO” There is uncertainty regarding the Design Council’s proposed plan to create a company that will deliver the Designing Demand Programme.  At this point NEWCO is purely hypothetical and not much can be said about it that is not speculative.  Nevertheless, there are potential issues with changing the delivery mechanism of DD.  These include: • As a commercial enterprise NEWCO will need to remunerate its initial set-up costs and be profitable as any business would.  This changes the priorities for the delivery of DD Specifically; it creates the potential conflicts of interest between RDAs and NEWCO if interests are not aligned.  Conversely, NEWCO could potentially retain expertise not currently housed in the Design Council that could improve the effectiveness of DD.  For example, the Design Council does not have experience of delivering business support or managing business models.  A more commercially oriented NEWCO, could thus increase the efficiency and effectiveness of the programme.   • As a commercial enterprise, NEWCO may treat similar programmes as potential competitors and this could create difficulties similar (but more pronounced) to the ones identified in this report in between IBBD and DD. 4.4.6 Sustainability As with any investment, an issue that needs to be discussed is whether the investment will become self-sustainable.  It is not possible to evaluate this issue in regards to the DD programme given its relatively young status and lack of evaluation.  The transfer of knowledge from mentors to regional delivery agents (e.g. regional mentors, RDA project management, business intermediaries) would create the potential for the design expertise in the programme to be passed along.  However, once the contract for the DD programme expires, it is questionable whether the RDA holds any rights to the Intellectual Property of the programme.  In other words, the RDA might be restricted from holding further workshops (e.g. Kick-start) The Practical Application of Design | 29  © TBR Economics  PN00806R  or undertake further modules (e.g. Accelerate) without making further arrangements with the Design Council (or NEWCO) to effectively purchase the IP element of the programme for another interval.  Recently, the Design Council has suggested that there is flexibility on this issue.  So, it is important that if and when agreeing a business model, emda should broach this issue with the Design Council.  4.4.7 RECOMMENDATION: Designing Demand Our view is that because: 1. The Design Council suggests that it is willing to look for possibilities for integration with other similar programmes, and is willing to work flexibly with the existing design infrastructure to ensure that the Region’s interests (not necessarily limited just to design) are considered; and 2. IBBD already exists has been successful in Leicestershire; and  3. The DD programme has the potential to be successful in the Region:  Emda should look to enrol to the National Designing Demand Programme at this point only if it can guarantee that every effort is made to ensure a mutually beneficial integration effort between the existing design initiatives in the Region and the DD programme.  Specifically, all existing initiatives should be consulted with regards to ensuring best practice in the Region in the first instance, and included in the development (and possibly the delivery) of the DD programme in the second instance.     In developing the programme, emda should seek to understand how its implementation relates to the issues defined in this report (e.g. economic impact, regional fit).   A Regional Hub of The National Design Centre (NDC) | 30  © TBR Economics  PN00806R  5. A Regional Hub of The National Design Centre (NDC) One of the Cox Review Recommendations it to set of a network of ‘Creativity and Innovation’ centres throughout the UK, with a central hub in London.  ‘Creativity’ cannot be viewed as a skill possessed by the gifted few. It needs to pervade the thinking of the whole business, to be embraced within public services, to be embedded in the education system, and to be sought out by those who buy goods and services, whether that means a company, a public-sector body or the consumer. In other words, getting greater creativity into UK SMEs has to be seen as part of a much wider cultural change. Moreover, the strength of UK creativity needs to be celebrated and internationally recognised. - Cox Review   One of the issues Cox is attempting to confront here is the need for a culture change in industry but also in the general population regarding the perception and attitude towards creativity and design.  A second issue is the need to recognise UK design at the international level, and this goes beyond just celebrating achievements but is inextricably linked to the issue identified by Figure 1, which shows the declining balance of trade.  Thus there is a need to show UK design to the world in order to increase the demand for UK design.  This includes, for example, increasing the export potential of businesses in the East Midlands.  In this way, UK industry can increase its international competitiveness and exploit the increase in future demand from developing countries.        The objectives of the network proposed in the Cox Review would be22: • To position the UK as pre-eminent on the world’s stage as a source of creative talent • To enhance the uptake and use by UK business of creative services • To strengthen the interaction between the various parties involved in promoting and representing creative skills and services • To enhance the public’s awareness of the relevance of creativity and innovation.  Furthermore, the facilities to be potentially provided by regional design centres include23: • Exhibition space • Seminar facilities • A hub for creative industry gatherings • Educational facilities  • Retail environment/dining facilities • Incubator space for early-stage creative businesses • Serviced office/shared studio facilities for creative companies • Design Audits • Mentoring relationships  The Cox Review states that the network, after initial set-up funding would ‘become largely or wholly self-sustaining’. The revenue sources identified are: • Rentable space • Seminar and meeting facilities • Restaurant and retail services • Sponsorship 5.1 Existing Initiatives in The UK and Beyond The National Design Centre (NDC) is still very nascent.  So far, there are 4 examples of the concept in the UK:                                                22 Cox review page 50 23 These proposed facilities have been taken from the Cox report and initiatives in place or in proposal stage in the UK.  A Regional Hub of The National Design Centre (NDC) | 31  © TBR Economics  PN00806R  1. The Lighthouse (Glasgow). 2. Design of the times (DOTT 07) commencing in 2007 in the NE. 3. Current plans for a London centre. 4. The Design Centre for the North (Gateshead).  At the moment only Scotland has something currently up and running and The Lighthouse, set-up in 1999, pre-dates the NDC and represents an autonomous decision made by the Scottish Executive.  The London Development Agency is currently deliberating over the precise nature of the NDC presence in London.   5.1.1 The Lighthouse (Glasgow) The Lighthouse was built in 1999, is located in Glasgow and focuses on architecture and design. It is laid out over six floors and includes exhibitions, events and initiatives related to the world of design and architecture.   There were 155,000 visitors to the centre in 2002 and 170,000 in 2004.  The shops inside the centre provide an opportunity for young artists particularly from Scotland to sell their work to visitors.  In addition the Lighthouse hosts conferences, other exhibitions and houses eating facilities. The conferences and seminars also act as promotional agents for the centre. The centre keeps in close contact with young artists, which it sees as vital for encouraging Scottish artists. The Lighthouse appears to be self-sustaining but this is slightly misleading.  It earns a large proportion of its “income” by renting space within the building as well as undertaking commercial ventures including restaurants and retail facilities.  However, the centre is operated as a charitable trust and a large portion of income is derived from public funds. The centre costs £3.2 million per annum to run and this is broken down in Table 1:  Table 1 Glasgow Lighthouse Income     Funding source Funding provision Commercial Income £2.2millionProject Grants £1.6millionGlasgow City Council Core Grant £1.4million Total Funding £5.2million 5.1.2 Design of the Times (DOTT 07)24 In contrast to the Lighthouse, DOTT 07 is an initiative based programme, which does not rely upon a specific location.  DOTT 07 has three project strands: 1. Public Design Commissions 2. Education  3. Design showcases  Public design commissions will incorporate design in a series of public projects as a partnership between citizens and designers.  At least 10 public commissions will be developed and they will vary in scale, and will involve a range of business, public and private sector and                                                24 We have not been able to speak with ONE NorthEast about the NDC yet, despite our attempts.  ONE NorthEast has been very helpful in regards to the DD programme and we will continue to pursue the RDA in regards to DOTT 07.  It is important to understand if DOTT 07 will be self-sustaining, where funding will come from, if there will be capital investment, and the nature of DOTT 07’s links with other initiatives both within the Region and without.   A Regional Hub of The National Design Centre (NDC) | 32  © TBR Economics  PN00806R  community organisations as partners.  Some examples of the commissions include designing practical steps to:  • Better connect urban and rural people • Make it easier for people to participate in local democracy • Improve life for patients and carers in the home, since 80% of healthcare, by time, takes place there. • Make it easier for people to use less energy, or recycle household waste?  Education programmes will engage students, teachers and local communities in collaborative projects. At the core of Dott 07 are projects including ones to help new generations master innovative tools and techniques of design, ask the right questions, identify what needs fixing, or changing, how to put together, and work in, multi–disciplinary teams, how to get projects paid for, and how to judge their success.  DOTT 07 will achieve this by working with students of all ages, interacting with communities, businesses, and even other countries to draw on best practice and brainstorm new uses for existing technologies.  Finally, design showcases will enable a programme of events to bring design to North East England in 2007.  These showcases will include big ticket set complemented by a challenge fund for micro–projects and first–time innovators. Dott 07 will help the North East’s producers develop projects, and will connect local venues with the producers of events from around the world.25  Thereafter, DOTT will to different regions across the UK, and this means emda may have an opportunity to host DOTT.   5.1.3 The Design Centre for the North The plans for the Design Centre for the North (Gateshead) are for £18 million worth of investment by the Northern Way RDAs.   The Centre will spearhead a range of design-led initiatives across the North East of England and also harness the design capacity of partners in Yorkshire and the North West.   The Centre will operate as a twin hub from two locations in Newcastle and Gateshead, which are scheduled to open in 2007. The Newcastle site is closely linked to Northumbria University’s new Design School and the Gateshead site is a private sector-led initiative with backing from Gateshead Council and ONE Northeast.  The particular focus of the Centre will be on skills related to the development of science and technology based products and services. It also aims to help the North’s SMEs and key clusters to improve their productivity and international competitiveness.  The centre will include seminar and exhibition areas, rapid prototyping facilities, shared project space, a cinema and incubation space. 5.1.4 NDC in London: The HUB The London Development Agency have recently begun deliberating on the precise nature of the NDC presence in London.  At the moment, it is likely that the NDC in London will be both physical and virtual.  The requirement for a physical space stems from the perceived need for conference facilities, the fact that the Design Council may be looking for a new home, London SMEs’ need for exhibition space, and potential demand by HEIs and the Imperial Colleges in London.  However, resources are obviously an issue for the LDA and this will impact on the ability to build a physical space.  In addition, there will need to be a virtual presence that can maintain a larger remit but again, the precise nature of this virtual presence is unclear.                                                  25 http://www.dott07.com/about/programme.html A Regional Hub of The National Design Centre (NDC) | 33  © TBR Economics  PN00806R  Despite LDA’s identification of demand for specific services (e.g. exhibition space, conference facilities), overall the project is still very nascent and as a result its specific roles and responsibilities are not yet clear.  Furthermore, the potential links and synergies between London (the hub) and the region are also not yet clear.  Strategic issue  6:  The National Design Centre is nascent: the precise nature of the London hub and its role as an umbrella organisation are not yet clear, the North East regional presence will not be implemented until 2007, and the Glasgow initiative has posthumously become linked with the NDC (originally a Scottish design initiative).  Thus questions such as how similar initiatives will be, whether they will be self-sustaining, the degree to which there will be capital investment involved, the degree to which the initiatives will link back to the Cox Review recommendations (or depart from them), and the extent to which these similarities or differences will impact on success are currently unclear.     5.1.5 International ‘Design Centres’ There are a number of international design centres that exemplify their country’s commitment to design and their belief in its ability to affect economic performance.  Three examples are portrayed in more detail below, these are:  • Korea • Taiwan • Singapore 5.1.5.1 Korea The Korean Institute of Design Promotion (KIDP) has been taking steps to monitor overseas design trends and participate in international exhibitions and conferences, academic conventions and international design-related organizations.  The objective of the KIDP is to advance the sophistication of Korea's design industry. Figure 6 Korean Design Centre                     The Korea Design Centre seeks to increase national competitiveness through design as well as enhance Korea's design industry. It is a 12-story in Songnam City. This new “design Mecca of Korea” includes space for design and business start-ups, design associations, an e-design academy, design convention hall, design library, exhibition halls, and seminar rooms. It connects to 16 Source: www.jdf.or.jp A Regional Hub of The National Design Centre (NDC) | 34  © TBR Economics  PN00806R  Design Innovation Centres across the country revealing a national hub/regional spoke model.  These centres offer state-of-the-art facilities for the use of university students, small local companies and design firms. 5.1.5.2 Taiwan The Taiwan Design Center was established in 2004, in order to raise the creativity of designers to international standards, increase the supply of design employment in order to meet growing demand for design services, raise industry competitiveness and help manufacturers build their brands, build up educational tools to increase the populations’ appreciation for design, and integrate design into different industries in order to create new services and values, and increase overall effectiveness.  An explicit objective of the centre is to enable Taiwanese industry to capture Chinese demand, develop Taiwan styled design products, and allow Taiwan designs to achieve international influence.  This type of international initiative gives substance to Cox's warning that other countries appreciate the value of design and are attempting to harness it in order to increase innovation, productivity, and economic performance.  Figure 7 Taiwan Design Centre in Nangang Software Park  Source: www.jdf.or.jp A Regional Hub of The National Design Centre (NDC) | 35  © TBR Economics  PN00806R  5.1.5.3 Singapore Singapore’s £158 million Fusionopolis creative centre, is due to open in June 2007. The centre will bring together businesses from the ICT and creative sectors in an iconic new building occupying 1.2 million square feet on 24 stories.26  It will contain shared facilities, conference rooms, meeting rooms, seminar rooms, an auditorium, production and audio studios, satellite access, state of the art IT infrastructure serviced apartments, amenity clubhouse, rooftop swimming pool, 500 seat performance theatre, retail outlets, a clinic, childcare, and restaurants.  The Fusionoplis will dwarf both Korea and Taiwan’s Design Centres.  Figure 8 Fusionopolis                            Source: http://www.one-north.com 5.2 Issues with a Physical Entity In regards to the East Midlands, there are a number of issues associated with creating a physical presence of the NDC. 5.2.1 Length and Cost of Investment and Long Run Impact The uniform view across stakeholders is that any physical investment would need to take an “all or nothing” approach and that a successful investment would require 8 to 10 years to become self-sufficient and successful.  The justification for “all or nothing” was the fact that the Region is already well equipped with small scale physical infrastructure.  Stakeholders did                                                26 http://www.fusionpolis.com.sg A Regional Hub of The National Design Centre (NDC) | 36  © TBR Economics  PN00806R  not see the point in creating something that would simply add to this infrastructure.  Instead, if it were to fulfil the objectives laid out in the Cox review it would need to “shout.”  The Glasgow and international models support this view.  Any development would require a large capital investment, which would need to be recouped over ensuing years.  Meanwhile, it would take time for the centre to reach its income potential by earning revenue from rentable space, seminar and meeting facilities, restaurant and retail services, or sponsorship.  Thus the economic impact to the Region after the initial build would be very small and not until the centre began to generate its own wealth would the Region benefit financially. 5.2.2 Understanding Demand At this point, there is no information on who the target audience for the facility would be, who it would help, and who its customers would be. Generally, there is no information on what the demand for the centres services would be. 5.2.3 Region Size and Population distribution The nature of the East Midlands is significantly different than the cities that Design centres are so far found in.  Specifically, Glasgow and London are the centres of economic activity in Scotland and England respectively and house very large proportions of their population in a relatively small area.  On the contrary, much of the East Midlands is rural, and the average distance of any business or customer from a specific point in the Region is much greater.  The ability to traverse the Region quickly is often poor (especially East/West) and for the most part, public transportation cannot be relied upon.  There is thus an issue about how a single location would feasibly serve the entire Region. 5.2.4 Existing infrastructure There is a large amount of existing infrastructure in the Region that serves at least one similar function to the NDC.  This ranges from universities’ innovation centres and incubation centres, to facilities like LCBD (Leicestershire Creative Business Depot), which provides facilities such as meeting rooms, office space, and catering services.  An illustration of the breadth and volume of existing initiatives is given below:  • Innovative Construction and Manufacturing Research Centre at Loughborough University • Loughborough Innovation Centre • Firegate Studios • Innovation Centre for Creative Industries at University of Northampton • HATCH (rapid prototyping project, Lincolnshire University) • Rapid Manufacturing Research Group • The Design Factory, Sleaford Lincolnshire • Ergonomics and Safety Research Institute, ESRI, (Loughborough University) • A new product design Centre at DMU  Strategic issue  7: There is a plethora of existing design related initiatives and infrastructure in the Region, maintaining a comprehensive and up to date landscape is thus difficult.  However, without defining this landscape there is risk of complicating it further and increasing the difficulty of understanding it in the future. 5.2.4.1 Lack of Demand for Showcasing One of the recommended uses for the NDC is exhibition space.  However, a number of stakeholders did not feel there was any demand for showcasing in the East Midlands.   A Regional Hub of The National Design Centre (NDC) | 37  © TBR Economics  PN00806R  5.2.5 Nascent Hub This point is not necessarily linked to a physical NDC and would apply to any form the NDC were to take.  A stated previously, London NDC is very nascent and as a result its specific roles and responsibilities are not yet clear.  Any project undertaken at this point would either:   • Ignore London and proceed independently, hoping to create links and exploit synergies later on • Delay until there was a better understanding of London’s role as a hub and its role to support/interact with the other region.  In effect, the current regional design centres can be more accurately described as collection of Region-specific design initiatives which may or may not have many overlapping objectives, and less accurately described as a cohesive organisation with regional branches. 5.3 Issues with Virtual Whilst there is a large number of issues associated with building a physical centre, this does not imply that a virtual centre is necessarily a solution.  However, there is clearly opportunity for emda to use the plethora of design-related infrastructure distributed around the Region.  5.3.1 Confusion with Existing Initiatives The main challenge associated with creating a new initiative that is less than very distinguishable from existing ones is that it may lose its impact and become lost amongst the others.  Worse, there is a possibility that it will create confusion with current initiatives and decrease efficiency.  For example, an initiative currently fulfilling a design support role might be duplicated, or confuse potential users.   5.3.2 RECOMMENDATION: The National Design Centre Emda should not invest in establishing a regional hub of the National Design Centre at the present time.  A physical presence is problematic given  • The scale of the investment • The lag between the establishment and remuneration of economic benefits to the Region • The size and ‘spread’ of the East Midlands,  • The lack of understanding of Demand • The plethora of existing infrastructure • The current lack of leadership from London   A virtual presence will be easily ignored and at least be lost amongst the abundance of current initiatives, at worst it will create confusion and decrease efficiency.  Instead, an initiative that coordinates resources in order to fill gaps and improve communication and efficiency would compliment, not substitute the current situation.   However, emda should closely monitor the development of the NDC and re-evaluate the above issues.     Conclusions | 38  © TBR Economics  PN00806R  6. Conclusions 6.1 The Strategic Importance of Design  The current thinking on the role of design has recently received a critical and strategic infusion through recent studies (e.g. Cox, DTI).   Specifically, it has become clear that creativity, design, and innovation cannot exist in isolation and in order to improve business performance, design has a vital role to play as the link between creativity and innovation. Whilst it is clear that design can be a key strategic driver of productivity and business performance it is difficult to prove because estimating its direct impact is problematic.  Nevertheless, both the Cox Report and the DTI recommend it as a crucial element for the success of UK enterprise.  According to a recent survey undertaken by the Design Council, the East Midlands recognises the value of design more than any other Region in the UK. This was verified by research carried out by TBR Economics on behalf of emda in 2004, which identified a large amount of design-related activity taking place within the Region. This lends support to the justification of design being treated as a strategic innovation priority for the Region. 6.2 Design and the Regional Innovation Strategy There are a number of ways in which the initiatives outlined in the RIS could be used to promote the strategic use of design. Most notably, the establishment of iNets will facilitate the provision of specialist skills and enable wide dissemination of the benefits of design. The iNets will also play a key role in Innovation Support, helping businesses to overcome barriers to using design as an enabler of innovation. This will include helping businesses to understand the value of design, and also to access the necessary funding and expertise.    A further objective of the RIS is to create an environment for innovation. A key focus of these initiatives should be to build confidence and ambition in businesses to encourage the strategic use of design. This will require the provision of appropriate facilities and training to accommodate the current and future needs of the Region’s economy.  Design also has potential to contribute to the RIS objectives of developing the Region’s industrial strengths and prioritising future investments. In addition to developing better products and services, design can also be used to facilitate technology transfer. This includes speeding up the development process and reconciling changing market needs and technological opportunities.  In relation to implementation, it is not anticipated that there will be any need to alter the planned structure and function of the iNets. Rather, it is recommended that design forms an integral part of the innovation message of these networks. Accordingly, the actions outlined in the RIS to market innovation can also be translated to the promotion of the strategic use of design: • Describe how design/innovation relates to the Region’s businesses and public sector by creating an overarching message that is supported by a tailored message for each iNet. • Use the Regional Innovation Portal to communicate design/ innovation messages and event information, and provide a focal point for inward investment. • Develop relationships with existing networks to help deliver the design/ innovation message to encourage adoption across the Region. • Establish a rolling twelve-month diary of events to ensure that design and innovation are at the forefront of business minds. • Use the iNets to encourage SMEs to engage in design/ innovation by using case studies to show how design/ innovation has transformed businesses in the East Midlands. Conclusions | 39  © TBR Economics  PN00806R   In relation to the targeting of these actions, the Cox Review emphasises the benefits associated with encouraging innovation in SMEs with the potential for growth and recommends that these businesses should be reached at the local level. This is consistent with the key function of the iNets of encouraging SMEs to be more innovative.  The iNets will also facilitate the targeting of the key sectors identified in the RES as having the greatest potential to contribute to the economic development of the East Midlands (transport equipment, construction, food and drink and healthcare). There is believed to be significant potential to promote design in these sectors, especially in transport equipment, which was identified by the Community Innovation Survey as the sector that invests the highest percentage of innovation expenditure in design. It is important that in addition to satisfying the crosscutting requirements of each of these sectors (e.g. knowledge exchange, innovation support, creating an innovative environment, fostering and enabling emerging technology) that due consideration is given to the effectiveness and potential impact of design in each of these industrial contexts. One way of achieving this is to develop key performance indicators for design, considering such factors as the way in which design is used, the purpose for which it is employed, the types of businesses using design, and how design influences business performance.  6.3    The Cox Recommendations In this report we have discussed two of the Cox recommendations in depth: the Designing Demand programme and establishing a regional hub of the National Design Centre.  In doing so, a number of key issues relating to the implementation of these programmes have been raised.  In addition, we have made recommendations with regards to the implementation of these two initiatives in the East Midlands.   6.3.1 Designing Demand There is definite potential for the Designing Demand programme to be effective in the East Midlands and for it to be successful in improving business performance through the strategic use of design. Accordingly it is recommended that emda should look to enrol on the programme after giving due consideration to a number of key issues that will determine how appropriate it is for the Region.  Firstly, it is crucial that emda looks for ways to integrate the programme with the existing design initiatives and design infrastructure in the Region.  It is of paramount importance that this is managed and coordinated in such a way as to avoid confusion and competition for funds between DD and current initiatives (e.g. IBBD). Hence, it will be necessary to ensure clear distinction between initiatives.  It is also important to maintain the current momentum in design, which is largely driven by universities, local initiatives, and a number of design-aware SMEs.  There is obvious potential to harness this progress, and the DD programme will need to be managed with the utmost sensitivity to avoid adversely impacting the current momentum in design.       Due consideration needs to be given to the long-term sustainability of the programme, which is currently limited as the DD programme has only been operating for a few years.  This means emda’s role in ensuring the sustainability of the programme is unclear at this stage, as is the likely ROI of the programme.  Specifically, the scale and length of emda’s commitment (e.g. funding and expertise) has yet to be established.  A key driver of success of the DD programme is the skill and expertise needed to deliver elements of the programme (e.g. Accelerate). This capacity is crucial to meeting the present and future needs of businesses.  An outstanding question is the extent to which the East Conclusions | 40  © TBR Economics  PN00806R  Midlands region can supply the level of skill and expertise required.  If it cannot,  either the scale of the programme will be limited or expertise must be bought in from elsewhere,  thereby reducing direct regional spend and the impact this creates.  In addition, the programme will need to be promoted and marketed and there are potential challenges for marketing the Design Council brand in the Region.  Given the existing design infrastructure it will be a challenge to avoid confusion by introducing a new brand for a service that will be seen by many to already exist, if only at present concentrated on Leicestershire.  Furthermore, the design council does not have a clean slate in the Region. In the early 1990s the Design Council carried out a 2-year period of national advertising to find businesses that were interested in innovating.  Anecdotally, it was not well received by businesses (e.g. manufactures) and may have tainted the reputation of the Design Council in the Region.     Finally, there may be opportunities for the DD programme to have wider regional benefits beyond the purely economic.  For example, design can promote and deliver more environmentally sustainable goods and services and emda should look to exploit these kinds of opportunities though DD.  Specifically, there are opportunities for design to positively affect the environmental impact of all four priority sectors.     6.3.2 Regional Hub of the National Design Centre It is recommended that at this present time emda should not establish a regional hub of the National Design Centre. However, emda should maintain an interest in this opportunity and give due consideration to a number of issues.  In the short-term, emda should monitor the progress of the London hub (The Bridge) and the Lighthouse in Glasgow and Design Centre North (Gateshead).  In doing this, emda should seek to understand the progress and success of these places and the implications they might have for regional hubs.  Specific attention should be paid to the type of companies that benefit and engage with these initiatives, the ROI, the nature of demand (e.g. sustained?), the wider geographic benefits (i.e. outside the Region), the fit with the industrial and HEI priorities and needs.  With regards to Design Centre North (Gateshead), any opportunities for insight into the success of the centre and how this relates to the barrier represented by the size and ‘spread’ of the East Midlands should be exploited.     Should a physical hub becomes viable in the future, consideration should be given to developing the existing infrastructure (e.g. could the LCBD could evolve into hub?).  This will facilitate continuity as well as the successful integration National and regional interests in Design.  Furthermore, it is likely to be more efficient than starting ‘from scratch’.  Finally, emda need to give due consideration to the how the benefits of the NDC will transfer across the East Midlands.  In other words, what are the impacts from the NDC on the Region’s relative performance?  The potential benefits of the NDC might be better understood by comparing the effects of the Lighthouse on Edinburgh as well as Glasgow.  This might give insight into the nature of the wider impacts of an East Midlands hub.    6.4  Summary of Key Recommendations A number of key recommendations are made throughout the report to guide future action in considering how design can be used and successfully established as a strategic priority within the Region. These are summarised in the table below.   Conclusions | 41   © TBR Economics  PN00806R  Table 2 Summary of Key Recommendations Issue Objective Action Confusion of the terms 'creativity', 'design' and 'innovation' and risk of excluding those who would benefit from them. Promotion of design as an enabler of innovation that is available to ALL businesses. Market design as the link between creativity and innovation. Should Design be a strategic innovation priority for the East Midlands? Use design to overcome barriers to innovation in the East Midlands. emda should make design a strategic innovation priority by exploiting regional strengths in design including opportunities provided by a strong regional design industry, a greater appreciation of design by regional businesses, and HEI expertise in design. CIS insufficiently detailed for emda to take strategic decisions. Understand the issues that different types of businesses in the Region experience and the strategic intervention options. Augmenting the Community Innovation Survey. Desire for interaction between HEI and SMEs, but lack of clarity about what could be achieved. Exploit opportunities that can be mutually beneficial to both SMEs and HEIs and drive forward innovation through the use of design. iNets identify and explore how to leverage potential synergies between SMEs and HEIs through iNets with regards to design. Insufficient appreciation and awareness of the applications for design in the Region’s businesses. Instil the importance of design as a tool for innovation within the Region’s businesses.   Embed design into the Region’s Support services. With regards to creating the environment for innovation there is no single repository of the significant rapid prototyping capacity that exists in the Region. Understand the RP capability in the Region and the range of applicability and use this tool to aid companies trying to create new products and modify existing ones.   emda should commission a Rapid Prototyping Audit to understand the current capability in the Region (and in neighbouring region as boundaries are arbitrary). With regards to fostering and enabling emerging technologies there is currently a poor understanding of the take-up and effectiveness of design within the Region. Clear understanding of how design is used, who it is used by, what its benefits are and how it can be a tool for fostering and enabling emerging technologies.  The iNets should find a way to establish design as a Key Performance Indicator. Should emda target intervention and if so how? Effective and efficient use of design to create and sustain economic and societal benefits in the Region. emda should focus on SMEs with the desire, potential, and ability to grow as well as its priority sectors. Should emda implement the Designing Demand programme?  Adopt the most appropriate delivery mechanism to drive of innovation within the Region to improve productivity and business performance. emda should look to enrol in the National Designing Demand Programme at this point only if it can guarantee that every effort is made to ensure a mutually beneficial integration with existing initiatives and infrastructure. Should emda implement a regional hub of the National Design Centre?  Harness and develop the Region’s creative strengths, raise the profile of design, and encourage its use to drive innovation. emda should use its existing infrastructure.  Its not necessary at the present time to establish a separate regional hub of the NDC.  However, the development of the NDC to be closely monitored by emda.     ",
    "Link": "https://core.ac.uk/download/30624489.pdf"
}