{
    "Title": "Transitioning from nanomedicine to picomedicine",
    "Authors": "Webster, Thomas",
    "Year": "No year available",
    "Abstract": "Inspired from biological systems, nanotechnology (and more recently, picotechnology) is beginning to revolutionize medicine including the improved prevention, diagnosis, and treatment of numerous diseases. This discussion will summarize efforts over the past decade that ave synthesized novel nanoparticles, nanotubes, and other nanomaterials to improve medicine. Efforts focused on the use of nanomaterials to minimize immune cell interactions, inhibit infection, and increase tissue growth will be especially emphasized. Tissue systems covered will include the nervous system, orthopedics, bladder, cardiovascular, vascular, and the bladder. Materials to be covered will include ceramics, metals, polymers, and composites thereof. Self-assembled nanochemistries will also be emphasized. Lastly, efforts to examine nanoparticle toxicity as well as nanosensors for the real-time monitoring of biological responses in the body will be presented. Thus, this discussion will: • summarize recent advances in novel nanomaterials for medical devices; • emphasize novel properties of nano- and pico-technology derived materials for biosensor applications; and • identify how such materials can be used to decrease inflammation, infection and improve tissue growth",
    "Keywords": "No keywords available",
    "Publisher": "'Purdue University (bepress)'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Society of Engineering Science 51st Annual Technical Meeting1–3 October 2014Purdue University, West Lafayette, Indiana, USATransitioning from nanomedicine to picomedicineWebster, Thomas, th.webster@neu.edu, NortheasternABSTRACTInspired from biological systems, nanotechnology (and more recently, picotechnology) is beginning to revolution-ize medicine including the improved prevention, diagnosis, and treatment of numerous diseases. This discussion will summarize efforts over the past decade that ave synthesized novel nanoparticles, nanotubes, and other nano-materials to improve medicine. Efforts focused on the use of nanomaterials to minimize immune cell interactions, inhibit infection, and increase tissue growth will be especially emphasized. Tissue systems covered will include the nervous system, orthopedics, bladder, cardiovascular, vascular, and the bladder. Materials to be covered will include ceramics, metals, polymers, and composites thereof. Self-assembled nanochemistries will also be em-phasized. Lastly, efforts to examine nanoparticle toxicity as well as nanosensors for the real-time monitoring of biological responses in the body will be presented.Thus, this discussion will:• summarize recent advances in novel nanomaterials for medical devices;• emphasize novel properties of nano- and pico-technology derived materials for biosensor applications; and• identify how such materials can be used to decrease infl ammation, infection and improve tissue growth.",
    "Link": "https://core.ac.uk/download/77937126.pdf"
}