{
    "Title": "10 Key Reading Practices for All Elementary Schools With Strong Evidence of Effectiveness From High-Quality Research",
    "Authors": "The Meadows Center for Preventing Educational Risk",
    "Year": "No year available",
    "Abstract": "The third installment of MCPER's new \"10 Key\" series, this document distills the latest research findings into 10 easy-to-follow recommendations that states, school districts, and schools can use to improve elementary students' reading outcomes. Also included are descriptions of what students should know and be able to do at the elementary grade levels.Educatio",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "All elementary students can become proficient readers if:1. Students are taught to listen for, distinguish, and manipulate sounds in spoken words; match these sounds to letters and word parts; and use this knowledge to read unfamiliar words in text quickly and accurately.2. Students are taught to read high-frequency words automatically and given daily opportunities to apply this knowledge to reading and comprehending text.3. Students read and respond to a variety of complex texts (e.g., literary, informational) every day across subject areas and receive detailed feedback. Students are taught to identify errors in word reading and understanding and to use practices to self-correct these errors (e.g., rereading text to gain better comprehension). 4. Students are taught the meaning of academic words and other unfamiliar vocabulary words used in oral and written language.5. Students are taught reading comprehension practices (e.g., paraphrasing information in text) and ways to flexi-bly apply these practices to reading and understanding a variety of literary and informational texts.6. Students are provided daily opportunities to incorporate learned reading practices (e.g., word meaning practic-es, comprehension practices) to read and understand a variety of texts.7. Students listen to, read, understand, and critically analyze a variety of complex text types of content-specific (e.g., history) and general (e.g., story about overcoming challenges) topics. 8. Students are taught, within meaningful contexts, the connections between reading, writing, listening, and speaking to develop deep knowledge of oral and written language and its structure, meaning, and purpose. 9. Students are provided opportunities to access a variety of high-interest texts and build motivation to read for enjoyment and to learn new information.10. Student learning is continually supported and measured to inform new and challenging reading goals for ongoing reading progress.10 Key Reading Practices for All Elementary Schoolswith strong evidence of effectiveness from high-quality research—including grade-level descriptions of what students should know and be able to do—© 2016 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0Grade-Level DescriptionsBelow, we describe what students at the elementary grade levels should know and be able to do to be considered suc-cessful readers. Regardless of grade level, all students benefit from frequent opportunities to read, listen to, and discuss a variety of literary and informational texts. In addition, all students benefit from explanations of unfamiliar, sophis-ticated language often seen in text across content areas. Hearing others “think aloud” about a text and students prac-ticing thinking critically about a text with teacher feedback help to grow the ability to understand a variety of texts. Students of all ages should be encouraged to read for enjoyment, to read to learn new information, and to discuss what they are reading with others. By the end of kindergarten, students can distinguish in-dividual sounds in spoken words, including identifying the first sound or the ending part of a spoken word. Students understand the connections between spoken words, indi-vidual sounds, and written language and know the names and most frequent sounds of the uppercase and lowercase letters. Students can read simple words by using the letter sounds and can read common words (e.g., was) quickly and accurately. Students know the organization of print—that writing goes from left to right, top to bottom, page by page—and the features of books (e.g., front, back, title page, illustrations, print). Students read short texts daily with pur-pose and understanding and listen to and discuss a variety of age-appropriate books. Students know the meaning of words in text and can categorize words conceptually (e.g., words related to colors). Students can ask and answer questions about key details and upcoming events or information in text. They also can identify the main topic and retell the key details in texts with assistance. Students can make connections between text topics and their personal experiences and can make inferences or draw conclusions, providing evidence from text to demonstrate their understanding.By the end of first grade, students can distinguish indi-vidual sounds in more complex spoken words (i.e., words with more sounds) through activities such as producing the individual sounds in a spoken word (e.g., /l/ /o/ /s/ /t/ are the sounds in lost) or recognizing when a spoken word has been changed by a sound being added, changed, or removed (e.g., when the sound /b/ is added to the word and, it makes the word band). Students can read unfamiliar words by using more advanced letter-sound relationships and patterns, such as two or more letters in a word making one sound (e.g., ea in the word eat) or smaller words within larger ones (e.g., the word toys is the word toy with a plural –s ending). Students increase the number of high-frequency or common words they can read quickly and accurately. Students recognize the parts of sentences (e.g., capitalization, ending punctuation) in a text, distinguish information provided by pictures from information provided by words, and recognize evidence about whether a story is true or fantasy. Students read grade-level text daily with accuracy, appropriate rate, purpose, and understanding. Students monitor their reading for word reading accuracy and understanding. Students know the meanings of unfamiliar, common words in grade-appro-priate text and can sort words into more advanced conceptual categories (e.g., living things). Students can identify the main idea, retell important details in sequential order, and ask questions to check their understanding of text. Students can describe characters in text, identify the reasons for their actions or feelings, and note sensory details provided in © 2016 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0text. Students continue to learn to make inferences, draw conclusions, and make connections between ideas and infor-mation in a variety of literary and informational texts, providing evidence from the text to demonstrate their under-standing. Students can use the features of a text (e.g., table of contents) to locate information in it. By the end of second grade, students can read multisyllable words by using their knowledge of letter-sound relation-ships and common prefixes (e.g., un– in the word undo) and suffixes (e.g., –ful in the word useful). Students can read words that have irregular or low-frequency sound patterns. Students continue to increase the number of high-frequen-cy or common words they can read quickly and accurately. Students know the meaning of common prefixes and suffixes and how to use them to determine word meaning. Students use context to determine the meaning of unfamiliar or mul-tiple-meaning words in text. Students read grade-level text daily with accuracy, appropriate rate, purpose, and under-standing while monitoring their reading for word reading ac-curacy and understanding and making corrections. Students continue to learn to make inferences, draw conclusions, and make connections between ideas and information in a variety of grade-appropriate literary and informational texts, including identifying dialogue and literal and nonliteral meaning in text, providing evidence from the text to demonstrate their understanding. Students can identify moral themes of text, compare and contrast key details in different versions of a text, and distinguish fiction from nonfiction. Students ask questions about text, locate key details in text, support answers with evidence from text, paraphrase the information read while maintaining meaning, and use the information to make and confirm predictions. Students can describe the motivations and feelings of key characters, make connections between characters and events in a story, and recognize a character’s point of view.By the end of third grade, students continue to improve their ability to read multisyllable words by using let-ter-sound knowledge and rules of English spelling (e.g., dropping the final e when adding –ing to the word use to make using). Students continue to read grade-appro-priate irregularly spelled words. Students read a variety of grade-level text daily with accuracy, appropriate rate, purpose, and understanding while monitoring their reading for word reading accuracy and understanding and making corrections. Students identify how prefixes and suffixes can change the meaning of words. Students continue to learn the meaning of unfamiliar, grade-level words and how to use context to determine the meaning of unfamiliar words, multiple-meaning words, and similarly spelled words that have different meanings (e.g., bow and bow). Students continue to learn to make inferences, draw conclusions, and ask questions to seek clarification and make connections between ideas in a variety of grade-appropriate literary and infor-mational texts. Students can paraphrase key themes with supporting details and explain how they affect future events. Students can identify key details presented through dialogue and identify information presented through first- or third-person point of view. Students can identify key features of various texts that create imagery or visual experiences for the reader and can identify cause-and-effect relationships among ideas presented in text. Students can identify an author’s purpose and can determine what the author is trying to tell the reader or persuade the reader of as well as how this information may differ from the students’ own point of view.© 2016 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0By the end of fourth grade, students can apply their combined knowledge of letter-sound correspondences, syllables, and word parts to read unfamiliar multisyllable words. Students can read a variety of grade-level text with accuracy, appropriate rate, purpose, and understanding, monitoring their reading for word reading accuracy and understanding and making corrections. Students continue to learn the meaning of grade-appropriate academic and content-specific words and phrases, including English words derived from Latin, Greek, or other word parts. Stu-dents can use a dictionary, glossary, or electronic resources to determine meanings and pronunciation of unfamiliar words. Students summarize, make inferences, draw conclu-sions, and explain a variety of text content using key details and evidence from the text. Students understand authors’ use of similes, metaphors, and common idioms. Students distinguish facts from opinions in text, use text to verify facts, and distinguish between stated and implied purposes. Students can analyze text and compare and contrast across texts regarding characters, interactions among characters and events, and how the author chooses to present information to a reader, including text structure.By the end of fifth grade, students continue to use their combined knowledge of letter-sound correspondences, syllables, and word parts to accurately read unfamiliar mul-tisyllable words. Students can read a variety of grade-level texts with accuracy, appropriate rate, purpose, and un-derstanding, monitoring their reading for word reading accuracy and understanding and making corrections. Students continue to learn the meanings of unfamiliar grade-appropriate academic and content-specific words and phrases, including English words derived from Latin, Greek, or other word parts. Students use resources such as dictionaries, thesauruses, and electronic resources to deter-mine word meanings, related words, and pronunciations. Students continue to learn word relationships such as ant-onyms, synonyms, and analogies. Students compare and contrast text themes across fictional works and across cultures. Students make connections between literature and the historical events of the time. Students analyze original texts and adaptations; examine how stories build from beginning to end, including foreshadowing and character roles; and evaluate different points of view or accounts of events in texts. Students can critically analyze the written structure of text, including sensory details, imagery, figurative language, how organizational patterns (e.g., cause and effect, compare and contrast) affect the connections among ideas, and ways in which authors achieve their purpose. Students identify and use accurate evidence from text, including quotes, to explain text meaning. Students use the critical analysis of two or more texts to integrate information across texts.—www.meadowscenter.org—© 2016 The University of Texas at Austin/The Meadows Center for Preventing Educational Risk Licensed under Creative Commons BY-NC-ND 4.0",
    "Link": "https://core.ac.uk/download/211331277.pdf"
}