{
    "Title": "Review Of  The Post-Cold War Trading System: Who\\u27s On First?  By S. Ostry",
    "Authors": "Golub, Stephen S.",
    "Year": "No year available",
    "Abstract": null,
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Swarthmore College Works Economics Faculty Works Economics 12-1-1997 Review Of \"The Post-Cold War Trading System: Who's On First?\" By S. Ostry Stephen S. Golub Swarthmore College, sgolub1@swarthmore.edu This work is brought to you for free and open access by . It has been accepted for inclusion in Economics Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. Follow this and additional works at: https://works.swarthmore.edu/fac-economics  Part of the Economics Commons Let us know how access to these works benefits you  Recommended Citation Stephen S. Golub. (1997). \"Review Of \"The Post-Cold War Trading System: Who's On First?\" By S. Ostry\". Journal Of Economic Literature. Volume 35, Issue 4. 2058-2059. https://works.swarthmore.edu/fac-economics/73 American Economic AssociationThe Post-Cold War Trading System: Who's on First? by Sylvia OstryReview by: Stephen S. GolubJournal of Economic Literature, Vol. 35, No. 4 (Dec., 1997), pp. 2058-2059Published by: American Economic AssociationStable URL: http://www.jstor.org/stable/2729898 .Accessed: 19/11/2014 12:23Your use of the JSTOR archive indicates your acceptance of the Terms & Conditions of Use, available at .http://www.jstor.org/page/info/about/policies/terms.jsp .JSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range ofcontent in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new formsof scholarship. For more information about JSTOR, please contact support@jstor.org. .American Economic Association is collaborating with JSTOR to digitize, preserve and extend access to Journalof Economic Literature.http://www.jstor.org This content downloaded from 130.58.65.13 on Wed, 19 Nov 2014 12:23:43 PMAll use subject to JSTOR Terms and Conditions2058 Journal of Economic Literature, Vol. XXXV (December 1997) that will promote economic efficiency and welfare. As Krauss emphasizes, trade protec- tion is certainly not the way to go. Krauss is hypercritical of the programs of foreign economic and military aid that the United States has provided to Western Europe (and Japan?), to the less developed countries, and more recently to countries making the transition from central planning to a market-based economy. He argues that all these programs have inevitably failed either because they were misguided in pur- suit of egalitarianism or condoned ineffective policies in the recipient countries. In his view, a great deal of money could have been saved if the United States had been much less generous and insisted on market-based incen- tives, restructuring, and de-emphasis of gov- ernment-supported programs. In retrospect, many of Krauss' criticisms are well taken, al- though at times he rails too much against the ideas of historical men of influence and fails to take into account the complex tides of his- tory and the politics of times past. In his concluding chapter, Krauss ad- dresses issues of regionalism, focusing on the European Union and NAFTA. He criticizes the pursuit of economic and monetary inte- gration in Europe on the grounds that it serves to reinforce the centralized influence and power of the European Commission and that insufficient encouragement is being given to increasing imports from Eastern Europe. He thus downplays here again the role of history and especially the political dy- namics that underlie the desire of the Euro- peans to achieve greater harmony in their re- lationships so as to overshadow the deep conflicts of the past. In contrast, his view of NAFTA seems more benign. He argues that it will bring about wage convergence so as to resolve the problems of U.S.-Mexican migra- tion, and that the extension of NAFTA to the rest of the Western Hemisphere will be a stepping stone toward global free trade. Here I found it curious that he did not discuss the role that the WTO might play in fostering multilateral trade liberalization rather than taking this detour through regional trading blocs. ROBERT M. STERN University of Michigan, Ann Arbor The post-cold war trading system: Who's on first? By SYLVIA OSTRY. London and Chicago: University of Chicago Press, 1997. 330 pages. $45.00. ISBN 0-226-63789-1. Sylvia Ostry does not directly answer the question in the title until the final page. But the answer is never in doubt: the dominance of the United States emerges starkly in this insightful and engrossing chronicle of post- war international trade negotiations. Ostry's lively historical account reveals how Ameri- can interests and beliefs have shaped virtually all aspects of the postwar trading system, from the creation of the General Agreement on Tariffs and Trade (GATT) to the com- pletion of the Uruguay Round. As the former head of the Canadian delegation at the Uruguay Round, she displays a com- manding knowledge of trade policy develop- ments and presents a concise, balanced, and incisive bird's eye view of the forces at work. Ostry shows how American reluctance to cede any sovereignty to international organi- zations-so evident today-led to the failure to implement the International Trade Organi- zation, which was to have been a much more powerful and encompassing organization than the GATT. Numerous exceptions and escape clauses were built into the GATT to make it acceptable. Nonetheless, American-led trade liberalization under the auspices of the GATT provided a huge boost to Europe and Japan. But the limited powers of the GATT set the stage for subsequent problems. At first, United States dominance of the world econ- omy allowed it to accept lack of reciprocity by other countries in liberalizing trade. But by the 1970s, the tremendous growth of Japan, seemingly abetted by industrial policy, along with stagflation at home, spawned American complaints about the GATT's toothlessness in the face of other countries' \"unfair\" practices. The United States responded with both unilateral and multilateral initiatives. The former manifested itself as the \"New Protec- tionism,\" consisting mainly of voluntary ex- port restraints on Japanese imports, while the latter was reflected in the agenda of the Tokyo Round of trade negotiations- non-tariff barriers, the European Common Agricultural Policy, government procurement. This content downloaded from 130.58.65.13 on Wed, 19 Nov 2014 12:23:43 PMAll use subject to JSTOR Terms and ConditionsBook Reviews 2059 The Tokyo Round achieved little, however, and U.S. frustration escalated in the 1980s. Although stagflation eased, the ballooning U.S. trade deficits provided macroeconomic fuel for the microeconomic complaints about predatory Japanese behavior. Pressure for stronger unilateral actions culminated in the enactment of the infamous Super 301 provi- sion of U.S. trade law, which authorized re- taliation against countries for a wide range of \"unfair\" trade practices. While Ostry con- demns Super 301 as a dangerous threat to a rules-based system, she points out that its ef- fects were limited due to the executive branch's reluctance. The threat of stronger U.S. measures may have helped persuade other countries to accede to U.S. pressure for a new and more ambitious round of trade ne- gotiations, the Uruguay Round. Unlike the Tokyo Round, Ostry views the Uruguay Round as a major achievement, no- tably the agreements on services and intellec- tual property rights, and the creation of the World Trade Organization (WTO). In re- sponding to American concerns and tackling some of the thorny issues raised by \"deeper integration,\" the Uruguay Round revived multilateralism and diminished the appeal of regional trade agreements, which Ostry dis- misses as a \"fad\" that has \"gotten out of hand\" (pp. 203-04). The WTO considerably en- hances the weak dispute settlement powers of the GATT. The familiar American ambiva- lence towards international organizations nearly blocked ratification of the Uruguay Round, and in 1995 U.S. threats of punitive tariffs on Japanese luxury car imports in re- sponse to alleged lack of access to the Japa- nese car market posed a potentially fatal threat to the WTO. Ostry argues that the world trading system must make continued albeit incremental progress on issues such as foreign investment, competition policy, and regulatory reform to create a global \"level playing field,\" while navigating the shoals of \"system frictions\" related to differences in economic structures and cultures. The analysis of the world economy is not as convincing as the discussion of trade policy. For example, Ostry stresses the \"enormous\" American investment in Europe beginning in the 1950s (p. 29), but Table 2.3 reports only nominal investment flows, providing little idea of how rapidly such flows increased in real terms or how large they loomed relative to European capital stocks. Many tables and fig- ures are dated and only loosely related to the thread of the argument. The view that China's economic emergence is \"the most formidable challenge the Western powers have ever faced\" (p. 211) is surely an exaggeration. Did America undermine its own domi- nance by promoting European and Japanese reconstruction through unilateral trade liber- alization and technology transfer? Ostry equivocates. She seems to concur with argu- ments that early American nurturing of the Japanese economy was a \"disaster\" (p. 48), because it did not require reciprocal Japanese liberalization. She approvingly quotes Ray- mond Aron's statement \"As the predominant economy, America had the advantage from its trading partners' point of view of believing in freedom and communication rather than in secrecy and bureaucracy\" (p. 26). When dis- cussing the 1990s, however, Ostry accepts the current conventional wisdom that Japan and Europe are at a disadvantage relative to the more free-wheeling and flexible American system. Her enthusiasm for \"deeper integra- tion\" may also be overdone. After all, com- parative advantage is based on economic di- versity. Moreover, regulatory harmonization may often be unnecessary to provide foreign and domestic firms with equal market ac- cess-the traditional GATT principle of na- tional treatment is sufficient. Despite these questions, Ostry has provided a sophisticated and illuminating look at the paradoxes of American trade policies and their global con- sequences. STEPHEN-S. GOLUB Swarthmore College G Financial Economics The economics offinancial markets. By HENDRIK S. HOUTHAKKER AND PETER J. WILLIAMSON. New York and Oxford: Oxford University Press, 1996. Pp. xiii, 361. $39.95. ISBN 0-19- 504407-X. JEL 97-0127 The Economics of Financial Markets is an outstanding book about financial markets. This content downloaded from 130.58.65.13 on Wed, 19 Nov 2014 12:23:43 PMAll use subject to JSTOR Terms and Conditions",
    "Link": "https://core.ac.uk/download/84121878.pdf"
}