{
    "Title": "Tunable resistive pulse sensing: potential applications in nanomedicine",
    "Authors": "Mark Platt (1257804), Muttuswamy Sivakumaran (4960780)",
    "Year": "No year available",
    "Abstract": "An accurate characterization of nanomaterials used in clinical diagnosis and therapeutics is of paramount importance to realize the full potential of nanotechnology in medicine and to avoid unexpected and potentially harmful toxic effects due to these materials. A number of technical modalities are currently in use to study the physical, chemical and biological properties of nanomaterials but they all have advantages and disadvantages. In this review, we discuss the potential of a relative newcomer, tunable resistive pulse sensing, for the characterization of nanomaterials and its applications in nanodiagnostics",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "Tunable Resistive Pulse Sensing: Potential Applications in Nanomedicine \nMuttuswamy Sivakumaran1* Mark Platt2 \n1. Department of Haematology, Peterborough City Hospital, Peterborough, PE3 \n9GZ, UK \n2. Department of Chemistry, Loughborough University, Loughborough, LE11 3TU, \nUK. \n* contact info and your email as corresponding author? \n \nAbstract \n \nAn accurate characterisation of nanomaterials used in clinical diagnosis and \ntherapeutics is of paramount importance to realise the full potential of \nnanotechnology in medicine and to avoid unexpected and potentially harmful toxic \neffects due to these materials. A number of technical modalities are currently in use \nto study the physical, chemical and biological properties of nanomaterials but they all \nhave advantages and disadvantages. In this review, we discuss the potential of a \nrelative newcomer, Tunable Resistive Pulse Sensing (TRPS), for the \ncharacterisation of nanomaterials and its applications in nanodiagnostics.   \n \nKeywords: Tunable Resistive Pulse Sensing, TRPS, nanotechnology, nanomedicine, \nnanodiagnostics, nanoparticles, aptamers, exosomes, biosensors. \n \n \nIntroduction \n \nNanomedicine, a branch of Nanotechnology, despite it being a relatively new \ndiscipline, has already shown great promise in the areas of in-vitro medical \ndiagnostics, in-vivo imaging, regenerative medicine, drug development and delivery \n[1-3]. The unique properties of nanomaterials (size, high surface to volume ratio, \nsurface characteristics and functionality) make them ideally suited for biosensors and \nfor targeted drug delivery. The size of the nanomaterial gives a distinct advantage in \nthat a drug could be transported across physiological barriers such as blood brain \nbarrier. Furthermore, the relative ease by which nanomaterials could be linked with \nvarious biomolecules such as antibodies or ligands, to precisely target and deliver a \ndrug to a particular organ or tissue is a major advantage of this technology. Such \nprecise targeting can greatly reduce systemic toxicity. Another unique feature of this \ntechnology is that a nanopharmaceutical could be constructed to carry not only a \ndrug but also a sensor to enable visualisation of the diseased tissue by imaging and \nalso achieving targeted delivery of a drug.  This combined therapeutic and diagnostic  \napplication (dubbed 'Theranostics') is fast becoming a reality. \n \nIt must, however, be emphasised that despite the great potential of nanomaterials in \nmedicine, in order to realise their full potential, they must be fully characterised [4]. \nThe size, shape and surface charge of the nanomaterials must be accurately \nanalysed. In addition, detailed evaluation to study the fate of nanopharmaceuticals \nfollowing systemic administration must be carried out. These evaluations must \ninclude stability of the nanomaterial in body fluids and tissues i.e. whether they \nundergo any disintegration in biological fluids that may result in significant change to \ntheir properties. Conversely the nanomaterial may coalesce to form larger particles \nwith different properties or form aggregates with altered functions. In addition, \ndetailed analysis into how nanopharmaceuticals interact with the components of \nbody fluids such as blood must be carried out. In particular, the interaction with \nvarious plasma proteins, lipids and other biomolecules, change in the surface charge \n(zeta potential) and the 'corona' effect must be studied. Methods to study interaction \nof nanopharmaceuticals with various blood cells to find out whether they passively \nadsorb onto cells or actively bind to a cell surface due to upregulation of various \ncellular adhesion molecules, whether the nanomaterial causes significant activation \nof any cell (eg. neutrophils, monocytes, lymphocytes, platelets and vascular \nendothelial cells) and whether the nanomaterial causes any cell membrane damage \nresulting in increased permeability or cell lysis must be established. \n \nThere is a range of techniques that are being used to study the physico-chemical \ncharacteristics of various nanomaterials (Box 1). They all have advantages and \ndisadvantages and not a single technique that will be able provide all the information \nrequired exists. A recent addition to this diagnostic array is Tunable Resistive Pulse \nSensing which is a variant of the much established technology of Resistive Pulse \nSensing (RPS).  \n Analytic techniques for characterisation of nanomaterials \n \nMicroscopy \n High resolution Optical Microscope \n Confocal Microscope \n Multiphoton Microscope \n 4Pi Microscope \n Cyto Viva Microscope  \n Magnetic Resonance Force Microscope (MRFM) \n Fluorescence Microscope \n Scanning Electron Microscope (SEM) \n Transmission Electron Microscope (TEM) \n Freeze Fracture Transmission Electron Microscope (ffTEM) \n Scanning Tunnelling Microscope (STM) \n Atomic Force Microscope (AFM) \n Scanning Near-Field Optical Microscope (SNOM) \n \nResistive Pulse Sensing \n High-resolution flow cytometry \n \nDiffraction techniques \n X-ray Defraction \n Electron Defraction \n Neutron Defraction \n Small Angle X ray Scattering (SAXS) \n Small Angle Neutron Scattering (SANS) \n Dynamic Light Scattering (DLS) \n \nNanoparticle Tracking Analysis (NTA) \n  \nSpectroscopy \n Optical absorption spectrometer \n UV spectrometer \n Infrared spectrometer \n Dispersive infrared spectrometer \n Fourier transform infrared spectrometer \n Raman spectroscopy \n UV photoelectron spectroscopy \n Auger electron spectroscopy \n \nMagnetic measurements \n Vibrating sample magnetometer (VSM) \n \nBox 1. Analytic techniques for characterisation of nanoparticles. \n(Source: Kulkarni SK [5], Jain KK [2]) \nResistive Pulse Sensing \n \nThe technique of resistive pulse sensing (RPS) to enumerate particles in solution \nwas first developed by Wallace. H. Coulter in early 1950s [6]. The principle of this \ntechnique is that when a particle traverses through a channel filled with aqueous \nelectrolyte solution, there is a transient change in the channel's ionic resistance \nknown as a 'resistive pulse'. As envisioned by Coulter, this technology was soon \nadopted for rapid counting of particles in biological fluids in particular in the field of \nHaematology where it is extensively used for enumeration of blood cells. \nSubsequently, in the 1970s, this technique was adapted for counting microorganisms \nincluding viruses and bacteriophages by de Blois and colleagues [7]. They were able \nto accurately size several type C oncorna viruses and T2 bacteriophages with a \ndetection limit of 5x107 viruses per ml. \n \nA landmark development of a method to detect single stranded DNA using biological \nalpha-haemolysin pore by Kasianowicz et al in 1996 [8] with a promising potential of \nDNA sequencing reignited interest in resistive pulse sensing technology. This \ndevelopment together with the on-going rapid growth in nanotechnology based \nresearch and applications resulted in the resurgence of RPS based techniques for \nparticle characterisation [9-11]. \n \nA variety of materials including carbon nanotubes [9], polydimethylsiloxane (PDMS) \n(Saleh OA & Sohn LL, 2002), glass (Lan et al, 2011], silicon [12] and polycarbonate \n(Sexton LT et al, 2007; Lee et al, 2004) have been used in RPS devices. \nOne of the major attributes of the RPS technology is its ability to provide valuable \ninformation on individual particles within their environment [12-13]. Hence, this \ntechnology has been used to study a variety of parameters including concentration, \nsize, charge and conductivity of diverse type of  particles, naturally occurring such as \npeptides, proteins, nucleic acids, cell derived particles (exosomes) and biomolecular \ncomplexes or man-made organic or inorganic nanomaterials, in different situations \nwith exquisite resolution [9, 11-12, 14-16]. \n \n \nTunable Resistive Pulse Sensing (TRPS) \n \nTRPS is an adaptation of RPS in which utilises a conical tunable elastomeric pore \nthat can be stretched or relaxed to change the pore size to suit the sample [11, 13, \n15-19]. Tunable pore membranes are made of thermoplastic polyurethane and the \npores are introduced by mechanical puncture. The concept of tunable nanopore \nmembrane was first developed by Sowerby [20]. The membrane can be stretched in \na biaxial direction to alter the pore size. The size of the pore can be altered as much \nas an order of magnitude [17]. \n \n \nPrinciple of Tunable Resistive Pulse Sensing \n \nThe instrument associated with TRPS is produced by the company Izon Science, \nand as with standard RPS equipment two fluid reservoirs are to be filled with a \nconducting electrolyte solution. In the setup the pore is mounted horizontally and \nreservoirs oriented above and below the pore membrane, with the sample typically \nplaced into the top reservoir, see figure 1.  \n \n \n \nFigure 1 A. Sectional schematic of a pore. The sample is typically placed into the \nupper fluid cell. B. Example of baseline current and “blockade” events (current dips) \nthat are each caused by an analyte traversing the pore. Each event is analysed for \nfull width half maximum (FWHM) duration and Δip. C. The Izon qNano instrument, \nshowing the fluid cell and location of crucifix plastic membrane. \n \n \nApplications of Tunable Resistive Pulse Sensing \n \nTRPS technology has a number of merits. The pore tunability offers flexibility in \nanalysing particles of broad size range (40nm-10um). It enables particle by particle \nmeasurement of size and surface charge of individual particles simultaneously. it can \nalso analyse particle aggregation and stability. It works with physiological strength \nbuffers, provides high resolution data points, large number of data points and \nrequires no software-induced data manipulation. It is relatively inexpensive off the \nshelf instrument requiring a few consumables and not needing carrier gases, fluidics \nor optics. \n \n \nTRPS in Nanoparticle Counting \n \nAs particles/analytes translocate the pore they temporarily occlude ions, leading to a \ntransient decrease in current known as a “blockade event”, examples of which can \nbe seen in figure 1b. The pulse frequency, J, is related to the concentration of the \nanalyte, Cs, multiplied by the velocity of the traversing particle, vp (ignoring \ncontributions from diffusion). The velocity term is the sum of the fluidic, vF, \nelectrophoretic, vE, and electroosmotic, vO, velocities, i.e. vp = vF + vE + vO. Here we \ntypically ignore the contribution from diffusion due to the magnitude of other forces \nand end effects are not taken into account in the analysis. vp can be written as; \n \n                (1) \nWhere         (1a) \n and   are the permittivity of the solution and kinematic viscosity respectively, P \nis the pressure across the pore, pore and particle  are the zeta potential of the \nchannel surface and particle respectively, and E is the electric field.  \n \nTRPS in Nanoparticle Size Analysis \n \nThe pores in the TRPS system are conical in shape and give rise to an asymmetric \ncurrent pulse, figure 1b [21]. For a conical pore, the change in the resistance, ΔR, \nacross the length of the pore. L, is given by equation 2 [22].  \n \n                                                              (2) \nwhere ρ is the resistivity of the electrolyte that is filling the pore, A(z) is the cross \nsectional area perpendicular to the pore axis z and R is the pore resistance. When \nno blockage is present, R is given by equation 2,<sup>1</sup> \n   (3) \nWhere DL and DS are the largest and small pore diameters. When a particle traverses \nthrough the pore, a blockade event is observed. This blockade is created by the \nparticle displacing a volume of electrolyte which in turn increases the resistance in \nthe circuit, temporarily lowering the current. The blockade magnitude can then be \nused to size the particles or analyte as the magnitude of the increased resistance is \ndirectly related to the size of the analyte.  \n \nIt must be noted that, unlike solid state pores where the size of the pore is always \nknown, the tunable pore must first be characterised before users can accurately \ndetermine the size of the analyte using TRPS. This is done easily using calibration \nbeads of a known size with a narrow size distribution amongst a sample population, \nand must be done prior to sample analysis and under the same conditions. \n \nA number of different techniques are available for the measurement of nanoparticle \nsize (Box 1). Some of which (dynamic light scattering (DLS), small angle X ray \nscattering (SAXS) and static light scattering (SLS)) are termed 'Batch Particle Size \nMeasurement methods because they perform size dispersion analysis of particles on \nthe whole population ('batch'). On the other hand, techniques such as microscopy \nincluding electron and atomic force microscopies, Nanoparticle Tracking Analysis \n(NTA) and TRPS carry out single particle by particle measurement and are \ncollectively called Single Particle Size Measurement methods. In a recent study, \nVarenne and co-workers (ref) evaluated nine different techniques in carrying out \nparticle size distribution (PSD) of multimodal dispersion of nanoparticles. Their study \nshowed that while single particle size measurement methods accurately determined \nthe PSD, none of the batch particle size measurement methods was able to \ncharacaterise the complex PSD (Figure 2) \n \n \n \n \nFigure 2. Summary of the obtained PSD from the dispersion of PIBCA nanoparticles \nanalyzed by different size measurement methods. Results from measurements \nperformed with single size measurement methods (AFM, TRPS, NTA) and methods \nbased on a separative process (AsFlFFF) are shown on the upper part of the graph. \nResults from measurements performed with batch size measurement methods \ncomprising different light scattering methods (SLS, DLS, PCCS) are summarized on \nthe lower part of the graph. * indicates a significant variation of the size position of \nthe corresponding detected population. Mean diameters were calculated from the \ndiameters of the population of nanoparticles with the corresponding size that was \ndetected in a ± 5% range (shown by the grey background) by at least 3 different \nmethods. Reprinted with permission from Pherm. Res (2016), 33: 1220-1234. \nCopyright Springer Science Business Media New York 2016 \n \nTRPS in analysis of shape and two/three dimensional geometric structures of \nnanoparticles \n \nThe majority of the work published to date has focused on spherical analytes or \nparticles. Some initial studies by Willmott and Platt [18] have shown that some \ninformation of length of asymmetric particles (cylinders) or clusters of spherical \nparticles can be extracted from peak width/ pulse duration. Other groups have also \nused the flexible TRPS pore to deform and characterise soft polymer like particles \n[23].  \n \n \n \nTRPS in analysis of particle aggregation \n \nAnalysis of particle aggregation forms the basis of a number of diagnostic platforms \nincluding biosensors and point of care devices. TRPS has been used successfully in \nthe detection of very low concentrations of analytes because of its ability to detect \nand enumerate particle aggregates that are formed as a result of binding between \nthe functionalised nanoparticles and the analyte. Examples of studies in which TRPS \nhas been used to detect nanoparticle aggregation are given in Table 1. \n \n \nParticle \nmaterial \nParticle size (nm) Surface function Analyte Analyte \nconcentration \nReference \nAu/Ni rods 1230 long x \n300 diameter \n1100 long x \n300 diameter \n \nAvidin (Ni) and  \nPEG (Au) \n \nAptamer (Ni) and  \nPEG (Au) \nBiotin \n \nPDGF \n~ 100 fM \n \n~ 100fM \n67 \nSPBs 3000 \n1000 \n300 \n \nAvidin \nAvidin \nStreptavidin \nBiotin \nBiotin \nBiotin  \n~ 1pM - 1nM \n~1 nM \n~1 nM \n68 \nAu 25 \n \nDNA DNA ~5 pM 69 \nAu 50 \n \nCitrate PNA ~5 nM 73 \nAu 30 \n35 \n \nAvidin \nDNA \nDNA 530 copies 98 \nMagnetic \nbeads \n1000 Protein RBCs ~107 per ml 99 \n \nTable 1. Particle aggregation studies using TRPS.   \nPEG = polyethylene glycol, PDGF = platelet derived growth factor, PNA = peptide \nnucleic acid, SPBs = superparamagnetic beads, RBCs = red blood cells. Adapted \nfrom Weatherall & Willmott, Analyst, 140, 3318-3334 (2015). [ref] \n \nTRPS in nanoparticle surface charge analysis \n \nEvident from equation 3 is the relationship between particle velocity and its zeta \npotential.  Zeta potential is defined as the electrostatic potential at the border \nbetween the diffuse layer and compact layer<sup>2</sup> or Stern layer [24] of a \ncolloidal system. Zeta potential is relative to surface charge of particles in \nsuspension and is often used as an indicator of colloidal stability.  The Smoluchowski \napproach supports that a particle’s zeta potential can be determined from its velocity \ntaking into account convective and electro osmotic forces, as well as the \nelectrophoretic mobility of the particle. The electrophoretic mobility is a measure of \nthe translocation time of the analyte through the pore under an applied electric field. \nIn their seminal paper Vogel and Willmott [25] developed a method of balancing the \nelectro osmotic and electrophoretic effects by balancing the pressure across the \npore allowing zeta potential values to be extracted from the resistive pulse. In a later \npublication Blundell et al [26], used a similar concept that was published by Arjmandi \net al [27] using pyramidal pores. Where a calibration based zeta potential method \nwas applied, based on the measurement of signal durations of translocation events \nas a function of voltage. The electrophoretic mobility is calculated from the derivative \nof medium particle velocity and applied electric field.  \n \nSikora and co-workers investigated the effects of adsorbed proteins from serum on \nthe size and surface charge of plain and aminated silica nanoparticles. The zeta \npotential was measured by electrophoretic light scattering (ELS) and TRPS (ref). \nThey reported that the particle-by-particle ζ-potential measurements by TRPS were \nconsistent with those performed with ELS and allowed a description of the ζ-potential \ndistribution within the samples \n \nTRPS in analysis of nanoparticle interaction with biomolecules \n \nIn biological fluids such as blood, the nanoparticles interact with the various \nconstituents such as cells and plasma proteins, potentially changing the particle \ncharacteristics. Proteins in blood bind to the surface of nanoparticles to form a \ncoating known as protein corona which can affect the interaction of nanoparticles \nwith the biomolecules [28-29]. The protein corona formation can affect the kinetics \nand dynamics of the nanoparticle in biological fluids thus modifying the \npharmacokinetics of nanopharmaceuticals. It is, therefore, imperative to study this \nphenomenon in detail.   \n \nBlundell and co-workers [30] studied the effects of plasma proteins albumin, \nfibrinogen and immunoglobulins on nanoparticle-protein corona formation using \n100nm silica nanoparticles and TRPS. Their study showed that TRPS could monitor \nthe kinetics of the protein corona forming on a particle and in particular what this \neffect then has on a nanoparticle's surface charge. The study also has shown that all \nthree proteins had an effect on nanoparticle mobility through the pore, indicating that \nthey are each forming protein-nanoparticle interactions. The researchers then went \non to study the effects of plasma proteins on protein corona dynamics by studying \nchanges in the zeta potential by TRPS [26]. TRPS promises to be a valuable tool to \ninvestigate this phenomenon of protein corona formation and its effect on \nnanoparticle kinetics in fluids, and other work by Shard et.al (ref) has compared the \nTRPS system with DLS for corona formation, shown in figure 2 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 2. Normalized number-weighted particle size distributions of plain (A and C) and \naminated (B and D) silica NPs in Tris (A and B) and serum-based (C and D) medium after 24 \nh incubation measured by DLS, DCS, and TRPS. DCS measurements are plotted assuming \na densities of 2.0 and 1.125 g/cm3 for the silica and the protein layers, respectively. \nReprinted with permission from Langmuir  2016, 32, 2216-2224. Copyright © 2016 American \nChemical Society [ref] \n \n \n \nTRPS in the analysis of nanoparticle-bound DNA interactions with \nbiomolecules \nParticle bound oligonucleotides are incorporated into many assay platforms for DNA \nsequencing, study of DNA-protein interactions, biosensing and drug delivery [31]. \nOver the last few years TRPS has been used to study the interactions between \nnanoparticle-bound DNA and various biomolecules by detecting changes in the \nparticle size or surface charge due to the binding of the biomolecules to the DNA or \nformation of aggregates [32]. \nInitially TRPS was used to identify binding of a 16nm long, 48 kbp double stranded \nDNA to silica nanoparticles by studying the changes in the surface charge [13]. DNA \nbinding resulted in a reduction of surface charge without any discernible change in \nsize. Subsequently, Booth et al [33] studied specific interaction between a 23 bp \nDNA fragment that was functionalised onto carboxylated dextran based magnetic \nparticles, to its complementary target using TRPS. The hybridization of the particle \nbound DNA to its target sequence caused an increase in the surface charge as \nindicated by a rise in zeta potential.  \nSingle Nucleotide Polymorphism (SNP) analysis forms a basis of clinical diagnosis \nand disease monitoring in certain diseases. An example is G487A mutation in \nglucose 6 phosphate dehydrogenase (G6PD) deficiency that causes haemolytic \nanaemias. Ang and Yung [34] has developed a label-free detection method to rapidly \nidentify single base pair mismatch in G6PD deficiency. They used two sets of 25nm \ngold particles with two different sized (18 and 100bp length) single stranded DNA \nfragments that are complementary to the different ends of a target attached onto \nthem. Hybridization of the particle bound DNA with the target sequence formed \ndifferent sized aggregates (dimers, trimers, tetramers and pentamers), shown in \nfigure 3. These aggregates produced different sized pulses on TRPS. The sensitivity \nof this assay in detecting target DNA was between 5.0pM to 2.5nM and a result \ncould be produced in 30 minutes. \n \nFigure 3 Schematic illustration of nanopore-based single-nucleotide detection using \na nAu-DNA probe. The ssDNA sequences on nAu-100b and nAu-18b probes were \ndesigned to be complementary to the mutant (mut) sequence and single mismatched \nto the wild-type (wt) sequence. In the presence of a perfectly matched (PM) target, a \nwell-defined nanoparticle assembly, termed conjugate grouping, forms. Each distinct \nconjugate grouping is picked up as an individual signal (“Yes” signal) when it \ntranslocates the pore of the membrane from the trans to the cis side. Every \nsuccessful translocation activity is termed a blockade event, which is characterized \nby its blockade magnitude (Δi) and baseline translocation duration (Δt). When a \nsingle-mismatched (SM) target is added, the intermediate duplex structure is \nenergetically unstable and fails to form an assembly structure. The smaller-sized \nnAu-DNA probe does not result in an appreciable dip in baseline current (ic) and is \ntaken to produce a “No” signal. Reprinted with permission from ACS Nano, 2012, 6, \npp 8815–8823. Copyright (2012) American Chemical Society. [ref] \n \nYang et al [35] has reported a novel diagnostic assay for detection of the Panton-\nValentine leukocidin (PVL) DNA from methicillin-resistant Staphylococcus aureus \n(MRSA) using TRPS and loop-mediated isothermal DNA amplification (LAMP) in \ncombination with gold nanoparticles.  The researchers first amplified the PVL DNA \nfrom MRSA by LAMP using four primers. The amplified DNA was conjugated to gold \nnanoparticles of two different sizes (55 and 30 nm respectively) to generate dual \ngold nanoparticle assemblies. The detection and quantification of the agglomerated \ngold nanoparticles were performed by TRPS.  The researchers concluded that this \ntechnique is capable of detecting 500 copies of genomic DNA from the bacteria \nMRSA MW2 and the detection can be completed within two hours with a signal-to-\nreadout setup providing a valuable tool for MRSA detection in clinical laboratory \nsetting. \nKuhnemund and Nilsson [36] employed rolling circle amplification technique (RCA) \nto amplify the target DNA and TRPS to carry out label free detection of DNA \nproducts on magnetic particles. The target DNA molecules were detected by padlock \nprobes which were circularised by ligase reaction. The DNA-padlock probe complex \nwas captured on magnetic particles by sequence specific oligonucleotides and \namplified by RCA. TRPS was used to detect individual particles with amplified DNA \nproduct. The lower detection limit of this technique was 1fM with an assay time of \nunder one hour.  \nMore recently, Blundell et al [37] studied the changes in zeta potential of DNA \nmodified particles using TRPS. The high sensitivity of TRPS enabled them to resolve \nthe signals for single stranded and double stranded DNA fragments and detect small \nchanges in base length for oligonucleotides between 15 and 40 bases long and \ndiscriminate between partial and fully complementary target sequences. The authors \nnote that this technique has a potential application in sensors for monitoring \nnanoparticles in medical and environmental samples. \n \nTRPS in the analysis of nanoparticle bound aptamer interactions with \nbiomolecules \n \nAptamers are short single-stranded pieces of DNA or RNA capable of binding to \nanalytes with specificity and high affinity. Aptamers are generated through the \nprocess of SELEX (Systematic Evolution of Ligands by Exponential Enrichment) [38-\n39] or by CLADE (Closed Loop Aptameric Directed Evolution) [40]. More recent \ntechnologies to incorporate aptamers as the target capture probe are Resistive Pulse \nSensing [41] and its variant technology Tunable Resistive Pulse Sensing [42]. Rotem \nand colleagues [41] attached an aptamer for thrombin to ἀ-haemolysin nanopore and \nobserved the interaction between the aptamer and its target molecule thrombin by \nRPS. Using this approach, they were able to detect the target molecule at nanomolar \nconcentration. Platt and colleagues [42] were the first to utilise TRPS technology to \nstudy interactions between nanoparticle-bound aptamers and target molecules. They \nemployed a different strategy using an aptamer for platelet derived growth factor \n(PDGF) tagged on to cylindrical nanorods containing gold and nickel segments. \nEach rod was a 'bar code'.  They used TRPS to study the interaction between the \naptamer and the target molecule and observed that the pulse magnitude and FWHM \nwere specific to a particular shape of the resulting aggregate. They were able to \ndetect the target molecule at femtomolar concentrations.  \n \nFollowing on from this work, Billinge and Platt have developed a multiplexed, label-\nfree platform using aptamers and TRPS (AptaTRPS) for the detection of biomarkers \n[43]. The researchers tagged aptamers to vascular endothelial growth factor (VEGF) \nand platelet derived growth factor (PDGF) on to 120nm and 300nm streptavidin \nmodified superparamagnetic beads respectively, shown in figure 4. The binding of \nthe target molecules to the aptamers was analysed by TRPS. Interestingly, they \nwere able to observe binding of two proteins to their specific aptamers \nsimultaneously.  \n \n \n \n \nFigure 4: A bar graph comparing the average particle rates of 120 nm beads functionalised \nwith V7t1 as VEGF165 concentration increases with or without the addition of 10 nM PDGF-\nBB in the presence of 300 nm beads functionalised with anti-PDGF aptamer. B bar graph \ncomparing the average particle rates of 300 nm beads functionalised with anti-PDGF \naptamer as PDGF-BB concentration increases with or without the addition of 10 nM VEGF165 \nin the presence of 120 nm beads functionalised with V7t1. C 3D surface plot displaying the \neffect of PDGF and VEGF on particle rate of 120 nm beads. D 3D surface plot displaying the \neffect of PDGF and VEGF on particle rate of 300 nm beads.Reprinted with permission from \nBiosensors and Bioelectronics, Volume 68, 2015, 741–748. [ref] \n \n \n \n \n \n \n \n \nAlsager and co-workers [44] have designed a simple sensor to detect 17β-estradiol \nutilising an aptamer attached to the surface of 217nm sized carboxylated polystyrene \nnanoparticles. The interactions between the aptamer conjugated nanoparticle and \nthe target molecule were studied by TRPS and DLS. Resistive pulse sizes increased \nwith the attachment of the aptamer. Binding of the target to the aptamer resulted  in \ndecrease in the pulse size due to conformational change. The detection limit of this \nsensor system was reported to be in the lower nanomolar range. \n  \n \nTRPS in extracellular vesicles analysis \n \nExtracellular vesicles (EVs) are lipid bilayer membrane vesicles secreted by most \nliving cells. The generation and release of EVs from living cells is a physiological \nprocess that occurs during cell growth and activation without affecting cell viability \n[45-46]. Extracellular vesicles (ECVs) are generated either at the plasma membrane \n(microvesicles) or within endosomal structures (exosomes). ECVs are very \nheterogeneous varying greatly in size and content. They vary in size from 20nm in \ndiameter to 1000nm. The small ECVs (20-100nm) comprise the more homogenous \npopulation of exosomes and the larger vesicles (100-1000nm), referred to as \nmicrovesicles, originate from plasma membrane. Physiologically EVs play a role in \ninter-cellular communications, immune responses, coagulation, inflammation,  \ntransport, cellular homeostasis and survival. The concentration and composition of \nthe EVs can be altered in pathological states. The EVs can carry microRNA and \nhave been shown to promote tumour invasiveness and metastasis and can confer \nresistance to drugs and promote endothelial cell migration, invasion and \nneovascularization acting as carriers of angiogenic stimuli. \nOver the last few decades, there has been an intense interest in studying EVs in \norder to understand their role in physiology and various pathological states including \ncancer, inflammatory states and neurodegenerative diseases and to explore their \npotential as early diagnostic and prognostic markers . Furthermore, EVs have also \nbeen explored as potential drug delivery vehicles [47]. As a result, there have been a \nsurge in the number of diagnostic modalities to study EVs. Over the last few years, a \nnumber of studies have employed TRPS as a diagnostic tool to characterise EVs \n[48-52 ].  \nde Vrij et al [48] investigated the ability of TRPS to quantify non-purified EVs in \nvarious body fluids including urine, blood plasma and pleural fluid and culture \nsupernatants. They found that, in all the samples studied, more than 95% of particles \nwere in the range of 150-400nm. Their study confirmed that TRPS is capable of \nmeasuring MVs in biological samples without the requirement of any prior MV \nisolation or labelling. The reproducibility of TRPS in determining the size and \nconcentration of EVs was studied by Coumans et al [49]. They used beads and \nstandard urine sample for their experiment with the instrument set at fixed stretch \nand voltage or fixed blockade height. Based on their findings, they concluded that \npore to pore variability is the cause of the variation in minimum detected size when \nsetting a fixed stretch and voltage. The reproducibility of the minimum detectable \ndiameter was improved by setting a fixed blockade height. \nThe size distribution of MVs in the urine and blood was also studied by Cheng et al \n[53-54]. They undertook a study to profile miRNA in various blood components and \nidentify differences in profiles within peripheral blood compared to cell-free plasma or \nserum and EVs. The characterisation of EVs was performed by TRPS. Their analysis \nshowed that the EVs isolated from urine provided a consistent source of miRNA for \nfurther analysis.  \nAlthough a number of exosome isolation protocols are currently available, there is a \nsignificant variation in their performance. In a bid to optimise the isolation protocol for \ncell culture supernatant and human plasma, Lobb et al [55] has undertaken a \ncomparative analysis of four exosome isolation techniques using TRPS and protein \nanalysis. The results obtained from this study have enabled them to identify the \ncurrent shortcomings in EV isolation methods and to propose a standardised method \nfor EV isolation. \nTRPS has also been employed to evaluate the effectiveness of therapeutic \nprocedures in lowering certain biological substances. Effectiveness of apheresis in \nremoving EVs was studied by combining TRPS and flow cytometry by Connolly and \ncolleagues [56]. Their results showed that while lipoprotein-apheresis reduces \ncirculating microparticles in patients with familial hypercholesterolaemia (FC), the \nprocedure non-selectively lowered annexin V positive CD41 positive platelet derived \nparticles. In another study in which nanofiltration was employed to remove \nmicroparticles to reduce thrombogenecity of human plasma, nanoparticle removal \nwas evaluated by TRPS, DLS, NTA and flow cytometry [57]. \nMaas and co-workers [58] adopted a strategy of using samples spiked with \npolystyrene beads of known size and concentration and TRPS to measure them in \norder to overcome the technical hurdles encountered when measuring EVs in \nbiological fluids. Lane et al [50] studied the effects of various exosome isolation \nprotocols on vesicle recovery and size distribution using TRPS and 100nm \nliposomes as a model system, shown in figure 5. They demonstrated that liposome \nsize distribution and ζ-potential are comparable to those of extracted exosomes, \nmaking them an ideal model for comparison studies.  \n Figure 5, (A) DLS percent intensity by size (nm) for ExoSpin, Invitrogen, PureExo, Ultracentrifugation \nand Unprocessed control. (B) TRPS measurements with an NP150 pore of particle size distributions \nfor ExoSpin (n = 1777), Invitrogen (n = 3302), PureExo (n = 0), Ultracentrifugation (n = 923) and \nunprocessed (n = 1312) samples respectively. Boxes indicate 25th, 50th and 75th percentile values, \nwhiskers encapsulate 1st and 99th percentile values. (C) Modal ± SD particle diameter for ExoSpin (n \n= 3), Invitrogen (n = 3), ultracentrifugation (n = 3) treated samples and the unprocessed negative \ncontrol as measured by TRPS with an NP150 pore. There was no significant difference in size \nbetween any of the processed samples and the unprocessed control (p>0.05). (D) Mean ± SD particle \ndiameter for ExoSpin (n = 3), Invitrogen (n = 3), ultracentrifugation (n = 3) treated samples and the \nunprocessed negative control as measured by TRPS with an NP150 pore. There was no significant \ndifference between any of the processed samples and the unprocessed control. Reprinted with \npermission from Scientific Reports (2015), 5, 7639. Copyright Nature Publishing Group [ref]. \n \n \n \n \n \n \nEVs derived from malignant cells including leukaemias and solid cancers are \ncurrently studied extensively. Analysis of tumour derived EVs may offer an early \ndiagnostic and disease monitoring tool. Increasingly TRPS is being used to \ncharacterise tumour derived EVs. Boing et al [59] studied the role of the enzyme \ncaspase-3 in inducing microvesicle release from breast cancer cells. In their \ntransfection study using a caspase-3 deficient breast cancer cell line, the \nresearchers demonstrated that caspase 3 transfected cells induced production of \ncaspase-3 containing 400-600nm sized EVs. They characterised EVs using TRPS \nand flow cytometry. Their study showed that, compared to flow cytometry,  TRPS \ngave more relevant information about the size and size distribution of EVs.  \nMesenchymal cell derived EVs are being studied as potential drug delivery vesicles \nand gene vectors. Katsuda and co-workers [60] explored the potential of EVs as \ndrug carrier for the treatment of Alzheimer's disease which is characterised by \naccumulation of beta-amyloid peptide in the brain. Beta amyloid is degraded by an \nenzyme neprilisin. The researchers isolated neprilysin containing EVs from  human \nadipose tissue-derived mesenchymal stem cells and characterised by TRPS and \nNTA. When the neprilisin expressing EVs were transferred into N2a cells, there was \na reduction in the secreted and intracellular beta amyloid peptide. Shimbo et al [61] \nused a different strategy to obtain mesenchymal derived EVs containing synthetic \nmiRNA (mRNA-143) for cancer therapy. They introduced the miRNA into cells and \nthen collected the released EVs containing the synthetic RNA. They characterised \nthe EVs by TRPS and transferred them to osteosarcoma cells. The transfer  of \nmiRNA inhibited migration of osteosarcoma cells.  \nIt must be recognised that despite the availability of various technologies for the \ncharacterisation of EVs, there is considerable variation in the sensitivity and \nreproducibility between these diagnostic modalities as highlighted by the study of \nvan der Pol [51]. The researchers measured the size and concentration of vesicles \nand reference beads with transmission electron microscopy (TEM), a conventional \nflow cytometer, a high resolution flow cytometer, nanoparticle tracking analysis \n(NTA), and resistive pulse sensing (RPS). Their study showed that each technique \ngave a different size distribution and a different concentration for the same vesicle \nsample. The researchers concluded that the differences between the detected \nvesicle concentrations are primarily caused by differences between the minimum \ndetectable vesicle sizes. The importance of correct settings to obtain accurate and \nreproducible results were highlighted in the study undertaken by Mass et al [62]. \nThey undertook a study to compare nanoparticle tracking analysis (NTA), high \nresolution flow cytometry and TRPS in quantifying EVs and 212nm sized synthetic \nliposomes. Their study showed that there were differences in absolute quantification \nof EVs and liposomes between the three technologies and highlighted the \nimportance correct and standardised instrument settings to obtain accurate results. \nMore recently, Akers et al [63] carried out a comparative analysis of technologies for \nquantifying extracellular vesicles (EVs) in cerebrospinal fluid of patients with \nglioblastoma. They compared the results obtained with TRPS, NTA, TEM and \nvesicle flow cytometry (VFC). Their results support the notion that the particle size \ndoes affect the quantitative analysis of EVs. For EVs <150nm in diameter, NTA \ndetected more EVs than TRPS. For EVs >150nm diameter, NTA consistently \ndetected lower number of EVs relative to TRPS. While TEM gave useful information \nabout the morphology, it gave significantly lower counts compared to NTA and \nTRPS. The authors have suggested that a multiplatform quantitation will be required \nfor clinical EV investigations.   \nIn order to address the issue of sensitivity and stability, Anderson et al [64] has \ncarried out a comprehensive analysis of the parameters involved in TRPS exosome \nmeasurements and demonstrated the ability to improve system sensitivity and \nstability by the optimisation of parameters. They also provided the first analysis of \nthe system noise, sensitivity cut-off limits, and accuracy with respect to exosome \nmeasurements and defined the system sensitivity. \nWith the rapid expansion in extracellular vesicle research, it is anticipated that the \nutility of TRPS in characterising EVs will rise sharply over next few years. \n \nTRPS in Drug Delivery and Drug Development Applications \n \nAs alluded in the Introduction, a variety of nanoparticles including liposomes, lipid \ncomplexes, polymers, nanocrystals, inorganic nanoparticles, dentrimers and several \nothers are being explored as potential drug delivery vehicles. Some of them are \nalready in clinical use (eg. liposomal amphotericin, nanocrystalised tacrolimus). It is \nknown that the physical characteristics such as size, surface charge, concentration \nand composition can affect the pharmakokinetics, pharmacodynamics and \ntoxicological properties of the nanoformulations [65]. \n \nLiposomes are the most commonly used nanoparticles for drug delivery. TRPS was \nfirst applied to characterise liposomes by Garza-Licudine and colleagues [66] to \nquantitate liposomes and polystyrene particles ranging from 200-400nm. They \ndemonstrated that there was a linear relationship between the capture rate \n(translocation events per second) and applied pressure and membrane stretching \ndistance. \n \nYang et al [67] carried out a study to explore the application of scanning ion \nocclussion sensing (SIOS) as a novel technology for characterization of \nnanoparticles. The size distribution of the liposomes was measured by both SIOS \nand dynamic light scattering (DLS). The ability of SIOS and DLS to resolve bimodal \nsamples was evaluated by measuring a mixture of 217 and 355 nm standard \nnanoparticles. The study showed that SIOS had higher sensitivity and better \nresolution than DLS in sizing bimodal particles. In addition, SIOS was able to detect \nopsonisation of liposomes by demonstrating an increase in the particle size and \ntranslocation rate. \n \npH responsive polymeric expansile nanoparticles are novel drug delivery vehicles \n(eNP) that respond to acidic environments by swelling with water and expanding. \nColby et al [23] used several techniques including electron microscopy, fluorescence \nmicroscopy and TRPS to measure particle size and concentration. The study \nshowed that eNP occurs in a continuous manner. TRPS was able to monitor the size \nchanges that took place over time. Resistive pulse sensing has also been employed \nto study hydrogels, another class of drug delivery nanoformulation [68]. \n \nSuperparamagnetic iron oxide nanoparticles (SPIONs) are currently being explored \nfor targeted photothermal therapy in cancer.  Upadhyay et al [69] investigated the \npotential of nanoformulation with SPION and a drug within a lipid matrix as a \npotentially targetable and thermosensitive inhalable drug delivery system. The \ntherapeutic nanoparticle was characterised by TRPS. The formulations were found \nto be suitable for controlled delivery. The authors concluded that the system \ndemonstrates promise as an effective drug vehicle in targeted and controlled \ninhalation therapy. The ability of TRPS to characterise SPIONs was also studied by \nWillmott and colleagues [18, 70]. SPIONS are widely used in molecular identification, \npurification, separation and aggregation. These are crucial steps in drug \ndevelopment. On the other hand, SPIONs are increasingly used for combined in-vivo \nimaging and cancer therapy (so-called theranostics). These findings may suggest \nthat the TRPS technology may have an important role in drug development and \ntheranostics.  \n \nA number of techniques are used to characterise nanopharmaceuticals, but there is \na lack of consistency and reproducibility among these technologies. In a bid to \novercome these drawbacks and to satisfy the requirements of various regulatory \nagencies, Kozak and co-workers [72] carried out a comprehensive and high \nresolution analysis of liposomes. The simultaneous size and zeta potential analysis \ncapabilities of TRPS enabled determination of the homogeneity and difference \nbetween unpegylated and pegylated liposomes. \n \n \nThe role of TRPS in Microbiology \n \nThe traditional methods employed to count microbes such as bacteria and viruses \ninclude microscopy (light or electron), plating and infectivity assay. These are \nlaborious and time consuming. Hence, a rapid, simple and inexpensive method \nwould be a great benefit to busy microbiology laboratories. In this respect, TRPS \nmay offer a solution by providing an alternative diagnostic platform to count and size \nthese microbes.  \n \nAs discussed in the earlier section, de Blois and colleagues [7] pioneered the use of \nresistive pulse sensing for quantitation and sizing of viruses as early as in 1977. But \nthe potential of TRPS for this purpose was first explored by Willmott and colleagues \n[73] and Vogel and colleagues [15]. In the former study, TRPS was shown to be \ncapable of detecting the unique shape (head and tail) of the lambda phage virus. \nVogel et al used TRPS, TEM and DLS for quantitative sizing of synthetic \n(polystyrene) and biological (adenovirus) nanoparticles. It was shown that the \ncalculated size of the adenovirus particle was in agreement with the results of TEM \nand DLS. Subsequently, Roberts and co-workers [19] used tunable pore technology \nto measure concentrations of Baculovirus. The determined concentrations agreed \nwith those obtained from microscopic counting and flow cytometry.  \n \nArjmandi et al [74] used the technique to measure the mass of nanoparticles and \nviruses. They were able to measure the size and density of human \nimmunodeficiency virus and Epstein-Barr virus. Using vesicular stomatitis virus \n(VSV) and 100nm polymer spheres as size controls, Akpinar & Yin [75] has shown \nthat TRPS was able to quantify concentrations down to 107 particles per ml which \nwas 50 fold lower than the detection limit of TEM. TRPS produced more reproducible \ncounts than TEM. Furthermore, the total-to-infectious particle ratio of VSV \npopulations as measured by TRPS and plaque assay has shown that each VSV \nparticle was infectious. In addition, TRPS provided useful information about the \nparticle size distributions based on hundreds of particles. \n \nTRPS has also been explored as a tool to measure concentration and size of \nbacteria. Roberts et al [19] were the first to apply TRPS to measure bacteria. They \ndetermined concentrations of marine photosynthetic cyanobacterium \nProchlorococcus in the same experiment with Baculovirus. The results were \ncomparable to those of microscopic analysis and flow cytometry. \n \nYu and colleagues [76] have used TRPS for accurate and sensitive monitoring of \nbacterial growth. Using Bacillus subtilis and Escherichia coli, the researchers \ncompared the sensitivity of detection of TRPS with the standard methods of bacterial \ngrowth detection, namely colony plating and optical density. Their results showed \nthat TRPS is sensitive and accurate relative to the standard methods with a lower \ndetection limit of 5x105 cells/ml. In addition, there was general agreement between \nTRPS and microscopy in cell volume measurements. The ability of TRPS to \ngenerate information about the concentration and the volume of the bacterial cell \nsimultaneously may provide valuable information about the physical aspects of cell \ndynamics in real time.  \n \nTRPS has also been applied for characterisation of bacteria in dairy products such \nas probiotics [77] and in environmental science [78-79]. In the study of Chung and \nco-workers [78], they used TRPS to measure the size distribution and surface \ncharge of Francisella tularensis in their investigation of biofilm formation whereas \nPang and colleagues [79] carried out comparative analysis of the size distribution \nand surface charge of biotin and glycoprotein coated microspheres to that of \nCryptosporidium parvum oocytes in a bid to develop surrogate markers to quantify \nremoval of the oocytes in porous media.  \n \nHeider and Metzner [80], in their review of four modalities (TRPS, NTA, flow \ncytometry and field flow fractionation-multiple angle laser light scattering (FFF-\nMALLS) for single virus particle analysis, have highlighted the advantages and \ndisadvantages of these techniques. The authors noted that the TRPS determined \nvirus particle concentration was several fold higher than the infectivity of the virus.    \n \n \nTRPS in Nanotoxicology \n \nWhile nanopharmaceuticals offer great promise for targeted delivery of drugs and in \ntheranostics, there are genuine concerns about their safety for in-vivo applications. \nHence, it is paramount that detailed characterisation of nanoparticles are carried out \nto minimise any potential toxicity when they are introduced in to the human body. Pal \nand colleagues [81] investigated the utility of TRPS for characterisation of four \ndifferent types of nanoparticles  (oxidised single walled carbon nanohorns, carbon \nblack, cerium oxide and nickel nanoparticle) in cell culture media containing serum. \nThe performance of TRPS was compared to that of DLS. Their results shown in \nfigure 6 below, showed that although the size distribution obtained by the two \ntechniques were comparable, TRPS offered higher resolution and sensitivity \ncompared to DLS and unique insights into size distribution and concentration of the \nnanomaterials, as well as particle behavior and morphology in complex media \n \n \nFigure 6. Comparative evaluation of TRPS and DLS in characterizing sensitivity and stability of size \ndistribution measurements of a series of sequential dilutions of SWCNH-ox in the range of 0.5–50 \nμg/mL, prepared from a stock solution of 500 μg/mL in RPMI+10% FBS. The graphs represent \naverages of triplicate measurements. Note changes in the DLS size distributions below 5 μg/mL, \nespecially left-side broadening of the peak and appearance of a smaller peak <50 nm, related to \nproteins in serum. At higher concentrations (50 μg/mL) the peak broadened to the right, In contrast to \nDLS, the TRPS size distribution remained fairly constant over the whole concentration range. \nReprinted with permission from ACS Nano  2014, 8, 9003-9015. Copyright © 2014 American \nChemical Society [ref] \n \n \nOne of the methods by which nanopharmaceutical toxicity on blood cells such as \nerythrocytes, leucocytes and platelets could be studied is by analysing the \nmembrane changes of that cell population. Since red cells are the most abundant \ncells in the body, toxicological studies of these cells may provide valuable \ninformation about the toxicity of the nanoparticle under investigation. Cheung et al \n[82] investigated the early apoptotic changes of erythrocytes, the so called \n'eryptosis', in response to a cytotoxic agent spolyphyllin D. The researchers studied \nthe cell shrinkage and translocation of phosphatidylserine (PS) to the outer lipid \nbilayer of the plasma membrane, a hallmark of apoptosis, using microbeads \nfunctionalised with annexin-V for PS binding. The results of their study showed that \nthis strategy of combining annexin-V beads and TRPS is a sensitive, reliable and \nsimple technique to determine eryptosis of human erythrocytes for various \nbiomedical applications.  \n \n \nConclusion and Future Perspective \n \nTRPS promises to be a valuable tool for nanoparticle characterisation. The ability of \nthis technique to carry out particle by particle measurement of size and surface \ncharge in addition to determining the concentration of polydisperse solutions and \ncolloids makes it particularly useful for analysing nanopharmaceuticals. This \ntechnique permits studying nanoparticle behaviour in various biological fluids such \nas blood and plasma, in particular, the important phenomenon of protein corona \nformation.  In addition, this technique can also be used to study the pharmacological \nand toxicological effects of effects of nanopharmaceuticals on blood cells. This \napplication may become useful in evaluating nanopharmaceuticals prior to various \nregulatory approval processes. \n \nIn the rapidly expanding field of extracellular vesicle research, TRPS is proving a \nuseful technique to size exosomes. An accurate determination of the size distribution \nof EVs may facilitate understanding of the biological and pathological role of these \nvesicles in physiology and in various disease states. It may also aid development of \nexosome based drug/gene delivery systems.  \n \nTRPS also has a potential for the development of  a rapid  and low cost platform for \nquantification and characterisation of microbes including bacteria and viruses.  The \nability of TRPS to perform tagless detection of subtle changes in the size, shape and \nsurface charge may enable development of biosensors using organic/inorganic \nnanoparticles, DNA, aptamers and other nanomaterials to detect biological \nmolecules for early diagnosis of diseases and to monitor therapeutic responses.  \n \nThis technique also has a potential in toxicological evaluation of nanoparticles by \nproviding valuable information about the interactions between the nanoparticles and \nblood components such as proteins and cells.  This technique may, therefore, aid \nvarious regulatory authorities in evaluating nanopharmaceuticals for clinical \napplications. \n \nWhile the above mentioned potentials are recognised, it must also be emphasised \nthat the technology of TRPS requires optimisation and standardisation to establish \nsensitivity, specificity and reproducibility. The manufacturers of the TRPS based \ndevices and their users must conduct detailed, systematic and comparative \nevaluation of various technologies that are currently used for nanoparticle \ncharacterisation.   \n \n   \n \n \n \n \nExecutive Summary \n \nNanoparticle characterisation is an important pre-requisite for developing various \nnanodiagnostic platforms and, more importantly,  nanopharmaceuticals \n \nA diverse array of measurement modalities ranging from microscopy to diffraction \ntechniques and spectroscopies are currently in use. No single technique can \nreliably be used to carry out the necessary measurements of different \nnanomaterials that are being studied for nanomedicine applications.  \n \nTunable Resistive Pulse Sensing (TRPS) is a recent addition to the  list of \nnanomaterial characterisation techniques. It is a variant of the established \ntechnique of Resistive Pulse Sensing (RPS) invented by Coulter in 1953. A size \ntunable elastomeric pore membrane is used to change the pore size and to improve \ndetection sensitivity.  \n \nOne of the important features of TRPS is its ability to measure simultaneously the \nsize and surface charge of individual nanoparticles. It is also capable of analysing \npolydispersed nanoparticle samples and colloids. \n \nThis technology may provide a rapid and low cost platform to count and \ncharacterise bacteria and viruses. \n \nThe ability of TRPS in detecting minute changes in the size, surface charge and \nshape permits development of sensitive biosensors by using nanomaterials such as \norganic/inorganic nanoparticles, DNA and aptamers.   \n \nTRPS is proving a valuable tool in the rapidly expanding field of extracellular vesicle \nresearch by providing accurate information about the size distribution of exosomes \nthat are generated in physiological and various pathological conditions including \ncancer and inflammatory diseases. \n \nThe ability of TRPS to study the interactions between nanomaterials and blood \ncomponents such as plasma proteins and cells may permit development of assay \nplatforms to evaluate nanopharmaceuticals for clinical use.  \n \nTo realise the full potential of this technology, it needs optimisation and \nstandardisation and also comparative analysis with other available technologies to \nprecisely define its role in nanomedicine and nanotechnology. \n \n  \n \nReferences \n \n1] Freitas RA. What is nanomedicine? Nanomedicine, 1(1):2-9 (2005). \n2] Jain KK. Nanotechnologies. In 'The Handbook of Nanomedicine' (Second Edition). \nEdited by Jain KK. pp 7-56. Human Press, New York. \n3] Logothetidis S. Nanomedicine: The Medicine of Tomorrow. In 'Nanomedicine and \nNanobiotechnology'. Edited by Logothetidis S. pp 1-24. Springer, New York (2011). \n4] Nel AE, Madler L, Velegol D et al. Understanding biophysicochemical interactions \nat the nano-bio interface. Nat Mater, 8(7), 543-57 (2009). \n5] Kulkarni SK. Analysis Techniques. In 'Nanotechnology: Principles and Practices' \n(Third Edition). pp 135-198. Springer, New York (2015). \n6] Coulter WH. Means for counting particles in a fluid. US patent 2,656,508 (20 \nOctober 1953). '**' A ground breaking invention of Resistive Pulse Sensing \ntechnology that paved the way for the development of numerous particle counters \nincluding blood cell analysers widely used in medicine.   \n7] de Blois RW & Wesley KA. Sizes and Concentrations of Several Type C \nOncornaviruses and Bacteriophage T2 by the Resistive-Pulse Technique. J. Virol, \n23, 227-233 (1977). \n8] Kasianowicz JJ, Brandin E, Branton D et al. Characterization of individual \npolynucleotide molecules using a membrane channel. Proc. Natl. Acad. Sci. USA, \n93, 13770–13773 (1996). ). '**' A landmark publication that re-ignited interest in \nResistive Pulse Sensing technology \n \n9] Henriquez RR, Ito T, Sun L, Crooks RM. The resurgence of Coulter counting for \nanalyzing nanoscale objects. Analyst, 129, 478–482 (2004). \n \nleh OA, Sohn LL. Direct detection of antibody-antigen binding using an on-chip \nartificial pore. Proc Natl Acad Sci USA. 2003;100(3):820-4 \n \nLan WJ, Holden DA, Zhang B et al. Nanoparticle transport in conical-shaped \nnanopores. Anal Chem. 2011;83(10):3840-7.# \n \nSexton LT, Horne LP, Martin CR. Developing synthetic conical nanopores for \nbiosensing applications. Mol Biosyst. 2007;3(10):667-85. \n \n10] Clarke J, Wu HC, Jayasinghe L et al. Continuous base identification for single-\nmolecule nanopore DNA sequencing. Nat Nanotechnol, 4(4), 265-70 (2009). \n11] Kozak D, Anderson W, Vogel R et al. Advances in Resistive Pulse Sensors: \nDevices bridging the void between molecular and microscopic detection. Nano \nToday, 6:531–545 (2011). '**' Comprehensive review article on the evolution of \nResistive Pulse Sensing and TRPS and its principles \n12] Dekker C. Solid-state nanopores. Nat Nanotechnol, 2(4), 209-15 (2007). \n13] Roberts GS, Kozak D, Anderson W et al. Tunable nano/micropores for particle \ndetection and discrimination: scanning ion occlusion spectroscopy. Small, 6(23), \n2653-8 (2010). \n14] Willmott GR, Vogel R, Yu SS et al. Use of tunable nanopore blockade rates to \ninvestigate colloidal dispersions. J Phys Condens Matter, 22(45), 454116 (2010). \n15] Vogel R, Willmott G, Kozak D et al. Quantitative sizing of nano/microparticles \nwith a tunable elastomeric pore sensor. Anal Chem, 83(9), 3499-506 (2011).  \n16] Vogel R, Anderson W, Eldridge J et al. A variable pressure method for \ncharacterizing nanoparticle surface charge using pore sensors. Anal Chem, 84(7), \n3125-31 (2012). \n17] Willmott GR, Moore PW. Reversible mechanical actuation of elastomeric \nnanopores. Nanotechnology, 19(47), 475504 (2008). \n18] Willmott GR, Platt M, Lee GU. Resistive pulse sensing of magnetic beads and \nsupraparticle structures using tunable pores. Biomicrofluidics, 6(1), 14103-15 (2012). \n19] Roberts GS, Yu S, Zeng Q et al. Tunable pores for measuring concentrations of \nsynthetic and biological nanopore dispersions. Biosens Bioelectron, 31(1), 17-25 \n(2012). \n20] Sowerby SJ, Petersen GB, Broom MF, Jones MD, Sowerby S, Petersen G, \nBroom M, Jones M. Patent. WO2006063872-A1; Sowerby SJ, Broom MF, Petersen \nGB. Sens.Actuators, B, 2007, 123, 325. '**' Pioneering work that introduced the \nconcept of 'tunability' to Resistive Pulse Sensing technology \n21] Willmott GR, Parry BET. Resistive pulse asymmetry for nanospheres passing \nthrough tunable submicron pores. J. Appl. Phys. 109 (2011). \n22] Kozak D, Anderson W, Trau M. Tuning Particle Velocity and Measurement \nSensitivity by Changing Pore Sensor Dimensions. Chem. Lett, 41, 1134-1136 \n(2012). \n23] Colby AH, Colson YL, Grinstaff MW.  Microscopy and tunable resistive pulse \nsensing characterization of the swelling of pH-responsive, polymeric expansile \nnanoparticles. Nanoscale, 5(8), 3496-504 (2013). \n24] Kaszuba M, Corbett J, Watson FM et al, High-concentration zeta potential \nmeasurements using light-scattering techniques. Philos. Trans. A. Math. Phys. Eng. \nSci, 368, 4439–51 (2010). \n25] Vogel R, Anderson W, Eldridge J et al. A variable pressure method for \ncharacterizing nanoparticle surface charge using pore sensors. Anal Chem, 84(7), \n3125-31 (2012). \n26] Blundell E, Holton E, Healey et al. Characterisation of the Protein Corona using \nTunable Resistive Pulse Sensing: Determining the Change and Distribution of a \nParticles Surface Charge. 2016 (Submitted for publication). \n27] Arjmandi, N., Van Roy, W., Lagae, L. & Borghs, G. Measuring the electric charge \nand zeta potential of nanometer-sized objects using pyramidal-shaped nanopores. \nAnal. Chem. 84, 8490–8496 (2012). \n28] Tenzer S, Docter D, Kuharev J et al. Rapid formation of plasma protein corona \ncritically affects nanoparticle pathophysiology. Nat Nanotechnol, 10, 772-81 (2013). \n29] Pozzi D, Caracciolo G, Digiacomo L et al. The biomolecular corona of \nnanoparticles in circulating biological media. Nanoscale, 7(33), 13958-66 (2015). \n30] Blundell E, Holton E, Healey et al. A study of surface interactions between \ncarboxyl polystyrene nanoparticles and various human blood components using \ntunable resistive pulse sensing. 3rd International Conference in Nanotechnology in \nMedicine, Manchester, UK (November 2015). \n31] Tokel O, Inci F, Demirci U. Advances in plasmonic technologies for point of care \napplications. Chem Rev, 114(11), 5728-52 (2014). \n32] Weatherall E, Willmott GR. Applications of tunable resistive pulse sensing. \nAnalyst, 140, 3318-3334 (2015). \n33] Booth MA, Vogel R, Curran JM et al. Detection of target-probe oligonucleotide \nhybridization using synthetic nanopore resistive pulse sensing. Biosens. Bioelectron, \n45, 136-40 (2013). \n34] Ang YS, Yung LY. Rapid and label-free single-nucleotide discrimination via an \nintegrative nanoparticle-nanopore approach. ACS Nano. 6(10), 8815-23 (2012). \n35] Yang AK, Lu H, Wu SY et al. Detection of Panton-Valentine Leukocidin DNA \nfrom methicillin-resistant Staphylococcus aureus by resistive pulse sensing and loop-\nmediated isothermal amplification with gold nanoparticles. Anal Chim Acta, 782: 46-\n53 (2013). \n36] Kuhnemund M, Nilsson M. Digital quantification of rolling circle amplified single \nDNA molecules in a resistive pulse sensing nanopore. Biosens Bioelectron, 67, 11-\n17 (2015). \n37] Blundell EL, Vogel R, Platt M. Particle-by-Particle Charge Analysis of DNA-\nModified Nanoparticles Using Tunable Resistive Pulse Sensing. Langmuir. \n32(4)1082-90 (2016). \n38] Tuerk C, Gold L. Systematic evolution of ligands by exponential enrichment: \nRNA ligands to bacteriophage T4 DNA polymerase. Science, 249(4968), 505-10 \n(1990). \n39] Ellington AD, Szostak JW. Selection in vitro of single-stranded DNA molecules \nthat fold into specific ligand-binding structures. Nature, 355(6363), 850-2 (1992). \n40] Knight CG, Platt M, Rowe W et al. Array-based evolution of DNA aptamers \nallows modelling of an explicit sequence-fitness landscape. Nucleic Acids Res, \n37(1), e6.doi:10.1093 (2009). \n41] Rotem D, Jayasinghe L, Salichou M et al. Protein detection by nanopores \nequipped with aptamers. J Am Chem Soc, 134(5), 2781-7 (2012). \n42] Platt M, Willmott GR, Lee GU. Resistive pulse sensing of analyte-induced \nmulticomponent rod aggregation using tunable pores. Small, 8(15), 2436-44 (2012). \n43] Billinge ER, Platt M. Multiplexed, label-free detection of biomarkers using \naptamers and Tunable Resistive Pulse Sensing (AptaTRPS). Biosens Bioelectron. \n68, 741-8 (2015). \n44] Alsager OA, Kumar S, Willmott GR et al. Small molecule detection in solution via \nthe size contraction response of aptamer functionalized nanoparticles. Biosens \nBioelectron. 57, 262-8 (2014). \n45] Cocucci E, Racchetti G, Meldolesi J. Shedding microvesicles: artefacts no more. \nTrends Cell Biol, 19, 43–51 (2009). \n46] Raposo G, Stoorvogel W. Extracellular vesicles: exosomes, microvesicles, and \nfriends. J Cell Biol, 200(4), 373-83 (2013). \n47] El Andaloussi S, Mager I, Breakefield XO et al. Extracellular vesicles: biology \nand emerging therapeutic opportunities. Nat Rev Drug Discov, 12(5), 347-57 (2013). \n48] de Vrij J, Mass SL, van Nispen M et al. Quantification of nanosized extracellular \nmembrane vesicles with scanning ion occlusion sensing. Nanomedicine, 8(9), 1443-\n58 (2013). \n49] Coumans FA, van der Pol E, Boing AN et al. Reproducible extracellular vesicle \nsize and concentration determination with tunable resistive pulse sensing. J Extracell \nVesicles, 3, 25922 (2014). \n50] Lane RE, Korbie D, Anderson W et al. Analysis of exosome purification methods \nusing a model liposome system and tunable-resistive pulse sensing. Sci Rep, 5, \n7639 (2015). \n51] Van der Pol E, Coumans FA, Grootemaat AE et al. Particle size distribution of \nexosomes and microvesicles determined by transmission electron microscopy, flow \ncytometry, nanoparticle tracking analysis, and resistive pulse sensing. J Thromb \nHaemost, 12(7), 1182-92 (2014). \n52] Van der Pol E, Boing AN, Gool EL et al. Recent developments in the \nnomenclature, presence, isolation, detection and clinical impact of extracellular \nvesicles. J Thromb Haemost, 14(1), 48-56 (2016). \n53] Cheng L, Sharples RA, Scicluna BJ et al. Exosomes provide a protective and \nenriched source of miRNA for biomarker profiling compared to intracellular and cell-\nfree blood. J Extracell Vesicles. 3(10) 3402/jev.v3.23743 (2014). \n54] Cheng L, Sun X, Scicluna BJ et al. Characterization and deep sequencing \nanalysis of exosomal and non-exosomal miRNA in human urine. Kidney Int, 86(2), \n433-44 (2014). \n55] Lobb RJ, Becker M, Wen SW et al. Optimized exosome isolation protocol for cell \nculture supernatant and human plasma. J Extracell Vesicles, 4, 27031 (2015). \n56] Connolly KD, Willis GR, Datta DB et al. Lipoprotein-apheresis reduces circulating \nmicroparticles in individuals with familial hypercholesterolemia. J Lipid Res, 55(10), \n2064-72 (2014). \n57] Chou ML, Lin LT, Devos D, Bu et al. Nanofiltration to remove microparticles and \ndecrease the thrombogenecity of plasma: in vitro feasibility assessment. \nTransfusion, 55 (10), 2433-44 (2015). \n58] Maas SL, de Vrij J, Broekman ML. Quantification and size-profiling of \nextracellular vesicles using tunable resistive pulse sensing. J Vis Exp, 92, e51623 \n(2014). \n59] Boing AN, Stap J, Hau CM et al. Active caspase-3 is removed from cells by \nrelease of caspase-3-enriched vesicles. Biochim Biophys Acta. 1833(8),1844-52 \n(2013). \n60] Katsuda T, Tsuchiya R, Kosaka N et al. Human adipose tissue-derived \nmesenchymal stem cells secrete functional neprilysin-bound exosomes. Sci Rep, 3, \n1197 (2013). \n61] Shimbo K, Miyaki S, Ishitobi H et al. Exosome-formed synthetic microRNA-143 is \ntransferred to osteosarcoma cells and inhibits their migration. Biochem Biophys Res \nCommun, 445(2), 381-7 (2014). \n62] Maas SL, de Vrij J, van der Vlist EJ et al. Possibilities and limitations of current \ntechnologies for quantification of biological extracellular vesicles and synthetic \nmimics. J Control Release, 200, 87-96 (2015). \n63] Akers JC, Ramakrishnan V, Nolan JP et al. Comparative Analysis of \nTechnologies for Quantifying Extracellular Vesicles (EVs) in Clinical Cerebrospinal \nFluids (CSF). PLoS. 11(2), e0149866 (2016). \n64] Anderson W, Lane R, Korbie D et al. Observations of Tunable Resistive Pulse \nSensing for Exosome Analysis: Improving System Sensitivity and Stability. Langmuir. \n31(23), 6577-87 (2015). \n65] Torchilin VP. Nanocarriers. Pharm Res, 24, 2333-4 (2007). \n66] Garza-Licudine E, Deo D, Yu S et al. Portable nanoparticle quantization using a \nresizable nanopore instrument - the IZON qNano™. Conf Proc IEEE Eng Med Biol \nSoc, 437(1-2), 253-63 (2010). \n67] Yang L, Broom MF, Tucker IG. Characterization of a nanoparticulate drug \ndelivery system using scanning ion occlusion sensing. Pharm Res, 29(9), 2578-86 \n(2012). \n68] Pevarmik M, Schiel M, Yoshimatsu K et al. Particle deformation and \nconcentration polarization in electroosmotic transport of hydrogels through pores. \nACS Nano, 7(4), 3720-8 (2013). \n69] Upadhyay D, Scalia S, Vogel R et al. Magnetised thermo responsive lipid \nvehicles for targeted and controlled lung drug delivery. Pharm Res, 29(9), 2456-67 \n(2012). \n70] Willmott GR, Fisk MG, Eldridge J. Magnetic microbead transport during resistive \npulse sensing. Biomicrofluidics, 7(6), 64106 (2013). \n72] Kozak D, Broom M, Vogel R. High resolution particle characterization to expedite \ndevelopment and regulatory acceptance of nanomedicines. Curr Drug Deliv, 12(1), \n115-20 (2015). \n73] Willmott GR, Broom MF, Jansen ML, Young RM, Arnold WM. In 'Molecular and \nNanotubes', ed O.Hayden and K Nielsch, Springer, New York, ch.7, pp 209-261 \n(2011). \n74] Arjmandi N, Van Roy W, Lagae L. Measuring mass of nanoparticles and viruses \nin liquids with nanometer-scale pores. Anal Chem. 86, 4637–41 (2014). \n75] Akpinar F, Yin J. Characterisation of vesicular stomatitis virus populations by \ntunable resistive pulse sensing. J Virol Methods. 218, 71–76 (2015). \n \n76] Yu AC, Loo JF, Yu S et al. Monitoring bacterial growth using tunable resistive \npulse sensing with a pore-based technique. Appl Microbiol Biotechnol, 98(2), 855-62 \n(2014). \n77] Bennett G, Rajan R, Bunt CR et al. Microbiological assessment of four probiotic \nfeed supplements used by the dairy industry in New Zealand. NZ Vet J. 61(2), 119-\n20 (2013). \n78] Chung M-C, Dean S, Marakasova ES et al. Chitinases are negative regulators of \nFrancisella novicida biofilms. PLoS One, 9(3), e93119 (2014). \n79] Pang L, Nowostawska U, Weaver L. Biotin- and glycoprotein-coated \nmicrospheres: potential surrogates for studying filtration of cryptosporidium parvum \nin porous media. Environ Sci Technol. 2012;46(21):11779-87. \n80] Heider S, Metzner C. Quantitative real-time single particle analysis of virions. \nVirology, 462, 199–206 (2014). \n81] Pal AK, Aalaei L, Gadde S et al. High resolution characterization of engineered \nnanomaterial dispersions in complex media using tunable resistive pulse sensing \ntechnology. ACS Nano, 8(9), 9003-15 (2014). \n82] Cheung AKL, Yang AKL, Ngai BH et al. Quantitative detection of eryptosis in \nhuman erythrocytes using tunable resistive pulse sensing and annexin-V-beads. \nAnalyst, 140, 1337-1348 (2015). \n",
    "Link": "https://core.ac.uk/download/288371313.pdf"
}