{
    "Title": "Casting And Recasting Gender: Children Constituting Social Identities Through Literacy Practices",
    "Authors": "Anderson, Diane Downer",
    "Year": "No year available",
    "Abstract": "Considers how gender, identity and literacy are entangled and mutually constitutive. Concludes that social experience, desire, proximate others, and the ways in which children can draw upon these in the classroom are aspects of the situated condition that deserve more prominence in literacy and identity research",
    "Keywords": "No keywords available",
    "Publisher": "'Transformative Works and Cultures'",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": " Swarthmore CollegeWorks   Educational Studies Faculty Works   2002  Casting And Recasting Gender: Children Constituting Social Identities Through Literacy Practices  Diane Downer Anderson Swarthmore College, danders1@swarthmore.edu   Let us know how access to this work benefits you.  Follow this and additional works at: http://works.swarthmore.edu/fac-education  Part of the Education Commons   Recommended Citation Diane Downer Anderson. (2002). \"Casting And Recasting Gender: Children Constituting Social Identities Through Literacy Practices\". Research In The Teaching Of English. Volume 36, Issue 3. 391-427. http://works.swarthmore.edu/fac-education/2  This work is brought to you for free and open access by the Swarthmore College Libraries. It has been accepted for inclusion in Educational Studies Faculty Works by an authorized administrator of Works. For more information, please contact myworks@swarthmore.edu. Casting and Recasting Gender: Children Constituting Social Identities through LiteracyPracticesAuthor(s): Diane Downer AndersonSource: Research in the Teaching of English, Vol. 36, No. 3 (Feb., 2002), pp. 391-427Published by: National Council of Teachers of EnglishStable URL: http://www.jstor.org/stable/40171532 .Accessed: 17/07/2014 14:29 .Your use of the JSTOR archive indicates your acceptance of the Terms & Conditions of Use, available at .http://www.jstor.org/page/info/about/policies/terms.jspJSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range ofcontent in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new formsof scholarship. For more information about JSTOR, please contact support@jstor.org. .National Council of Teachers of English is collaborating with JSTOR to digitize, preserve and extend access toResearch in the Teaching of English.http://www.jstor.org This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsThis content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsREsEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 fEBRUARY 2002 391 Casting and Recasting Gender: Children Constituting Social Identities through Literacy Practices E353' DIANE DowNER ANDERSON Swarthmore College I spent over 6 months in two 3rd and 4th grade multi-age classrooms gathering data to explore the question, How are gender, identity, and literacy entangled and mutually constitu-tive? I audiotaped literature group discussions, collected student writing, audiotaped discus-sions while students were writing, and audiotaped interviews about their discussion tran-scripts, their writing, and their talk and teasing. I used a hybrid cif lenses (poststructural feminist theories, interactional sociolinguistic frame and positioning theories, and reader re-sponse stance theories) for understanding and analyzing the data. I found that the children used a variety of literacy strategies for representing themselves and others as gendered persons: naming and renaming practices, intertextual references, bodycasts, and verbal interactions. The data show the ways that children use literacy practices to do the social identity work cif gender. I a~gue that while educators and policy makers are concerned with the development cifliteracy skills, children are using literades for social and cultural purposes, including the representation and constitution cif gender identities. I also a~gue that while power is salient and can denote gender dominance and difference, neither dominance nor difference can folly represent the range and complexity cif children~ literacy and gender practices. Gender, as socially consti-tuted identity, is not monolithic, immutable, or always patriarchal. Social experience, desire, proximate others, and the ways in which children can draw upon these in the classroom are aspects cif the situated condition that deserve more prominence in literacy and identity re-search. Literacy is at heart an effort to construct a self within ever-shifting discourses in order to participate in those discourses; that effort is always local. - Yagelsk.i, 2000, p. 9 This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions392 REsEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • FEBRUARY 2002 Naming the Parakeets (Or, How a Simple Literacy Event Can Organize and Shape the Views of Participants, Leaving Them in Social and Ideological Tension) George, a fourth grade boy who inten-tionally created explicitly equitable male and female characters in his own stories and told me many times about his gender equity concerns, was sputtering when I walked into class one day in early February. (Pseudonyms are used throughout for students and teachers.) The teacher had recently brought in two parakeets to be class pets, one male and one female. After a lengthy class discussion and vote, the names Calvin and Hobbes (after the boy and his stuffed tiger in Bill Watterson's popular comic strip) had won as the names for the pets. George was so upset that he had tears in his eyes. George took up for both birds when I asked him, \"What about this is so upsetting?\" He told me that the female bird would be upset because \"she would want a female name,\" and the male bird would be upset because \"he wouldn't want her to have a male name:• While his classmates seemed con-tent with two male names for a male and female bird, George was non-plussed. His reasons reveal an uneven sense offairness concerning names, as if names are capital that can b.e owned, even by birds. George's dichotomous sense of how the gender and naming world should work had been disrupted. Names carry great weight in iden-tifYing a world of gender for children in classrooms and a school where both girls and boys have cross-gender names such as Pat, Sam, Alex, Morgan, and Chris. Although gender and names often structure a binary system of naming and identity, the children in the class had disrupted it with their male names for both genders of birds. Were they denying the female bird her femi-ninity by not giving her an explicitly female name? Were they intending to elevate her status by giving her a male name? Did they simply enjoy the intermedial reference? George, in pre-senting his own conflicted reasons, may have been expressing a feminist parti-sanship in taking up for the female bird as well as a partisan and patriarchal sense of name ownership for the male bird. The ways in which George positioned the birds, the names, and himself in relation to his classmates on this issue is complex and contradictory. It is but one piece of evidence that gender was on his mind and that literacy practices such as naming, intertextual references, and personal interactions facilitated this gender work. While a majority of the children in the class accepted this non binary gender naming, George ap-peared caught up in the tension of his personal feminist sensibility, and he was clinging to the way that the gender-naming world works, as he understood it. It seems that the community was ready to move into a new way of gender naming, while George was conflicted in many directions. One could make arguments on the side of George or the class community about who had the more feminist or sexist sensibility. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 393 The Study It has always intrigued me that, al-though I walk into elementary class-rooms where spelling, punctuation, stories, and comprehension skills are being taught, these rarely seem to be the primary interests of children. Al-though many children appear compli-ant-responding to a prompt in their journals, filling out a worksheet, read-ing and discussing a story, or writing the rare report-these literacy events are steeped in personal, social, and cultural meaning making. Using the resources available both inside and outside school, children use literacy tasks and opportu-nities for their own purposes, in spite of curriculum design, state assessments, concerned and involved parents, or well-intentioned teachers. Children use literacy events to find their place among others and to position others at both local and global levels, often working through the stories they read, the stories and characters they create, and their discourse. I agree with Luke (1992) that when researchers pay attention to chil-dren by using \"a different map for reading classroom literacy events\" (p. 123), the children can help to \"move away from criteria for literacy narrowly defined as discrete 'psychological skills' internal to the subject, and towards more contextualized explanations of literacy as social practice\" (p. 107). Naturalistic studies in classrooms suggest that, among other uses, children use literacy practices to constitute iden-tities for themselves and others in situ (Egan-Robertson, 1998; Kamberelis & Scott, 1992; Kamler, 1994; McCarthey, 1998). Among the 4 5 children in the two third- and fourth-grade multi-age classes that were the site of this study, gender was the most explicit identity constituted. I looked closely at gender representations and the ways in which children positioned themselves and oth-ers with a view ofliteracies and gender as socially situated. The local social identities that children constituted and the ways in which children did this work through literacy practices com-plicated and challenged more popular views and understandings of gender as monolithic, binary, immutable, and pa-triarchal. The purpose of this article is to show the complexity of doing gender (West & Zimmerman, 1987) through literacy practices among this particular group of children by focusing on three literacy events. Because the children in this study constituted gender identities at the levels of the self, the social group, and at more generalized, distant cultural levels, I will use events at these three levels to illustrate how the children enacted gendered identities through literacy practices. I will show how power can denote dominance and dif-ference, yet dominance and difference don't completely represent the broad range of complex gender positions taken up or assigned by the children. Gender and power are not always binary, patriarchal, or hegemonic when situated among children. I have looked across talk and texts and across academic and social spaces to capture the range of gender constitu-tion done by the children. I found that children cast gender: (1) by naming and renaming selves, peers, and characters, This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions394 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • fEBRUARY 2002 (2) by calling upon intertextual content, genres, and conventions such as metaphor, argument, media references, anthropo-morphism, and personification, (3) by means of bodycasts such as voice, cloth-ing, and hair, and (4) by means of interactions, especially discourse strategies. The categories of naming and renaming, intertextual reference, bodycasts, and interactions were not nearly parallel nor are they mutually exclusive. They often occurred simulta-neously and sometimes functioned syn-ergistically to constitute gender at the personal/individual level, at the social and classroom level, and at the more global level of what it meant to be male or female. Although gender identity was the most salient identity to emerge among the children in this study, other social identities, from exotic ethnicities to local soccer competency, also emerged. Additionally, gender identi-ties at the personal, social, and global levels were constandy formed, con-tested, and reformed by the children. The metaphor of casting gender is used as a heuristic designed to suggest the richness of the many strategies through which children enact gender in their literacy practices.As a metaphor of multiple meanings, casting gender denotes social categories with which and to which children identified or cast persons and other actors such as ani-mals. Like theater directors the children cast themselves, one another, and fic-tional characters into gender categories as they understood them. They cast themselves through genders other than their own biological sex; they both reiterated gender categories and chal-lenged them by taking up and casting gender through intertextual resources; and they demonstrated awareness of the complicated effects of using gender casting strategies to position themselves and others. Gender categories, as social and cultural resources, also acted as structural resources through which so-cial identities and literacies could be constructed or cast. They sometimes seemed fixed, cast in stone as it were, as well as broken and recast. Children used literacy activities to cast gender as fishing lines or nets might be used to capture others in their activities. Additionally, when social groups and children in the local context expressed gender in linguistic responses, representations, negotiations, and navi-gations, they left behind textual mean-ings and references that were in turn taken up and used by other children. Like worm castings, gender expressions and identities themselves became re-sources for future use and recasting (Anderson, 1998). This paper uses cast-ing gender in all of these ways to explain how children represented, re-sponded to, negotiated, and navigated gender in their literacy and identity practices. The first of the literacy events that I will use, called The Llama's Secret, was highly orchestrated by the teachers in the two classes and was intended to counter gender teasing and \"put downs\" among the children. I use it to show how this community of children broadly conceptualized gender within the con-straints set up in teacher-initiated class-room activities. The second centers around a student-initiated play called This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 395 \"Clone Wars.\" Written primarily by 2 boys but informed by many more children, it bridged home and school settings and functioned as a focal point for social gender play among many children in the class. The third event might be considered a case study of a focal child. Called \"Callie the Torture-woman,\" it chronicles the literacy prac-tices and meanings at the personal! social level of a third-grade girl named Callie through her teacher-assigned writ-ing and interviews about her writing. I have purposely chosen three dissimilar, non-parallel events because children and classroom literacy prac-tices aren't so neat and parallel when looked at ethnographically. These three events are messier to deal with rhetori-cally but more representative of the range of events and involvement that take place in a classroom in which children move in and out of personal, social, and more culturally global spaces. Individuals (Callie) are nested in social relationships (\"Clone Wars\") and cul-tural spaces (The Llama's Secret). Look-ing at the constitution of gender identities at three levels reveals the nested aspect of identity meanings without distorting reality by privileg-ing one over another. Theoretical Orientation In doing gender in school (West & Zimmerman, 1987), children talk, read, and write in response to, in spite of, and/ or in order to manage themselves, their relationships, and the contexts and concomitant expectations that they in-habit. The concepts of doing gender and doing literacy locally and daily, as well as the salience of gender to this setting, suggested the orienting ques-tion of the study: How are gender, identity, and literacy mutually constitu-tive, imbricated, and socially and cul-turally inscribed, constructed, and mutable? I looked to learn how the children were representing, responding to, negotiating, and navigating gender through literacy practices in their dis-course, in their writing, and in their literature response groups. How did gender emerge or get marked in children's literacy practices? What were the social meanings of gender and gender language to the children? How were particular forms of text carrying meaning in this community of prac-tice? How did children's understand-ings of gender inform, get used, or play through their writing and their talk about texts or writing? Ultimately I wondered what kinds of social identi-ties the children were constructing through specific literacy practices.These questions guided methodological choices including the types of data collected, interview scripts, and meth-ods for analysis and interpretation of data. They suggested naturalistic in-quiry in which description and inter-pretation were grounded in systematic collection and analysis of data. Gender and literacy have been studied together through many sub-fields of education, literary theory, and interactional sociolinguistics, yielding new and important understandings of the ways in which reader response, writing, comprehension, and discourse strategies are influenced by gendered positions, settings and participants, and This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions396 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • fEBRUARY 2002 dichotomous understandings of gen-der. However, children as research par-ticipants are often categorized from the beginning of a study as biological boys and girls, and it is often assumed that looking at what girls typically do and what boys typically do represents or implies what any girl or boy does. Studies that describe how children are engaging in literacy and gender work are rare. Often gender is but one aspect of a study's greater literacy focus (Dyson, 1993,1997, 1999;Maybin, 1987, 1994), play focus {Goodwin, 1990), or dis-course focus (Sheldon, 1993; Thorne, 1993). Studies that address the overlap-ping phenomena of gender and school practices include those by Walkerdine (1990) and Davies (1993), who use poststructuralist theories to understand masculine and feminine identities in schooling, with the desire to disrupt the \"fictions\" (Walkerdine, 1990,p.xiii) and the coercions of stereotypical concep-tions of gender. Goodwin (1990),in her ethnography of children playing in a Black neighborhood in Philadelphia, used conversational analysis to under-stand children's communication and found that gender differences were more situated than dichotomously as-cribable to males and females. Thorne (1993) attends to gender as social prac-tice in schooling, although she does not address classroom literacy practices per se. More recent work by Orellano (1994, 1995),Karnler (1993, 1994),Jett-Simpson & Masland (1993), Gray-Schlegel (1996), Solsken (1993), Marks (1995),Cherland (1992), Aitken (1992), Evans (1996) and others has approached literacy and gender as social and lin-guistic constructions and representa-tions in particular settings. However, these researchers look either at writing or reading, not both, and rarely attend to talk as well. Many continue to site gender in biology by contrasting the talk and practices of girls and boys as difference. A more recent orientation of lit-eracy researchers has been that of situ-ated practice. Although not focusing on gender per se, Barton (2000), Barton & Hamilton (1998, 2000), Barton, Hamilton, & lvanic (2000), Egan-Robertson (1998), Green & Dixon (1994), Gregory & Williams (2000), Luke (1992), and McCarthey (1998) have taken up literacy as social practice. Maybin (1987,2000) and Dyson (1993, 1997, 1 999) in particular, in studying the social significance ofliteracy among elementary-age children in schools, investigate gender as one aspect of social literacy issues. The Santa Barbara Classroom Dis-course Group has reminded educa-tional researchers to attend to \"how everyday life in classrooms is con-structed by members through their interactions, verbal and other, and how these constructions influence what stu-dents have opportunities to access, accomplish, and thus 'learn' in school\" (Green & Dixon, 1994, p. 231). Green and Dixon have urged educational researchers to use sociolinguistic tools to study discursive and social practices in classrooms. Children, it appears, in spite of the ways in which researchers have divided and distributed their studies and vo-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and R~Xasting Gn1der 397 cabularies of gender and literacy, are performing as gendered persons and becoming literate in classrooms simul-taneously as they read, write, and talk. As Sheldon (1993) has determined, gender and literacy can be expected to constitute one another mutually through daily practices. According to Davies (1993) there are \"many different ways of being male and female and, in an ideal world, we would have access to many or all of these possible ways of being\" (p.10). Children have the capac-ity to create those ideal worlds in their oral and written fictions as well as to negotiate and navigate non-ideal worlds. Literacy, on the other hand, has been viewed by educators through the lenses of academic literacies (Bartho-lomae, 1995; Bridwell-Bowles, 1995), personal writing (Calkins, 1991; Elbow, 1995; Gilbert, 1991; Grumet, 1987; Powers, 1995; Stotsky, 1 995), and through written and oral channels (Collins, 1995;Gee, 1990;Street, 1 993a). Dichotomizing literacy practices in these ways has, as Gilbert (1 991) claims about personal writing, \" forsaken claims on the social, the cultural, and the ideo-logical\" (p. 19).Additionally, when per-sonal, social, and academic writing are viewed as continuous (as Collins, Gee, and Street recommend viewing orality and literacy) or transparent to one another, social, cultural, and ideological aspects of reading, writing, and speak-ing may become more apparent. Ideo-logical aspects of consciousness are formed at the intersections of texts, contexts, and persons and constitute social identities such as gender. When identity, or consciousness, is understood in Volosinov's (1993) sense of ideological alignments, social and cultural meanings can be evoked. In the spaces at the nexus of formerly envi-sioned dichotomies, such as orality/ literacy and personal/academic, mean-ings that reach beyond persons and texts into social settings and cultures can be seen and understood.Thus social identities can be formed at the level of individual persons as well as at the level of sociocultural meanings for small and large groups of persons. Cooper and Holzman (1989) see literacy practices and gender identities, which evolve in settings, as cognitive and social vehicles for literacy learning. They understand cognitive and social theories of writing as continuous, not contradictory or oppositional. Stories written and told in communities orga-nize experience, materialize social in-teractions, and maintain social control and community coherence. They are often \"about the tensions between the impulse of a community to remain as it has been . and that of individuals to change their relationship to the com-munity\" (p. 133). Children's talk, their responses to literature, the writing they do at home, at school, and across those spaces can be expected to show how children experience and interpret so-cial interactions and identities: \"the ongoingly produced self\" (Davies & Harre, 1990, p. 6) who dwells socially among others. Local and socially significant set-tings must form the basis of any literacy investigations that attempt to discern cultural meanings because culture is an abstraction of meanings derived from This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions398 R.ESEJ\\RCH IN THE TEACHING OF ENGLISH • VOLUME 36 fEBRUARY 2002 daily, situated practices. If writing and reading are only understood as cogni-tive, personal, and/ or academic and if literacy is only acknowledged in its written or oral forms, then the social aspects of the productions and abduc-tions of oral and written texts and all those in between will remain hidden. The cultural ideologies or meanings of practicing reading, writing and speak-ing will also remain hidden. Lenses of instrumental literacy, tra-ditional feminist theory, and/ or critical theory are somewhat limited in their potential for interpreting how children constitute social identities. Socially and locally situated views ofliteracy events and practices, as advocated by Barton (2000), Street (1993b), and others, and the concept of doing gender (West & Zimmerman, 1987) allow for broader possibilities of interpretation. In this analysis I primarily use a situated so-cial/local literacies lens (Barton & Hamilton, 2000;Yagelski, 2000) to cap-ture the complexities of the intersec-tions of children's literacy practices and gender work that were prominent in one school setting. In this site, gender identities in particular arose as important to the local inhabitants, the teachers, and the children. Traditional feminist and criti-cal theories are important to under-standing gender, have contributed greatly to gender understandings, and will perhaps seep into this analysis. But they are not central to it because they often tend to dichotomize, make static, essentialize, and reify difference and power relations into patriarchy and oppression. I argue instead that post-structural feminist theories (St. Pierre & Pillow, 2000; Weedon, 1987), which site power in language and allow for situated and competing ideologies, are more apt for the rich and messy data provided by naturalistic inquiry such as this one. Like McCarthey (1998) I believe that no one theoretical lens can thor-oughly capture or represent the com-plexity ofhurnan interactions or literacy practices. The essentializing effects of many traditional feminist analyses of gendered phenomena, as well as ana-lytical tendencies to cast difference and dominance rigidly and narrowly, have promoted a victim status for girls and an oppressor status for boys. This profiling does a disservice to children, and it distracts educators from the complexi-ties and the situated conditions of ongoing identity construction and lit-eracy development. I purposely use the term social identities to focus on the social aspects of gender identity and literacy work. Although the terms subjectivities and personhood (Egan-Robertson, 1998) are also used to refer to identity work in the field of literacy, I have chosen the term social identities for use in this paper. Subjectivities, as a term coming out of post-structuralist theory, renders the person into subject/ object posi-tions that tend to oversimplify positions and to imply hierarchies, dichotomies, and oppositions. Personhood, although more humanistic, implies more indi-vidual, personal, and psychological as-pects of the self than I am content to settle for with these data. I am using social identities to mean This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 399 where one stands among others and how one positions others or sees others positioned either in relation to oneself or in the greater scheme of persons. It is a term that works across local and global levels. Although social identities can include conceptions of identity as personal, hierarchical, oppositional, and individual, it primarily captures the fluid and ever-shifting relationships, interrelationships, and positions that exist among children. These positions and relationships are more socially con-stituted, complex, overlapping, mul-tiple, and fluid than they are simply hierarchical or oppositional as subjectivities and personhood have come to imply. Local and situated views can serve to complicate and enrich understand-ings of social identities and power relationships because they reveal con-tradictions to popular and simplistic views of gender.Yagelsk.i (2000) argues that local acl3 of literacy ... local manifestations of the broader ideological struggles ... rep-resent the many complex, sometimes over-lapping, often conflicting discourses within which people function everyday, within which they negotiate the constraints and challenges of contemporary life, within which they make the small decisions that can determine how much control they exercise over their lives. (pp. 7-8) Elsworth (1992) argues: \"Class-room practices that were context-spe-cific . . . seemed to be much more responsive to our own understandings of our social identities and situations\" (p. 91) and showed \"multiple and con-tradictory social positionings\" (p. 104). Social positionings can be seen through written and oral discourses, what I will broadly callliteracies. Weedon (1987) advocates a femi-nist poststructuralist theory wherein language is the site of struggle-recog-nizing language as the site of struggle gives meaning to language and enables the transformation of language itself because it is the individual site of conflicting forms of subjectivity. Dis-course is the structuring principle not an abstract system, and language is always socially and historically located in discourses. Weedon claims that expe-rience by itself has no essential mean-ing. Instead she looks to historically and socially specific discursive production of conflicting and competing meanings where language is more than expres-sion or reflection: Language is a site for political struggle.Although I agree with Weedon in terms of discourse, I prefer to turn, if not to interpretations of experience, then at least (1) to local contexts of experience to understand more fully gender identity meanings and (2) to interactional sites of conflict-ing forms of identity. Thus, this study presumed to chal-lenge (a) dichotomies of gender as biological sex, (b) academic and social dichotomies, and (c) oral and written literacy dichotomies (Gee, 1991 ; Street, 1995). Both literacy development and social identities, including gender, race, and class, are important to preadoles-cent students, yet they have rarely been studied in terms of how they might mutually develop and constitute one another. Although there is evidence that boys and girls are \"differendy This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions400 RESEARCH IN THE TEACHING OF ENGLISH • VoLUME 36 FEBIUJARY 2002 literate\" (Millard, 1997), there is also evidence that their literacies, when seen across talk and text and academic and social spaces, are both complex and not easily explained by simple dichoto-mous concepts of dominance, contrast, and difference (Dyson, 1993, 1997; Freeman & McElhinny, 1995; Goodwin, 1990; Maybin, 1994). Many studies of children, literacy, and gender, although revealing much about differences in gender access, equity, and literacy prac-tices, have also reiterated essentialist views of gender as biological sex by sorting children into males and females and looking for differences rather than recognizing complex, situated strate-gies for gender work. Instead, for the purposes of this study, gender was defined as socially, culturally, and locally constructed, although loosely tied to biological sex (Anderson, 1999). Gen-der and literate identities were pre-sumed to be social and ideological alignments (Volo~inov,1993) carried in the events and practices of literacies. The significance of local literacy prac-tices was used in this study as a way of grounding the findings in the data rather than in the literature review (Street, 1993a). The particular class-rooms studied demonstrated curricular permeability among the home, school, and other social worlds of the children. Because of this permeability the class-rooms were useful for researching social literacies as well as indicative of the strong cultural alignments between the school and conununity (Dyson, 1993, 1997). This study describes and inter-prets the particular strategies and mean-ings that a group of children used for being male and female and for repre-senting and negotiating gender through literacy practices in classrooms at per-sonal, social, and cultural levels. It advances an understanding ofliteracy as a social and ideological phenomenon as well as whatever else it has been determined to be or might be. Method Setting I chose these 2 classrooms (the 2 teachers were friends with one another and ran the 2 classrooms collaboratively) when, on another project, I realized how drenched the children's literacy activities and social experiences were in gender play (Thorne, 1993).Additionally, they were chosen as sites of conve-nience, intensity (Patton, 1990), and permeability (Dyson, 1993). The study was set in a suburban, predominantly White, grades 1-5 school that might be more aptly categorized as a hybrid of ailluent/ professional and executive/ elite rather than working- or middle- to upper middle-class (Anyon, 1980), al-though there are elements of all catego-ries present in the conununity. Gender was particularly salient, as demonstrated by the children's discourse in the class-rooms and the concerns of teachers and parents, with race and class appearing to be less salient. The permeability of the classrooms and the curriculum, their \"openness to the children's experiences and lan-guage\" (Dyson, 1993, p. 30), made the intersection of literacy and gender easily accessible to ethnographic and sociolinguistic methods of data collec-tion. Collaboration and attention to This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 401 individual interests were explicitly ad-dressed in the multi-age classrooms. The children used knowledge and lan-guage drawn from their out-of-school worlds freely and openly to construct knowledge and demonstrate their com-petence within the classroom and school. The channels between home and school for linguistic, content, and procedural knowledge were relatively seamless (B. Street, personal communication), al-lowing children not only to use their household knowledge (Tapia, 1991) but for it to be valued. The match between the implicit curriculum, including overall goals for students vis-a-vis academic achieve-ment and social class and what the children brought to that curriculum, supported a permeable curriculum ca-pable ofbuilding on children's experi-ences and language (Dyson, 1993). This congruence also reprivileged the stu-dents who came to school with the most appropriate matching knowledge and skills such as categorical and argu-mentative styles. This aspect of the site was both a research characteristic as well as a signal that factors were at work in the children's schooling experience that could not be denied or minimized in terms of its impact on persons or groups of persons regarding literacy practices. Access was established through my ongoing relationship with the school through preservice teacher instruction at a nearby college, as a consultant in the district, as a parent in the school community, and as a former member of the school's management team. The principal encouraged and welcomed classroom-based research. The teachers of the two multi-age grade three/ four classrooms (who combined their class-rooms for literature groups, projects, activities, field trips, and morning re-cess) were particularly interested in the study. In their eyes gender had emerged as a school and classroom \"problem\" in terms of social differentiation through chosen activities, \"putdowns\" of girls and ofboys who were \"girl-like,\" and an incident between students in fourth grade the previous year that was de-scribed and problematized as \"gender harassment.\"The children's intense fo-cus on gender was consistent with findings that Once children move into elementary school ... there is ... a gradual movement toward social differentiation within the peer group .... While social participation and peer friendship are the central elements of peer culture, there is a clear pattern of increased differentiation and conflict in peer relations throughout childhood. The first sign of so-cial differentiation is increasing gender sepa-ration. (Corsaro & Eder, 1990, pp. 202-205) Literacy work was one venue for com-peting representations, interactions, and ideologies at the site of social differen-tiation. Data Collection and Analysis Ethnographic tools of data collection were used, including observational field notes, transcripts of audio-taped litera-ture discussions, children's writing, and meta-interviews with children over their transcripts and stories for the 6-month duration of the study. Strauss and Corbin's (1990) systematic grounded theory method was used to This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions402 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • FEBRUARY 2002 develop theory from the diverse data. Data were analyzed and interpreted using sociolinguistic discourse methods (interactional analysis (Gumperz, 1982; Saville-Troike, 1982), frame analysis ofexpectations [Tannen, 1993a, 1993b), positioning analysis [Davies & Harre, 1990), analysis of acts and stances [ Ochs, 1993) anq literary theories and reader response theories [Benton,1983;Bleich, 1986;Bogdan,1990;Britton, 1984;Iser, 1972; Sipe, 1996]). These tools made linguistic, social, and interpretive analy-ses possible across discourse and writ-ing. Rhetorically, they enabled findings to be reported and exemplified in thick description (Eisenhardt & Howe, 1992; Geertz, 1973) that included focal child case studies and literacy events and practices across academic and social spaces and oral and written literacies. Standards of validity for qualitative research were insured through adher-ence to Erickson's (1986) focus on \"the immediate and local meanings of ac-tions, as defined from the actors' point of view\" (p. 119), amount and diversity of good quality data, and rigorous search for disconfirming evidence. To promote validity, I adopted Lincoln and Guba's (1985) standards of trustworthi-ness, which include techniques for prolonged involvement, multiple sources of data, refining working themes, and respondents' review of findings. My primary role as researcher ranged along a continuum from ob-server-participant to participant-ob-server (Spradley, 1980). As an adult researching children's literacy practices I was constrained in my ability to be a true participant, i. e., a child (Spindler &  Spindler, 1992). However, the children shared their lives with me in ways that they might be reluctant to with parents and teachers, perhaps because I was another kind of participant, someone unusually interested in their literacy and social lives. I looked for children-in-literacy activities in which both written com-positions and oral utterances were sub-sumed in literacy events and practices and where there was evidence of a gendered consciousness on the part of the children. I looked to literacy events that merged the children, their lan-guage, and the social conditions of production. Three theoretical concepts formed my rationale: 1) the constructivist Vygotskian unit of child-in-activity put forth by Cole (1985),2) VoloSinov's (1993) theory of consciousness and ideology realized as \"meaning ... in the process of active, responsive under-standing . .. between speakers\" (p. 44), and 3) West and Zimmerman's (1987) concept of doing gender as practice and not simple dichotomy and difference (Freeman & McElhinny, 1995). Child-ren's discourse, writing, reading, and social relations were not detached from one another. Attention to children-in-literacy activities with gender con-sciousness made the work of analysis messy and difficult because one could look at semi-discrete literacy events as well as fragmented utterances. How-ever, it was through this attention to co-constituted interactions that insider meanings could be derived most truth-fully. In attempting to search for discon-firming evidence, to allow for respon-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 403 dents' review of the findings, and to allow the children to correct my mis-takes in transcribing multiple, overlap-ping, and simultaneous voices (Finnegan, 1992), I returned to individuals and groups of children with both transcrip-tions and their written stories. My experiences with the children particu-lar to this school convinced me that their participation in interviews could be a normative classroom experience. As members of a speech community, the children would \"display more in-herent communicative flexibility\" (Hill &Anderson, 1993,p.122) than they are often credited with by researchers. Meta-interviews over transcripts of the children's talk and writing could also serve as a way for me to share my evolving knowledge with the children, involving them to some degree as co-researchers in the process (Cameron, Frazer, Harvey,Rampton,& Richardson, 1992). Additionally, text and script-based interviews could serve to dis-tance children psychologically from their literacy activities (Cocking & Renninger, 1993). There-interview process, which I came to call the redux interview, proved to be a rich source of interpretations and meanings. The redux interviews became a way to elicit insider interpre-tations of meanings, to give children insight into the research process, and to make alternative interpretations of lit-eracy practices available to the children (Frazer, 1992). In one sense children recursively re-spoke and re-wrote their oral and written texts, re-inscribing, revealing, and complicating both their and my original interpretations. They were even less able than I was to ascertain who had spoken particular utterances, affirmingVolosinov's (1994) and Bakhtin's (1981, 1986) concepts of co-constructed and ventriloquated meanings and ideologies, with utter-ances often extended across speakers in chains of meaning. In a sense a naturalistic study and analysis such is this is expressly about disconfirming evidence. It is an inten-tional search to disrupt simple surface categories and to describe phenomena as complex and nuanced rather than simply to code and tally categories. So while I can present tallies of strategies from relatively discrete literacy events, it is through description and interpreta-tion that categories become meaning-ful in so far as the children are concerned. (See Anderson, 1998 for coding of data of major assignments and events.) When I found disconfirming evi-dence, I was able to revise my working theories of the importance of gender identities for the group and to correct my interpretations of particular data. For example, it became clear when the children wrote their\"Temple Pyramid\" stories about Latin America that ethnic identities were being represented and not just gender identities. It also be-came clear that local identities, such as excellent girl athletes, as well as the proxi-mity of other children, complicated children's representations of gender. Results I will use three cases of literacy to illustrate the ways in which the children in this study constituted social identities of gender through their literacy prac-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions404 RESEARCH IN THE TEACHING OF ENGLISH • VoLUME 36 • fEBRUARY 2002 tices of naming, intertextual references, bodycasting, and interactions. These data were chosen because they repre-sent a thick stew of the themes that emerged from the study, both at the level ofhow children were representing data and at the level of supporting and contradicting notions of dichotomous and stereotypical representations for gender such as simplistic power and dominance. The data chosen tend to come from children who were highly prolific in class, either orally or in writing, although they are representa-tive of the larger corpus in terms of those strategic categories and identity themes. I will begin with The Llama's Secret, a view into a teacher-initiated drama intended to provide a venue in which the teachers and children could experi-ence and examine gender roles. Second, l will examine a student-initiated script and the discourse around it to show how a group of boys used their play script \"Clone Wars\" to do social work in the classroom. Last, [ will show how one female focal child, Callie, used her literacies to establish identities for her-self and her friends and to navigate the landscape of her evolving social situa-tion. The Llama's Secret: Cross-sex Casting I Cross-gender Cogitations Almost nobody really knows who's who and what's what. -George, interview When I entered the classroom in Janu-ary for the formal data collection, the children were beginning practice for a play that the teachers had written based on a Peruvian legend used in their study of Latin America. Called The Llama's Secret, the play was based on a Noah's Ark -type story about saving the animals during a flood by leading male/ female pairs of animals to a mountaintop following the advice of the llama (Palacios, 1993). The teachers, like the children, were authors. They had co-written the script based on The Llama's Secret in order to counteract some of the verbal sexist sparring that they'd heard among the children such as \"putdowns of girls, putdowns of boys by boys saying they were like girls\" (teacher comment). I had noticed it, too. Comments would fly on the way to soccer recess. For example, one day Robin (a girl) beat James in a race to the field, and Peter yelled, \"You can't even beat a girl!\" to James. Robin's angry, firm face showed that she was both incensed and hurt. She told me afterwards that It's a bigger putdown of girls than of James. It's like saying girls can't run, girls can't do sports, girls can only do school, but not those other things. I play soccer because I love it, but I get to play better! Ironically, a few weeks later James told me that Robin, who was frequently chosen early by boy captains for soccer, was \"a good soccer player.\" In casting the script the teachers explicitly switched male and female roles. For example, a girl from class played the male flamingo and a boy played the female flamingo. The teach-ers told me that they purposely wrote the parts so that the female roles were This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 405 strong. This was an interesting choice, given that the boys would get to play \"strong roles\" even though they were female roles. The children, even the boys, were compliant with the sex role switching, and [ suspected it had much to do with the popularity of their young, enthusiastic teachers. The data [collected for The Llama~ Secret case included observations of rehearsals, observations of the perfor-mance, audiotapes and notes from af-ter-performance discussions, and a set of written responses to the experience that [ will call the \"Dear Cleve\" letters. The teachers asked me to take small groups of children to the audito-rium expecting me to supervise while the children conducted their own re-hearsals. The \"voice\" issue came up almost immediately, raised by Dave, who said: DAVE: Ifboys have girls' parts, shouldn't they make their voices higher and shouldn't girls with boys' parts make their voices lower? DDA: Are there those kinds of differ-ences in girls' and boys' voices? DAVE: Yes. CALLIE: No, [have a low voice. Although there were no immediate voice changes, the topic of voice was brought up again and again by the boys and a week later the boys were speaking in such exaggeratedly high voices that their words were distorted. The girls, on the other hand, were not altering their VOICeS. Costumes for the drama were or-ganized and created by the children's parents. They were asked to make identical costumes for the male and female characters. This similarity in costumes made it hard for audience members to distinguish between males and females, girls and boys, during the two performances of the play, one during the school day for other classes and one during the evening for the parents. The performances were suc-cessful, and there were no complaints from parents expressed publicly or to the teachers or principal about the cross-sex casting. The performances were followed by two related literacy events. In one the children were divided into three groups to have discussions about the experi-ence.The two teachers and I each led a group; two were audio-taped while the other teacher took notes on children's questions and responses when the tape recorder failed. Table 1 shows how children referenced gender during their oral discussions in terms of the acting roles they played. The children, when asked to talk about \"what it means, what it was like to play an opposite-gender role in a play,\" raised issues of physical factors (clothing, voice, hair, age, face, pierced ears, make-up, and size); non-physical attributes of acting such as skill and discourse (cursing, manners, dignity); audience reaction; and the quality of the experience of cross-sex casting for themselves and others. The discussions also hinted at how limiting it is for children to speak of gender as anything but essentialist and biological.The term gender, it appears, is abducted and functions as a polite term This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions406 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 fEBRUARY 2002 TABLE 1 The llama'! Secret Small Group Discussions What matters in playing or preparing to play an opposite-gender (sex) role? PHYSICAL FACTORS NON-PHYSICAL FACTORS Clothing 20 Acting skill 7 Voice 12 Discourse 5 Hair 7 Audience reaction (manners, cursing, dignity) 4 Age 6 Face 5 Pierced ears 3 Make-up 3 Size 1 How did students experience role switching? Difference No difference QUhliTV OF EXPERIENCE Feeling Opportunity Challenge Forced Creative 6 4 2 for biological sex. Sex, unfortunately, connotes sexuality and intercourse, leav-ing no word available for a conception of gender as socially constructed. Yet the children were quite sophisticated in talking of gender through the medium of the gender role switching experi-ence. Children, for the most part, avoided the term \"sex\" and often used \"gender\" to mean biological sex. The discussions preceded the sec-ond literacy event, the writing of the \"Dear Cleve\" letters, letters written to \"Cleve,\" the theater director, in which the children discussed their feelings about the cross-sex casting. Along with their drama experience, the discussions provided a discursive resource upon which the children could draw for their writing. The teachers framed the letters in three parts conforming to an essay or legal argument structure. In the first the children were to state their position: \"You must know how l feel about.\" In the second the children were to provide evidence or rationale: \"Here are my reasons.\" In the third part they were to summarize and conclude: \"Having read this you should know my position.\" An assignment such as this is pro-leptic, i.e., it assumes future develop-ment even though that development does not yet exist (Cole, 1996). The This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 407 task of writing the persuasive letter presupposes a bifurcated stance ofbeing for or against cross-sex casting without necessarily having explicidy taught the essay /legalistic argument form to the children. In a sense, the future responses of the children are embedded in the present assignment. The assignment acts as a scaffold to a particular structure for thinking about the topic. Yet the chil-dren are also able to draw upon the ideas and language of their peers from their discussions, and these complicate their stances. The proleptic quality of the letter/ essay structure imposed particular con-straints on their responses ,forcing them initially to state positions for, against, or ambivalent toward the notion of whether boys and girls should be able to play opposite gender roles in plays. The children mitigated those positions in their letters with clarifications and conditions. In Table 2 one can see that most boys and girls were initially in favor of girls and boys being able to play opposite gender roles. (Seven students did not complete the assignment.) However, the children clarified and posed conditions through genre conventions Qetter and essay structures provided by the teachers), focal choices and primary stances (explicit align-ments such as assertions, opinions, evalu-ations, interpretations), elaboration and evidence that served to affirm, compli-cate, or disrupt focal choices and stances (experiences, extensions, re-irnaginings ), and meta-commentary (utterances in which the speaker or writer steps outside the flow and structure of the argument to address someone beyond the text, such as the addressee). The children addressed the prepara-tions, physical and otherwise, that one must make to play a different gender role adequately. Voice and clothing were most often mentioned and were dichotomously structured as male/ fe-male. Many children mentioned that they needed to change their voices to be the other gender or the audience would be \"thrown off by voices;• although Dave said \"I didn't have to change my voice\" to be a girl. This view contrasted with Dave's earlier position on the need for boys to \"make their voices higher\" to play female roles. High and low voices, loud and soft voices, and cursing and non-cursing voices held gender meanings even at an age when boys' voices had not yet changed. There were children who argued that the boy and girl animals \"wore the exact same costumes;' but \"Paul [who played the only human character] had to wear a dress and it was poindess, TABLE 2 AGAINST Boy Girl Boy Girl Boy Girl 15 11 FOR AMBIVALENT 3 3 3 3 This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions408 REsEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • FEBRUARY 2002 because girls wear jeans.\" Clothing was dichotomously understood as male/ female, pants/ dresses, and boys' shoes/ girls' shoes. Hair was dichotomized into short hair for boys and long hair for girls, even in this classroom where some boys had ponytails and some girls had close-cropped hair. However, Carrie summed up with \"It's about being that character,\" and Pat H. (a girl) claimed, \"It's not how you look but how you act it out.\" Residual meanings of gender, such as stereotypical clothing and hair, competed with present-day experience as much as being for or against cross-gender role-play competed. Carrie, Pat H., and other children addressed the qualities of acting. They mentioned memorizing and knowing lines, acting well so the audience could tell what gender role was being played, how playing opposite gender roles could \"increase your acting ability\" and that it would be a \"good way to practice your acting and build up acting skills.\" Children were also able to distance themselves from their roles in order to consider how role-switching would have an effect on them and on the audience. For themselves, it was an experience of opportunity, desire, and empathy. It provided\" challenge,'\"'fun,\"'' creativity,'' \"chance,\" \"opportunity,\" the \"feel of what it's like to be a different gender,'' and the chance to \"feel things from each other's perspective.\" According to Sam C. (a boy) \"boys should feel what it's like to be a girl, and the same for girls.\" Hannah wrote \"Some girls want to be boys and some boys want to be girls in the world. Acting in plays gives them a chance to do it.\" However, some children thought it would be \"boring,'' \"annoying,'' or even \"distressing.\" Ac-tors might find it a \"problem\" or \"trouble\" to play opposite gender roles. The children's recognition of tffects on the audience was quite conflicted .The audience might be \"confused,'\"'might not be able to tell\" who was male and who was female, and might be \"thrown off by the voices.\" \"People (the audi-ence] might complain\" or\"bullies might tease your actors.\" On the other hand, there seemed to be a recognition of the theater's potential for inducing bliss (discomforting and transforming) as well as the comforts of pleasure (Barthes, 1973). Sam S. (a boy) said that gender role-switching \"would be more inter-esting for the audience, it would give them something to think about,\" while Libby W said that \"throughout history theater has tried to surprise the audi-ence .... Sometimes the audience gets upset .... They will be able to use their imaginations.\" Two categories of argument in the letter/ essays were highly situated in American culture and were strongly connected. The focus on supply and demand of actors and roles speaks to an economic view of role casting. For ex-ample, two girls considered the avail-ability of boy and girl roles and the availability of girls and boys to play those roles as reasons for people to be \"flexible\" in their acting skills and interests. For others, role switching was about individual rights. Some children wanted actors to be able to \"decide,\" \"choose,\" or\"get to play whatever they want.\" The cases for or against role-This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 409 switching were supported by argu-ments such as that ofLibby W. who said that \"actors have a right to switch parts and would want to.\" But Peter said that actors should switch parts\" only if they want to\" because \"most would want to play their own gender.\" Not surprisingly, given the topic and the essay genre, the children's letters/ essays are saturated with a dis-course of dichotomy, d!fference, and polarity. The following phrases are taken verba-tim from their letters: positives/ negatives, pms/ cons, good/bad, fun/ serious, high/low, opposite, male/female, raise/lower, one hand or the other, sides, go for it/no don't, different genders, complete success/ complete disaster, interchanging males and females, vice-versa, agree/ disagree, boy I girls thing, opposite kind of person, male/female par~ are different, different/ normal, themselves/others, different person-alities of men and women, opposite sex, the other gender, female parts/male parts. In seeing gender roles as dichotomy structured in sides, the children spoke as if this duality of gender had a border that could be crossed or parts that could be fused: PAUL: I call myselfWO-MAN,WO for woman and MAN for man because I like to be a half girl, half boy. CARRIE: It's about being that character-for becoming, actually becoming that character. PAT H . (girl): It allows a person to an-other side of himself or hersel£ DAVE: I sort ofliked being the opposite sex for my play. Or sex and gender were borders to be crossed, either hard or non-existent: joHN: Sometimes when acting you tend to forget you're a girl or a boy. Sometimes it's hard to transform a person completely. CALLIE: I played a boy part in our play and I didn't feel any different. Although most of the children took positions for or against the sex-role switching, their positions shifted, often carefully and subdy, within the texts of their letter essays. Mitigation included clarifications of their positions with examples of exceptions and with the experiences of themselves and oth-ers. A sample of their mitigation and consequent ambivalence includes oc-casional references to the situated na-ture of the experience: LARRY: I don't really mind switching genders but I had to write this. RoBIN: Male/female roles can't always be played by the opposite gender. TED: But, on the other hand, if you did, the actors and actresses would have a challenge. Liz B.: There's no one way to go with it. Either way it works out. I'm with the \"go for it\" and \"no don't\" side. I feel caught in the middle between both sides. MAx: I also have other opinions. LIBBY H.: [It's] right but would actors want to switch roles? PETER L.: [I'm] for it but let actors de-cide and most will want to play their own gender. ANNA: It's alright for men and boys. I would probably want to. SAM S.: Some actors have fun though a lot of actors don't. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions410 REsEARCH JN THE TEACHING OF ENGLISH • VOLUME 36 • FEBRUARY 2002 CAROLINE: (It) doesn't matter but? If it's not okay with that person. NoAH: There are variables ... most fe-male and male parts are different, but you could ... and the play could be a complete success--or a complete disaster ... There are many benefits. It all depends! LEvAR: I mean why do boys always get so embarrassed when they have to play a female part? I don't really care what I am. Even though I don't play female parts very often, but I wouldn't mind playing a female part once in a while. DAVE: It was sort of fun being a girl. I sort of liked being the opposite sex for the play. The children also drew upon their experiences and those of their class-mates to mount arguments and evi-dence in their essays and to place their opinions in the company of others. Taking a stance on the issue was as much about where they stood among others as it was about how they actually felt: ANNA: My friends enjoyed it. PAT H. (girl): It's fun to see your friends act really different. SAM W.: I mean Paul was a pretty good girl! I swear that my mom said ev-erybody she talked to said I was the best actor. My mom doesn't lie to me often. Most people agree with me. joE: Paul had to wear a dress-pointless. JANE: I guess my teacher feels the same way because--SAM C.: I know a girl who didn't want to play a boy's part. Lours: Most people agree with me. LEVAR: Some of my friends didn't enjoy the experience of being a girl but some did. PATS. (boy): Take me for instance. MARTIN: It would help me to do some-thing different. I never played a script as a girl [before]. I feel I could be-come more creative. JoE: I don't care as long as I get to act. I played a female iguana .... [It] made no difference. DAVE: I played a female iguana. It was sort of fun being a girl. jANE: I played a boy condor and I liked it because it gave me an idea of a boy's life--HANNAH: I have a male puppy so I wanted to be a male puma. My point in reviewing the children's primary stances, their evidence, and their ambivalence and mitigation is to show how the dichotomized topic of gender through the structuring of The Llama's Secret and the underlying genre of essay pushed children to take posi-tions and sides on the issue. Initially they took strong positions in spite of their ability to see the complexities of the issue, to take various perspectives, to identify with teacher and peer posi-tions, and to understand the situated nature of their nuanced responses. How-ever, the explicit and overriding genre of the more personal letter to \"Cleve,\" the theater director, may have allowed them the room to complicate their stances with empirical evidence and with This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 411 their desire to be somewhere in the company of their peers and teachers. The path of the children's move-ment from speaking of only male and female voices during rehearsals through their performances, audience reactions, group discussions, and written letters/ essays created a venue and language for speaking of sex/ gender roles in the culture as well as challenges to cultural understandings of gender. Poignantly, Paul ended his letter/essay with, \"Girls are really like boys. It does not matter if a boy plays a girl, especially if they are animal parts. It does not matter too much if a boy plays a girl (person):' Analysis of this statement shows that the qualification of\"animal parts\" and \"not matter too much\" mitigates the effects of\"it does not matter.\" For Paul it does matter, if not \"too much\" then a little. If not \"animal parts\" then human parts matter. Although, as I showed earlier, Paul gladly claimed he called himself \"WO-MAN, a half girl, half boy,\" he was the only boy in the play who played a female human part, and he played it enthusiastically in his long blonde wig and skirt. But he also clarified for his reader, Cleve, at the end of his letter/ essay, that a girl is, indeed, like a boy, she is a \"(person).\" But according to Paul a girl is a person in parentheses. Perhaps the parentheses indicate that she is a boy in parentheses. Her gender identity rests on how she is \"like boys\" and on explicitly identify-ing her as a \"(person).\" A girl as a \"(person)\" may represent her in rela-tion to humankind or mankind. Ac-cording to Paul it doesn't matter if boys and girls switch roles if the roles are \"animal parts,\" and \"It does not matter too much if a boy plays a girl (person).\" In terms of social identity, Paul must place the girl explicitly in the category of \"(person)\" in order for it not to matter \"too much.\" Even in claiming his allegiances to being \"half girl,\" a hierarchy of position seeps through Paul's feminist stance in his categorical reference to being a \"(person).\" Gender power and position are not monolithic, completely patriarchal, or completely differentiated as essentialist characteris-tics for Paul or among his classmates. Yet there are remnants of gender hege-monies even in Paul's liberal and ten-sion-filled claim to gender bifurcation just as there are mitigations, tensions, and challenges in the most firm for or against stances. I turn now to an analysis of a literacy event in which a group ofboys used the writing of a play to accomplish their social desires. The social work of the boys included getting desired girls to play in a play with them and to limit their contact with low-status boys such as Paul. Clone Wars: \"I Only Want to Be a Player in a Play\" In The View from Saturday, Konigsburg (1996, writes: \"Whenever someone makes out a guest list, the people not on the list become officially uninvited, and that makes them the enemies of the invited. Guest lists are just a way of choosing sides\" (p. 78). The writing of \"Clone Wars,\" begun at a boy's over-night birthday party and continued over a 6 month period in class, func-tioned in much the same way as does This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions412 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • fEBRUARY 2002 Konigsburg's guest list. The cast list and story script functioned to invite chil-dren, or not, into the play and into play. \"Clone Wars\" drew on resources of popular culture such as the Star U'clrs series of movies and books as well as the social scene of the classroom. Social relationships and identities were consti-tuted through verbal interactions as the play was written and rewritten. The children wrote and continually rewrote the script, and cast members and class-mates helped to shape the script's direction. In developing and naming characters, casting the script, and deter-mining dialogue and plot actions, the children navigated a range of compet-ing interests and meanings. One might describe a children's classroom compo-sition such as this as formed at the intersection of a social relation-ship between ourselves as composers, and an ideological one between our psyches (or in-ner meanings) and the words, the cultural signs, available to us .... Composers, then, are not so much meaning-makers as meaning negotiators, who adopt, resist, or stretch avail-able words. (Dyson, 1997, p. 4) In the case of \"Clone Wars,\" available intertextual and situated social mean-ings were stretched to enact social desires to invite and dis-invite class-mates to play. As I watched the \"Clone Wars\" script develop in the classroom, I be-came aware that Joe and Noah were the principal authors. Joe and Noah told me that it started with something called \" the playground wars of February\" in which Pat H. and Callie (both girls) chased Joe, Noah, Levar, and Dave around the playground during recess. But Noah's mom, who helped out in the classroom once a week, told me the script started at a sleepover. When I asked Joe about the script and the sleepover, he agreed: We had the idea of Star War.\\' for some rea-son. Yeah, and that was at a sleep over when it was time to go to bed, we made this sort of tent out of sleeping bags, and we went under and played joe's Gameboy and wrote the story. The classrooms in this study were permeable to virtually any literacy events the children brought to school, so something like \"Clone Wars\" found its way into theW riter's Workshop part of the day, whether it was of interest to the teacher or not. There was much excitement generated by its initial ar-rival in the classroom among various children, and that interest waxed and waned throughout the spring. The naming of characters with classmates' names or plays on names evoked the most interest. Almost weekly I was given an updated cast and character list, always incomplete and always evolving. A relatively complete cast list iteration looked like this: \"Clone Wars\" Character Child Cast &om Class Joe Glider Joe Bev Glider CS (Cyber Slider) Rebel Troops BB Crew Levar Glider (Bev, for beverage, is his nickname) Pat S. (a boy) Nodd Noah Sam C. Peviach Sam C. (a boy) Pat H. (a girl) This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 413 KallVader Cat Troopers Storm Troopers General House Walkers Maria Callie Mary House George, Sam W, Pat N.,Lee Maria The children's naming actions are worth examination in terms of how characters, character names, and class-mates were matched and incorporated. Although I have used pseudonyms here, I have tried to represent the same relational and alliterative flavor of the original castings. Classmates' names were incorporated into many of the Star Wars characters' names, such as Darth Vader becoming Kall Vader and the Gliders taking on names such as Joe Glider and Bev Glider. Peviach is the phonetic rendering of Pat H.'s initials with a V thrown in, as one boy told me, like the \"von\" in German World War I names such as \"von Baron.\" Favored, high status female class-mates such as Pat H. and Callie were cast in important and powerful roles and traditionally male roles, although not always benevolent ones. For ex-ample, Callie became Kall Vader, the antagonist in the original Star Wars. Mary House was General House, and Peviach was another powerful and evil character. Maria, playing a character named Maria, transformed into a leop-ard that scarred CS's face in a confron-tation with the Jedis, perhaps reflecting the girls as cats, boys as dogs binary often seen in the media and in children's stories. Gender roles seemed based on more than biological sex. Status for girls was attained, as seen through the boys' comments about girls throughout the study, by being smart, pretty, and playing soccer or chasing games well. Joe, Noah, and many other boys \"liked\" or \"loved\" Callie, Pat H., and Maria. And, although they also \"liked\" or\"loved\" Robin, another high status girl from the other class in the study, Robin was in the other class, was not part of the \"playground wars of February,\" and never showed up in \"Clone Wars.\" In fact, the only girls and boys in the cast of\"Clone Wars\" were from this class even though the two classes did recess, projects, literature circles, and math together on a daily basis. I believe this separation is impor-tant to note in that it may indicate a way in which the more proximate popula-tion superceded status when it came to literacy practices and social inclusion. At another level the casting was a point of contention on many occasions, with children not in the play lobbying to get in and constant tension about who would play whom. In one power-ful incident the casting of the play functioned to constitute and reflect social position in the class and how that was contested and negotiated. I asked Joe and Noah's permission to audio-tape while they were revising \"Clone Wars\" at the computer. While I was observing in another part of the class-room, Paul (alias \"WO-MAN), the boy with a history of playing and wanting to play female roles in skits, entered the following conversation: NoAH: (to Joe) Who's going to be Prin-cess H? This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions414 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • fEBRUARY 2002 jOE: (to Noah) I'll be Princess H! Paul: (from another part of the room) I'll be Princess H! NoAH: (to Joe) Is Paul anything yet? JoE: Paul's my understudy. PAUL: (walking over to Joe and Noah) No, I won't be your understudy. I'll be Princess H. STUDENT: Shhhhh. PAUL: Come on you guys. I only want to be a part. joE: Princess H doesn't live. PAUL: Alii want is a part, OK? NoAH: (to Joe) How about Princess H? joE: How about Maria? No, Maria, she's already a part. PAUL: Why don't you guys want me? JOE: You're my understudy! PAUL: (pleading quiedy) No,Joe. I did that because I wanted to be a part of it and I thought you might be sick. That's the only reason I did that. Can I please be Princess H? I only want to be a player in a play. joE: Do you only want to live for five seconds? PAUL: I just want a part. NoAH: Well, OK, it's basically the small-est part in the play. PAUL: OK, what do you do, what do you do? jOE: You go \"Stop this!\" (in a high-pitched voice) NoAH: All you do is come in and say \"Stop this fight. I insist!\" And Peviach slashes you. PAUL: Ummmrn (pause) I'll be your un-derstudy. JOE: I thought so. (pause) PAUL: And then I could come back from the dead. NoAH: And Peviach could kill you agam. PAUL: Yeah, that would be cool. Qoe typing during pause) DAVE: (entering the conversation) Hey, but Zoda's not alive. (pause) Zoda is alive. NoAH: Zoda isn't, he's a spirit, remem-ber? He got killed by Peviach. DAVE: Oh, yeah. JoE: (to Dave)You don't want to be Lev's understudy? DAVE: No,'cause I know. JoE: OK, you are now Princess H. I now dub you a dead person. This exchange reveals how the role of Princess H functioned as much-sought-after capital in the class. In verbal interaction centered on this role, Paul lobbied for it and was defeated by the arguments of Joe and Noah. Paul pleaded that\" I just want a part;' though he had been told it was \"basically the smallest part in the play;' and he re-vealed his social understanding by ask-ing \"Why don't you guys want me?\" Although the boys cast girls in high-status and powerful male or male-type roles, they argued over a female role for a male actor. Although the written genre appears to be a play script, the verbal genre was one of argument, quite legal in tone, designed to win the role of Princess H for whomever the authors saw as socially worthy. Drawing on intertextual and situated social material, through interaction in the play and in real conversation, using naming word-play and classmates to cast the play, and with both regard and disregard for biological sex, the children constituted This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 415 a social map and a social agenda among themselves. Gender, in a sense, was less divisive and problematic in this case where social constraint of one another and a heterosexual sensibility of want-ing to be near the favored girls were of primary interest to the boys involved. I will now turn to the last of the three literacy events, a focal look at Callie, a high-status third grade girl in one of the classes and an avid partici-pant in teacher-initiated literacy tasks. Callie-the-Torturewoman We can lose ourselves in the parts we play, and if this continues too long we will not find our way back again. -Unsworth, 1995, p. 206 I have shown that, in performing a play such as The llama's Secret and constructing a written socio-drama such as \"Clone Wars;' the characters, setting, and plot are a result of complex social negotiations and navigations among participants. In authoring a story a child can control not only the actions and talk of the characters but who gets to be whom, even as she draws upon classroom discourse, teacher as-signments, and ideas from classmates. Many of the children cast themselves and friends across and into gendered categories by naming and renaming characters or claiming identities pro-nominally through those characters. For many children this casting was both social and personal work and operated at conscious and subconscious levels. Callie's writing captured a range of identities through which she expressed power and position, including those that might be difficult to take up in her life, at least in a biological sense. Callie wrote two major stories during the course of the study into which she cast herself explicitly or implicitly, \"The Temple\" and \"The Dream-Complete It\" story. I will discuss each one and Callie's interview comments about the stories in order to show the ways in which Callie under-stood her place and that of others in the stories. \"The Temple\" was written in re-sponse to an assignment after a social studies unit on Latin America. Children were invited to write narrative fictional stories in which they expressed their knowledge about Mayan culture. In \"The Temple,\" a mystery about an ancient missing priest, Callie cast the following characters: a mom, a daugh-ter named Mary Circhip, Callie-the-Torturewoman, a bony-hand man, and assorted Mayans including a chief, a high priest, and a missing priest. In the story Callie the author bridged two characters-the protagonist Mary Circhip, whose first name was that of Callie's real best friend and whose last name echoed the \"hip circles\" that Callie and her friends laughed about during an African dance experience, and Callie-the-Torturewoman, the evil antagonist. In an interview Callie claimed \"there really isn't a narrator, so I'm sort of Mary\" and that Mary \"likes to brag, she likes to solve mysteries, she cares about every people .... When I wrote this I was thinking about Nancy Drew, because I love Nancy Drew.\" Callie did This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions416 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 fEBRUARY 2002 not create a perfect Mary as an alter ego through whom to narrate her story. Instead, Mary was a complex, self-centered character who liked to brag and said in the story, \"I, Mary Circhip, was the most popular kid in my elemen-tary school, so I was not all that excited to leave all my fans and my detective job to go to some city far, far away.\" The character Mary later met Callie-the-Torturewoman, who was guarding the bony hand man in the funerary crypt: \"My name is Callie;' said the guard. \"I am the torturewoman. If you do anything bad I will torture you. If you laugh, smile, act happy, you will pay. Ha ha ha ha,\" Cackled Callie. \"Oh yeah, I forgot. If you try to kill me you can't.'' I couldn't help but laugh. It was so funny. She actually thought she could hurt me. \"You think this is funny, eh? Well, maybe after this you will think otherwise,\" the woman torturer said. Callie was just about to slap me when the door leading to my room was thrust open and out stepped my mom. While Callie the author used her best friend's name for the protagonist, the name of the antagonist bore Callie's name. Additionally, the antagonist was named Callie-the-Torturewoman and was a \"woman torturer.\" Woman was marked, distinguishing this torturer from expected torturers, men as the default gender torturers (Tannen, 1993). Like women doctors, women presidents, women explorers, and women scien-tists, Callie was a woman torturer, not just a (man) torturer. When I asked Callie the author how the Torturewoman came to be named Callie, her personal name, she told me: Well, her name was, I think her name was really weird. I have no idea how my sister got it . . . because my sister made up my nickname when she couldn't say Carolyn (Callie's real first name). So, it just made me think of, when I was writing, I wanted to have like this big torturewoman going \"ooooh\" and so I just happened to think of my name, so I wrote down my name. The character traits are nasty, mean, horrifying, but gruesome? I don't know. I guess ifl saw her and she was taking care of me I would be like really scared . . . because she's like \"you laugh, you will be happy, you'll pay, ha, ha!\" When I asked Callie directly if she was ever Callie-the-Torturewoman,she told me \"I am also her; she has my name. I feel like her when I capture someone. I feel evil and like laughing and evil laugh. She's just mostly evil,\" likely recalling her involvement in \"the play-ground wars of February,\" a run and capture game between the boys and the girls. Callie the child author cast herself into the roles of protagonist Mary and antagonist Callie-the-Torturewoman. Neither role was entirely flattering; both were powerful and complexly masculine and feminine. The reference to her literary heroine, the fictional Nancy Drew, allowed her a traditionally masculine detective role without hav-ing to mark it as \"woman detective.\" The torturer role did not. As an author, and one with both the writing skills and agency to cast characters, friends, self, and various names, Callie was in a position to cross gender boundaries and mark them or not, according to the resources from which she drew. In her next major story, Callie used the position of narrator to cast herself This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 417 across another gender border. The as-signment asked students to write a story in which a child has a dream and shares that dream with the class because it \"concerns the whole class, the whole school, the entire human race, and is remembered as a major event in the story.\" Callie wrote of a dream in which \"He, the creator of life, and of death\" showed the dream narrator a \"picture of all the girls on one side of the earth and all the boys on the other.\" Then He told her:\"You must determine what to do. I advise you not to go anyplace unex-plored. Peculiar things might happen there.\" The teacher sent the dream narra-tor to the president, who, surprisingly to me and Callie's teacher, greeted the narrator with \"Hello son.\" (We had both assumed that the narrator was a girl, perhaps Callie.) The president put a stop to the geographical separation of the boys and the girls, and the narrator went home peacefully. However, the story ended with, \"When I woke up everything was different. The girls were back with the boys and vice versa. The president did everything. Except I was on the equator. Was something else wrong?\" Both the teacher and I were sur-prised to find that Callie had cast herself once more across a gender border through the male perspective of the narrator of the story. Her shifting and multiple consciousness of gender in her story was further evidenced when I interviewed her about the story. I asked her to tell me more about the boy narrator: CALLIE: Urn, the boy? I have no idea what his name is. What do you want to know? DDA: Well, if you had to describe his character traits, what would they be? CALLIE: He's a boy, he gets a little cau-tious sometimes, but he goes through things. DDA: What do you mean he goes through things? CALLIE: Well, like I say \"I walked and I walked, twiddling my thumbs and sweat pouring down my forehead like pails of water being poured from my hair to my chin.\" I mean, he's really getting scared about what he's doing, but he kept going, going to get through with it. Callie's pronouns changed back and forth between \"he\" and \"I.\" She said \"he's a boy\" as she stood apart from him, then, \"I say \"I walked and ... \"as if she was the boy narrating the story. She could have said \"I write\" or \"he says\" instead of\" I say,\" but instead she chose words that indicated a crossing into the male narrator's voice. But then she backed out when she said \"I mean, he's really getting scared about what he's doing .... \"When I asked her direcdy if she was the narrator in the dream story, she said: Mostly no. It's my mind saying it. It's a char-acter in the book that's transforming it for me. Anyways, it's from my mind. I can't go into the story world but I put my thoughts into someone in the story world so that he can narrate it for me. Callie, in being \"mostly\" not the boy narrator, implied that she was This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions418 REsEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 • fEBRUARY 2002 somewhat the boy narrator by putting her\"thoughts\"into him, where\"he can narrate it for me.\" One can speculate on the hegemonic positioning of males and females that Callie drew upon as a resource in expressing her thoughts through the boy narrator. One can also see in this story a strong binary of male and female established through the \"picture of all of the girls on one side of the earth and all the boys on the other.\" Yet Callie stepped across that gender boundary through her literacy agency. I asked her about where her ideas for the story came from in order to understand more about what might have propelled that agency: CALUE: Well I had this vision about these girls, turning their backs on every-one. When I was thinking about, there would be just one girl who would be reaching out to the other side and all of the boys would be like \"ugh;' and there would be one boy reaching out but the whole world would be turning their backs on each other. DDA: Why? Where did you come up with that? CALLIE: I don't know but I sort of, like see I had a friend who is a boy; who is in my class now, and has been in my class since preschool. Up until kindergarten we would play every single day, every single recess, sit next to each other, everything. And from first grade till now, we have been turning our backs on each other, not really talking about each other, talk-ing to each other, just talking once in a while, but just, we're not really friends anymore because, we're like afraid or something (pause) it's like we're afraid that something's going to happen if we do that, that like, we're just noticing that we're (two/ too) different people and \"bye-bye.\" DDA: Is this story trying to accomplish something? CALLIE: Just to say, look, sometimes this is happening. Like to me it has been happening a lot with Maria. Where, we were friends, totally everyday; but now we are turning our backs on each other. Because lots of things are happening to her, I'm on the other side. DDA: Do those things that are happen-ing have anything to do with her relationship to Pat (the boy who likes Maria)? CALLIE: Yes. Qaughs) Well, 'cause she's been getting love notes from him, and I've been seeing her cutting out hearts, almost writing to him, and I've been trying to stop her, because I don't think we should be doing that, that we are too young or what-ever.And once I stopped her and she said, \"Oh, all right\" and she put the hearts and scissors away. But I thought she would keep doing it, so I took the scissors away.And now she goes with other friends and stuff. Callie's explanation shows a deep connection with the changing social scene among her friends and classmates, which included a dynamic flux of relationships between the sexes and between same-sex friends. Callie was positioned in her social world as turn-ing away and being turned away from This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 419 both her male friend, whom she had known since preschool, and her girl-friend, Maria. Her power in her rela-tionships with Maria and with her preschool male friend was very compli-cated and in flux at this point. In her writing she was also multiply posi-tioned in a rich mix offemininities and masculinities: as a boy narrator, as a torturewoman, and as her friend Mary Circhip, who was like Nancy Drew. And, although Mary Circhip might have been the most feminine role in play, as the Nancy Drew-type detective and the problem-solver in the story, she was not a descendently-positioned fe-male. Issues of gender difference and dominance merely begin to explain Callies's positions and the positions of others. They cannot account fully for the complicated gender border strad-dling that Callie took up in her life, caught between allegiances to friends, and in her stories, where the narrator stood \"on the equator\" or became a torturewoman. Border straddling, a term inspired by Thorne's (1993) conception of chil-dren doing borderwork at the edges of each other's gender that serves to mark borders more strongly than they other-wise might be marked, means standing in both gender worlds and ideologies simultaneously. Thorne talks about border crossing as the ways in which boys and girls move across gendered boundaries, taking up the activities and characteristics of the other. Callie ap-pears to be more than a border-crosser: She was a border straddler who cast her social self, her social identity, to stand simultaneously as both male and female in her stories. Neither male nor female position was necessarily or consistently dominant or dominated. Instead they were in tension and dynamic, symbolic of various ways of being in the world that she had the agency to take up, or not, through her writing. Nested within her greater com-munity and culture, nested within a bevy of social relationships, Callie used naming, intertextual references, and interactions to cast social identities of gender as well as personal identities for herself. She had the agency and literacy strategies with which to enact complex and highly nuanced gender identities, even within teacher-assignments tied to curricular content. Like the authors of\"Clone Wars\" she identified herself and others in her literacy worlds, and these identities bore strong resem-blance to her social world. Her literacies and her identities, for herself and the others she cast, were highly entwined and overlapping. Discussion George, Callie, Paul, Noah,Joe, Pat H., Maria, and their classmates were busy casting identities for themselves and others, using literacy practices to figure out \"who's who and what's what,\" as George described it. While gender power and position are salient, simple interpretations of dominance and dif-ference do not capture or respect the complexity and tensions of children's literacy and identity work. As this study shows, socially situated and eclectic perspectives are important to under-standing the richness of very human literacy and identity phenomena. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions420 REsEAR CH IN THE TEACHING OF ENGLISH • V OLUME 36 • fEBRUARY 2002 To summarize, in The Llama's Secret the children both revealed their under-standing of being male and female through their complex interpretations of playing another sex in voice, cloth-ing, age, and other physical factors. However, they also understood cross-sex casting as situated in their experi-ences, acting skill, discourse, and understanding of how an audience might react. The experience of role-switching and the follow-up conversa-tions and writing reveal the children's understanding of gender as social and cultural as well as physical, as difference as well as non-difference. Playing an-other gender, it seems, is about taking on the culture's physical and non-physical meanings for gender. Accord-ing to Robin, \"Male/female roles can't always be played by the opposite gen-der,\" implying that sometimes they can. John said that \"sometimes when acting you tend to forget you're a boy or a girl\" and Callie claimed, \"I played a boy part in our play and I didn't feel any different.\" Gender, it seems, is about more than biological sex, and the children know it. The task of taking a position on being for or against cross-sex casting. in theater was both shaped by the proleptic teacher assignment and challenged by the children's experi-ences, class discussions, and competing ideologies. In the case of\"Clone Wars,\" Paul was marginalized socially with the threat of fictional death and the poten-tial of being killed off twice should he take the role ofPrincess H . The \"Clone Wars\" authors cast gender both stereotypically and non-stereotypically in order to get close to the girls they considered to be high status, with status based on looks, intelligence, and ath-letic prowess. Noah and Joe used their own social desires, perhaps their devel-oping heterosexual desires, to cast roles in their play, with gender being an aspect of and complication to their casting rather than a determining di-chotomy. Callie, acting not in solitude or without experience, claimed a range of conflicting identities for herself and others, trying these roles on with skill and confidence. Articulate and highly positioned socially, she had the agency to use her literacy skills to work out some of her social concerns among her developing peers through her academic writing. Although at first glance her literacy work is personal, her responses and her place among others shows how entangled the academic, personal, and social can be for children. In the privileged community of this study, parents are very concerned from year to year about which teacher their child will get, understanding learn-ing primarily as a dyadic activity be-tween adult and child. Yet to watch children in daily practice is to realize how much more learning itself is a collaborative group activity rather than a dyadic one (Gregory & Williams, 2000). Seven hours per day in a subur-ban elementary classroom with a per-meable curriculum provides ample time for children to mediate one another's literacies and for teachers and peers to influence ideologically local and global social identities. The permeability of such a site to local literacies, coupled This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 421 with the agency of the children to speak gender and to speak cif gender, allows insight into both the constitu-tion of identities through literacy prac-tices and the tensions inherent in those identities and practices. Gender was on the teachers'minds, and it was present in the children's writing and talk, both academic and social. Although the teachers under-stood gender's presence as primarily harassment and worked to counter it with cross-gender role-play through inverted character traits, gender's pres-ence was not entirely hegemonic or patriarchal. Power and dominance were imbedded in representations and inter-actions about gender. However, power and position were constandy in flux, dependent on authorship, personal his-tory, proximity to and status among others, and teacher and student initi-ated literacy events. Classrooms such as these, in an ailluent/professional, executive/ elite (Anyon, 1980) suburban public school, are permeable to the children's lan-guage, knowledge, and experiences. They hold promise for creating school environments that recognize the en-tangled aspects of the personal, social, and academic. These are spaces of privilege where children bring their prior experiences, cultural and linguis-tic resources, interests, and social desires to bear on literacy and identity. The permeability of classroom spaces also has the potential to make the social aspects ofliteracy apparent to teachers. My work in public urban schools and suburban working-class schools has shown me that such permeable settings are not the norm. However, the perme-able curriculum should not be con-fused with a highly progressive curriculum in which children are often left on their own to reproduce and reiterate cultural norms willy-nilly with little to no mediation by teachers or less powerfully positioned peers. In finding response theories and socio-linguistic tools to be useful to a study such as this, I initially shunned applying a feminist lens to the data. I wanted to avoid the dichotomizing effects of dominance and difference theories that lead to victimization rep-resentations for girls. However, I found that a feminist poststructural lens was useful. A hybrid of feminist and post-structural theories in relationship \"ges-tures toward fluid and multiple dislocations and alliances\" (St. Pierre & Pillow, 2000, p. 3) and allows for a messier social science, one that tries to be accountable to complexity (Lather, 2000). Poststructural theories also ges-ture toward a focus on the situated reality of everyday practices, what Gal (1995) sees as the \"structure of social relations that is reproduced and some-times challenged in everyday practice\" (p. 1 7 5). In terrns ofliteracies of reading, writing, and discourse, ideologies are \"inscribed in language and enacted in interaction\" (p. 178). Therefore the local literacy practices, proleptic but always in tension, are essential to under-standing both local resources for posi-tions of power and enactments of power through interactions, both writ-ten and oral. I agree with Dyson (1999) who believes that This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions422 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 fEBIUJARY 2002 Tensions are critically important, even though they may not be resolvable. To negotiate literate participation in complex classroom cultures, children must differen-tiate not only phonological niceties and textual features but also social worlds-the very social worlds that provide them with agency and important symbols. (p. 396) Recognizing and valuing those tensions is possible only when methods for literacy research account for the consistently social nature of persons, including children, and their positions in cultures, neighborhoods, families, and classrooms. Children are devalued in current assessment and standards-crazed trends when their daily activities and practices and the ways in which those practices are part and parcel oftheir personal and social experience are ignored. Girls and boys are also deval-ued when their gender status is simpli-fied into mere difference and dominance, ignoring the rich subtleties of their ever fluid and evolving social identities. In spite of the current focus on bottom-line test scores and the knowl-edge and skills they supposedly repre- Author Note sent, the children in this setting as-sumed the agency, with their resources in hand, to do academic and social work more or less simultaneously. In casting gender globally, socially, locally, and personally through naming and renam-ing, intertextual references, bodycasts, and interactions, the children showed how they understood gender identities as well as how they used their literacy activities to purposefully do gendered social work. This is a real classroom, filled with children and their literate discursive social practices. This study, however, is but one view of one classroom. To understand more fully how literacy and social identities are entwined in mutual constitution, educators must look to other locally situated literacy practices among children in a range of commu-nities and work to understand what Yagelski (2000) calls their ever-shifting discourses and literacy participation. We must also challenge less permeable classroom settings as unsuitable for literacy learning. This study was supported by a faculty Research Grant from Swarthmore CoUege. I would like to thank Lawrence Sipe, Brian Street, and Rebecca freeman for their inteUectual support dur-ing the study. I am grateful to the reviewers of this article for their clear insights and generous suggestions. Please direct correspondence to Diane Downer Anderson at Swarthmore CoUege, 500 CoUege Ave., Swarthmore. PA 19081-1397; e-mail: danders1@swarthmore.edu. References AITKEN, A. (1992). \"When the woman came crying\": Social issues through children's writing. English Quarterly, 24(2), 20-24. ANDERSON, D. D. (1998). Casting gender: The constitution qf social identities through literacy practices among third and fourth graders. Unpublished doctoral dissertation, The University of Pennsylvania. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 423 ANDERSON, D. D. (1999). WO-MAN meets Callie-the-Torturewoman: Naming and renaming across talk and text. In S.Wertheim,A. C. Bailey, & M. Corston-Oliver (Eds.), Engendering communication: Proceedings from the Fifth Berkeley Uilmen and Language Conference (pp. 13-24). Berkeley, CA: Berkeley Women and Language Group. ANYoN, J. (1980). Social class and school knowledge. Curriculum Inquiry, 11(1), 3-41. BAKHTIN, M. M. (1981). The dialogic imagination: Four essays by M. M. Bakhtin (M. Holquist, Ed.; C. Emerson & M. Holquist, Trans.). Austin: University ofTexas Press. BAKHTIN, M. M. {1986). Speech genres and other late essays (C. Emerson & M. Holquist, Eds.; V.W McGee, Trans.). Austin: University ofTexas Press. BARTHES, R. (1973). The pleasure rif the text. (R. Miller, Trans.). New York: Hill and Wang. BARTHOLOMAE, D. (1995). Writing with teachers: A conversation with Peter Elbow. College Composition and Communication, 46,62-71. BARTON, D. (2000). Researching literacy practice: Learning from activities with teachers and students. In D. Barton, M. Hamilton, & R. Ivanic (Eds.), Situated literacies: Reading and writing in context (pp. 167-179). New York: Routledge. BARTON, D., & HAMILTON, M. (2000). Literacy practices. In D. Barton, M. Hamilton, & R. lvanic (Eds.), Situated literacies: Reading and writing in context (pp. 7-15). New York: Routledge. BARTON, D., HAMILTON, M., & lvANIC, R. (Eds.). (2000). Situattd literacies: Reading and writing in context. New York: Routledge. BENTON, M. (1983). Secondary worlds. journal rif Research and Development in Education, 16, 68-85. BLEICH, D. (1986). Gender interests in reading and language. In E. A. Flynn & P. P. Schweickart (Eds.), Gender and reading (pp. 234-266). Baltimore, MD: Johns Hopkins University Press. BOGDAN, D. (1990). In and out of love with literature: Response and the aesthetics of total form. In D. Bogdan & S. Straw (Eds.), Beyond communication: Reading comprehension and criticism {pp. 109-137). Portsmouth, NH: Heinemann. BRIDWELL-BOWLEs, L. (1995). Freedom, form, function: Varieties of academic discourse. College Composition and Communication, 46, 46-71. BRITTON,]. (1984).Viewpoints:The distinction between participant and spectator role: Language in research and practice. R esearch in the Teaching rif English, 18, 320-331. CALKINS, L. (1991). Living between the lines. Portsmouth, NH: Heinemann. CAMERON, D., FRAZER, E., HARVEY, P., RAMPTON, M. B. H., & RicHARDSON, K. (Eds.) (1992). Researching language: Issues rif power and method. New York: Routledge. CHEIU.AND,M. (1992). Gendered readings: Cultural restraints upon response to literature. The NewAdvocate, 5, 187-198. COCKING, R ., & RENNINGER, K.A. (Eds.) (1993). The development and meaning if psychological distance. Hillsdale, N]: Erlbaum. CoLE, M. {1985). The zone of proximal development: Where culture and cognition create each other. In J.V.Wertsch (Ed.), Culture, communication, and cognition: Vygotskian perspectives (pp. 146-180). New York: Cambridge University Press. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions424 RESEARCH JN THE TEACHING OF ENGLISH • VOLUME 36 FEBRUARY 2002 ColE, M. (1996). Cultural psychology: A ona andfoture disdpline. Cambridge, MA: Harvard University Press. CoLLINs,]. (1995). Literacy and literacies. Annual Review if Anthropology, 24, 75-93. CoOPER, M. M., & HoLZMAN, M. (1989). Writing as soda/ action. Portsmouth, NH: Heinemann. CoRsARo,W., & EDER, D. (1990). Children's peer cultures. Annual Review if Sociology, 16, 197-220. DAVIES, B. (1993). Shards if glass. Cresskill, NJ: Hampton. DAVIES, B., & HARRE, R. (1990). Positioning: The discursive production of selves. The Jourm~lfor the Theory if Soda/ Behavior, 20(1), 43-63. DvsoN,A. HAAs. (1993). Soda/ worlds if children learning to write in an urban primary school. New York: Teachers College Press. DYSON, A. HAAs. ( 1997). Writing superheroes: Contemporary childhood, popular culture, and classroom literacy. NewYork:Teachers College Press. DYSON, A. HAAs. (1999). Coach Bombay's kids learn to write: Children's appropriation of media material for school literacy. Research in the Teaching if English, 33, 367-401. DYSON, A. HAAs. (2000). On reframing children's words: The perils, promises, and pleasures of writing children. Research in the Teaching if English, 34, 352-367. EcAN-ROBERTSON,A. (1998). Learning about culture, language, and power: Understanding relationships among personhood, literacy praaices, and intertextuality. Albany, NY and Madison, WI: National Research Center on English Learning and Achievement. Report Series 2.35. EISENHART, M.A., & HoWE, K. R. (1992).Validity in educational research. In M. LeCompte,W. L. Millroy, & ]. Preissle (Eds.), The handbook if qualitative research in education (pp. 643-680). San Diego, CA: Academic Press. ELBow, P. (1995). Being a writer vs. being an academic: A conflict in goals. College Composition and Communication, 46, 72-83. ELLSWORTH, E. (1992).Why doesn't this feel empowering? In C. Luke & ] . Gore (Eds.), Feminisms and critical pedagogies (pp. 90-I I 9). New York: Routledge. ERICKSON, F. (1986). Qualitative methods of research on teaching. In M. Wittrock (Ed.), Handbook if research on teaching (3rd ed.) (pp. 119-161 ). New York: Macmillan. EvANS, K. (1996). A closer look at literature discussion groups: The influence of gender on student response and discourse. The New Ad110cate, 9, 183-196. FINNEGAN, R. (1992). Oral traditions and verbal arts:A guide to research praaices. New York: Routledge. FRAZER, E. (1992).Talking about gender, race, and class. In D. Cameron, E. Frazer, P. Harvey, M. B. H. Rampton, & K. Richardson (Eds.), Researching language: Issues if power and method (pp. 90-112). New York: Routledge. FREEMAN, R., & McELHINNY, B. (1995). Language and gender. In S. McDay & N. Hornberger (Eds.), Sodolinguistics and language teaching (pp. 218-280). New York: Cambridge University Press. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 425 GAL, S. (1995). Language, gender, and power: An anthropological review. InK. Hall & M. Bucholtz (Eds.), Gender articulated: Language and the socially constrncted seif(pp. 169-182). New York: Roudedge. GEE,]. (1990). Social linguistics: Ideology in discourses. New York: Falrner. GEERTZ, C. (1973). The interpretation if cultures: Selected essays. New York: Basic Books. GILBERT, P. (1991). Writing pedagogy: Personal voices, truth-telling, and \"real\" texts. In C. Baker & A. Luke (Eds.), Towards a critical sodology if reading pedagogy (pp. 1-23). Philadelphia: John Benjamins. GooDWIN, M. H. (1990). He-said-she-said:Talk as social organization among black children. India-napolis: Indiana University Press. GRAY-SCHELEGEL, M.A., & GRAY-ScHELEGEL,T. (1996).An investigation of gender stereotypes as revealed through children's creative writing. Reading Research and Instruction, 35, 160-170. GREEN,]. L., & DIXON, C. N. (1994). Talking knowledge into being: Discursive and social practices in classrooms. Linguistics and Education, 6, 231-239. GREGORY, E., & WILLIAMs, A. (2000). City literacies: Learning to read across generations and cultures. New York: Roudedge. GJUJMET, M. R. (1988). Bitter milk. Amherst, MA: University of Massachusetts Press. GuMPERz,J.J. (1982). Discourse straregies. New York: Cambridge University Press. HILL, C., & ANDERSON, L. (1993). The interview as research tool. New Ideas in Psychology, 11, 111-125. ls£R, W (1972). The reading process: A phenomenological approach. New Literacy History, 3, 279-299. PSON, M., & MAsLAND, S. (1993). Girls are not dodo birds! Exploring gender equity issues in the language arts classroom. Language Arts, 70, 104-108. KAMBERELIS, G., & Scorr, K. D. (1992). Other people's voices: The coarticulation of texts and subjectivities. Linguistics and Education, 4, 359-403. KAMLER, B. (1994). Gender and genre in writing. Linguistics and Education, 6, 153-182. KoNIGSBURG, E. L. (1996). The view ftom Saturday. New York: Atheneum. LATHER, P. (2000). Drawing the line at angels: Working the ruins of feminist ethnography. In E. A. St. Pierre & W S. Pillow (Eds.), Jtbrking the ruins: Feminist poststrnctural theory and methods in education (pp. 284-311). New York: Roudedge. LINCOLN,Y., & GUBA, E. (1985). Naturalistic inquiry. Thousand Oaks, CA: Sage. LUKE, A. (1992).The body literate: Discourse and inscription in early literacy training. Linguistics and Education, 4, 107-129. MARKs, T. A. (1995). Gender differences in third graders oral discourse during peer-led lirerature discussion groups. Unpublished doctoral dissertation, University of Maryland at College Park. MAYBIN,]. (1987). Children~ talk in school and the construction if meaning. Unpublished master's thesis, Sussex University, UK. Jm-SJMThis content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and Conditions426 RESEARCH IN THE TEACHING OF ENGLISH • VOLUME 36 FEBRUARY 2002 MAYBIN,J. (1994). Children's voices: Talk, knowledge, and identity. In D. Graddol,J. Maybin, & B. Stierer (Eds.), Researching language and literacy in social context (pp. 131-150). Philadelphia: The Open University Press. MAYBIN, J. (2000). The New Literacy studies: Context, intenextuality, and discourse. In D. Banon, M. Hamilton, & R. lvanic (Eds.), Situated literades: Reading and writing in context (pp. 197 -209). New York: Routledge. McCARTHEY, S.J. (1998). Constructing multiple subjectivities in classroom literacy contexts. Research in the Teaching of English, 32, 126-160. MILLARD, C. (1997). Differently literate: Boys, girls, and the schooling of literacy. New York: Falmer. OcHs, E. (1993). Constructing social identity: A language socialization perspective. Research on LAnguage and Social Interaction, 26, 287-306. ORELLANA, M. F. (1994,April). Literacy as a gendered soda/ practice in two bilingual classrooms. Paper presented at the annual meeting of the American Educational Research Association, New Orleans. ORELLANA, M. E (1995, April). Good guys and \"bad\" girls: Gendered identity construction in a writing workshop. Paper presented at the annual meeting of the American Educational Research Association, San Francisco. PALAcios, A. (1993). The Llama~ Secret. Mahwah, NJ:Troll Associates. PATTON, M. Q. (1990). Qualitative evaluation and research methods (2nd ed.).Thousand Oaks, CA: Sage. POWER., B. (1995). Bearing walls and writing workshops. LAnguage Arts, 72, 482-488. SAVILI.E-TROIKE, M. (1982). The ethnography of communication: An introduction. Baltimore: University Park Press. SHELDON, A. (1993). Pickle fights: Gendered talk in preschool disputes. In D. Tannen (Ed.), Gender and conversational interaction (pp. 83-1 09). New York: Oxford University Press. SIPE, L. (1996). The construction of literary understanding /,y first and second graders in response to picture storybook readalouds. Unpublished doctoral dissertation, The Ohio State University. SoLSKEN,J.W. (1993). Literacy, gender, and work in families and schools. Norwood, NJ:Ablex. SPINDLER, G. , & SPINDLER, L. (1992). Cultural process and ethnography: An anthropological perspective. In M.D. Le Compte, W. L. Millroy, & J. Preissle (Eds.), The handbook of qualitative research in education (pp. 53-92). San Diego: Academic Press. SPRADLEY, J. P. (1980) . Participant observation. New York: Holt, Rinehart, & Winston. STRAUSS, A., & Co RBIN,]. (1990). Basics of qualitative research: Grounded theory procedures and techniques. Thousand Oaks, CA: Sage. SroTSKY, S. (1995). The uses and limitations of personal or personalized writing in writing theory, research, and instruction. Reading Research Quarterly, 30,758-776. Sr. PIERRE,E.A., & PILWW,W S. (Eds.) (2000). Utbrking tire ruins: Feminist posfstructural theory and methods in education. New York: Routledge. This content downloaded from 130.58.65.13 on Thu, 17 Jul 2014 14:29:03 PMAll use subject to JSTOR Terms and ConditionsCasting and Recasting Gender 427 STREET, B.V. (1993a). lnttoduction:The new literacy studies. In B.V. Street (Ed.), Cross-cultural approaches to literacy {pp. 1-21). New York: Cambridge University Press. STREET, B.V. (1993b, March). What do we mean by localliteracies? Paper presented at the confer-ence, \"Sustaining localliteracies: People, language and power,\" Reading University, UK. SlREET, B.V. (1995). Sodalliterades: Critical approaches to literacy in development, ethnography, and education. New York: Longman. TANNEN, D. (1993a).What's in a frame? Surface evidence for underlying expectations. In D. Tannen (Ed.), Framing in discourse {pp. 14-56). New York: Oxford University Press. TANNEN, D. (1993b).The relativity of linguistic strategies: Rethinking power and solidarity in gender and dominance. In D. Tannen (Ed.), Gender and discourse {pp. 19-52). New York: Oxford University Press. TAPIA,]. (1991). Cultural reproduction: Funds rf knowledge as survival strategies in the Mexican-American community. Unpublished doctoral dissertation, University of Arizona. THORNE, B. (1993). Genderplay: Girls and boys in school. New Brunswick, NJ: Rutgers University Press. UNSWORTH, B. (1995). Morality play. New York: Doubleday. VOLdiNOv,V. N. (1993). Language and ideology. In]. Maybin (Ed.), Language and literacy in soda/ practice (pp. 44-57). Philadelphia: The Open University Press. WALKERDINE,V. (1990). Schoolgirl fictions. NewYork:Verso. WEEDON, C. (1987). Feminist practice and poststructuralist theory. Cambridge, MA: Blackwell. WEsT, C ., & ZIMMERMAN, D. H. (1987). Doing gender. Gender and Sodety, 1(2), 125-151. YAGELSKI, R. P. (2000) . Literacy matters: Writing and reading the soda/ self N ew York: Teachers C ollege Press. ",
    "Link": "https://core.ac.uk/download/84122009.pdf"
}