{
    "Title": "5th Annual Progress Reporting and Coordination Meeting on CCAFS Projects and Regional Activities in Southeast Asia",
    "Authors": "CGIAR Research Program on Climate Change, Agriculture and Food Security",
    "Year": "No year available",
    "Abstract": "The proceedings document the results of the 5th Annual Progress Reporting and Coordination Meeting on CCAFS Projects and Regional Activities in Southeast Asia. The report tackles the progress of activities in the CSV sites and on CCAFS project implementation in 2019; the significant outputs and outcomes of FP/CSV implementation; and the knowledge, learning, and experiences across projects",
    "Keywords": "No keywords available",
    "Publisher": "",
    "Publication Date": "No publication date available",
    "Journal": "No journal available",
    "Citation Count": 0,
    "Full Text": "  \n 5th Annual Progress Reporting and Coordination Meeting on \nCCAFS Projects and Regional Activities in Southeast Asia \n \n21 November 2019 \nBallroom Van Mieu 3, Pullman Hanoi Hotel \nHanoi, Vietnam \n \nSPECIFIC OBJECTIVES \n \nThe one-day meeting will cover the following specific objectives: \n1. Report on the progress of CCAFS projects and activities in 2019; \n2. Identify the significant outputs and outcomes of FPs and regional activities; and \n3. Share knowledge, learning, and experiences across projects. \n \nEXPECTED OUTPUTS \n \n1. A review of the implementation progress of FPs in 2019; \n2. Identification of emerging outcomes that will be pursued in 2020; and \n3. Solutions to the identified issues/problems/challenges/gaps in the implementation of the FPs and \nregional activities.  \n \nPROGRAM \n \nTime Activity In-Charge \n08:00–08:30 Registration Secretariat \n08:30–09:00 Opening program  \n Welcome remarks Leo Sebastian, RPL, CCAFS SEA \n Opening remarks Chu Van Chuong, ICD-MARD \n Introduction All participants \nPlenary Session 1: Presentations on outcomes of CCAFS works in Southeast Asia \n09:00–09:20 P264: Application of the climate-related risk mapping \nand adaptation planning (CS-MAP) in the Mekong \nRiver Delta to cope with salinity intrusion \nLe Thanh Tung, DCP \n(20 mins report) \n09:20–09:40 P264: CCAFS’s Outcomes in Vietnam Alice Ferrer, UPV \n(20 mins report) \n09:40–10:00 P264: Assessing the outcome of the Myanmar CSA \nStrategy \nEisen Bernardo, CCAFS \n(20 mins report) \n 10:00–10:15 Discussion (Q&A)  All (Presenters are the panelists) \n10:15–10:25 Group photo All participants \n10:25–10:40  Poster sessions \n Coffee/tea break  \n \n \n \nPlenary Session 2: Presentations on CCAFS Flagship Projects \n10:40–10:55 P1591: Policy imperatives for Southeast Asia's regional \nfood systems under climate change. \n \n \nSampriti Baruah, CIP Asia \n(15 mins report) \n 10:55–11:10 The Asia Climate Policy Hub: Developments and \nstrategy in Southeast Asia \n \nGodefroy Groesjean, CIAT Asia \n(15 mins report) \n 11:10–11:30 P1596: Gender sensitive CSA options trialed and \ntested in CSVs, and business case development for \nscaling \nTiffany Talsma, CIAT Asia \nRene Vidallo, IIRR Asia \nReiner Wassmann, IRRI   \n(20 mins report) \n11:30–11:45 P1602: GHG mitigation in rice: From evidence-based \nconcepts to adoption at scale \nBjoern Ole Sander, IRRI \n(15 mins report) \n11:45–12:05 P1608: A Climate Services Menu for SEA (CliSM): tackling \nscaling with a diversity of end users in the climate \nservices value chains \nAngelica Barlis, CIAT Asia \nLe Thi Tam, ICRAF \nPeter Clausen, CARE \n(20 mins report) \n12:05–12:15 Discussion (Q&A)  All (Presenters are the panelists) \n12:15–13:15   Lunch break  \n \n \n \n   \nPlenary Session 3: Presentations on Bilateral Projects \n13:15–13:30 WorldFish Tran Van Nhuong, WorldFish  \n(15 mins report) \n13:30–13:45 International Center for Tropical Agriculture Godefroy Groesjean, CIAT Asia \n(15 mins report) \n13:45–14:00 International Rice Research Institute Reiner Wassmann, IRRI \n(15 mins report) \n14:00–14:15 World Agroforestry Nguyen Quang Tan, ICRAF \n(15 mins report) \n14:15–14:30 Discussion (Q&A)  All (Presenters are the panelists) \nPlenary Session 4: Presentations on Regional Activities \n14:30–14:40 P264: CCAFS’s Regional Agricultural Forecasting Toolkit \n(CRAFT) \nSridhar Gummadi, CCAFS SEA \n(10 mins report) \n14:40–14:50 P264: Prioritizing CSA in Vietnam Luu Ngoc Quyen, NOMAFSI \n(10 mins report) \n14:50–15:00 P264: Development of training materials on climate-\nsmart rice production for extension staff and rice \nfarmers \nNguyen Viet Khoa, NAEC \n(10 mins report) \n15:00–15:10 P264: Developing a Training Manual on Establishing \nClimate-Smart Villages (CSVs) in the ASEAN \nJulian Gonsalves, IIRR \nRosario B. Bantayan, SEARCA \n(10 mins report) \n15:10–15:20 P264: Adoption of climate-smart aquaculture (CSAq) \nin the North Central Coast of Vietnam \nCao Le Quyen, VIFEP \n(10 mins report) \n15:20–15:30 P264: Harnessing rural radio for climate change \nmitigation and adaptation in the Philippines \nRogelio Matalang, PFRB \n(10 mins report) \n15:30–15:40 P264: School-on-the-air on climate-smart agriculture \n(SOA-CSA) in Cagayan Valley, Philippines \nMar Raquepo, DA-RFO2 \n(10 mins report) \n15:40–16:00 Discussion (Q&A) All (Presenters are the panelists) \n16:00–16:15  Poster sessions \n Coffee/tea break  \n \n \n \n \n \n  \n \nPlenary Session 5: Roundtable discussion on transforming Southeast Asian agriculture \nModerator: Dada Bacudo, GIZ/ASEAN CRN \n16:15–16:25 Introduction of the topic and panelists  \n16:25–16:35 Presentation on  \nTransforming food systems under climate change \nJana Koerner \nCCAFS SEA \n16:35–17:20 Comments by panelist 1 Somchai Boonpradub  \nDoA, Thailand \n \nComments by panelist 2 Thavone Inthavong \nNAFRI, Laos \nComments by panelist 3 Mak Seoun  \nMAFF, Cambodia   \nComments by panelist 4 Yiyi Sulaeman   \nICALRRD, Indonesia \nComments by panelist 5 U-Nichols Manalo \nAMIA, Philippines  \nComments by panelist 6 Tran Cong Thang \nIPSARD-MARD, Vietnam \nDiscussion (Q&A)  All panelists \n17:20–17:30 Conclusions by the chair  \n \n \nClosing Plenary Session \n17:30–18:00 Closing Program \n Closing remarks \n \n Dr. Le Quoc Doanh \n Vice Minister, MARD \n \n \nMaster of Ceremonies: Rex Navarro, CCAFS SEA \n \n \n \n \n \n \n \n  \nOpening Program \n Welcome Remarks, Dr. Leocadio Sebastian, Regional Program Leader, CGIAR \nResearch Program on Climate Change, Agriculture and Food Security in \nSoutheast Asia (CCAFS SEA) \no Agriculture in Southeast Asia is already transforming due to many factors \nincluding a changing demography in the countries, the growing middle class, \nregional integration, and climate change. CCAFS aims to play a role in this \ntransformation by implementing climate-smart agriculture (CSA) options that \ncater to the context-specific situation and needs of its target communities.  \no Outcomes refer to the changes that happened after using the outputs. An \noutcome determines if the outputs were used in the first place and if they \nchanged the knowledge, skills, attitudes, and practices of stakeholders. \nOutcomes also refer to the development of initiatives that benefit large \nnumbers of stakeholders.  \no This year, CCAFS have started to document the outcomes of its projects \nimplemented in the last few years. This documentation was conducted to \nprepare the future activities and prioritized outcomes that CCAFS would pursue \nin the next few years.  \no The outcomes that would be prioritized must be context-specific, i.e., the \noutcomes are relevant in the situation where they would be pursued. To identify \noutcomes that were suitable to specific contexts, CCAFS has been collaborating \nwith its partners at various levels across Southeast Asia. This collaboration \nwould hopefully lead to more funding, and in turn, generate more outcomes in \nbroader geographic areas.  \no CCAFS SEA and its partners are always ready to assist countries in scaling CSA \ntechnologies and practices that improve food and nutrition security and \naddress impacts of climate change. To achieve this scaling, CCAFS is helping \ncountries mainstream CSA into their national programs and projects.  \no Scaling calls for more closer collaboration among stakeholders as it is already \nhard to achieve in the first place. Community-based participatory activities, \nwhich compose the major works of CCAFS, are even harder to conduct. \nStakeholders must discuss to synergize their ideas and elevate their quality of \nwork to achieve scaling. \n \n Opening Remarks, Dr. Chu Van Chuong, Deputy Director General, \nInternational Cooperation Department, Ministry of Agriculture and Rural \nDevelopment (MARD) \no Climate change is a major global issue that brings destructive impacts on many \ncountries. In Vietnam, climate change impacts had already dealt major damages \nand losses to its agriculture sector.  \nWorkshop highlights \n o The Vietnamese government had taken actions to address climate change, \nspecifically climate change adaptation and mitigation actions with CCAFS SEA \nand other international partners. These climate actions were integrated into the \nsocio-economic plans of Vietnam.  \no MARD highly appreciates the support of CCAFS SEA on the agriculture sector \nof Vietnam. Dr. Chu Van Chuong mentioned the risk mapping and adaptation \nplanning project that CCAFS SEA helped develop for the Mekong River Delta \n(MRD).  \no Dr. Chu Van Chuong encouraged the participants to share their knowledge and \nexperiences to prepare for the next years that would be dominated by \ndiscussions on climate change. He also wished that Vietnam could expand its \nnetworks to broaden the reach of its activities.  \n  \nPlenary Session 1: Presentations on outcomes of CCAFS works \nin Southeast Asia  \n P264: Application of the climate-related risk mapping and adaptation \nplanning (CS-MAP) in the Mekong River Delta to cope with salinity intrusion, \nLe Thanh Tung, Department of Crop Production  \no The focus of the presentation was about the adaptation of MRD and other areas \nsuffering from inundation and salinity intrusion. MRD, specifically, was shown \nto be divided into six agro-ecological regions. The salinity distribution and \nrainfall distribution of these regions were used to develop the CS MAP. \no The development of CS MAP started by identifying the climate-related risks in \nthe MRD. Based on the risk levels from technical data and local knowledge, the \nmaps were drawn and had eventually guided the crafting of adaptive plans. The \nplans included adjusting cropping calendar and changing cropping systems.  \no The risk maps and adaptive plans were polished and verified through meetings \nwith individual provincial Department of Agriculture and Rural Development \noffices. After polishing and verifying, they were integrated into the regional \nplans of MRD.  \no The adaptive plans reduced the damages on crops and minimized the risks of \ninundation and salinity intrusion in MRD.  \no The proposed cropping calendar for winter-spring season 2019-2020 was \nshown, as well as the status of rice production in autumn-winter 2019 on a \nmonthly basis.  \n \n P264: CCAFS’s outcomes in Vietnam, Dr. Alice Joan Ferrer, University of the \nPhilippines Visayas \no Outcome Harvesting was introduced as a new methodology to monitor and \nevaluate CCAFS projects. In this context, harvesting means identifying, \n describing, and analyzing outcomes or behavioral changes at the individual, \ngroup, community, and organizational level.  \no The steps to conduct Outcome Harvesting are: (1) design the study; (2) gather \ndata and identify outcome leads; (3) engage with key informants; (4) \nsubstantiate outcomes; (5) analyze and interpret; and (6) write up. A total of 13 \nkey informants were interviewed for this methodology, together with collecting \nand analyzing reports and online sources. Using this methodology, preliminary \noutcomes of CCAFS projects were identified.  \no The outcomes can be divided into four categories: (1) use of new tools, \napproaches, methodologies, and learning outcomes; (2) trust, relationships, \ncapability built among stakeholders in climate change; (3) use of new services; \nand (4) use of new knowledge generated in funded researches.  \no New tools and approaches that are now being used are the Climate-Smart \nVillage (CSV) as a research for development (R4D) approach, climate-smart \nmaps and adaptation plans (The CS MAP project), alternate wetting and drying, \nparticipatory approaches—which were commonly mentioned in key informant \ninterviews—gender and social inclusion, and changes in mindsets (from rice \nonly to crop and livelihood diversification, from adaptation to adaptation and \nmitigation).  \no Trust, relationships, and capacities were built through trainings/workshops, \nmeetings, inputs in plans, country statements, source materials (CSA \nCompendium, training materials on climate-smart rice production for extension \nstaff and rice farmers in Vietnam, etc.), and village demonstrations.  \no The new services that are now being used in the CSVs include the agro-climate \ninformation services for women and ethnic minorities and the community \ninnovation fund.  \no Benefit-cost analyses were conducted on CSA technologies and farm-level \nclimate-smart aquaculture. For future activities, more interviews would be \narranged to improve the final report.  \n \n P264: Assessing the outcome of the Myanmar Climate-smart Agriculture \nStrategies, Mr. Eisen Bernardo, CCAFS SEA \no Myanmar is facing a lot of climate-related challenges like any other countries \nin Southeast Asia. This makes Myanmar one of the most vulnerable countries \nto climate change impacts.  \no In 2014, the government committed to adopt CSA with the help of CCAFS and \nthe International Rice Research Institute (IRRI). As part of this commitment, \nMyanmar adopted the Myanmar Climate-smart Agriculture Strategy (MCSAS) \nIN 2015.  \no The MCSAS follows a systems approach in agriculture, considering the roles of \nvarious stakeholders in the “system,” i.e., the agriculture sector, and \nemphasizing knowledge generation among them. Knowledge generation, after \nall, is a key component of climate change adaptation.  \n o Despite its current weaknesses (unclear implementing mechanisms, absence of \na long-term investment plan, lack of alignment with Myanmar’s sustainable \ndevelopment plan, among others), opportunities were identified: \nunderstanding the overall picture of the climate change policy, integrating the \nMCSAS into educational activities about climate change and disaster \npreparedness, and recognizing its potential in terms of agricultural \ntransformation.  \no Emerging outcomes of MCSAS included an estimated amount of USD 1 billion \nin CSA investments from 2016 to present; USD 230 million for the Resilient \nCommunities Development Project; and an almost 65 million-dollar fund for \nthe five-year project, “Climate-Friendly Agribusiness Value Chain.” \n  \n Highlights of the group discussion for Plenary Session 1 \no Outcome Harvesting is qualitative in nature, but its process is iterative. \nEvaluators can go back to the previous steps and choose outcomes that can be \nstudied using quantitative methodologies.  \no The outcomes being targeted are not necessarily the result of CCAFS activities. \nOutcomes can still appear where CCAFS is already out of the picture. The key is \nto work closely with stakeholders to document these outcomes and set proper \nattributions. Outcome studies and impact evaluations must be conducted by \nthird-party institutions and not by the CSA implementers.  \no A thought to ponder on after the session was the potential contribution of \nprioritized outcomes to the agricultural transformation in Southeast Asia.  \nPlenary Session 2: Presentations on CCAFS Flagship Projects \n P1591: Policy imperatives for Southeast Asia’s regional food systems under \nclimate change, Sampriti Baruah, International Potato Center  \no The focus on roots and tubers in the Philippines came from the farmers in \ndisaster-prone areas. Farmers considered root and tubers the insurance crops \nbecause they believed they were climate-resilient. \no The Seeds without Borders was started by IRRI. An initiative to improve the \n“movement” of seeds across Southeast Asia, the Seeds without Borders aims to \nmake the varieties developed in one signatory country available to other \nsignatories on demand. Vietnam and the Philippines are being encouraged to \njoin this initiative through linkages in policy circles.  \no Two policy forums were organized for Vietnam and the Philippines. The \n“Opportunities for a Climate Smart Food System in the Philippines” was held \nlast 7 February 2019 while the second forum, “Opportunities for a Climate Smart \nFood System in Vietnam,” was organized a few months later, on 10 April 2019.  \no Networks of diverse stakeholders in the Philippines and Vietnam were now \nestablished. These would help in promoting climate-smart food systems.  \no Two studies are being conducted. Both are covering seed systems in the \nPhilippines and Vietnam, specifically value chains of seeds for major roots and \n tubers, procedures for seed replacement and certification, processes on varietal \nrelease, and trades and markets on seeds.  \no This 2019, these outputs were published: a technical report titled, “Identifying \nOpportunities and Challenges for Creating a Climate-Smart Food system in \nVietnam;” the journal article, “Changing Food Consumption Patterns in Rural and \nUrban Vietnam: Implications for a Future Food Supply System;” a forthcoming \npaper called “Identifying Opportunities and Challenges for Creating a Climate-\nSmart Food system in the Philippines;” and a developing article titled, “Changing \nFood Consumption Patterns in Rural and Urban Philippines Implications for a \nFuture Food Supply System.”  \n \n The Asia Climate Policy Hub: Developments and strategy in Southeast Asia, \nGodefroy Grosjean, International Center for Tropical Agriculture (CIAT) Asia  \no The Climate Policy Hub (CPH) is founded on three pillars: supporting CSA \ninvestment planning; de-risking finance; and policy engagement. These pillars \nguide the CPH in scaling CSA investments.  \no CSA Investment planning: Part of this is developing CSA country profiles or \n“snapshots” of countries in the context of CSA. After compiling and analyzing \nthese profiles for prevailing trends, a global synthesis report was prepared by \nCIAT. A major highlight of the report states that only five technologies account \nfor about 50% of all practices considered climate-smart and that climate-\nsmartness is context-specific  \no Step-by-step process of CSA investment plans: situation analysis, examining \nvulnerabilities, impacts, and readiness of communities; prioritizing \ninterventions, looking for value and trade-offs; program design and \nimplementation, scaling CSA and transforming knowledge into action; and \nmonitoring and evaluation to document experiences.   \no Through the CPH, innovative and suitable financing services are being \ndesigned. This is in line with developing climate-smart business models and \nunderstanding the connection between climate change and agricultural risk \nmanagement.  \no CPH is involved at the regional and international levels, working with the ASEAN \nClimate Resilience Network (ASEAN CRN) and the Conference of Parties (23 and \n24). In the future, it will expand its support to CSA scaling and capital \ndeployment, together with promoting digital agriculture (developing digital \nagriculture profile of Vietnam, specifically information and communication \ntechnology solutions for aquaculture value chains in the MRD).  \n \n  P1595: Gender-sensitive CSA options trialed and tested in CSVs, and business \ncase development for scaling, Tiffany Talsma, CIAT Asia; Rene Vidallo, \nInternational Institute of Rural Reconstruction (IIRR); and Reiner Wassmann, \nInternational Rice Research Institute (IRRI)  \no Since CSVs are already established, it is now high-time to prove that the CSV \nconcept can be scaled. This project aimed to scale the climate-smart village \n(CSV) approach in the Philippines, Vietnam, and Laos. Alongside scaling, it \nsearched for pathways to integrate CSA into programs and projects of national \ngovernments.  \no Through knowledge sharing activities in the Philippines (Guinayangan CSV), \nLaos (Phailom CSV), and Vietnam (Yen Bai Province), context-specific and \nscalable CSA portfolios, as well as the CSV approach, were promoted. In \nVietnam, specifically, two new CSVs will be established. \no In Laos, CSVs will focus on the nutritional contributions of CSA. The Laos \nexperience also presents a case for scaling, where community-based seed \nproduction was expanded, and seed producers and rice exporters were linked. \nA manual on community-based rice production was also developed in the \nprocess.  \no The key outputs produced under this project included an info note about the \npromotion of adaptation platforms in agriculture; climate-resilient agriculture \nbrochures made from the experiences of selected sites under Adaptation and \nMitigation Initiative in Agriculture (AMIA) in the Philippines; a report about the \nadvantages of climate-resilient cassava-cowpea intercrop practice in North \nVietnam; and primers on CSV profiles in Myanmar.  \no Emerging outcomes of the project include research on the governance pathway \nto scale CSA in Southeast Asia. This explores how working with government \npartners through their major programs can broaden the coverage of CSA \nservices and products.  \no The publications produced out of this project include the info note, “Scaling the \ncapacities to adapt to a changing climate: Experiences of the AMIA Climate \nResilient Villages, Philippines;” a peer-reviewed article titled, “Adaptation, \nmitigation and food security: Multi-criteria ranking system for climate-smart \nagriculture technologies illustrated for rainfed rice in Laos;” and the report, \n“Triple advantage of climate-resilient cassava-cowpea intercrop practice in \nNorthern Vietnam.”  \n \n P1602: Greenhouse Gas (GHG) Mitigation in Rice: From evidence-based \nconcepts to adoption at scale, Bjoern Olde Sander, IRRI Vietnam  \no The project components are: (1) demand-driven support of mitigation \nplanning; (2) monitoring, reporting, and verification; (3) low-carbon certification \nschemes; and (4) innovative technologies and policy analyses. It features \nalternate wetting and drying (AWD) as a viable mitigation practice for the rice \nsector in Vietnam.  \n o AWD suitability mapping was conducted in An Giang Province, Vietnam. \nGeographic information system (GIS) was used to develop climatic suitability \nmaps while participatory approaches were employed to draw adoption capacity \nmaps.  \no During the AWD scaling workshop, the maps and the mapping process were \npassed on to the Department of Crop Production and scaling strategies were \ndiscussed with eight MRD provinces. After the workshop, representatives of An \nGiang Province expressed their plans to out-scale the AWD practice.  \no Through this mitigation-based project, IRRI was able to contribute in the \ndevelopment and implementation of Vietnam’s Nationally Determined \nContributions (NDCs). They were also able to calculate baseline GHG emissions \nand run model reduction scenarios, which would be useful in the investment \nplanning and MRV of GHG mitigation activities of Vietnam.  \no A subsequent step of the project is classifying farmers based on their emission \nreduction potential. This means that the project will identify farmers who will \nbe “full adopters,” “partial adopters,” and “non-adopters.” Related to this \nclassification is identifying the emission reduction potentials of various rice \ncultivars.   \n P1608: A Climate Services Menu for Southeast Asia (CliSM): Tackling scaling \nwith a diversity of end-users in the climate services value chains, Angelica \nBarlis and Pablo Imbach, CIAT Asia; Le Thi Tam and Elizabeth Simelton, World \nAgroforestry (ICRAF); and Tran Manh Hung and Peter Clausen, CARE \no There are several bottlenecks when it comes to scaling: diversity of and \ndisconnection among actors along the national and local levels; weak capacity \nand infrastructures for climate services; and government structures.  \no To overcome these bottlenecks, scaling agents and project implementers must \ngather data about the end-users (integrate gender and youth as well). From \nthis step, the project was able to develop an assessment framework of climate \nservices value chains.  \no Afterwards, they must build business models that cater to the characteristics of \nend-users and their information needs. These models must be tested for their \nscalability at the national level. \no There are already key outputs produced and currently in progress because of \nthis project. An output that was tested and disseminated in Ha Tinh Province \nwere agro-advisory bulletins specifically designed for farmers. Meanwhile, \nthose in progress include a business model for climate services supporting \nVietnam’s coffee sector and an assessment of practitioners’ needs to scale \nclimate services.  \no The emerging outcomes of this project focus on improved stakeholder \nengagement in crafting strategies and implementation plans. Such \nengagement can ensure the uptake of climate services in the agricultural \nactivities of MARD. \n o In the future, the project will organize learning workshops for high-level officials \nand policy makers to enable them to add their inputs on climate services and \nprovide feedbacks on the proposed scaling framework.  \n \n Group discussion for Plenary Session 2  \no The process is as important as the outputs. This is an important thought that we \nshould always keep in mind when we aim for outcomes.  \no In CCAFS, we should be aware of the time we take for data gathering because \nwe are always aiming to generate for outcomes. Aside from time, we should \nalso be mindful in writing the citations of our outputs. Our partners must be \nhighlighted in those outputs as they had major contributions in developing \nthem. In the end, there should be a transfer of ownership from us to our \npartners.  \no Regarding the De-RISK project, implementers are already engaging with MARD \nat the start, ensuring the participation of government partners.  \no A policy line must be established to ensure that the gender dimension and \nyouth sector are also included in our projects.  \n \nPlenary Session 3: Presentations on Bilateral Projects \n WorldFish, Tran Van Nhuong, WorldFish \no The project aims to scale out the best practices in managing community fish \nrefuges (CFRs). These practices could then improve the climate resilience of \nCFRs and the nutritional benefits from consuming fish. CFRs also serve as major \nsources of water for their surrounding communities.  \no The adaptation practices of farmers include improved fish feeding, pond water \nmanagement, water retention practices, and postharvest handling, as well as \nuse of stress-tolerant fish.  \no Men and women differ in the adaptation practices they wanted to prioritize but \nboth agree that stocking large fingerlings is a must.  \no A total of 5,222 hectares of rice field-fisheries areas are now under an improved \nmanagement. Fish conservation was deemed effective due to the increase in \nfish biomass and household fish catch from 2017-2018.   \no As a source for domestic water use, CFRs led to the establishment of 12 drinking \nstations enjoyed by 34,000 households, 12 health centers, and 109 schools in \n128 villages. The CFRs were also useful during the early drought in 2019 since \nthey provided water to the communities.  \no CFR groups were able to solicit support from local governments and the private \nsector amounting to almost USD 300,000. This support would be dedicated to \nimproving CFR activities.  \n \n  International Center for Tropical Agriculture, Godefroy Grosjean, CIAT Asia \no The current projects of CIAT in Asia cover climate-resilient agriculture, food \nsystems and value chains, value adding to cassava, forages and livestock, and \nagricultural systems and landscapes.  \no The De-RISK project was again featured but presented with more in-depth \ninformation this time. Its main objective is to reach 27,000 farmers in Vietnam, \nLaos, Cambodia, and the Philippines.  \no To reach this number of farmers, the project aims to develop climate services \nbased on seasonal forecasts, innovative insurance products, and supportive \nadaptation policies.  \no Another initiative that was featured was the weather forecasting for coffee \nsustainability, which aims to reduce the carbon footprint of the coffee sector \nthrough agricultural weather advisories and improved seasonal and yield \nforecasting for farmers.  \no CIAT is promoting innovative financial services in the Philippines by supporting \nthe Agricultural Credit Policy Council and the Philippine Crop Insurance \nCorporation. These two offices are being engaged to implement CSA-based \nagri-financial products for farmers.  \no Climate-resilient cassava systems already benefited more than 4,000 farmers in \nmore than 4,000 hectares of cassava in Yen Bai Province, Vietnam. The systems \ncombined cassava with cowpea and grass barriers in appropriate regions to \nimprove soil fertility and improve yield and income.  \n \n International Rice Research Institute, Reiner Wassmann and Bjoern Ole \nSander, IRRI \no IRRI implemented four bilateral projects: Thai Rice NAMA, Support national \nmitigation plans and programs in Vietnam and Bangladesh, Cost-Benefit \nAssessment of Mitigation, and the Vietnam Sustainable Agricultural \nTransformation (VnSAT). \no New donors have one common factor: mitigation. Donors are looking for \nprojects that reduce the GHG emissions of the agriculture sector.  \no Through Thai Rice NAMA, IRRI was able to implement mitigation technologies \nand practices in Thailand such as laser land levelling, straw and stubble \nmanagement, AWD, and site-specific nutrient management. These are planned \nto be scaled through a “revolving fund” and direct financial investments, among \nother activities.  \no In Vietnam and Bangladesh, the Climate and Clean Air Coalition works with IRRI, \nnational governments, non-government organizations, and other international \ninstitutions to reduce the amount of short-lived “climate pollutants” in the \natmosphere. Specifically, this project aims to support governments to reduce \ntheir methane emissions from rice through evidence-based information and \nstrategies.  \n o IRRI is also conducting cost-benefit analyses of mitigation projects. These \nanalyses identify the technologies and practices used, account the costs against \nthe co-benefits of adopting them, and identify impacts, if there are any.  \no The VnSAT project targeted 30 key rice districts over eight provinces in the MRD \nwith a budget of USD 100 million. Through the project, several issues on rice \nproduction were identified, including rice quality, certification standards, and \nmarket linkages.  \no IRRI released a publication titled, “Climate-smart Rice Production Manual” for \nMyanmar. The publication has both English and Burmese versions. A new GHG \ncalculator was also developed for croplands: the Source-selective and Emission-\nadjusted GHG calculator for Cropland (SECTOR).  \n World Agroforestry, Nguyen Quang Tan, ICRAF \no ICRAF is working with Ha Tinh Province and the Ministry of Natural Resources \nand Environment in implementing an ecosystem-based adaptation project for \nfarmers. Called the Ha Tinh SIPA project, it combines the principles of \necosystem services and CSA. \no The project aims to improve the adaptive capacity and livelihoods of both male \nand female farmers in Ha Tinh Province and build the capacities of relevant \nstakeholders to integrate ecosystem services and CSA.  \no At the international level, the project supports Vietnam in developing a national \nadaptation plan, contributing to the “Loss & Damage” debate, and crafting \nprovincial adaptation plans with financial components.  \no The project was able to build networks that facilitate knowledge sharing among \nfarmers. Through these networks, as well as a kick-start fund platform called \nthe Community Innovation Fund, CSA technologies and practices were \npromoted and eventually adopted. The networks are led by village leaders and \nfarmer champions.  \no The project utilizes three forms of scaling: vertical, horizontal, and commercial.  \no Vertical scaling is achieved through government structures, integrating CSA in \npolicies, national programs, and action plans. Horizontal scaling entails \nexpanding the reach of the farmers that adopt CSA. Commercial scaling \ninvolves the private sector.  \n \n Group Discussion \no We must present indicators to our policy makers to convince them to join us. \nAt the same time, we must consider what kind of policy maker we are talking \nto because in many instances, what we think is not aligned with what they think.  \no There is no blanket strategy to engage policy makers. The key is to use various \napproaches and media to reach them. We can also bring them to the field or \nbring the evidence to them. The evidence must then be economically viable.  \no Even with the discussions on how to engage policy makers, a major issue still \narises from outside the policy circles: working with farmers and the private \n sector. We must find an approach or a set of approaches that can catch the \ninterest of these stakeholders. \n  \nPlenary Session 4: Presentations on Regional Activities \n P264: The CCAFS Regional Agricultural Forecasting Toolkit (CRAFT), Sridhar \nGummadi, CCAFS \no CRAFT is a computer-based, personal decision-making tool that analyzes \nagricultural risks and predicts short- and long-term yields. It can run many crop \nsimulation models that lead to interactive thematic maps. CRAFT contains a \nuser-friendly application, a database containing relevant data, and an \nintegrated GIS map.  \no CRAFT is a useful tool to research about crop forecasting; it supports multiple \ncrop and climate models; it is suitable for researchers working in developing \ncountries. \no Climate Predictability Tool (CPT) is an easy-to-use Windows software to \ngenerate seasonal climatic forecasts. Specifically, forecasts are generated \nthrough fields of sea-surface temperatures or outputs from a general \ncirculation model. CPT is both a statistical prediction and downscaling tool. \no There will be an evaluation of how CPT performed in the Philippine context (CPT \nperformance in Vietnam will be evaluated as well). New datasets will then be \ndeveloped for CRAFT and seasonal climate and yield predictions will be \nprovided for the Philippines.  \n \n P264: Prioritizing CSA in Vietnam, Luu Ngoc Quyen, Deputy Director General, \nNorthern Mountainous Agriculture and Forestry Science Institute \no In 2017, CCAFS SEA supported the conduct of a survey identifying the CSA \npractices being conducted in Vietnam. From this survey, a CSA book was \npublished, documenting a total of 90 CSA practices over the entire county.  \no CSA practices and systems that could contribute to achieving the NDCs of \nVietnam were listed, together with those that could support the \nimplementation of the country’s National Adaptation Plan (NAP).  \no A total of 57 prioritized CSA practices and systems were identified for adoption. \nThey were chosen for their potential to contribute in the NAP implementation \nand Vietnam’s NDCs. These include integrated pest management, drip method, \ngrass hedgerow, AWD, poultry, and rice-fish intercropping.  \no They were grouped into six categories: (1) pest control and production of \nquality products; (2) protection and sustainable use of cultivated land and water \nresources; (3) agroforestry and integrated cropping systems; (4) paddy rice \nproduction; (5) husbandry; and (6) aquaculture.  \no The impacts of these CSA practices and systems will be studied. This is to spot \nlocations where they can be promoted and address the challenges that hinder \n their implementation. All the information that will be gathered will be stored in \na database.  \n P264: Development of training materials on climate-smart rice production for \nextension staff and rice farmers, Dr. Nguyen Viet Khoa, Chief, Training and \nExtension Division, National Agricultural Extension Centre  \no The project aims to develop a standard training manual and curriculum on \nclimate-smart rice production for both extensionists and farmers. These \nmaterials will cover CSA options that farmers can adopt on their fields, as well \nas effective communication and extension practices that extensionists can \napply on their activities.  \no The materials developed under this project covered the following: Rice \nproduction and greenhouse gas emission; Land preparation; Varieties and crop \nestablishment; Crop nutrition management; Integrated water management; \nHarvest and postharvest technologies; Marketing and rice value chain; and \nFarmers engagement and training basics of training for adults.  \no To develop these materials, the project adopted this step-by-step \nmethodology: (1) training needs assessment; (2) review of existing training \nmaterials; (3) compilation; (4) test trainings; and (5) launching and wide use. \nThis methodology is participatory and involved not only the farmers, but also \nextension staff, researchers, and government officials.  \no At the national level, 550 extension staff were involved, together with 1000 \nusers of climate-smart rice training manual. At the provincial level, 2000 officers \nused the training manual, together with 63 provincial agriculture extension \ncenters with 2000 staff overall. At the district level, 15000 extensionists were \ninvolved. At the commune and village levels, a total of 11 162 people’s \ncommittees participated.  \no E-learning materials will be developed to discuss climate-smart rice production. \nThis will be complemented with video clips and mobile-based communication \nmaterials.  \n P264: Developing a training manual on establishing Climate-Smart Villages \n(CSVs) in the ASEAN, Rosario Bantayan, Program Specialist, Southeast Asian \nRegional Center for Graduate Study and Research in Agriculture (SEARCA)   \no SEARCA, IIRR, and CCAFS are working together to scale the principles and \nprocesses of CSA in communities vulnerable to the worsening impacts of \nclimate change. \no In the workshop, “Establishing Climate-Smart Villages in the ASEAN Region to \nImprove Food Security and Resiliency in Local Communities” last 9-13 July 2019, \nparticipants were exposed to the potential of CSA to improve food security in \nlocal communities under a changing climate.  \no The workshop was divided into four modules to deepen the participants’ \nappreciation and knowledge on CSA and show them on-ground CSA \ntechnologies and practices being adopted by selected communities.  \n o The first module was a backgrounder on CSA, introducing it as a transformative \nresearch-for-development approach to address the intersecting issues on \nclimate change, agriculture, and food security. Included in this module were \npresentations about the participatory tools used by AMIA villages and \nGuinayangan CSV in the Philippines.  \no Module 2 involved a panel discussion on emerging lessons from the CSVs in \nSoutheast Asia. The panel included Dr. Leo Sebastian, Regional Program Leader \nof CCAFS Southeast Asia; Ms. Perla G, Baltazar, Senior Technical Officer of the \nDA Systems-wide Climate Change Office; and Dr. Julian Gonsalves, Senior \nAdviser and CCAFS Project Leader from the International Institute of Rural \nReconstruction. Jana Koerner, CCAFS SEA Scaling Officer, presented how to \nconduct scaling in the context of CSVs.  \no The third module involved a series of roving workshops in selected sites in \nGuinayangan CSV. The participants learned and witnessed firsthand \nintercropping and other interventions in an upland agricultural system in \nBarangay Cabong Norte; native pig raising in Barangay Capuluan Tulon; coastal \nreforestation and livelihood diversification in Barangay Capuluan Central; and \nagroforestry and crop diversification in Barangay Sta. Cruz. \no Module 4 was a reflection and synthesis exercise where the participants \ndiscussed the best practices in their CSA-related works.  \no Key outputs include appreciation and understanding of CSA technologies and \npractices introduced during the roving workshops; proceedings, brochures, and \nevaluation reports; and re-entry action plans. The action plans discuss how to \nestablish CSVs in Southeast Asia and applying climate-resilient practices in \nvarious vulnerable communities.  \no Through these activities, SEARCA, IIRR, and CCAFS were able to contribute in \npromoting the concepts and practices of climate-resilient agriculture in \nSoutheast Asia.  \no In the future, there will be an analysis to determine the degree by which the \nparticipants applied their learnings during the roving workshop, a case story \nbook of farmers in Southeast Asia, and another roving workshop in 2021 in \nMyanmar, Cambodia or Vietnam.  \n \n P264: Adoption of climate-smart aquaculture in the North Central Coast of \nVietnam, Cao Le Quyen, Tran Van Nhuong, Nguyen Duc Trung, Trinh Quang \nTu, Phan Phuong Thanh, and Le Thi Thu Huong \no Climage-smart aquaculture (CSAq) can improve the adaptation and resilience \nof coastal communities, as proven by a case study in North Central Vietnam. In \nthe case study, genetically improved farmed tilapia was integrated in CSAq \nsystems. \no Farmers are more likely to adopt CSAq if it helps them increase their incomes. \nThis was seen in the results of the case study, where economic efficiency and \nmarket price are the primary drivers of adoption for CSAq among farmers. \n Economic efficiency can be improved by reducing costs of farmers, improving \nefficiency of feed use, establishing CSAq value chain linkage, and managing \ndiseases, among others.  \no Access to CSAq-related information is another driver of adoption. Farmers are \nmore likely to adopt CSAq if they are aware what it is, what its benefits are, and \nwhere they can access such information (i.e., aquaculture extension services). \no Demographic factors (age, gender, education, aquaculture experience, labor \navailability, technical awareness on CSAq), aquaculture practices (culture area, \ntype of production, aquaculture revenue), access to extension services, market \nprice, and perceived benefits were considered in analyzing the adoption \nbehaviors of farmers.  \no A total of 200 shrimp farms with and without tilapia integration were covered \nin the case study.  \no Conducive policies must be developed to scale-out CSAq in other areas in \nVietnam. \n P264: Harnessing rural radio for climate change mitigation and adaptation in \nthe Philippines, Rogelio Matalang, Philippine Federation of Rural \nBroadcasters  \no The rural radio campaign called “Climate Change, i-Broadkas Mo!” was \nimplemented in 2015 in the Philippines by CCAFS SEA. The campaign was in \ncollaboration with the Philippine Federation of Rural Broadcasters (PFRB) and \nregional field offices under DA. In 2018, the campaign entered a second phase, \nwhich served as its intensified follow-up and extension.  \no Ready-to-be-aired (RTBA) materials were produced under this campaign, which \naims to educate rural broadcasters about climate change and CSA. In turn, the \nbroadcasters are expected to serve as intermediaries of climate-related \ninformation that will be disseminated to rural areas in the Philippines. \no “Sa Kabukiran,” a television-radio program of DZMM, airs the materials \nproduced under this campaign. Aside from DZMM, other radio stations that \nbroadcasted the materials included 87.7 FM DYVL, DYDC FM, and DXMS Radyo \nBida 882 KHz. Moreover, the materials were being aired in IBC-6 channel and \nin social media platforms through Facebook Live.  \no A total of 276 canned interviews, 285 scripts, 10 radio spots, and 3 jingles were \nproduced under this campaign. These materials were disseminated to over a \nhundred active members of PFRB, many of which own a regular radio program. \nThe materials were written and aired in major languages in the Philippines: \nIlocano, Tagalog, Cebuano, Waray, Ilonggo, Maranao, Maguindanaon, and \nBicolano.  \no The materials were produced during broadcast production workshops \norganized in strategic areas all over the Philippines. The areas were selected \ndue to their proximity to relevant stakeholders that the campaign can engage \nwith. In Phase 2, the workshop venues were in Cagayan de Oro, Leyte, and \nIsabela. \n  P264: School-on-the-air on climate-smart agriculture in Cagayan Valley, \nPhilippines, Marcelo Raquepo, Department of Agriculture, Regional Field \nOffice 02 \no A study was conducted to assess the immediate outcomes of a distance-based \nlearning project titled, “School-on-the-Air Climate Smart Agriculture (SOA-CSA) \nin Cagayan Valley, Philippines.” The SOA-CSA project proves to be an effective \ninitiative to inform farmers about CSA practices on rice production. This is \nreflected on the high levels of retention, awareness, and adoption among \nfarmers.  \no About 67% could recall the information they heard from the SOA lessons. \nAlmost all of them (93%) displayed awareness of and knowledge on the causes \nof climate change. Meanwhile, 89% are aware of and have knowledge on the \neffects of climate change. Majority of them know about CSA practices on rice \nand almost always adopt them. Overall, 92% of the farmers in this study said \nthat the information they heard from the SOA project are useful to them and, \nin turn, have influenced them to adopt CSA technologies for rice.  \no The outcomes of the project are promising. Farmers earned a mean yield \nincrease of 19 cavans per hectare, which they attributed from the application \nof CSA. This yield increase led to a mean increase of PHP 18,000 in farm income \nper hectare.  \no For future SOA-CSA programs, farmers suggested they must discuss high-value \ncrops, as well as corn. Their preferred time of the program is 5:00-6:00 in the \nmorning, preferably hosted by male anchors or a male-female tandem and \naired in Ilokano language. \no The study was led by DA-Regional Field Office 02 and was participated by the \nfollowing state universities: Cagayan State University, Isabela State University, \nNueva Vizcaya State University, and Quirino State University \n Group Discussion \no Vietnam has different kinds of extension programs, but no specific program is \ndedicated for CSA. As a resolution, CSA is integrated into existing extension \nprograms. While integrating CSA, it must be communicated to farmers to allow \nthem to learn its benefits. In Vietnam, mass media platforms are utilized to \ncommunicate CSA.  \no Technical staff and extension workers who go to the farming communities \ncomplement media-based interventions. For instance, they will be the ones to \nclarify any information that the farmers found vague in media programs.  \no How is the roving workshop different from a farmer field school? A roving \nworkshop is designed for high-level officials to bring them to the ground, but \nit can still serve as a learning platform for farmers. In roving workshops, most \nof the learning occur in the field sites. Moreover, a roving workshop is not \nsomething that is conducted every day. It requires long preparation. \n \n Plenary Session 5: Roundtable discussion on transforming \nSoutheast Asian agriculture \nModerator: Dada Bacudo, German Agency for International Cooperation/ASEAN CRN  \nPresentation: Jana Korner (CCAFS SEA) - “Transforming food systems under climate change”  \nPanelists: Somchai Boonpradub (Thailand), Thavone Inthavong (Laos), Mak Seoun (Cambodia), \nYiyi Sulaeman (Indonesia), U-Nichols Manalo (Philippines), Tran Cong Thang (Vietnam) \n Transforming Food Systems under a Changing Climate is a new CCAFS-led initiative \nthat aims to harness the benefits of food systems that are now undergoing major \nchanges in polices, human diets, technologies, adaptation approaches, and \ninvestments.  \n Many phenomena are occurring all at once, several of which have direct influence on \nglobal and local food systems. These include the aging farmer population, shifting \ndietary demands, rising urbanization, and the changing climate.  \n This initiative is composed of five work packages: \no Local to global policy as a catalyst for change; \no Changing diets and transforming food systems; \no Future technologies and food systems innovation; \no Adaptation and development pathways for different types of farmers; and  \no Financing the transformation of food systems under a changing climate. \n The policy areas that can be explored are adaptation and mitigation in agriculture, food \nloss and waste management, and nutrition and sustainability.  \n Diets should not be healthy and balanced only, but also climate-friendly. To achieve \nsuch diet, food must be familiar to the people, appealing (in terms of cost and taste \namong other factors), and most especially, accessible to them.  \n Digital agriculture will play a role in the future of food systems. Innovative adaptation \npractices such as vertical agriculture can also be adopted. In scaling these practices, \nthere must be safety nets for vulnerable sectors that are being encouraged for \nadoption.  \n Currently, farmers are involved in typical large-scale commercial farming, small-scale \nsubsistence farming, small-scale marketing, extensive traditional farming practices, and \nartisanal farming. By 2040, farmers are hoped to focus more on environmental \nexternalities, land consolidation, and income diversification, among other targets.  \n Public and private sector investments must be encouraged. The investments can \nincentivize farmers and de-risk the adoption of certain technologies and practices.  \n The enabling environment that would facilitate transformation included investments \non agricultural infrastructures, support of policy makers, and involvement of private \nsector.  \n The roundtable discussion converged on three main themes: modernization, \nempowerment, and education.  \n Modernizing agriculture was considered a key step to achieve transformation of food \nsystems and an entry point for CSA. It can be achieved by employing innovative and \n practical approaches in the farms (shift to high-value crops, adoption of climate-\nresilient varieties, farm mechanization, among others).  \n Empowerment entails involving and organizing farmers. If they are working as a group \n(usually as cooperatives), they can collectively participate in agriculture-related \nactivities and in key decision-making processes with their governments. They can also \ntest and eventually adopt together new approaches (e.g. agricultural entrepreneurship) \nif they see that these are beneficial for their farming.  \n Education is a critical component to engage the youth sector in agriculture.  \n \nClosing Remarks, Dr. Le Quoc Doanh, Vice Minister, MARD  \n CSA may have been mentioned only recently, but climate-smart technologies and \npractices have long been adopted and utilized before. Still, recommendations are \nwelcome to improve CSA implementation, especially at the institutional level.  \n Vietnam committed to continue working with CCAFS to minimize the impacts of \nclimate change on its agriculture sector. The CS MAP project was a good case study \nthat they can learn from. It can now be scaled up to support the disaster management \nactivities of Vietnam.  \n Aside from the CS MAP, CCAFS is also involved in supporting Vietnam on their \ninternational commitments, specifically the country’s commitment to the Paris \nAgreement—the NDCs. CCAFS is also assisting the country in implementing its NAP.  \n Dr. Le Quoc Doanh called on the participants to identify programs that are really \naligned with agriculture and encouraged scientists to work together further.   \nAwarding ceremony \n Dr. Sebastian was recognized for his invaluable contributions to the agriculture and \nrural development of Vietnam. He received the “Medal for the contribution to the Cause \nof Agriculture and Rural Development\" from the Ministry of Agriculture and Rural \nDevelopment. \n The Medal is considered the most honorable individual award for those who \ncontributed greatly to the agriculture sector of Vietnam.  \n Since 2013, Dr. Sebastian has been leading CCAFS Southeast Asia in developing crucial \nclimate activities in Vietnam, specifically the CS MAP in the Mekong River Delta. He \nhelped establish CSVs in the country and implement context-specific CSA technologies \nand practices. Moreover, he supported the mobilization of funds to the agriculture \nsector of Vietnam.  \n Dr. Sebastian also contributed greatly to the negotiation team of Vietnam as the \ncountry prepared its National Determined Contributions that would be submitted to \nthe United Nations Framework Convention on Climate Change.  \n \n \n \n  \n \n \n \n \n \n \n \nPhotos \n  \n \n \n \n \n  \n \n \n \n \n  \n \n \n \n \n \n  \n \nProject \nposters \n\n\n\n\n\n\n\n\n\n  \n",
    "Link": "https://core.ac.uk/download/288633331.pdf"
}